{"status":"ok","totalResults":342,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Gili Malinsky","title":"Senator Elizabeth Warren called for massive student debt relief. Here’s the average student loan debt in every state.","description":"Senator Elizabeth Warren, a Democratic presidential candidate, proposed canceling up to $50,000 in student-loan debt for 42 million Americans. Overall, her plan would account for canceling as much as $640 billion in student debt. According to the Department o…","url":"https://www.businessinsider.com/student-loan-debt-per-state-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf21d0b14bf419f81267e5-2732-1366.jpg","publishedAt":"2019-04-23T14:36:32Z","content":null},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Tyler Lauletta","title":"NFL MOCK DRAFT: Here is what the experts are predicting for all 32 first-round picks","description":"The 2019 NFL draft will begin Thursday, April 25. We analyzed nine mock drafts to get a sense of how the first round might play out. Visit Business Insider's homepage for more stories. With plenty of mock drafts across the internet, there's no shortage of pre…","url":"https://www.businessinsider.com/2019-nfl-mock-draft-consensus-first-round-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf0c70b14bf416e04ca984-960-480.jpg","publishedAt":"2019-04-23T13:02:00Z","content":"With plenty of mock drafts across the internet, there's no shortage of predictions of where future NFL superstars will land in the first round of the draft on Thursday night. \r\nRead more:Raiders GM reportedly 'does not know who he can trust with his draft sec… [+493 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Silvia Ascarelli, Catey Hill","title":"Here’s exactly where you should retire — based on what’s important to you","description":"Tell MarketWatch what you want in retirement, and we’ll tell you where to live.","url":"https://www.marketwatch.com/story/heres-exactly-where-you-should-retire-based-on-whats-important-to-you-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HE982_sunset_ZG_20190304133917.jpg","publishedAt":"2019-04-23T10:00:12Z","content":"You finally get to choose where you want to live. Not somewhere because of work. Not because of the kids and school. Its time to retire and pick a place to enjoy for a few decades.\r\nNow you need to find the metro area that will make you happy.\r\nWe know this i… [+2826 chars]"},{"source":{"id":null,"name":"Fashionista.com"},"author":"Winnie Liu","title":"Billy Reid Is Hiring A Store Manager In New York, NY","description":"THE BRAND Billy Reid began designing under his own name 20 years ago. He created clothes he would want to wear, pairing beautiful fabrics with impeccable construction. In 2005, he opened his flagship store in his new hometown of Florence, Alabama where he wou…","url":"https://fashionista.com/2019/04/billy-reid-is-hiring-a-store-manager-in-new-york-ny","urlToImage":"https://fashionista.com/.image/t_share/MTYzNTUzMzUyNDA2Mjc5NTIy/ch5a5218-billy-reid.jpg","publishedAt":"2019-04-23T17:14:37Z","content":"Photo: Billy Reid\r\nTHE BRAND\r\nBilly Reid began designing under his own name 20 years ago. He created clothes he would want to wear, pairing beautiful fabrics with impeccable construction. In 2005, he opened his flagship store in his new hometown of Florence, … [+2339 chars]"},{"source":{"id":null,"name":"Deadspin.com"},"author":"Lauren Theisen","title":"The College Basketball Bribery Scandal Might Be Spreading To Football","description":"On Monday, a second trial to deal with the charges from college basketball’s bribery scandal began in U.S. District Court. Former financial advisor Christian Dawkins and former Adidas consultant Merl Code both returned as defendants after being convicted in t…","url":"https://deadspin.com/the-college-basketball-bribery-scandal-might-be-spreadi-1834250463","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--iHCRw6-m--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/il3bxnrpyi6bex8rdobj.jpg","publishedAt":"2019-04-23T20:43:00Z","content":"On Monday, a second trial to deal with the charges from college basketballs bribery scandal began in U.S. District Court. Former financial advisor Christian Dawkins and former Adidas consultant Merl Code both returned as defendants after being convicted in th… [+3422 chars]"},{"source":{"id":null,"name":"Theregister.co.uk"},"author":"Richard Speed","title":"It was that gosh-darn anomaly again, says SpaceX as smoke billows from Crew Dragon test site","description":"NASA schedules walloped, Cynus launches, and Owen Garriott's final voyage Roundup It has been an eventful past seven days in space what with SpaceX making a big cloud o' orange smoke, Cygnus docking, and veteran astronaut Owen Garriott taking his final journe…","url":"https://www.theregister.co.uk/2019/04/23/space_round_up/","urlToImage":"https://regmedia.co.uk/2019/04/23/crew_dragon_recovery.jpg","publishedAt":"2019-04-23T15:30:08Z","content":"Roundup It has been an eventful past seven days in space what with SpaceX making a big cloud o' orange smoke, Cygnus docking, and veteran astronaut Owen Garriott taking his final journey into the black.\r\nSpaceX's Crew Dragon appears to have suffered a signifi… [+5348 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Mike Chiari","title":"McShay: Quinnen Williams Favored by Cardinals If They Pass on Kyler Murray","description":"If the  Arizona Cardinals  decide against selecting Oklahoma quarterback Kyler Murray in the 2019  NFL  draft, a somewhat surprising name  could  reportedly come off the board with the No...","url":"https://bleacherreport.com/articles/2832668-mcshay-quinnen-williams-favored-by-cardinals-if-they-pass-on-kyler-murray","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/353/hi-res-754f7b8c1947a5a7eed032d394aa704c_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-23T12:53:13Z","content":"Darron Cummings/Associated Press\r\nIf the Arizona Cardinals decide against selecting Oklahoma quarterback Kyler Murray in the 2019 NFL draft, a somewhat surprising name could reportedly come off the board with the No. 1 overall pick.\r\nESPN NFL draft expert Tod… [+604 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Tansey","title":"2019 NFL Draft: Odds and Predictions for This Year's Star Prospects","description":"The speculation surrounding what the Arizona Cardinals will do with the No. 1 overall pick in the 2019  NFL  draft ends Thursday night in Nashville...","url":"https://bleacherreport.com/articles/2832654-2019-nfl-draft-odds-and-predictions-for-this-years-star-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/351/hi-res-8a5c48e04efe29b09e713dd57888c959_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-23T13:05:42Z","content":"Brynn Anderson/Associated Press\r\nThe speculation surrounding what the Arizona Cardinals will do with the No. 1 overall pick in the 2019 NFL draft ends Thursday night in Nashville. \r\nMost of the NFL draft experts have the Cardinals taking Kyler Murray with the… [+5952 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Zach Buckley","title":"NFL Mock Draft 2019: Early Predictions for Nation's Top Prospects","description":"After months of evaluating prospects and mock drafts, we finally made it to  NFL  draft week 2019.    At this point, you might feel like you know everything about this draft class, but you shouldn't...","url":"https://bleacherreport.com/articles/2832604-nfl-mock-draft-2019-early-predictions-for-nations-top-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/263/hi-res-a76aa0293b5ce64fabeb01f99517bead_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-23T18:05:42Z","content":"Wilfredo Lee/Associated Press\r\nAfter months of evaluating prospects and mock drafts, we finally made it to NFL draft week 2019.\r\nAt this point, you might feel like you know everything about this draft class, but you shouldn't.\r\nThe annual talent grab is alway… [+4573 chars]"},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Al Jazeera","title":"New Mexico militia leader boasted of assassination training: FBI","description":"FBI says it was told that militia leader Larry Hopkins said his group trained to kill Obama, Clinton and Soros.","url":"https://www.aljazeera.com/news/2019/04/mexico-militia-leader-boasted-assassination-training-fbi-190423201042551.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/4/23/af3ca21c5c2549e5931f482a8dc5378c_18.jpg","publishedAt":"2019-04-23T21:11:23Z","content":"Larry Hopkins's arrest on Saturday came amid an uproar over videos his New Mexico-based militia group posted online, some of which showed camouflaged militiamen surrounding and detaining hundreds of migrants who had crossed the US-Mexico border.\r\nThe FBI arre… [+4170 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Charlotte Carroll","title":"Corruption Trial Witness Said He Paid Football Players From Alabama, UNC and Other Schools","description":"Marty Blazer testified that he paid football players from seven schools, including Alabama and Michigan, to persuade them to hire him as a financial advisor.","url":"https://www.si.com/college-football/2019/04/23/marty-blazer-ncaa-corruption-trial-alabama-unc-michigan","urlToImage":null,"publishedAt":"2019-04-23T19:04:57Z","content":null},{"source":{"id":null,"name":"Si.com"},"author":"Joan Niesen","title":"Spring Football Risers: Who's Building Momentum for a Breakthrough 2019?","description":"Spring football is a time for new faces and surprise standouts. Which key players have boosted their 2019 expectations?","url":"https://www.si.com/college-football/2019/04/23/spring-practice-markese-stepp-sean-clifford","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/23/college-football-spring-risers-sean-clifford-kelly-bryant.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T16:33:29Z","content":"The school year is winding down at many colleges, and the last wave of spring games (with Washington, Virginia and a few more left to go in the final weekend of April) has given us a final glimpse of college football before the long wait until August. And alt… [+6428 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Andrew Perloff","title":"The Reel NFL Mock Draft: 2019 Prospects Ranked By Their YouTube Highlights","description":"We rank the 2019 prospects solely on the tape that’s available online to the common fan.","url":"https://www.si.com/nfl/2019/04/23/nfl-mock-draft-based-youtube-highlights","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/2019-mock-draft-youtube-perloff.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T12:50:08Z","content":"Imagine a universe in which teams couldnt watch college football, study tape or work out players. All they had to go on was the Internet. Thats the premise of a YouTube mock draft. Throw technique and consistency out the window. This is about highlights, wher… [+10410 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Josh Israel","title":"Senate GOP campaign committee smears Democratic 2020 candidates with false billboards","description":"The National Republican Senatorial Committee (NRSC), the campaign arm of the Senate Republicans, has launched a series of billboards attacking several Democratic candidates over their supposed support for Medicare for All. Not all of the Democrats who are bei…","url":"https://thinkprogress.org/nrsc-smears-democratic-2020-candidates-false-billboards-464fd55c9af0/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1134521046-1.jpg?w=1024&h=683&crop=1","publishedAt":"2019-04-23T17:26:31Z","content":"The National Republican Senatorial Committee (NRSC), the campaign arm of the Senate Republicans, has launched a series of billboards attacking several Democratic candidates over their supposed support for Medicare for All.\r\nNot all of the Democrats who are be… [+4068 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Inside the 2019 NFL draft class: 50 facts you didn't know","description":"The relative of Nat King Cole? Film buff turned linebacker? A boxing champ's son? A track-and-field record-holder? Get to know this year's NFL draft class.","url":"http://www.espn.com/nfl/draft2019/story/_/id/26553152/inside-2019-nfl-draft-class-50-facts-know","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1006%2Fr443065_1296x729_16%2D9.jpg","publishedAt":"2019-04-23T12:37:47Z","content":"Two hundred fifty-four names will be called on the stage in Nashville, Tennessee, over the course of three days this week. And many of those 2019 NFL draft class prospects come with fascinating backgrounds, pro connections and interests.\r\nThe relative of a ja… [+13248 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Sophia Tesfaye","title":"Herman Cain is out of running for Fed post — but Trump's second choice is worse","description":"Another one of Trump’s “best\" bites the dust — but who may come next is much worse","url":"https://www.salon.com/2019/04/23/herman-cain-is-out-of-running-for-fed-post-but-trumps-second-choice-is-worse/","urlToImage":"https://media.salon.com/2019/04/cain-moore.jpg","publishedAt":"2019-04-23T06:00:06Z","content":"Another one of Trump’s “best\" bites the dust. \r\nThe president announced on Monday via Twitter that one of his two preferred picks to join the board of directors of the Federal Reserve Bank, former Fox News contributor and failed Republican presidential candid… [+4634 chars]"},{"source":{"id":null,"name":"Neatorama.com"},"author":"Franzified","title":"Best Hiking Places in Every State in the U.S","description":"Hiking is a thrilling experience. It makes you appreciate the amazing things in life found in nature. And when you reach your destination, it is as if your exhaustion disappeared magically, and you would whisper to yourself, “This was worth it. This was worth…","url":"https://www.neatorama.com/2019/04/23/Best-Hiking-Places-in-Every-State-in-the-U-S/","urlToImage":"https://uploads.neatorama.com/images/posts/885/105/105885/Best-Hiking-Places-in-Every-State-in-the-U-S_0-x.jpg?v=9413","publishedAt":"2019-04-23T18:51:57Z","content":"Hiking is a thrilling experience. It makes you appreciate the amazing things in life found in nature. And when you reach your destination, it is as if your exhaustion disappeared magically, and you would whisper to yourself, This was worth it. This was worth … [+268 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Char Adams","title":"Woman Missing for 5 Days Found Alive in Wrecked Car After Vanishing During Trip to Post Office","description":"An Alabama woman was found alive in her wrecked car in a highway ditch on Monday, five days after she vanished during a trip to the post office, reports say. Family members reported Robin Fancher missing on Saturday — three days after she was last seen headin…","url":"https://people.com/human-interest/robin-fancher-missing-alabama-wrecked-car/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/robin.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-23T20:52:35Z","content":"An Alabama woman was found alive in her wrecked car in a highway ditch on Monday, five days after she vanished during a trip to the post office, reports say.\r\nFamily members reported Robin Fancher missing on Saturday   three days after she was last seen headi… [+1460 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Adam Carlson","title":"Everything to Know About Kim Kardashian's Complex Relationship with the White House — and Her Dinner with Jared & Ivanka","description":"The journey that took Kim Kardashian to the Trump White House began with a single tweet. Over the last year, Kardashian West, 38, has been making criminal justice reform a priority — a surprising evolution to some, she realizes, given her reality TV backgroun…","url":"https://people.com/politics/kim-kardashian-relationship-with-jared-kushner-donald-trump/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/kim-kardashian-9.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630","publishedAt":"2019-04-23T20:05:46Z","content":"The journey that took Kim Kardashian to the Trump White House began with a single tweet.\r\nOver the last year, Kardashian West, 38, has been making criminal justice reform a priority a surprising evolution to some, she realizes, given her reality TV background… [+6200 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Nick Sibilla, Contributor, Nick Sibilla, Contributor https://www.forbes.com/sites/nicksibilla/","title":"New York And Pennsylvania Will No Longer Suspend Driver's Licenses Over Drug Crimes","description":"Previously, any drug offense (no matter how minor) triggered a mandatory suspension of at least six months, even if the crime has nothing to do with driving.","url":"https://www.forbes.com/sites/nicksibilla/2019/04/23/new-york-and-pennsylvania-will-no-longer-suspend-drivers-licenses-over-drug-crimes/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F854082878%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-23T16:21:00Z","content":"Under legislation taking effect this month, New York and Pennsylvania will no longer suspend drivers licenses for people convicted of drug crimes. Previously, any drug offense in either state (no matter how minor) triggered a mandatory license suspension of a… [+10240 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Patricia Traina, Contributor, Patricia Traina, Contributor https://www.forbes.com/sites/patriciatraina/","title":"2019 Giants Mock Draft: Lots of Value In First Four Rounds","description":"Giants general manager Dae Gettleman said this year's draft class is loaded in talent. In this four-round mock draft, we try to match talent and need with value.","url":"https://www.forbes.com/sites/patriciatraina/2019/04/23/2019-giants-mock-draft-lots-of-value-in-first-four-rounds/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1086249520%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-23T16:54:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nNew York Giants general manager Dave Gettleman. (Photo by Joe Robbins/Getty Images)\r\nGetty\r\nThe Giants have needslots of needson their roster, particularly on the defensive side of the ball.\r\nGood thing … [+30072 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Joe Cornell, Contributor, Joe Cornell, Contributor https://www.forbes.com/sites/joecornell/","title":"KAR Auctions Services Targets Spin Of Insurance Auto Auctions Spinco In 2Q","description":"On April 1, 2019, KAR Auction Services, Inc. announced that it has received a favorable private letter ruling from the IRS to the IAA spin. As per the latest Form 10, IAA’s debt is pegged at approximately $1,330.0 million upon completion of the separation. Sp…","url":"https://www.forbes.com/sites/joecornell/2019/04/23/kar-auctions-services-targets-spin-of-insurance-auto-auctions-spinco-in-2q/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1083374350%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-23T16:18:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\n(Photo by Igor Golovniov/SOPA Images/LightRocket via Getty Images)\r\nGetty\r\nOn April 1, 2019, KAR Auction Services, Inc. (NYSE: KAR, $55.98, Market Capitalization: $7.5 billion), a leading provider of who… [+20032 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Andrew DePietro, Contributor, Andrew DePietro, Contributor https://www.forbes.com/sites/andrewdepietro/","title":"Here's How Much Money Graphic Designers Earn In Every State","description":"Find out where you can earn the most money as a graphic designer in the United States.","url":"https://www.forbes.com/sites/andrewdepietro/2019/04/23/graphic-designer-salary-state/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_5036%2Fpt_5036_585_o.jpg%3Ft%3D1556000109","publishedAt":"2019-04-23T06:15:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nGraphic designers earn slightly more than the U.S. average wage for all occupations.\r\nGetty\r\nWith the explosion of the internet and digital revolution in general, the career of a graphic designer has bee… [+8680 chars]"},{"source":{"id":null,"name":"10tv.com"},"author":null,"title":"BBQ food truck owners gets heat for 'LGBTQ' T-shirts - 10TV","description":"BBQ food truck owners gets heat for 'LGBTQ' T-shirts 10TV Alabama deputy suspended for homophobic comments after teen's suicide AL.com BBQ food truck faces backlash for 'LGBTQ' T-shirts CNN BBQ food truck faces backlash for ‘LGBTQ’ T-shirts WGHP FOX 8 Greensb…","url":"https://www.10tv.com/article/bbq-food-truck-owners-gets-heat-lgbtq-t-shirts-2019-apr","urlToImage":"https://www.10tv.com/sites/default/files/styles/article_image/public/2019/04/23/kentuckybbqshirt.jpg?itok=m8bCKmS7","publishedAt":"2019-04-23T18:17:27Z","content":"WILLIAMSTOWN, Ky. (AP) The owner of a Kentucky barbeque food truck got more heat than he bargained for when he began selling T-shirts with the message \"I support LGBTQ: Liberty, Guns, Bible, Trump, BBQ.\"\r\nBelle's Smokin' BBQ owner Jamie Smith told news outlet… [+527 chars]"},{"source":{"id":null,"name":"Wvtm13.com"},"author":"WVTM 13 Digital","title":"Public health experts warn of measles outbreak as cases inch closer to Alabama - WVTM13","description":"Public health experts warn of measles outbreak as cases inch closer to Alabama WVTM13 New York Outbreaks Drive US Measles Count up to 626 U.S. News & World Report Lack Of Vaccinations, Ease of Travel To Blame For Measles Outbreak CBS New York Measles outbreak…","url":"https://www.wvtm13.com/article/public-health-experts-warn-of-measles-outbreak-as-cases-inch-closer-to-alabama/27231638","urlToImage":"https://kubrick.htvapps.com/vidthumb/147eb5a9-08ad-434c-ac85-41621561e943/147eb5a9-08ad-434c-ac85-41621561e943_image.png?crop=1xw:1.0xh;center,top&resize=1200:*","publishedAt":"2019-04-23T03:11:00Z","content":"UAB and Jefferson County Department of Public Health experts on Monday warned of the nationwide measles outbreak as cases continue to inch closer to Alabama.\r\n\"Once it gets started in a vulnerable population it will spread quickly,\" said Dr. William Curry, As… [+99 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Kyler, Bosa and D.K. Are Looking for Jobs on Career Day | Gridiron Heights Draft Special - Bleacher Report","description":"Kyler, Bosa and D.K. Are Looking for Jobs on Career Day | Gridiron Heights Draft Special Bleacher Report Minnesota Vikings Top 5 Draft Needs: Tight End, #3 Daily Norseman Why Kyler Murray Is a One-of-a-Kind Quarterback Prospect | 2019 NFL Draft | The Ringer T…","url":"https://www.youtube.com/watch?v=WS8U7E-TByc","urlToImage":"https://i.ytimg.com/vi/WS8U7E-TByc/maxresdefault.jpg","publishedAt":"2019-04-23T16:17:17Z","content":null},{"source":{"id":null,"name":"Profootballfocus.com"},"author":null,"title":"PFF 2019 NFL Mock Draft 5: Rounds 1-3 | NFL Draft news and analysis - Pro Football Focus","description":"PFF 2019 NFL Mock Draft 5: Rounds 1-3 | NFL Draft news and analysis Pro Football Focus Tipsheet: Drew Lock is first-round wild card at NFL Draft STLtoday.com 2019 NFL Draft: How should the Cardinals approach each stage? Let's play GM and take a look CBS Sport…","url":"https://www.profootballfocus.com/news/draft-pff-2019-nfl-mock-draft-5-rounds-1-3","urlToImage":"https://media.profootballfocus.com/2019/04/USATSI_11967926_168384674_lowres.jpg?w=1024&h=1024","publishedAt":"2019-04-23T12:46:05Z","content":"By Steve Palazzolo &amp;bullet;\r\nApr 23, 2019 \r\nMy final mock draft is here. This time, we dove into the first three rounds, trying to find the fits and values that make the most sense for your team.\r\nAs always, I do not try to predict the draft. Im playing t… [+17933 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Brad Anderson","title":"Check Out The Eight Colors You Can Get For The New Hyundai Sonata","description":"The Hyundai Sonata should get an online configurator soon with pricing details just around the corner.","url":"https://www.carscoops.com/2019/04/check-out-the-eight-colors-you-can-get-for-the-new-hyundai-sonata/","urlToImage":"https://images.carscoops.com/2019/04/07f97d52-hyundai-sonata-color-.jpg","publishedAt":"2019-04-23T17:13:14Z","content":"The all-new 2020 Hyundai Sonata recently celebrated its North American debut at the New York Auto Show where it captured a lot of attention for its four-door coupe looks.\r\nAdopting a more adventurous design than its predecessor, the new Sonata will be sold in… [+1568 chars]"},{"source":{"id":null,"name":"Yellowhammernews.com"},"author":"A message from the Alabama Franchisee Association","title":"HB352 seeks to save the American Dream for Alabama small business owners - Yellowhammer News","description":"HB352 seeks to save the American Dream for Alabama small business owners Yellowhammer News The American Dream. It is woven into the fabric of our nation's success and yet, at some point, for small business owners across Alabama, the dream of small...","url":"https://yellowhammernews.com/hb352-seeks-to-save-the-american-dream-for-alabama-small-business-owners/","urlToImage":"https://yellowhammernews.com/wp-content/uploads/2019/04/Huddle-House-AL-Franchisee-Association.jpg","publishedAt":"2019-04-23T15:31:55Z","content":"Alabama is set to once again host “the Super Bowl of bass fishing.”\r\nB.A.S.S. announced Monday that the 50th Bassmaster Classic presented by DICKS Sporting Goods will be held in the Yellowhammer State — the world championship bass tournament in Birmingham, wi… [+3958 chars]"},{"source":{"id":null,"name":"Al.com"},"author":"Leada Gore | lgore@al.com","title":"Measles now reported in Georgia, Florida and Tennessee; 'likely' to spread to Alabama - AL.com","description":"Measles now reported in Georgia, Florida and Tennessee; 'likely' to spread to Alabama AL.com Cases of measles have now been reported in almost every state surrounding Alabama. View full coverage on Google News","url":"https://www.al.com/news/2019/04/measles-now-reported-in-georgia-florida-and-tennessee-likely-to-spread-to-alabama.html","urlToImage":"https://www.al.com/resizer/00l_xPVvZjvfbwxG0wnt3AaDc2Y=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/KSKWFZP5WZFULJ7MMBXIYOM7AM.jpg","publishedAt":"2019-04-23T13:43:00Z","content":"Measles cases have now been reported in Georgia, Florida and Tennessee and the disease is likely to spread to Alabama, according to health officials.\r\nThe Centers for Disease Control said 626 cases of measles have been reported in 22 states, with concentrated… [+1308 chars]"},{"source":{"id":null,"name":"Bleedinggreennation.com"},"author":"Brandon Lee Gowton","title":"NFL Draft 2019: The Eagles’ 8 most likely first round picks, according to one Sportsbook - Bleeding Green Nation","description":"NFL Draft 2019: The Eagles’ 8 most likely first round picks, according to one Sportsbook Bleeding Green Nation 2019 NFL Mock Draft: Cardinals to draft Kyler Murray, Giants to select Josh Allen | Get Up! ESPN Alabama DT Quinnen Williams shouldn’t be available,…","url":"https://www.bleedinggreennation.com/2019/4/23/18512411/nfl-draft-2019-most-likely-first-round-picks-josh-jacobs-alabama-running-back-marquise-brown-simmons","urlToImage":"https://cdn.vox-cdn.com/thumbor/Lt8kDl_Pxs3u4zKNoRxq-xhF868=/0x0:4811x2519/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13689212/1079273836.jpg.jpg","publishedAt":"2019-04-23T13:56:11Z","content":"Are you willing to wager on who the Philadelphia Eagles will select in the first round of the 2019 NFL Draft on Thursday night? If so, youre in luck. DraftKings Sportbook recently put out the following odds for Philadelphias pick:\r\nJosh Jacobs: +600Marquise B… [+3607 chars]"},{"source":{"id":null,"name":"Dynastyleaguefootball.com"},"author":"John DiBari","title":"Josh Jacobs: The King of the Hill - Dynasty League Football","description":"Josh Jacobs: The King of the Hill Dynasty League Football Get your 100 percent accurate NFL Draft scouting report SB Nation Charles Davis mock 3.0: Giants pass on QB NFL.com Will Harris NFL Draft Tape | Boston College S ACC Digital Network The Race to Make th…","url":"https://dynastyleaguefootball.com/2019/04/23/josh-jacobs-the-king-of-the-hill/","urlToImage":"https://dynastyleaguefootball.com/wp-content/uploads/2019/04/Jacobs-2.jpg","publishedAt":"2019-04-23T13:03:24Z","content":"After a rather uninspiring series of performances at the NFL Scouting Combine, followed by some lackluster pro day showings, we sit here heading into the NFL draft with Josh Jacobs listed as most peoples RB1 in this class. Is that still warranted?\r\nAt a previ… [+2222 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Carter Sherman, VICE News","title":"Alabama sheriff’s deputy attacks LGBTQ community after gay teen dies by suicide","description":"\"I'm seriously offended there is such a thing as the movement,\" the sheriff's deputy wrote in response to reports of the teen's death.","url":"https://news.vice.com/en_us/article/wjv585/alabama-sheriffs-deputy-attacks-lgbtq-community-after-gay-teen-dies-by-suicide","urlToImage":"https://video-images.vice.com/articles/5cbf17f19e85b2000782a2d5/lede/1556032689776-GettyImages-769772763.jpeg?crop=1xw:0.8451219512195122xh;center,center","publishedAt":"2019-04-23T15:26:22Z","content":"A sheriffs deputy in Alabama has been placed on leave after he made anti-LGBTQ comments on social media specifically, on a post about a teenage boy who was bullied until he killed himself, Alabama.com reported Monday.\r\nLast weekend, a local Alabama news stati… [+2911 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Doctor: Alabama's Saban undergoes hip replacement surgery","description":"Alabama coach Nick Saban has undergone hip replacement surgery","url":"https://www.foxsports.com/college-football/story/doctor-alabama-s-saban-undergoes-hip-replacement-surgery-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/11b21f9a70964757adc6a0cb91ed0695.vresize.1200.630.high.11.jpg","publishedAt":"2019-04-23T00:08:59Z","content":"TUSCALOOSA, Ala. (AP) — Alabama coach Nick Saban has undergone hip replacement surgery.\r\nDr. Lyle Cain said Monday the 67-year-old Saban is expected to make a full recovery and “should be able to return to work in the very new future.” Cain says the right hip… [+441 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Justin Thomas launches foundation for children, military","description":"Golf notes: Justin Thomas launches his foundation; Meghan MacLaren tees it up next to men for 3rd time this year","url":"https://www.foxsports.com/golf/story/justin-thomas-launches-foundation-for-children-military-042319","urlToImage":"https://b.fssta.com/uploads/2019/04/9d0295c76a0e4c6384b384f984c6246c.vresize.1200.630.high.61.jpg","publishedAt":"2019-04-23T23:01:06Z","content":"Justin Thomas is the latest PGA Tour player to launch a foundation, and it wasn’t anything he threw together overnight.\r\n“We’ve been talking about it the last couple of years,” Thomas said. “My mom has done an unbelievable job of making sure everything was do… [+7296 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Monday Sports in Brief","description":"Monday Sports in Brief","url":"https://www.foxsports.com/other/story/monday-sports-in-brief-042319","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-23T07:22:39Z","content":"BASKETBALL\r\nPHOENIX (AP) — The Phoenix Suns fired coach Igor Kokoskov after one season.\r\nThe team announced Kokoskov’s firing in a statement Monday night.\r\nA longtime NBA assistant, Kokoskov was the first European-born head coach in NBA history when Phoenix h… [+8224 chars]"},{"source":{"id":null,"name":"Kdnuggets.com"},"author":"Dan Clark","title":"2019 Best Masters in Data Science and Analytics – Online","description":"We provide an updated comprehensive and objective survey of online Masters in Analytics and Data Science, including rankings, tuition, and duration of the education program.","url":"https://www.kdnuggets.com/2019/04/best-masters-data-science-analytics-online.html","urlToImage":null,"publishedAt":"2019-04-23T15:30:36Z","content":"Data Science and Analytics is a very hot field, and demand for data scientists is still growing strongly. Many universities stepped in and created many degrees in the field, primarily Masters degrees.\r\nBack in 2017, we ran a series of articles looking at the … [+28998 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Kate Smith","title":"Alabama politicians compare abortions to the Holocaust","description":"\"Invoking the Holocaust to advance any policy position is totally out of bounds,\" said a spokesperson for the Anti-Defamation League","url":"https://www.cbsnews.com/news/alabama-abortion-bill-alabama-politicians-compare-abortions-to-the-holocaust-in-proposed-abortion-law-2019-04-23/","urlToImage":"https://cbsnews1.cbsistatic.com/hub/i/r/2014/08/04/e7b7af62-7e09-4c6b-9433-b8533b2c21be/thumbnail/1200x630/b5e6f0a253132905a3bab77941e0d8dc/alaabortionap801264464369.jpg","publishedAt":"2019-04-23T20:19:37Z","content":"In legislation proposed earlier this month, Alabama state lawmakers compared abortions in the U.S. to the Holocaust and other modern genocides, prompting Jewish activists and abortion rights groups to rebuke the legislation as \"deeply offensive.\"\r\nSenator Ben… [+4593 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Jamie Yuccas","title":"Gas prices continue climbing across U.S.","description":"The average gas price in California is now above $4","url":"https://www.cbsnews.com/news/gas-prices-continue-climbing-across-us-2019-04-23/","urlToImage":"https://cbsnews3.cbsistatic.com/hub/i/r/2016/08/10/b45bf902-f4ab-4814-9e43-3b09cc79f70f/thumbnail/1200x630/cf7bcfe9ee09c243bba05ca157015874/gas-pump-493361566.jpg","publishedAt":"2019-04-23T22:49:04Z","content":"Los Angeles — For eight straight weeks, gas prices are climbing across the country, up more than 20 cents a gallon in a month. No one has been hit harder than California drivers, who are seeing their highest prices in nearly five years.\r\nThe average price for… [+978 chars]"},{"source":{"id":null,"name":"247sports.com"},"author":"Steve Wiltfong","title":"No. 1 recruit Bryan Bresee goes in-depth on Clemson commitment - 247Sports","description":"No. 1 recruit Bryan Bresee goes in-depth on Clemson commitment 247Sports Nation's top prospect commits, Clemson moves to No. 1 in rankings TigerNet Nation's No. 1 recruit picks Clemson over Alabama, others AL.com Clemson football, Dabo Swinney on verge of No.…","url":"https://247sports.com/Article/Bryan-Bresee-commitment-announcement-Clemson-131443570/","urlToImage":"https://s3media.247sports.com/Uploads/Assets/843/194/9194843.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630","publishedAt":"2019-04-23T19:02:02Z","content":"No. 1 recruit Bryan Bresee announced his commitment to Clemson during Tuesday’s broadcast on CBS Sports HQ, but the Damascus (Md.) five-star defensive lineman told the Tigers he was coming earlier this month while on the campus for the spring game.\r\nBreese’s … [+3142 chars]"},{"source":{"id":null,"name":"Hogshaven.com"},"author":"Steve Shoup","title":"Redskins Mock Draft Scenario - Hogs Haven","description":"Redskins Mock Draft Scenario Hogs Haven NFL mock draft 2019 results: 32 reporters make their first-round picks Los Angeles Times Will Harris NFL Draft Tape | Boston College S ACC Digital Network Quinnen Williams about to fulfill a dream and his mother’s last …","url":"https://www.hogshaven.com/2019/4/22/18511929/redskins-mock-draft-scenario","urlToImage":"https://cdn.vox-cdn.com/thumbor/pd_fDxcfWAWgGKJHHU-jDJXGR6s=/0x0:4777x2501/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16183514/usa_today_11435914.jpg","publishedAt":"2019-04-23T01:57:45Z","content":"For this Redskins mock draft using On the Clock Draft Simulator I went with the approach of taking the top QB available at 15 and then maximizing my selections in the top 4 rounds. I took a page out of last years draft playbook and traded back in the 2nd roun… [+5266 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Jenny Vrentas","title":"The NFL Draft Information Trade: How Teams Gather Nuggets of Knowledge to Shape Draft Decisions - Sports Illustrated","description":"The NFL Draft Information Trade: How Teams Gather Nuggets of Knowledge to Shape Draft Decisions Sports Illustrated Why Kyler Murray Is a One-of-a-Kind Quarterback Prospect | 2019 NFL Draft | The Ringer The Ringer Recap: Eagles chat with Jimmy Kempski PhillyVo…","url":"https://www.si.com/nfl/2019/04/23/nfl-draft-information-trade-media-adam-schefter-ian-rapoport-rick-gosselin","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/Draft-Information-story.png&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T12:22:02Z","content":"Ian Rapoport found himself in an uncomfortable position. The NFL draft was due to start in a matter of hours, and one teams general manager was asking him to play the role of carrier pigeon.\r\nI need you to tell [a second GM] that Im not going to draft [a spec… [+14922 chars]"},{"source":{"id":null,"name":"Knbr.com"},"author":null,"title":"Matt Barrows predicts which player 49ers are 'eying' with No. 2 pick - KNBR","description":"Matt Barrows predicts which player 49ers are 'eying' with No. 2 pick KNBR Nick Bosa Comes With The Kind of Baggage That Doesn’t Matter The New York Times Nick Bosa has all the tools, but today's NFL could play against him - Stephen A. | First Take ESPN Opinio…","url":"http://www.knbr.com/2019/04/23/matt-barrows-predicts-which-player-49ers-are-eying-with-no-2-pick/","urlToImage":"http://images.tritondigitalcms.com/6616/sites/82/2019/04/23124108/lynch-shannee1.jpg","publishedAt":"2019-04-23T12:54:00Z","content":"© Kelley L Cox-USA TODAY Sports\r\nThe countdown to the 2019 NFL Draft has ticked to two days. On Thursday, the 49ers will add a top prospect with the No. 2 overall pick, or if they trade down, potentially two players in the first round.\r\nDraft talk has filled … [+2495 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Tatiana Pile","title":"IRS faces Tuesday deadline to hand over Trump's tax returns - AOL","description":"IRS faces Tuesday deadline to hand over Trump's tax returns AOL IRS faces a second deadline to release Trump tax returns to Democrats CNN Team Trump Scoffs at Tax Return Deadline, Dares Dems to Take Legal Action: 'Let Them Knock Themselves Out' The Daily Beas…","url":"https://www.aol.com/article/finance/2019/04/23/irs-faces-tuesday-deadline-to-hand-over-trumps-tax-returns/23715971/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/3384x2218+0+33/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2F0db690c0-6351-11e9-af7f-172ac7c7b3a2","publishedAt":"2019-04-23T15:04:14Z","content":"Tuesday is the deadline for the IRS to hand over President Donald Trump's tax returns to the House Ways and Means Committee.\r\nThe panel wants the president's personal tax returns from the last six years and tax returns from eight of his businesses. It initial… [+2942 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Michael David Smith","title":"Josh Jacobs appears to have multiple teams with first-round interest","description":"The running back position has been devalued in the NFL in recent years, but one running back appears poised to be snapped up no later than the end of the first round. Alabama running back Josh Jacobs has been mocked to draft slots in the 20s in most mock draf…","url":"https://profootballtalk.nbcsports.com/2019/04/23/josh-jacobs-appears-to-have-multiple-teams-with-first-round-interest/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/gettyimages-1075814730-e1556037477582.jpg","publishedAt":"2019-04-23T16:38:12Z","content":"The running back position has been devalued in the NFL in recent years, but one running back appears poised to be snapped up no later than the end of the first round.\r\nAlabama running back Josh Jacobs has been mocked to draft slots in the 20s in most mock dra… [+785 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Walgreens to hike minimum age for store tobacco sales","description":"Walgreens has decided to raise its minimum age for tobacco sales several weeks after a top federal official chastised the drugstore chain for violating laws restricting access to cigarettes and other tobacco products.","url":"https://news.yahoo.com/walgreens-hike-minimum-age-store-154009254.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/TbyI8rJwllIcVPcYrm.32g--~B/aD0zNTYzO3c9NTM0NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-04/cb9be7b0-65e1-11e9-b9e6-cffbf1319e98","publishedAt":"2019-04-23T18:20:42Z","content":"Walgreens has decided to raise its minimum age for tobacco sales several weeks after a top federal official chastised the drugstore chain for violating laws restricting access to cigarettes and other tobacco products.\r\nDeerfield, Illinois-based Walgreens Boot… [+922 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Women seeking discount plastic surgery paid with their lives at clinics opened by felons","description":"Florida legislators failed to act as the high-volume businesses left 13 dead, a dozen injured, according to a USA TODAY Investigation.","url":"https://news.yahoo.com/women-seeking-discount-plastic-surgery-012028526.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/m37sAtWts8MHai2JZJNWGA--~B/aD04NjY7dz04NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/usa_today_news_641/2614e8880a612c62964f17dfe563b261","publishedAt":"2019-04-23T01:20:28Z","content":"MIAMI One man pleaded guilty to bank fraud. One was convicted of grand theft in a real estate scam. Two others admitted to elaborate Medicare schemes that siphoned millions from taxpayers.In Florida, one of the nations top destinations for plastic surgery, a … [+22044 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Clemson lands No. 4 prospect Bresee for 2020","description":"Defensive tackle Bryan Bresee, the No. 4 prospect in the class of 2020 and the No. 1 ranked DT,   is committing to Clemson, he announced Tuesday.","url":"http://www.espn.com/college-football/story/_/id/26587244/clemson-lands-no-4-prospect-bresee-2020","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0301%2Fr406436_3_1296x729_16%2D9.jpg","publishedAt":"2019-04-23T19:09:00Z","content":"Clemson landed a commitment from 2020 defensive tackle Bryan Bresee on Tuesday, adding another top prospect to its class. Bresee is the No. 4 ranked prospect overall and chose the Tigers over Alabama, Georgia, Michigan, Ohio State and Penn State.\r\nThe No. 1 r… [+4026 chars]"},{"source":{"id":null,"name":"Advocate.com"},"author":"Tracy E. Gilchrist","title":"Alabama Cop on Leave for Antigay Post About 15-Year-Old's Suicide","description":"While the community rallied after a 15-year-old boy was bulled and died by suicide, a  sheriff's deputy responded with a hateful anti-LGBTQ post on Facebook.","url":"https://www.advocate.com/youth/2019/4/23/alabama-cop-leave-antigay-post-about-15-year-olds-suicide","urlToImage":"https://www.advocate.com/sites/advocate.com/files/2019/04/23/nigel-750x.jpg","publishedAt":"2019-04-23T15:31:53Z","content":"A sheriffs deputy was placed on leave for making anti-LGBTQ comments on a Facebook post about a 15-year-old Huntsville, Ala., boy who died by suicide after experiencing antigay bullying, according to AL.com. \r\nIn a Facebook post on local TV station WZDXs page… [+2845 chars]"},{"source":{"id":null,"name":"Fox47news.com"},"author":"WSYM","title":"NFL Draft 2019: Who has been picked at 8 in past 20 years","description":"The 2019 NFL Draft begins on Thursday night, and the Detroit Lions have the No. 8 selection in this year's draft. The team has plenty of needs, and below, we'll look at some of the previous selections that have been made with the 8th pick in the draft. 2018: …","url":"https://www.fox47news.com/sports/nfl-draft-2019-who-has-been-selected-with-8th-pick-in-the-past-20-years","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/40c193a/2147483647/strip/true/crop/1024x538+0+76/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9b%2Ff1%2F35f8bfdd44618a6143f59245b334%2Fgettyimages-951616874.jpg","publishedAt":"2019-04-23T17:37:39Z","content":"The 2019 NFL Draft begins on Thursday night, and the Detroit Lions have the No. 8 selection in this year's draft. The team has plenty of needs, and below, we'll look at some of the previous selections that have been made with the 8th pick in the draft.\r\n2018:… [+1138 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"NBC Sports BayArea","title":"Raiders seven-round mock draft: Paul Guenther gets defensive line help","description":"The Raiders are scheduled to make eight selections in this NFL draft. Half of them come in the first 35 overall. That will likely change during the annual selection process, which begins Thursday night in Nashville.Raiders trades are expected either in the fi…","url":"https://sports.yahoo.com/raiders-seven-round-mock-draft-205254164.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/rpqk4utXw_HX2trQazdzqQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/06221fb6137c57371a7aee9f93f28dad","publishedAt":"2019-04-23T20:52:54Z","content":"Raiders seven-round mock draft: Paul Guenther gets defensive line help originally appeared on nbcsportsbayarea.com\r\nThe Raiders are scheduled to make eight selections in this NFL draft. Half of them come in the first 35 overall. That will likely change during… [+6009 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Yahoo Sports","title":"Yahoo Sports' top 2019 NFL draft prospects, No. 3: Mississippi State DT Jeffery Simmons","description":"Leading up to the 2019 NFL draft, which starts April 25, Yahoo Sports will count down our top 100 overall prospects. We’ll count them down 10 at a time, followed by profiles on our top 30 overall players.","url":"https://sports.yahoo.com/yahoo-sports-top-2019-nfl-draft-prospects-no-3-mississippi-state-dt-jeffery-simmons-180706279.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/0n5nbxoeYBNRj9qMcakr8Q--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cbf542f1f000058017f2291.jpeg","publishedAt":"2019-04-23T18:07:06Z","content":"Leading up to the 2019 NFL draft, which starts April 25, Yahoo Sports will count down our top 100 overall prospects. Well count them down 10 at a time, followed by profiles on our top 30 overall players.\r\nPrevious entries: Nos. 100-91 | 90-81 | 80-71 | 70-61 … [+7709 chars]"},{"source":{"id":null,"name":"Sandiegouniontribune.com"},"author":"Baltimore Sun","title":"Fate of Kyler Murray provides only buzz to NFL Draft this year","description":"This is the bobblehead NFL draft — top heavy — and overall is about as sexy as a church social. Everyone's wearing fig leaves. It can be good, maybe real good, but good or real good make a fully-clothed centerfold. What it has are question marks, dozens of th…","url":"https://www.sandiegouniontribune.com/canepa-nfl-draft-kyler-murray-arizona-cardinals-jon-gruden-raiders-story.html","urlToImage":"https://www.trbimg.com/img-5cbf137d/turbine/canepa-nfl-draft-kyler-murray-arizona-cardinals-jon-gruden-raiders","publishedAt":"2019-04-23T13:30:00Z","content":"This is the bobblehead NFL draft top heavy and overall is about as sexy as a church social. Everyones wearing fig leaves.\r\nIt can be good, maybe real good, but good or real good make a fully-clothed centerfold.\r\nWhat it has are question marks, dozens of them,… [+4906 chars]"},{"source":{"id":null,"name":"Dailynorseman.com"},"author":"Daily Norseman","title":"Minnesota Vikings Top 5 Draft Needs: Tight End, #3","description":"We are now, officially, just a couple of days away from the 2019 NFL Draft in Nashville, and we're doing one final rundown of what the Minnesota Vikings' biggest needs are as we approach Draft Weekend. I've looked at the running back spot as well as the corne…","url":"https://www.dailynorseman.com/2019/4/23/18512607/minnesota-vikings-top-5-draft-needs-tight-end-2019-nfl-draft","urlToImage":"https://cdn.vox-cdn.com/thumbor/soGYd7aWqTWKCIiozE1l0okvVTQ=/0x0:4965x2599/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13648830/usa_today_11893422.jpg","publishedAt":"2019-04-23T05:00:00Z","content":"We are now, officially, just a couple of days away from the 2019 NFL Draft in Nashville, and were doing one final rundown of what the Minnesota Vikings biggest needs are as we approach Draft Weekend. Ive looked at the running back spot as well as the cornerba… [+3628 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Yahoo Sports","title":"Nashville perfect host for evolving NFL draft party","description":"The Super Bowl can’t go everywhere. The draft can. So keep sending this thing out into the country and let each region put its own spin on it.","url":"https://sports.yahoo.com/nashville-perfect-host-for-evolving-nfl-draft-party-015921537.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/YdrOTYsAaVudJMMO9CzscA--~B/aD0yOTg0O3c9NDUxOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cbe7023240000b9000684a8.jpeg","publishedAt":"2019-04-23T01:59:21Z","content":"Back in the 1990s, what did people first say to Butch Spyridon when he would tell them he was from Nashville, Tennessee?\r\nYou mean after they stopped laughing? joked Spyridon, who has served as president of the Nashville Convention and Visitors Corporation si… [+4980 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Rotoworld","title":"NFL Draft RB Deep Dive","description":"Thor Nystrom takes a closer look at the 2019 running backs class in advance of the draft.","url":"https://sports.yahoo.com/nfl-draft-rb-deep-dive-230009665.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/TU7qeiFDGmKLIOyVzvx.5g--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/cb444cfb8204b9caea7e4051a7c021b0","publishedAt":"2019-04-23T23:00:09Z","content":"Below is an updated version of my RB rankings, with few names, updated rankings and write-ups, and added videos for each prospect.All players ages are calculated as of September 2019. The spider web of each prospect's test results from the NFL Combine come co… [+47189 chars]"},{"source":{"id":null,"name":"Eater.com"},"author":"Taylor Henriquez","title":"The Cheese-Smothered Comfort of My Hometown Mexican Chain","description":"For a new teen transplant to the South, a combo-plate Mexican restaurant named La Parrilla felt like a sanctuary.","url":"https://www.eater.com/2019/4/23/18309424/la-parrilla-mexican-food-georgia","urlToImage":"https://cdn.vox-cdn.com/thumbor/tsUTs3EnRfO9S66TL8Zr6AmvPE0=/0x115:3000x1686/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16125242/Naya_Cheyenne_La_Parrilla_Header_3000x1800_Updated.jpg","publishedAt":"2019-04-23T14:00:00Z","content":"There are only two situations that make me lose my appetite: watching breech calves being born on The Incredible Dr. Pol(if you know, you know), and driving behind pickup trucks flying Confederate flags. \r\nI saw my first Confederate flag at 12 on a visit to F… [+14166 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"The Associated Press","title":"Monday Sports in Brief","description":"The Phoenix Suns fired coach Igor Kokoskov after one season.  The team announced Kokoskov's firing in a statement Monday night.  A longtime NBA assistant, Kokoskov was the first European-born head coach in NBA history when Phoenix hired him to replace interim…","url":"https://sports.yahoo.com/monday-sports-brief-072403967--nfl.html","urlToImage":null,"publishedAt":"2019-04-23T07:24:03Z","content":"BASKETBALL\r\nPHOENIX (AP) -- The Phoenix Suns fired coach Igor Kokoskov after one season.\r\nThe team announced Kokoskov's firing in a statement Monday night.\r\nA longtime NBA assistant, Kokoskov was the first European-born head coach in NBA history when Phoenix … [+8317 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Doctor: Alabama’s Saban undergoes hip replacement surgery","description":"TUSCALOOSA, Ala. (AP) — Alabama coach Nick Saban has undergone hip replacement surgery. Dr. Lyle Cain said Monday the 67-year-old Saban is expected to make a full recovery and “should be able to return to work in the very new future.” Cain says the right hip …","url":"https://www.seattletimes.com/sports/college/doctor-alabamas-saban-undergoes-hip-replacement-surgery/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/urn-publicid-ap-org-ad28784272004570ac0f87493330aa04Alabama_Spring_Football_34359-1200x630.jpg","publishedAt":"2019-04-23T00:08:59Z","content":"TUSCALOOSA, Ala. (AP) Alabama coach Nick Saban has undergone hip replacement surgery.\r\nDr. Lyle Cain said Monday the 67-year-old Saban is expected to make a full recovery and “should be able to return to work in the very new future.” Cain says the right hip r… [+539 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Missing woman found alive in car days after disappearance","description":"DOTHAN, Ala. (AP) — A missing woman has been found alive in her wrecked car five days after she was last seen in south Alabama. Authorities say a passer-by noticed a car that was mostly hidden by brush in a ditch off a road Monday. Rescuers found Robin Joyce …","url":"https://www.seattletimes.com/nation-world/nation/missing-woman-found-alive-in-car-days-after-disappearance/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-23T12:26:35Z","content":"DOTHAN, Ala. (AP) A missing woman has been found alive in her wrecked car five days after she was last seen in south Alabama.\r\nAuthorities say a passer-by noticed a car that was mostly hidden by brush in a ditch off a road Monday.\r\nRescuers found Robin Joyce … [+521 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"Bob Condotta","title":"Seahawks defensive tackle Jarran Reed has sports hernia surgery, expected to be ready for training camp","description":"Reed had surgery on the same day he saw good friend Frank Clark get traded away","url":"https://www.seattletimes.com/sports/seahawks/jarran-reed-has-sports-hernia-surgery-expected-to-be-ready-for-training-camp/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/131457-1200x630.jpg","publishedAt":"2019-04-23T21:36:31Z","content":"Shortly after the Seahawks traded Frank Clark Tuesday, defensive tackle Jarran Reed tweeted that he felt like he had just lost his best friend.\r\nHe apparently tweeted that from a hospital bed in Philadelphia, as it was shortly after reported by Ian Rapoport o… [+3150 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"Sarah Moreno","title":"Sponsored: Hispanic women hurt most by wage gap, costing them over $20,000 a year","description":"At the national level, Latin women earn 53 cents for every dollar earned by a white non-Hispanic male, study says.","url":"https://www.seattletimes.com/explore/careers/hispanic-women-hurt-most-by-wage-gap-costing-them-over-20000-a-year/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-23T14:10:00Z","content":"Five extra months of rent, nine months of child care and nearly four months of health insurance.\r\nThat’s what women in the United States could afford if their salaries were the same as men’s.\r\nThe salary gap is still pummeling working women, and particularly … [+3267 chars]"},{"source":{"id":"time","name":"Time"},"author":"Associated Press","title":"Walgreens to Raise Minimum Age to Purchase Tobacco After Federal Criticism","description":"Walgreens has decided to raise its minimum age up to 21 years old for tobacco sales after a top federal official criticized them.","url":"http://time.com/5576518/walgreens-age-purchase-tobacco-21/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/walgreens-age-purchase-tobacco-21.jpg?quality=85","publishedAt":"2019-04-23T20:36:30Z","content":"Walgreens has decided to raise its minimum age for tobacco sales several weeks after a top federal official chastised the drugstore chain for violating laws restricting access to cigarettes and other tobacco products.\r\nDeerfield, Illinois-based Walgreens Boot… [+955 chars]"},{"source":{"id":null,"name":"Rawstory.com"},"author":"Tana Ganeva","title":"Evangelist arrested for child sex abuse is still trying to manipulate his victims from jail: authorities","description":"A 39-year-old Alabama pastor in jail for allegedly engaging in sex acts with victims ages 13-16 is still in contact with his victims, according to authorities. WBRC reports that Paul Action Bowen, formerly an evangelical religious leader in the community, is …","url":"https://www.rawstory.com/2019/04/evangelist-arrested-child-sex-abuse-still-trying-manipulate-victims-jail-authorities/","urlToImage":"https://www.rawstory.com/wp-content/uploads/2018/04/Alabamayouthpastor-800x430.png","publishedAt":"2019-04-23T19:34:01Z","content":"A 39-year-old Alabama pastor in jail for allegedly engaging in sex acts with victims ages 13-16 is still in contact with his victims, according to authorities.\r\n# p #1_6 # ad skipped = NULL #\r\nWBRC reports that Paul Action Bowen, formerly an evangelical relig… [+1315 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Ben Kercheval","title":"WATCH: Live stream of Bryan Bresee, the No. 1 recruit for 2020, announcing his college decision","description":"Bresee is considering Alabama, Clemson, Georgia, Ohio State and Penn State, among others","url":"https://www.cbssports.com/college-football/news/watch-live-stream-of-bryan-bresee-the-no-1-recruit-for-2020-announcing-his-college-decision/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/23/5ac34365-1d09-4571-8299-67693e349ce8/thumbnail/770x433/b21deb52d0801da3cfdf0b40d4aa7834/8533509.jpg","publishedAt":"2019-04-23T18:09:40Z","content":"Defensive lineman Bryan Bresee, the No. 1 overall recruit in the Class of 2020, is set to make his college announcement on Tuesday at 2:40 p.m. ET. Bresee will appear LIVE on CBS Sports HQ, which can be viewed in the video player above.\r\nBresee is considering… [+908 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Matt Norlander","title":"FBI witness testifies he paid college football players at major programs from 2000 to 2014","description":"Martin Blazer said he paid college football players at Alabama, Penn State, Notre Dame, Michigan and others","url":"https://www.cbssports.com/college-football/news/fbi-witness-testifies-he-paid-college-football-players-at-major-programs-from-2000-to-2014/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/23/5b44a140-3cb4-4a89-91bf-0bb0ff2231d4/thumbnail/770x433/90f36aca55d85502b5b718101e85e823/hakeem-nicks.jpg","publishedAt":"2019-04-23T22:03:20Z","content":"NEW YORK -- College football has been wrangled into the mud pit of college basketball's corruption trial. And some of the biggest names in the sport were invoked Tuesday: Alabama, Notre Dame, Michigan and Penn State among others. \r\nTuesday saw opening argumen… [+5231 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"CBS Sports Staff","title":"2019 NFL Draft: Top prop bets, picks, predictions: Go Under 2.5 wide receivers in first round","description":"SportsLine's top NFL expert reveals his best prop bets for the 2019 NFL Draft","url":"https://www.cbssports.com/nfl/news/2019-nfl-draft-top-prop-bets-picks-predictions-go-under-2-5-wide-receivers-in-first-round/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/10/20/c6d0eaf1-e726-415a-ae02-9d6bd7742d72/thumbnail/770x433/7151ca61c5590e2a2405915b33b2a349/oklahoma-tcu.jpg","publishedAt":"2019-04-23T23:25:18Z","content":"The 2019 NFL Draft begins Thursday night with the Arizona Cardinals set to go on the clock at 8 p.m. ET from Nashville. Quarterback Kyler Murray and defensive linemen Nick Bosa and Quinnen Williams are vying to be the No. 1 pick, while Ohio State QB Dwayne Ha… [+3254 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"2019 NFL Draft: Running back comparisons for top prospects, including James Conner, Reggie Bush and more","description":"There could be a Maurice Jones-Drew or Dalvin Cook lurking, even in an RB class not rife with elite talent","url":"https://www.cbssports.com/nfl/draft/news/2019-nfl-draft-running-back-comparisons-for-top-prospects-including-james-conner-reggie-bush-and-more/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/09/25/4680f23c-7aaa-4876-ba52-1c0c6a61ddae/thumbnail/770x433/af16bd60613045270b1eee06474fdba6/cowboys.jpg","publishedAt":"2019-04-23T14:45:14Z","content":"Compared to the Saquon Barkley-led group of a year ago, the 2019 running back class doesn't stack up.\r\nWhat should we expect during the draft? The theme of this iteration of running back prospects, to me, is more Day 2 value selections than highly sought afte… [+9393 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"2019 NFL Draft superlatives: The breakout late-round receiver, the immediate game-changer and more prospect awards","description":"Which late-round WR could be the next Antonio Brown? Who'll live up to the hype like Quenton Nelson? Let's take a look","url":"https://www.cbssports.com/nfl/draft/news/2019-nfl-draft-superlatives-the-breakout-late-round-receiver-the-immediate-game-changer-and-more-prospect-awards/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/11/02/bcb8e5ff-398b-459b-aa68-8935b9217282/thumbnail/770x433/19911d287d47e93aca8ebdc5b052b5c9/quinnen.jpg","publishedAt":"2019-04-23T18:45:22Z","content":"Superlatives -- they're the thing from high school yearbooks that people are most likely to remember years and years later. In your yearbook did you win \"most likely to succeed\"? Well, you totally should have. And for this year's draft, there will be plenty t… [+13456 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"2019 NFL Draft: My final Top 200 Big Board headlined by defensive linemen, edge rushers and receivers","description":"The class of defensive linemen lived up to the hype, and plenty of talented receivers are available this year","url":"https://www.cbssports.com/nfl/draft/news/2019-nfl-draft-my-final-top-200-big-board-headlined-by-defensive-linemen-edge-rushers-and-receivers/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/07/25/613b3e21-a51f-4958-8500-62c75075b4ca/thumbnail/770x433/68137e0a4f88be3f12abdd5c3089d4bb/usatsi-10404128-nick-bosa-buckeyes.jpg","publishedAt":"2019-04-23T16:43:21Z","content":"After months and months of watching and re-watching film of hundreds of draft prospects and analyzing combine and pro day results, my Top 200 Big Board for the 2019 NFL Draft is finalized. \r\nNick Bosa remained my No. 1 prospect throughout. Drew Lock's my No. … [+20330 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"NFL Draft 2019: Comparisons for the top defensive linemen, including why Ed Oliver is like John Randle","description":"Plus the former Clemson star similar to Linval Joseph and a look at 2019's top defensive line prospects","url":"https://www.cbssports.com/nfl/draft/news/nfl-draft-2019-comparisons-for-the-top-defensive-linemen-including-why-ed-oliver-is-like-john-randle/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/01/c01712be-ed99-4f3d-baa8-c44f9e3ae496/thumbnail/770x433/993f4968323d74219f3a7ae86ddbf638/ed-oliver.jpg","publishedAt":"2019-04-23T16:01:06Z","content":"When we look back on the 2019 NFL Draft, which kicks off Thursday in Nashville, Tennessee, it's my opinion that we'll remember it as an epic defensive tackle class. There are an unusually high number of top-end talents, but that's not the only reason. On Day … [+6959 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"NFL Draft 2019: NFL comparisons for top defensive backs, including Deandre Baker, Greedy Williams and more","description":"Which former Washington star has similarities to Casey Hayward? Here's a look at 2019's top corners and safeties","url":"https://www.cbssports.com/nfl/draft/news/nfl-draft-2019-nfl-comparisons-for-top-defensive-backs-including-deandre-baker-greedy-williams-and-more/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/20/aee60fa7-8c04-4247-b006-12b5eff4587a/thumbnail/770x433/e0a94b39fac9da6dc9bcba07bd1f86ce/david-long-michigan.jpg","publishedAt":"2019-04-23T16:30:15Z","content":"Prospects had clearly defined positions at the NFL level at one point in the not-too-distant past. But it's moving closer to becoming a positionless league, and this class of defensive backs in the 2019 NFL Draft will add more evidence to that idea. \r\nMost of… [+7981 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"CIA’s recruitment campaign hits a bump with bad grammar","description":"The CIA conducts is facing outcry over its grammar as part of its new public recruitment campaign.","url":"https://www.bbc.co.uk/news/world-us-canada-48032270","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/A6B8/production/_106308624_ciaseal5.jpg","publishedAt":"2019-04-23T20:19:07Z","content":"Image copyrightSAUL LOEBImage caption\r\n The CIA is trying to promote its work and recruit new people\r\nThe CIA has started a new recruitment campaign and will soon have an Instagram account. But as they've discovered, operating in the open is not always easy. … [+2704 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Deputy on leave for homophobic comment over teen’s suicide","description":"HUNTSVILLE, Ala. (AP) — An Alabama deputy has been put on administrative leave for posting a homophobic comment on a Facebook post about a gay teen who killed himself. Al.com reports Madison County Deputy Jeff Graves wrote the comment Sunday on a WZDX-TV Face…","url":"https://www.seattletimes.com/nation-world/nation/deputy-on-leave-for-homophobic-comment-over-teens-suicide/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-23T10:17:44Z","content":"HUNTSVILLE, Ala. (AP) An Alabama deputy has been put on administrative leave for posting a homophobic comment on a Facebook post about a gay teen who killed himself.\r\nAl.com reports Madison County Deputy Jeff Graves wrote the comment Sunday on a WZDX-TV Faceb… [+657 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"ADAM BEAM","title":"California Senate OKs ban on hairstyle discrimination","description":"SACRAMENTO, Calif. (AP) — California could become one of the first states to outlaw racial discrimination because of hairstyles — such as braids and dreadlocks — in a move aimed at challenging long-held standards of professionalism in the workplace. The Calif…","url":"https://www.seattletimes.com/nation-world/nation/california-senate-oks-ban-on-hairstyle-discrimination/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-23T00:15:09Z","content":"SACRAMENTO, Calif. (AP) California could become one of the first states to outlaw racial discrimination because of hairstyles such as braids and dreadlocks in a move aimed at challenging long-held standards of professionalism in the workplace.\r\nThe California… [+2566 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"Adam Jude","title":"How a baseball bat helped former Husky Jake Browning improve his NFL draft stock","description":"One NFL talent evaluator said Browning’s arm strength was a “major concern” coming out of college. That same evaluator watched Browning cat the NFL combine. “I did a double take,” the scout said. “I thought, ‘This doesn’t look like the same kid.’ \"","url":"https://www.seattletimes.com/sports/uw-husky-football/how-a-baseball-bat-helped-former-husky-jake-browning-improve-his-nfl-draft-stock/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/04222019_jake-browning_095206-1200x630.jpg","publishedAt":"2019-04-23T13:00:23Z","content":"Jake Browning knew what he had to do. He knew he had to build strength in his right arm, and he knew he had much to prove to NFL scouts.\r\nThe question he had been pondering for a while was how?\r\nHow, coming off a Jan. 1 Rose Bowl appearance, with less than tw… [+7177 chars]"},{"source":{"id":null,"name":"Eurekalert.org"},"author":null,"title":"Majority of US states restrict decision-making for incapacitated pregnant women","description":"Half of all US states have laws on the books that invalidate a pregnant woman's advance directive if she becomes incapacitated, and a majority of states don't disclose these restrictions in advance directive forms, according to a study by physicians and bioet…","url":"https://www.eurekalert.org/pub_releases/2019-04/mc-mou042219.php","urlToImage":"https://www.eurekalert.org/images/EurekAlert_StackedLogo_RGB.jpg","publishedAt":"2019-04-23T04:00:00Z","content":"ROCHESTER, Minn. -- Half of all U.S. states have laws on the books that invalidate a pregnant woman's advance directive if she becomes incapacitated, and a majority of states don't disclose these restrictions in advance directive forms, according to a study b… [+3686 chars]"},{"source":{"id":null,"name":"Nasa.gov"},"author":"Dwayne Brown / Alana Johnson","title":"NASA's InSight Detects First Likely 'Quake' on Mars","description":"While their causes are still unknown, one of three shaking events looks a lot like the quakes detected on the Moon by the Apollo missions.","url":"https://www.jpl.nasa.gov/news/news.php?feature=7383","urlToImage":"https://www.jpl.nasa.gov/images/insight/20190423/PIA23177-16.jpg","publishedAt":"2019-04-23T19:04:00Z","content":"NASA's Mars InSight\r\nlander has measured and recorded for the first time ever a likely \"marsquake.\"\r\nThe faint seismic signal, detected by the lander's Seismic\r\nExperiment for Interior Structure (SEIS)\r\ninstrument, was recorded on April 6, the lander's\r\n128th… [+6212 chars]"},{"source":{"id":null,"name":"Dailycaller.com"},"author":"Lauryn Overhultz","title":"Man And His Friends Invite Elderly Woman To Eat Dinner With Them After Seeing Her Eat Alone","description":"A man in Alabama shared a heartwarming dinner with an elderly woman and his friends after noticing she was sitting alone.","url":"https://dailycaller.com/2019/04/23/man-elderly-woman-widow-dinner/","urlToImage":"https://cdn01.dailycaller.com/wp-content/uploads/2019/04/Dinner-e1556048603524.jpg","publishedAt":"2019-04-23T20:00:33Z","content":"A man in Alabama shared a heartwarming dinner with an elderly woman and his friends after noticing she was sitting alone.\r\nJamario Howard says the trio of friends were waiting on their food at Brad’s in Oxford when they noticed the elderly woman sitting by he… [+1102 chars]"},{"source":{"id":null,"name":"Patriots.com"},"author":null,"title":"News Blitz 4/23: Finding the next wide receiver - Patriots.com","description":"News Blitz 4/23: Finding the next wide receiver Patriots.com Why Kyler Murray Is a One-of-a-Kind Quarterback Prospect The Ringer 2019 NFL Mock Draft: Cardinals to draft Kyler Murray, Giants to select Josh Allen | Get Up! ESPN Signs still pointing to Kyler Mur…","url":"https://www.patriots.com/news/news-blitz-4-23-finding-the-next-wide-receiver","urlToImage":"https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/patriots/icvrejv7xset6azriop7","publishedAt":"2019-04-23T15:42:19Z","content":"The draft continues to creep closer and closer and most if not all of the local Patriots coverage deals with this weekends selection process. New England has 12 picks heading into the three-day extravaganza and opinions vary greatly as to which direction the … [+1715 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"https://facebook.com/610sports/","title":"Bink Chiefs Mock 8.0 - 610 Sports Radio","description":"Bink Chiefs Mock 8.0 610 Sports Radio Sources - Clark dealt to Chiefs, has $105.5M deal ESPN Why Did Seattle Trade Frank Clark & How Does this Impact the 2019 Draft? NFL Frank Clark Traded to Chiefs: Will the Pass Rusher Be Worth the Premium? Sports Illustrat…","url":"https://610sports.radio.com/blogs/jay-binkley/chiefs-mock-80","urlToImage":"https://radioimg.s3.amazonaws.com/610sports/USATSI_11728159_168382249_lowres_0.jpg?ISisrddlwH7GAShNdCZGJUPqHOOLUb5T","publishedAt":"2019-04-23T19:41:06Z","content":"Well things certainly changed for the 1019 draft with the trade for Frank Clark so it takes away the Chiefs 1st round pick.  They also give up a 2nd rounder next year and swap with the Seahawks in the third round.\r\nPositional breakdowns:\r\nA look at defensive … [+11421 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Renée Graham","title":"Waiting for the ‘homocracy’","description":"Bishop E.W. Jackson is expressing his idiotic belief that a gay man in the White House will be the end of democracy.","url":"https://www.bostonglobe.com/opinion/2019/04/23/waiting-for-homocracy/TArKUemP1gkyi6r8Nj1z4J/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/23/BostonGlobe.com/EditorialOpinion/Images/bdcde05f01ca4f83a52bbf9293be1dda-bdcde05f01ca4f83a52bbf9293be1dda-0.jpg","publishedAt":"2019-04-23T19:09:49Z","content":"Bishop E.W. Jackson, a conservative Virginia minister, believes if Pete Buttigieg is elected president, America would become “a homocracy.”\r\nOnce Buttigieg, the mayor of South Bend, Ind., officially announced his White House ambitions earlier this month, it w… [+4624 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Linda Matchan","title":"Amid anti-Semitism across America, this 94-year-old Holocaust survivor is keeping the faith","description":"Izzy Arbeiter made it out of Auschwitz against the odds. Amid a recent disturbing wave of bigotry against Jews in America, he’s still telling his story and refusing to despair.","url":"https://www.bostonglobe.com/magazine/2019/04/23/amid-anti-semitism-across-america-this-year-old-holocaust-survivor-keeping-faith/FBFZkPk4rbXGLN7oOBXfuI/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/03/11/BostonGlobe.com/Magazine/Images/museum0428arbeiter.jpg","publishedAt":"2019-04-23T19:09:49Z","content":"On May 18, 1949, a repurposed Army transport ship, the USAT General R.L. Howze, docked at Boston’s Commonwealth Pier carrying more than 900 people fleeing the shards of postwar Europe. A photographer from the Boston Evening Globe was there to capture a shot f… [+13594 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Two Prominent Alabama State Agencies Win Bronze in International Web Award Competition","description":"MONTGOMERY, Ala.--(BUSINESS WIRE)--Two Alabama websites hosted by Alabama Interactive have been recognized by the Horizon Interactive Award competition in the government category.","url":"https://www.businesswire.com/news/home/20190423005606/en/Prominent-Alabama-State-Agencies-Win-Bronze-International","urlToImage":"http://www.businesswire.com/images/bwlogo_square.png","publishedAt":"2019-04-23T13:39:52Z","content":"MONTGOMERY, Ala.--(BUSINESS WIRE)--Two Alabama websites hosted by Alabama Interactive have been recognized \r\n by the Horizon Interactive Award competition in the government category \r\n this year. The Alabama Law Enforcement Agencys (ALEA) official website, al… [+4808 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Warrior Met Coal Announces Special Cash Dividend","description":"BROOKWOOD, Ala.--(BUSINESS WIRE)--Warrior Met Coal, Inc. (NYSE:HCC) (“Warrior” or the “Company”) today announced that its board of directors has declared a special cash dividend (the “Special Dividend”) of approximately $4.41 per share of Warrior’s common sto…","url":"https://www.businesswire.com/news/home/20190423005616/en/Warrior-Met-Coal-Announces-Special-Cash-Dividend","urlToImage":"https://mms.businesswire.com/media/20190423005616/en/717533/23/Warrior_Logo.jpg","publishedAt":"2019-04-23T22:20:46Z","content":"BROOKWOOD, Ala.--(BUSINESS WIRE)--Warrior Met Coal, Inc. (NYSE:HCC) (Warrior or the Company) today \r\n announced that its board of directors has declared a special cash \r\n dividend (the Special Dividend) of approximately $4.41 per share of \r\n Warriors common s… [+1066 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Warrior Met Coal Announces Quarterly Cash Dividend","description":"BROOKWOOD, Ala.--(BUSINESS WIRE)--Warrior Met Coal, Inc. (NYSE:HCC) (“Warrior” or the “Company”) today announced that its board of directors has declared a regular quarterly cash dividend of $0.05 per share to be paid on May 10, 2019, to stockholders of recor…","url":"https://www.businesswire.com/news/home/20190423005611/en/Warrior-Met-Coal-Announces-Quarterly-Cash-Dividend","urlToImage":"https://mms.businesswire.com/media/20190423005611/en/717534/23/Warrior_Logo.jpg","publishedAt":"2019-04-23T20:25:08Z","content":"BROOKWOOD, Ala.--(BUSINESS WIRE)--Warrior Met Coal, Inc. (NYSE:HCC) (Warrior or the Company) today \r\n announced that its board of directors has declared a regular quarterly \r\n cash dividend of $0.05 per share to be paid on May 10, 2019, to \r\n stockholders of … [+848 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"United Insurance Holdings Corp. Schedules 2019 First Quarter Financial Results and Conference Call","description":"ST. PETERSBURG, Fla.--(BUSINESS WIRE)--United Insurance Holdings Corp. (Nasdaq: UIHC) (UPC Insurance or the Company), a property and casualty insurance holding company, announced today that it expects to release its financial results for the first quarter end…","url":"https://www.businesswire.com/news/home/20190423005774/en/United-Insurance-Holdings-Corp.-Schedules-2019-Quarter","urlToImage":"https://mms.businesswire.com/media/20190423005774/en/213368/21/UIHC_Logo.jpg","publishedAt":"2019-04-23T20:09:01Z","content":"ST. PETERSBURG, Fla.--(BUSINESS WIRE)--United Insurance Holdings Corp. (Nasdaq: UIHC) (UPC Insurance or \r\n the Company), a property and casualty insurance holding company, \r\n announced today that it expects to release its financial results for the \r\n first qu… [+1730 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Intero Continues Great Leadership in Los Gatos Office With Hiring of Respected Trailblazer Stephen Slater","description":"CUPERTINO, Calif.--(BUSINESS WIRE)--lt;a href=&quot;https://twitter.com/hashtag/brokerage?src=hash&quot; target=&quot;_blank&quot;gt;#brokeragelt;/agt;--Stephen Slater is named Vice President and Managing Officer of the Intero Los Gatos office.","url":"https://www.businesswire.com/news/home/20190423005398/en/Intero-Continues-Great-Leadership-Los-Gatos-Office","urlToImage":"https://mms.businesswire.com/media/20190423005398/en/717630/23/INTERO_LOGO_A_STANDARD_WEB.jpg","publishedAt":"2019-04-23T15:12:09Z","content":"CUPERTINO, Calif.--(BUSINESS WIRE)--Intero, a Berkshire Hathaway affiliate and wholly owned subsidiary of \r\n HomeServices of America, Inc., is proud to announce the hiring of \r\n Stephen Slater as the Vice President and Managing Officer of the Los \r\n Gatos off… [+2498 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Liberty Mutual Insurance Recognizes Utility’s Paragould, Arkansas manufacturing plant with its Gold Safety Award","description":"CITY OF INDUSTRY, Calif.--(BUSINESS WIRE)--lt;a href=&quot;https://twitter.com/hashtag/safety?src=hash&quot; target=&quot;_blank&quot;gt;#safetylt;/agt;--Liberty Mutual Insurance Recognizes Utility’s Paragould, Arkansas manufacturing plant with its Gold Safet…","url":"https://www.businesswire.com/news/home/20190423005229/en/Liberty-Mutual-Insurance-Recognizes-Utility%E2%80%99s-Paragould-Arkansas","urlToImage":"https://mms.businesswire.com/media/20190423005229/en/717537/23/UTM_Paragould_Safety_Award.jpg","publishedAt":"2019-04-23T13:07:18Z","content":"CITY OF INDUSTRY, Calif.--(BUSINESS WIRE)--Utility \r\n Trailer Manufacturing Company, the industrys largest \r\n manufacturer of refrigerated \r\n trailers and a leading manufacturer of dry \r\n freight vans, flatbeds, \r\n and Tautliner®curtainsided trailers is pleas… [+3315 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Trustmark Corporation Announces First Quarter 2019 Financial Results","description":"JACKSON, Miss.--(BUSINESS WIRE)--Trustmark Corporation Announces First Quarter 2019 Financial Results.","url":"https://www.businesswire.com/news/home/20190423005792/en/Trustmark-Corporation-Announces-Quarter-2019-Financial-Results","urlToImage":"https://mms.businesswire.com/media/20190423005792/en/3382/23/logo_for_businesswire_2003.jpg","publishedAt":"2019-04-23T20:39:27Z","content":"JACKSON, Miss.--(BUSINESS WIRE)--Trustmark Corporation (NASDAQ:TRMK) reported net income of $33.3 million \r\n in the first quarter of 2019, representing diluted earnings per share of \r\n $0.51. This level of earnings resulted in a return on average tangible \r\n … [+67580 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Synovus Announces Earnings for the First Quarter 2019","description":"COLUMBUS, Ga.--(BUSINESS WIRE)--Synovus Financial Corp. (NYSE: SNV) today reported financial results for the quarter ended March 31, 2019. First Quarter 2019 Highlights Diluted EPS of $0.72; adjusted diluted EPS of $0.98, up 7.6% sequentially and 15.1% year o…","url":"https://www.businesswire.com/news/home/20190423005272/en/Synovus-Announces-Earnings-Quarter-2019","urlToImage":"http://www.businesswire.com/images/bwlogo_square.png","publishedAt":"2019-04-23T10:38:51Z","content":"COLUMBUS, Ga.--(BUSINESS WIRE)--Synovus Financial Corp. (NYSE: SNV) today reported financial results for \r\n the quarter ended March 31, 2019.\r\nFirst Quarter 2019 Highlights\r\nDiluted EPS of $0.72; adjusted diluted EPS of $0.98, up 7.6% \r\n sequentially and 15.1… [+43652 chars]"},{"source":{"id":null,"name":"Hrw.org"},"author":"Human Rights Watch","title":"US: States Use Anti-Boycott Laws to Punish Responsible Businesses","description":"Expand Outside the office of New York State Governor Andrew Cuomo, demonstrators protest against a law that bars the state from investing in companies that support boycotts of Israel, New York City, June 9, 2016. © 2016 Mark Apollo/Pacific Press/LightRocket v…","url":"https://www.hrw.org/news/2019/04/23/us-states-use-anti-boycott-laws-punish-responsible-businesses","urlToImage":null,"publishedAt":"2019-04-23T04:00:01Z","content":null},{"source":{"id":null,"name":"Theroot.com"},"author":"Corey Townsend","title":"Dear Nigel Shelby and the Rest Of The LGBTQ+ Community, You Are Loved and There Is Nothing Wrong With You","description":"Nigel Shelby was a 15-year-old high school freshman in Alabama who, according to reports on Facebook, committed suicide because of homophobic bullying. Read more...","url":"https://www.theroot.com/dear-nigel-shelby-and-the-rest-of-the-lgbtq-community-1834244210","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--Bj-Rf1B5--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xsgttn6cc1unpjgzcfsy.png","publishedAt":"2019-04-23T18:00:00Z","content":"Nigel Shelby was a 15-year-old high school freshman in Alabama who, according to reports on Facebook, committed suicide because of homophobic bullying.\r\nMany members of the LGTBQ+ community have been Nigel Shelby. I have been him. Nigel took his life because … [+4461 chars]"},{"source":{"id":null,"name":"Popville.com"},"author":"Prince Of Petworth","title":"“May 8: Chipotle opens first Chipotle east of Anacostia River + swag giveaway!”","description":"Photo by PoPville flickr user Josh Bassett\r\n\r\nFrom an email:\r\n\r\n\"On Wednesday, May 8, Chipotle Mexican Grill, known for its real ingredients and fresh food, will open its first restaurant east of the Anacostia River. Plus, the first 50 customers will receive …","url":"https://www.popville.com/2019/04/may-8-chipotle-opens-first-chipotle-east-of-anacostia-river-swag-giveaway/","urlToImage":"https://s26552.pcdn.co/wp-content/uploads/2019/04/chipotle.jpg","publishedAt":"2019-04-23T13:45:44Z","content":"Photo by PoPville flickr user Josh Bassett\r\nFrom an email:\r\n“On Wednesday, May 8, Chipotle Mexican Grill, known for its real ingredients and fresh food, will open its first restaurant east of the Anacostia River. Plus, the first 50 customers will receive Chip… [+228 chars]"},{"source":{"id":null,"name":"Sbnation.com"},"author":"Dan Kadar","title":"The 200 best players in the 2019 NFL Draft","description":"Defense reigns supreme this year, but Oklahoma QB Kyler Murray could go first overall.","url":"https://www.sbnation.com/nfl/2019/4/23/18510580/nfl-draft-big-board-best-players-strength-weakness-2019","urlToImage":"https://cdn.vox-cdn.com/thumbor/bfZrkmLVGSGuZi_ayT23fDdVT2I=/0x186:2000x1233/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16181961/top_200.jpg","publishedAt":"2019-04-23T11:00:00Z","content":"Defense reigns supreme this year, but Oklahoma QB Kyler Murray could go first overall. If you like defense, the 2019 NFL Draft is for you. This class is overloaded with top players on defense, especially along the defensive line. It all starts with Ohio State… [+34330 chars]"},{"source":{"id":null,"name":"Truthout.org"},"author":"Merula Furtado","title":"States Are Trying to Stop Cities From Raising Minimum Wage","description":"GOP-controlled legislatures have been wresting control over wages and benefits from local governments. The post States Are Trying to Stop Cities From Raising Minimum Wage appeared first on Truthout.","url":"https://truthout.org/articles/states-are-trying-to-stop-cities-from-raising-minimum-wage/","urlToImage":"https://truthout.org/wp-content/uploads/2019/04/2019_0423-minimum-wage-b-1200x787.jpg","publishedAt":"2019-04-23T13:48:22Z","content":"Earlier this month, the New Orleans City Council took a big first step: It unanimously approved a resolution aimed at raising the city’s minimum wage. However, the resolution will be entirely symbolic unless Louisiana’s Republican state legislature gets out o… [+7814 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Ben Kercheval","title":"College football recruiting: Bryan Bresee, the No. 1 recruit for 2020, commits to Clemson","description":"Bresee committed to Clemson over Alabama, Ohio State and others","url":"https://www.cbssports.com/college-football/news/college-football-recruiting-bryan-bresee-the-no-1-recruit-for-2020-commits-to-clemson/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/23/5ac34365-1d09-4571-8299-67693e349ce8/thumbnail/770x433/b21deb52d0801da3cfdf0b40d4aa7834/8533509.jpg","publishedAt":"2019-04-23T18:58:51Z","content":"Defensive lineman Bryan Bresee, the No. 1 overall recruit in the Class of 2020, made his college announcement live Tuesday on CBS Sports HQ, and the decision was good news for the Clemson Tigers. With Bresee verbally committing to Dabo Swinney's team, Clemson… [+1436 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Jason La Canfora","title":"NFL Draft 2019: How many QBs will be taken in the first round? Setting over/unders for every position","description":"You should probably wait until Round 2 if you're picking in the top half of the draft and need a corner or receiver","url":"https://www.cbssports.com/nfl/news/nfl-draft-2019-how-many-qbs-will-be-taken-in-the-first-round-setting-overunders-for-every-position/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/26/87548f72-b338-490e-a79b-57b727daab24/thumbnail/770x433/f73f37c63c10a2e5ea42e322458311e8/kyler-murray-oklahoma.jpg","publishedAt":"2019-04-23T17:45:11Z","content":"Things are starting to come into focus. Well, at least somewhat. \r\nThe 2019 NFL Draft is, finally, just a few days away, and teams are deep into their pre-draft meetings, pouring over each position group as they set the boards for the final time. (Well, final… [+5908 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Ryan Wilson","title":"NFL Draft 2019: 22 players will attend the draft in Nashville on April 25, so let's break them down","description":"There will be three QBs at the draft this week, but one first-round lock won't be in Nashville","url":"https://www.cbssports.com/nfl/draft/news/nfl-draft-2019-22-players-will-attend-the-draft-in-nashville-on-april-25-so-lets-break-them-down/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/26/87548f72-b338-490e-a79b-57b727daab24/thumbnail/770x433/f73f37c63c10a2e5ea42e322458311e8/kyler-murray-oklahoma.jpg","publishedAt":"2019-04-23T14:15:09Z","content":"The first round of the 2019 NFL Draft is just days away, and \r\nWhen commissioner Roger Goodell takes the stage in Nashville to announce the first-overall pick of the 2019 NFL Draft in a matter of days, 22 players will be in attendance. There is one player -- … [+2701 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"2019 NFL Draft: NFL comparisons for Devin White, Devin Bush and other top linebackers","description":"Here's a Kwon Alexander-type sleeper, plus who has similarities to Eric Kendricks and more LB comparisons","url":"https://www.cbssports.com/nfl/draft/news/2019-nfl-draft-nfl-comparisons-for-devin-white-devin-bush-and-other-top-linebackers/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/01/02/caa95598-c441-4be2-a1cb-3b09aafdcf39/thumbnail/770x433/85d69f2a650a29c15934dee43afb1916/usatsi-11927266-devin-white-lsu-2019-fiesta-bowl-1400.jpg","publishedAt":"2019-04-23T16:15:07Z","content":"The 2019 linebacker class probably isn't going to rank among the best all-time, and it doesn't stack up to last year, when the eventual Defensive Rookie of the Year was taken in Round 2 and we had three first-round studs. \r\nEarly on Day 3 is when most of valu… [+7470 chars]"}]}