{"status":"ok","totalResults":188,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Eliza Relman","title":"Trump accused Ilhan Omar of trivializing 9/11, but has made his own controversial comments about the terror attacks","description":"President Donald Trump attacked Democratic Rep. Ilhan Omar for a controversial comment she made about the 9/11 terror attacks, but Trump has his own history of making controversial remarks about 9/11. On the day of the terror attacks in 2001, Trump mentioned …","url":"https://www.businessinsider.com/trump-ilhan-omar-jabs-made-controversial-comments-about-911-despite-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb1e8aa95cb1559af2d4b34-1136-568.png","publishedAt":"2019-04-13T15:25:40Z","content":"President Donald Trump attacked Democratic Rep. Ilhan Omar for a controversial comment she made appearing to trivialize the 9/11 terror attacks, but Trump has his own history of making what many believed were insensitive remarks about 9/11. \r\n On the day of t… [+2614 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joe Perticone","title":"Progressives like Alexandria Ocasio-Cortez may be the 'rock stars' of the Democratic House majority — but another group of freshman Democrats is reshaping Congress","description":"The freshman class of Democratic members of Congress is the largest since the post-Watergate scandal group in 1974. Despite progressives like Alexandria Ocasio-Cortez grabbing big headlines, most of the freshman Democrats are actually moderates, belonging to …","url":"https://www.businessinsider.com/democrat-house-freshmen-centrist-moderate-alexandria-ocasio-cortez-ilhan-omar-2019-4","urlToImage":"https://amp.businessinsider.com/images/5caf53e153c7111beb349776-2732-1366.jpg","publishedAt":"2019-04-13T13:43:00Z","content":"LEESBURG, Virginia — The massive group of freshman Democratic members of Congress elected in the 2018 midterms is the largest since the aftermath of the Watergate scandal in 1974. Since they have taken office, there has been a concerted effort from Republican… [+7327 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Erin Brodwin","title":"A mysterious condition makes marijuana users violently ill, and it reveals a hidden downside to the drug's growing popularity","description":"Frequent marijuana use appears to be causing a mysterious syndrome characterized by severe nausea and repeated vomiting. Little is known about the condition, which is called cannabinoid hyperemesis syndrome, or CHS. Business Insider interviewed half a dozen p…","url":"https://www.businessinsider.com/marijuana-syndrome-vomiting-nausea-symptoms-do-i-have-chs-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cacd577c6cc5057071b4385-1136-568.jpg","publishedAt":"2019-04-13T14:05:00Z","content":"Alice Moon once reviewed marijuana edibles for a living. So when a doctor told the 29-year-old Californian that she had to stop using cannabis because of a newly discovered syndrome, it threatened to turn her world upside down. \r\n Before giving up the drug, s… [+18395 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Daniel Manzo","title":"Major severe storms, tornado outbreak expected in Deep South","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews.  Find the top news online at ABC news.","url":"https://abcnews.go.com/US/major-severe-storms-tornado-outbreak-expected-deep-south/story?id=62375543","urlToImage":"https://s.abcnews.com/images/US/wind-damage-ohio-wews-mo-20190413_hpMain_16x9_992.jpg","publishedAt":"2019-04-13T10:11:46Z","content":"A very dangerous weekend lies ahead for much of the South -- with especially severe storms expected in Louisiana, Arkansas and Mississippi on Saturday.\r\nThe new storm organized Saturday morning and was moving across Texas. In addition to a widespread severe w… [+2756 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Doug Stanglin, USA TODAY","title":"Severe storms, including likely twisters, forecast from East Texas to Alabama","description":"Severe thunderstorms, including  strong tornadoes, damaging winds and very large hail, are likely from East Texas  to western Alabama Saturday.","url":"https://www.usatoday.com/story/news/nation/2019/04/13/severe-storms-including-likely-twisters-feared-texas-alabama/3456113002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/13/USAT/28564bbd-79b7-4ba0-8c47-b4924c92df3c-EPA_USA_GOLF_THE_MASTERS_2019.JPG?crop=5183,2902,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-13T11:52:17Z","content":"Patrons head for the exits as a weather warning sounds during the second round of the 2019 Masters Tournament at the Augusta National Golf Club in Augusta, Ga. April 12. Forecasters warn another round of storms could hit the tournament Sunday during its final… [+1953 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Editors, USA TODAY","title":"'Game of Thrones' returns, Pete Buttigieg surging, NBA playoffs: 5 things you need to know this weekend","description":"5 things you need to know this weekend","url":"https://www.usatoday.com/story/news/2019/04/13/game-of-thrones-buttigieg-pence/3445848002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/11/USAT/f8462bb2-4aeb-4029-929e-37ce6b3ff9e4-c84f1ab96e310c9720530e59112c320fb1221023ce5b46a06f8f87d2def179fd.jpg?crop=3132,1785,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-13T07:26:54Z","content":"Kit Harington as Jon Snow on \"Game of Thrones.\"\r\n (Photo: Helen Sloan/HBO)\r\nDangerous weather may slam  southern states\r\nPeople in the South are in for stormy and potentially dangerous weather this weekend, especially on Saturday afternoon and evening. \"There… [+4182 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"hcaygle@politico.com (Heather Caygle)","title":"Biden’s bulldogs give him an edge in 2020","description":"The likely White House contender has a cadre of senior Democrats ready to defend him against attacks.","url":"https://www.politico.com/story/2019/04/13/biden-bulldogs-1272931","urlToImage":"https://static.politico.com/a6/ab/b0f6d5a1454cbfe08076f863dc53/190412-joe-biden-ap-773.jpg","publishedAt":"2019-04-13T11:14:06Z","content":"Former Vice President Joe Biden has a stable of as many as a dozen senators and still more in the House that are prepared to vouch for him when he inevitably comes under siege. | Andrew Harnik/AP Photo\r\nWhen Joe Biden was embroiled in controversy over his tac… [+7641 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Adam Wells","title":"Alabama HC Nick Saban to Undergo Exam on Hip Injury; May Miss 6-8 Weeks","description":"Now that Alabama's spring game is in the books, head coach  Nick Saban  is going to get his ailing hip fixed.    Per AL...","url":"https://bleacherreport.com/articles/2831212-alabama-hc-nick-saban-to-undergo-exam-on-hip-injury-may-miss-6-8-weeks","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/802/695/hi-res-0568f9a0b903424d5d4aa465e53a0282_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-13T22:22:52Z","content":"Christian Petersen/Getty Images\r\nNow that Alabama's spring game is in the books, head coach Nick Saban is going to get his ailing hip fixed.\r\nPer AL.com's Michael Casagrande, Saban announced he would undergo an evaluation of his hip and could end up needing s… [+1069 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Kristopher Knox","title":"2019 NFL Mock Draft: Predictions for Mid First-Round Prospects","description":"With the 2019  NFL  draft commencing on April 25, the identity of the first overall pick still remains a bit of a mystery...","url":"https://bleacherreport.com/articles/2831090-2019-nfl-mock-draft-predictions-for-mid-first-round-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/802/516/hi-res-9e5b4da03294dce4f1e3ab821b8bee5f_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-13T13:06:35Z","content":"Iowa TE Noah FantCharlie Neibergall/Associated Press\r\nWith the 2019 NFL draft commencing on April 25, the identity of the first overall pick still remains a bit of a mystery.\r\nThe Arizona Cardinals don't need to take a quarterback because they selected Josh R… [+5756 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"EMILY S. RUEB","title":"Cursive Seemed to Go the Way of Quills and Parchment. Now It’s Coming Back.","description":"Nearly two dozen states have reintroduced cursive instruction since 2010, when the Common Core standards dropped a requirement that it be taught in elementary schools.","url":"https://www.nytimes.com/2019/04/13/education/cursive-writing.html","urlToImage":"https://static01.nyt.com/images/2019/04/14/education/14xp-cursive-print1/10xp-cursive-facebookJumbo.jpg","publishedAt":"2019-04-13T13:48:39Z","content":"Part of being an American is being able to read cursive writing, Ms. Roach told King 5 News.\r\nLawmakers have also invoked the Declaration of Independence, which was marked by John Hancocks flamboyant signature, as a reason for a script revival.\r\nAndrew Brenne… [+1542 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Shivani Naik, Shahid Judge","title":"Talent pool","description":"As the World Championship beckons in July at Korea, India unexpectedly is looking to three teen swimmers to make a splash in the 1500m. While the youngest, Aryan Nehra, has already made the 'B' qualification cut, Aryan Makhija and Advait Page are promising to…","url":"https://indianexpress.com/article/sports/sport-others/talent-pool-swimming-world-championships-south-korea-5674463/","urlToImage":"https://images.indianexpress.com/2019/04/aryan-makhija-759.jpg?w=759","publishedAt":"2019-04-13T20:36:42Z","content":"Standing at six-feet, with an even longer wingspan, 6-foot-2, Aryan Makhija has known the sport ever since he was four.\r\nIt takes 30 laps of an Olympic-size swimming pool (50 m) to complete a 1500m freestyle race. Its a race that demands a carefully-measured … [+13790 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"BINYAMIN APPELBAUM","title":"Editorial Observer: Everyone’s Income Taxes Should Be Public","description":"Disclosure of tax payments would make it easier to hold politicians accountable. It also would help to reduce fraud and economic inequality.","url":"https://www.nytimes.com/2019/04/13/opinion/sunday/taxes-public.html","urlToImage":"https://static01.nyt.com/images/2019/04/13/opinion/13publictaxes/13publictaxes-facebookJumbo.jpg","publishedAt":"2019-04-13T18:30:03Z","content":"Another benefit would be identifying patterns of illegal discrimination against women or minorities. Lilly Ledbetter, for whom the 2009 fair pay law is named, would have learned a lot sooner that she was making less than her male colleagues at a Goodyear plan… [+2031 chars]"},{"source":{"id":null,"name":"Whnt.com"},"author":"http://www.facebook.com/whntnews19","title":"Severe storms expected late Saturday night and Sunday morning - WHNT News 19","description":"A strong storm system moving in from the southwest will bring a risk of severe storms to the Tennessee Valley Saturday night through early Sunday Morning.\r\n\nThe Storm Prediction Center outlines a region of severe weather potential for both Saturday and Sunday…","url":"https://whnt.com/2019/04/13/severe-storms-more-likely-saturday-night-sunday-morning/","urlToImage":"https://localtvwhnt.files.wordpress.com/2019/04/headline.jpg?quality=85&strip=all&w=1200","publishedAt":"2019-04-13T09:30:00Z","content":"A strong storm system moving in from the southwest will bring a risk of severe storms to the Tennessee Valley Saturday night through early Sunday Morning.\r\nThe Storm Prediction Center outlines a region of severe weather potential for both Saturday and Sunday … [+2233 chars]"},{"source":{"id":null,"name":"Al.com"},"author":"Leigh Morgan","title":"Tornadoes possible with storms expected late tonight and Sunday, weather service says - AL.com","description":"Tornadoes possible with storms expected late tonight and Sunday, weather service says AL.com Southern US to be in the crosshairs of a dangerous severe weather, tornado outbreak AccuWeather.com Severe storms expected late Saturday night and Sunday morning WHNT…","url":"https://www.al.com/news/2019/04/tornadoes-possible-with-storms-expected-late-tonight-and-sunday-weather-service-says.html","urlToImage":"https://www.al.com/resizer/rDn3NqY8CZX9DwWp2iPhI829Ds0=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/D2KG3TLIOFBNZHOZ6UM74EUOXM.png","publishedAt":"2019-04-13T13:11:00Z","content":"All of Alabama will run the risk of seeing severe weather this weekend, starting late tonight and lasting into Sunday.\r\nAnd just about everything is on the table this time, including tornadoes, large hail, damaging winds and heavy rain, according to the Natio… [+3586 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Severe weather moving into Georgia on Sunday - 11Alive","description":"Severe weather moving into Georgia on Sunday 11Alive First Alert: Damaging winds, hail headline severe weather Sunday WBTV First Alert Forecast: The Midlands could see strong to severe storms Sunday afternoon WIS10 Alabama tornadoes: National Weather Service …","url":"https://www.youtube.com/watch?v=-Chj2_aQihg","urlToImage":null,"publishedAt":"2019-04-13T23:33:19Z","content":"[[getSimpleString(data.title)]]\r\n[[getSimpleString(data.description)]]\r\n[[getSimpleString(data.videoCountText)]]"},{"source":{"id":null,"name":"Ktre.com"},"author":"KLTV Digital Media Staff","title":"Tornado warnings expire for parts of East Texas - KTRE","description":"Tornado warnings expire for parts of East Texas KTRE Debunking A Dangerous Myth About Tornado Sirens - They Shouldn't Warn You Inside Forbes Severe weather comes to metro Atlanta and North Georgia 11Alive Tornado Watches issued for much of North Alabama WAAY …","url":"http://www.ktre.com/2019/04/13/severe-thunderstorm-watch-issued-parts-east-texas/","urlToImage":"http://www.ktre.com/resizer/YSN-FRfwyOKGEDXoxhnXxv4UIvA=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/TAQWHQVXCNBOJC7FBONOFKZ5OM.jpg","publishedAt":"2019-04-13T15:09:00Z","content":"EAST TEXAS (KLTV) - All watches and warning for East Texas have expired as of 6:30 p.m.\r\nMeteorologist Cody Gottschalk is tracking the storms on the road in the Storm Tracker. Watch him live here. \r\nThe Crockett Fire Department reported the dome at the Crocke… [+4480 chars]"},{"source":{"id":null,"name":"Wvtm13.com"},"author":"Jerry Tracey","title":"Severe storms move in early Palm Sunday morning - WVTM13","description":"Severe storms move in early Palm Sunday morning WVTM13 Tornadoes, severe storms target South on Saturday USA TODAY Severe storms could strike Houston area Saturday morning Chron What to do if you're in a mobile home during a severe thunderstorm or tornado WSB…","url":"https://www.wvtm13.com/article/severe-storms-moves-in-early-palm-sunday-morning/27133129","urlToImage":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/severe-day-1555129081.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*","publishedAt":"2019-04-13T04:20:00Z","content":"BIRMINGHAM, Ala. —A cloudy start to our Saturday, but most of us will not get rain during the day. And it will have a bit of a warm, humid feel to it. \r\nThunderstorms move into central Alabama early Palm Sunday morning. Damaging winds and a tornado are possib… [+218 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Associated Press","title":"The Latest: Possible Mississippi twister, no injuries - Fox News","description":"The Latest on a powerful storm system moving through the southern United States (all times local): 6 p.m. Authorities in East Texas say two children were killed after a tree fell on a car as it was being driven during a strong storm.","url":"https://www.foxnews.com/us/the-latest-possible-mississippi-twister-no-injuries","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-4f362e46d5264d5dbefd5c31959a88dd.png","publishedAt":"2019-04-13T23:17:35Z","content":"DALLAS The Latest on a powerful storm system moving through the southern United States (all times local):\r\n6:15 p.m.\r\nAuthorities say a possible tornado has touched down in western Mississippi, causing damage to several businesses and vehicles.\r\nJohn Moore, a… [+3260 chars]"},{"source":{"id":null,"name":"Firsthandweather.com"},"author":"Matthew Holliday","title":"Two-Day Severe Weather Event Including A Tornado Risk - Firsthand Weather","description":"Two-Day Severe Weather Event Including A Tornado Risk Firsthand Weather Deadly storms strike the South, reports of tornadoes Axios Tornado Watch issued for several counties in Alabama WVTM13 Strong thunderstorms bear down on New Orleans area; tornado watch is…","url":"http://firsthandweather.com/4207/tornado/","urlToImage":"http://firsthandweather.com/wp-content/uploads/2019/04/radar.png","publishedAt":"2019-04-13T01:07:03Z","content":"Saturday-Early Sunday Morning: A strong shortwave system currently\r\nlocated over the Four Corners region has contributed to the development of a\r\nsurface low pressure system over Mexico. As the shortwave advances eastward,\r\nthe surface low will move northeast… [+4111 chars]"},{"source":{"id":null,"name":"Wsfa.com"},"author":"Lee Southwick","title":"FIRST ALERT WEATHER DAY: Severe storms possible late tonight and tomorrow morning - WSFA","description":"FIRST ALERT WEATHER DAY: Severe storms possible late tonight and tomorrow morning WSFA Southern US in the crosshairs of a dangerous severe weather, tornado outbreak AccuWeather.com Southern states brace for severe weather; tornado warnings issued Fox News Ver…","url":"http://www.wsfa.com/2019/04/13/first-alert-strong-severe-storms-possible-late-tonight-tomorrow/","urlToImage":"http://www.wsfa.com/resizer/UvzuWUlvoxwKKX2fn9kMS9nAcYc=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/DD4AFTL7TNB7PDNQ7HTAVXH33I.png","publishedAt":"2019-04-13T15:53:00Z","content":"MONTGOMERY, AL (WSFA) - Strong storms are rolling across parts of Texas, Louisiana, Arkansas and Mississippi today, bringing multiple Severe Thunderstorm and Tornado Warnings. These storms will work their way east throughout the rest of the day and could arri… [+918 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Associated Press","title":"Southern storm system drenches Dallas, threatens twisters - Fox News","description":"Southern storm system drenches Dallas, threatens twisters Fox News Tornado rips through Texas, storm heads toward News 5 area WKRG News 5 Town Of Franklin, Texas, Like War Zone After Tornado (UPDATED) Downtown Austin, TX Patch Tornado Slams Central Texas Town…","url":"https://www.foxnews.com/us/southern-storm-system-drenches-dallas-threatens-twisters","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-4f362e46d5264d5dbefd5c31959a88dd.png","publishedAt":"2019-04-13T19:17:22Z","content":"DALLAS A large storm system that dumped snow on Colorado and is threatening to make it a soggy weekend for many states to the south and east has drenched parts of Texas and spawned a possible tornado that didn't hurt anyone.\r\nThe National Weather Service says… [+611 chars]"},{"source":{"id":null,"name":"Watchdog.org"},"author":"Watchdog News","title":"By the numbers: Ohio State University business school ranked nation's 31st best - Watchdog.org","description":"By the numbers: Ohio State University business school ranked nation's 31st best Watchdog.org Ohio State University's Fisher Business School ranked 31st among U.S. colleges offering master of business administration programs, according to a new study...","url":"https://www.watchdog.org/ohio/by-the-numbers-ohio-state-university-business-school-ranked-nation/article_29ce9834-5c7b-11e9-97ed-6f6849e23b6b.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/watchdog.org/content/tncms/custom/image/122b36e0-2885-11e8-b10b-738058be3b80.png","publishedAt":"2019-04-13T12:59:00Z","content":"Ohio State University's Fisher Business School ranked 31st among U.S. colleges offering master of business administration programs, according to a new study by U.S. News that examined 367 schools.\r\nThe Columbus school has an annual in-state tuition rate for f… [+9939 chars]"},{"source":{"id":null,"name":"Watchdog.org"},"author":"Watchdog News","title":"By the numbers: University of Pennsylvania business school ranked nation’s best - Watchdog.org","description":"By the numbers: University of Pennsylvania business school ranked nation’s best Watchdog.org University of Pennsylvania's Wharton Business School ranked first among U.S. colleges offering master of business administration programs, according to a new...","url":"https://www.watchdog.org/pennsylvania/by-the-numbers-university-of-pennsylvania-business-school-ranked-nation/article_3cbf11bc-5c7b-11e9-96dc-334694fc3e61.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/watchdog.org/content/tncms/assets/v3/editorial/c/0c/c0c8f23e-5c80-11e9-ac14-83dafef766eb/5caf7c1d89710.image.jpg?resize=925%2C630","publishedAt":"2019-04-13T16:59:00Z","content":"University of Pennsylvania's Wharton Business School ranked first among U.S. colleges offering master of business administration programs, according to a new study by U.S. News that examined 367 schools.\r\nThe Philadelphia school has an annual in-state tuition… [+9952 chars]"},{"source":{"id":null,"name":"Al.com"},"author":"Joseph Goodman | jgoodman@al.com","title":"Turtles rule the Masters unlike any other green jacket - AL.com","description":"Turtles rule the Masters unlike any other green jacket AL.com 2019 Masters leaderboard breakdown: Coverage, scores, highlights from Round 2 with Tiger Woods rolling CBS Sports Masters 2019: Jordan Spieth might not be ‘back,’ but don’t count him out of this Ma…","url":"https://www.al.com/sports/2019/04/turtles-rule-the-masters-unlike-any-other-green-jacket.html","urlToImage":"https://www.al.com/resizer/Y3QFUVzIHFRioQAY4kbcuUkT50U=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/WNXOXBUMMZE3ZFA4PN62Y5E7VQ.jpg","publishedAt":"2019-04-13T11:15:00Z","content":"Imagine walking out on a green at Augusta National to get a better view of a golfer attempting a birdie putt at the Masters.\r\nIt happened on Friday on the courses famous 16th hole.\r\nWhen Kevin Kisner was lining up his birdie putt on the beautiful par-3 over w… [+5496 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.dailymail.co.uk/debate/columnists/columnist-1003632/Tom-Parker-Bowles-Event-for-The-Mail-on-Sunday.html","title":"Pub grub to dazzle and delight... and not a Pringle in sight!","description":"The Royal Oak at Whatcote is a cut above the norm. Every element is precisely crafted, yet the cooking is never prissy. Flavours whisper, sing and holler. Balance is all","url":"https://www.dailymail.co.uk/home/event/article-6911139/Pub-grub-dazzle-delight-not-Pringle-sight.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/13/13/12227500-0-image-a-12_1555157367454.jpg","publishedAt":"2019-04-13T21:01:37Z","content":"The Royal Oak\r\n2 Upper Farm Barn, Whatcote, Warwickshire\r\nRating: \r\nApacket of Scampi Fries and a pint. That, for me, is true pub food, a blessed union of salt, fat, booze and MSG. God, I love MSG, an ingredient more sinned against than sinning. But thats a w… [+3890 chars]"},{"source":{"id":null,"name":"Ajc.com"},"author":"Ken Sugiura","title":"Bill Curry, Mike Riley know Georgia Tech’s grief too well - Atlanta Journal Constitution","description":"Bill Curry, Mike Riley know Georgia Tech’s grief too well Atlanta Journal Constitution At some point, if he hasn't already, Georgia Tech coach Geoff Collins will encounter a player who has difficulty keeping his concentration, doesn't practice with...","url":"https://www.ajc.com/sports/college/bill-curry-mike-riley-know-georgia-tech-grief-too-well/OUWWnG5aQBc6THHaNSVAaN/","urlToImage":"https://www.ajc.com/rf/image_large/Pub/p10/AJC/2019/04/13/Images/Brandon%20Adams%20032619%20tech%20adams_AP12(1)_edited.jpg","publishedAt":"2019-04-13T00:00:01Z","content":"At some point, if he hasn’t already, Georgia Tech coach Geoff Collins will encounter a player who has difficulty keeping his concentration, doesn’t practice with great effort or wants to give up football. They are common occurrences for any college football t… [+6372 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Nick Saban working with young Alabama team, not much depth","description":"Nick Saban working with young Alabama team, not much depth","url":"https://www.foxsports.com/college-football/story/nick-saban-working-with-young-alabama-team-not-much-depth-041319","urlToImage":"https://b.fssta.com/uploads/2019/04/e7e31c1d73fb4d348dc76611a9ac24b0.vresize.1200.630.high.13.jpg","publishedAt":"2019-04-13T07:02:25Z","content":"Alabama’s Nick Saban isn’t likely to get much sympathy from his coaching peers regarding his offseason challenges.\r\nBut even the Crimson Tide faces some, especially on a defense that was uncharacteristically vulnerable late last season. Such challenges are in… [+3334 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1963 GMC 2500 Dually at No Reserve","description":"This 1963 GMC 2500 is a flatbed dually pickup powered by a 305cc V6 paired with a 4-speed manual transmission and finished in green paint. The truck was reportedly bought new by a sign company in southern Tennessee and was later acquired by the second owner, …","url":"https://bringatrailer.com/listing/1963-gmc-2500-dually/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/1963_gmc_2500_dually_1554129793cd2084920190330_120916-e1555099652287.jpg","publishedAt":"2019-04-13T01:45:16Z","content":"This 1963 GMC 2500 is a flatbed dually pickup powered by a 305cc V6 paired with a 4-speed manual transmission and finished in green paint. The truck was reportedly bought new by a sign company in southern Tennessee and was later acquired by the second owner, … [+1412 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Jeff Berardelli","title":"Very serious threat of strong, long-lasting tornadoes in southern U.S.","description":"The worst of the storms will be found Saturday afternoon over east Texas moving into Louisiana, Arkansas and Mississippi","url":"https://www.cbsnews.com/news/threat-strong-long-lasting-tornadoes-southern-united-states-today-2019-04-13/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/13/5db8cd02-18b7-47ee-9e98-5206b4a8bf30/thumbnail/1200x630/6e3141860ec1b0b1c0aa11eea8d96195/map2.png","publishedAt":"2019-04-13T17:57:52Z","content":"The National Weather Service's Storm Prediction Center has issued a moderate threat for severe weather Saturday. Moderate does not nearly convey the actual threat. On a scale of one to five, it's a four. This is the kind of day we see in the U.S. only a handf… [+3977 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Severe storms, including likely twisters, forecast from East Texas to Alabama","description":"Severe thunderstorms, including strong tornadoes, damaging winds and very large hail, are likely from East Texas  to western Alabama Saturday.","url":"https://news.yahoo.com/severe-storms-including-likely-twisters-115217858.html","urlToImage":"https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png","publishedAt":"2019-04-13T11:52:17Z","content":"A weekend storm system is forecast to bring severe thunderstorms, including strong tornadoes, damaging winds and very large hail, from East Texas to western Alabama on Saturday.\r\nThe storm could also slam into Georgia on Sunday during the final hours of the M… [+1837 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Where and how to mail your federal tax return","description":"There’s no one IRS address. The one you use depends on where you’re filing from. Here’s where to send yours.","url":"https://news.yahoo.com/where-mail-federal-tax-return-110207882.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/qEbRa1bxnoXV568OZ8sOsw--~B/aD01NDA7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/1009217/421aabf5-10b3-4bce-9ec9-5531eba8a00e/6c5a0179-c17c-5912-a82e-ce1a60d7513f/data_3_0.jpg?s=76d993f36b6c3d36ee3b844698f5a8ee&c=2d764c83e7d51a9f3649aa02f2d9a4f1&a=tripleplay4us&mr=0","publishedAt":"2019-04-13T11:02:07Z","content":"Its getting down to the wire to mail in your tax returns on time.\r\nYour return must be postmarked by April 15, have the correct postage, and be addressed correctly to be considered on time by the IRS, according to the U.S. Postal System.\r\nMake sure to weight … [+2253 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"What we learned from Saturday's spring football games","description":"Alabama, Notre Dame, Oklahoma and Ohio State all played spring games on Friday or Saturday. Here's what we saw from them, and from other key games.","url":"http://www.espn.com/college-football/story/_/id/26514543/what-learned-saturday-spring-football-games","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0413%2Fr528876_1296x729_16%2D9.jpg","publishedAt":"2019-04-13T18:31:35Z","content":"College football spring practice is wrapping up across the country and there was a huge slate of spring games on Friday and Saturday including at Alabama, Notre Dame, Oklahoma and Ohio State. Here are some early overreactions and takeaways from Friday and Sat… [+10694 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Saban could face lengthy recovery with hip issue","description":"Alabama coach Nick Saban said he's been dealing with a hip issue that will need to be evaluated.","url":"http://www.espn.com/college-football/story/_/id/26515995/saban-face-lengthy-recovery-hip-issue","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0318%2Fr516154_1296x729_16%2D9.jpg","publishedAt":"2019-04-13T21:36:55Z","content":"TUSCALOOSA, Ala. -- Alabama coach Nick Saban told reporters on Saturday that he has been dealing with a hip issue that will need to be evaluated by doctors and could require as much as 6-8 weeks of recovery.\r\n\"It's been a little bothersome,\" Saban said follow… [+1950 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"QB Hurts debuts for Oklahoma in spring game","description":"Quarterback Jalen Hurts seemed to be collected and in command during Oklahoma's spring game Friday night, finishing 11-of-14 passing for 174 yards and a touchdown, with some electric runs as well.","url":"http://www.espn.com/college-football/story/_/id/26510218/qb-hurts-debuts-oklahoma-spring-game","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0413%2Fr528513_1296x729_16%2D9.jpg","publishedAt":"2019-04-13T04:06:52Z","content":"NORMAN, Okla. -- In his public debut as a Sooner, quarterback Jalen Hurts seemed to be collected and in command during Oklahoma's spring game Friday night.\r\nThe Alabama transfer seemed to be having a little more fun, too.\r\nImmediately after a 1-yard touchdown… [+2424 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"No decision on Ohio State QB after spring game","description":"The competition for Ohio State's starting quarterback job has kicked off in earnest after the Buckeyes spring game on Saturday.","url":"http://www.espn.com/college-football/story/_/id/26515591/no-decision-ohio-state-qb-spring-game","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0413%2Fr528777_1296x729_16%2D9.jpg","publishedAt":"2019-04-13T20:11:38Z","content":"COLUMBUS, Ohio -- Ohio State head coach Ryan Day isn't ready to name a starting quarterback after spending his first spring with a pair of young contenders for the job.\r\nSophomore transfer Justin Fields and redshirt freshman Matthew Baldwin split time with th… [+2714 chars]"},{"source":{"id":null,"name":"Clutchpoints.com"},"author":"ClutchPoints","title":"Redskins news: Bruce Allen says it's up to Reuben Foster to change","description":"Washington Redskins linebacker Reuben Foster avoided a suspension from the NFL after domestic violence charges against him were thrown out, but Redskins president Bruce Allen is making it very clear with Foster that any activity that is not up to the team’s s…","url":"https://clutchpoints.com/redskins-news-bruce-allen-says-its-up-to-reuben-foster-to-change/","urlToImage":"https://clutchpoints.com/wp-content/uploads/2019/04/AllenFoster-1000x600.jpg","publishedAt":"2019-04-13T05:00:00Z","content":"Washington Redskins linebacker Reuben Foster avoided a suspension from the NFL after domestic violence charges against him were thrown out, but Redskins president Bruce Allen is making it very clear with Foster that any activity that is not up to the team’s s… [+1331 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"The Latest: Twister hits Texas community; about a dozen hurt","description":"DALLAS (AP) — The Latest on a powerful storm system moving through the southern United States (all times local):","url":"https://news.yahoo.com/latest-twister-hits-texas-community-dozen-hurt-201112355.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/T3wIovcYxE5xHv2bvxO4vg--~B/aD0yMjkyO3c9Mzc4ODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/4f362e46d5264d5dbefd5c31959a88dd.jpg","publishedAt":"2019-04-13T20:11:12Z","content":"DALLAS (AP) The Latest on a powerful storm system moving through the southern United States (all times local):\r\n3:10 p.m.\r\nAuthorities say about a dozen people in Texas have been injured in powerful storms that have spawned at least one suspected tornado and … [+1830 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"JOHN ZENOR","title":"Nick Saban working with young Alabama team, not much depth","description":"Alabama’s Nick Saban isn’t likely to get much sympathy from his coaching peers regarding his offseason challenges. But even the Crimson Tide faces some, especially on a defense that was uncharacteristically vulnerable late last season. Such challenges are ine…","url":"https://www.seattletimes.com/sports/nick-saban-working-with-young-alabama-team-not-much-depth/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/urn-publicid-ap-org-ad28784272004570ac0f87493330aa04Alabama_Reloads_Football_94599-1200x630.jpg","publishedAt":"2019-04-13T07:02:25Z","content":"Alabama’s Nick Saban isn’t likely to get much sympathy from his coaching peers regarding his offseason challenges.\r\nBut even the Crimson Tide faces some, especially on a defense that was uncharacteristically vulnerable late last season. Such challenges are in… [+3424 chars]"},{"source":{"id":null,"name":"Mmafighting.com"},"author":"Alexander K. Lee","title":"UFC 236 predictions","description":"Will Max Holloway avenge his loss to Dustin Poirier? Can Kelvin Gastelum stop the ascent of Israel Adesanya?","url":"https://www.mmafighting.com/2019/4/13/18306538/ufc-236-predictions","urlToImage":"https://cdn.vox-cdn.com/thumbor/dxtBvFPWzOexasvBObVyNwen-WY=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16023997/012_Dustin_Poirier.jpg","publishedAt":"2019-04-13T12:00:00Z","content":"There will be two new champions crowned at UFC 236 and even though they’re of the interim variety, there’s hope that Saturday’s victors will bring some stability to their respective divisions. For Max Holloway, he enters his main event rematch with Dustin Poi… [+9450 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Kathleen Joyce","title":"Southern states brace for severe weather; tornado warnings issued - Fox News","description":"Southern states brace for severe weather; tornado warnings issued Fox News Southern US in the crosshairs of a dangerous severe weather, tornado outbreak AccuWeather.com NWS: Tornadoes, damaging winds, large hail possible as severe storms near Houston Chron.co…","url":"https://www.foxnews.com/us/southern-states-severe-weather-tornado-warnings","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/694940094001_6025932046001_6025937270001-vs.jpg","publishedAt":"2019-04-13T18:41:59Z","content":"As several Midwestern states are digging out from a spring snowstorm, the South is bracing for weekend thunderstorms that could bring tornadoes.\r\nThe National Weather Service said strong winds and hail were expected in the South. Tornadoes are also possible S… [+1742 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Emily S. Rueb","title":"Cursive writing looping back into style","description":"While cursive has been relegated to nearly extinct tasks such as writing thank-you cards and signing checks, rumors of its death may be exaggerated.","url":"https://www.bostonglobe.com/news/nation/2019/04/13/cursive-writing-looping-back-into-style/rxfQjEfLxjY0IvsuNqfLlI/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/13/BostonGlobe.com/National/Images/CURSIVE%20COMEBACK.jpg","publishedAt":"2019-04-13T21:39:30Z","content":"While cursive has been relegated to nearly extinct tasks such as writing thank-you cards and signing checks, rumors of its death may be exaggerated.\r\nThe Common Core standards seemed to spell the end of the writing style in 2010 when they dropped requirements… [+4928 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Katharine Q. Seelye","title":"Kitty Tucker, 75, who raised awareness of the Silkwood case","description":"The public interest lawyer and antinuclear activist helped raise national awareness of nuclear power whistleblower Karen Silkwood’s death.","url":"https://www.bostonglobe.com/metro/obituaries/2019/04/13/kitty-tucker-who-raised-awareness-silkwood-case/1ciiYOv6Bl3ml5ikuYcOAM/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-13T23:57:12Z","content":"Kitty Tucker, a public interest lawyer and antinuclear activist who helped raise national awareness of nuclear power whistleblower Karen Silkwood’s death, died March 30 in Silver Spring, Md. She was 75.\r\nHer husband, Robert Alvarez, said the cause was complic… [+4904 chars]"},{"source":{"id":null,"name":"Accuweather.com"},"author":null,"title":"LIVE: 2 children killed as tornadoes leave trail of horrific damage in southern US - AccuWeather.com","description":"LIVE: 2 children killed as tornadoes leave trail of horrific damage in southern US AccuWeather.com Tornado hits central Texas town as severe storms forecast from Dallas to Birmingham, Alabama USA TODAY Tornado touches down in Texas as severe storm system thre…","url":"https://www.accuweather.com/en/weather-news/live-deadly-tornado-kills-2-children-leaves-trail-of-horrific-damage-in-texas/70007983","urlToImage":null,"publishedAt":"2019-04-13T23:10:00Z","content":null},{"source":{"id":null,"name":"Disneyfoodblog.com"},"author":"Molly","title":"DFB Review and Food Photos: Lunch at The Plaza in Disney World’s Magic Kingdom!","description":"Greetings from Main Street USA! Last week we popped into The Plaza Restaurant to see if the comfort food eats were as good as we remember. The Plaza has been a long-standing underrated favorite here at DFB. Most Magic Kingdom diners aim to eat at Be Our Guest…","url":"http://www.disneyfoodblog.com/2019/04/13/dfb-review-and-food-photos-lunch-at-the-plaza-in-disney-worlds-magic-kingdom/","urlToImage":null,"publishedAt":"2019-04-13T12:00:14Z","content":"Greetings from Main Street USA! Recently we popped into The Plaza Restaurant to see if the comfort food eats were as good as we remember. The Plaza has been a long-standing underrated favorite here at DFB. Most Magic Kingdom diners aim to eat at Be Our Guest … [+8085 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"Damaging storms and possibly tornadoes threaten U.S. South","description":"Severe thunderstorms that could produce tornadoes, damaging winds and large hail will slam a swathe of the U.S. South on Saturday from eastern Texas to Mississippi, forecasters said.","url":"https://www.reuters.com/article/us-usa-weather-idUSKCN1RP0BM","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2019-04-13T13:30:04Z","content":"(Reuters) - Severe thunderstorms that could produce tornadoes, damaging winds and large hail will slam a swathe of the U.S. South on Saturday from eastern Texas to Mississippi, forecasters said. \r\nThe National Weather Service on Saturday issued warnings of en… [+979 chars]"},{"source":{"id":null,"name":"Redstate.com"},"author":"Alex Parker","title":"Who Are the People Deciding Our Fate from the Bench? Here’s a Judge You Don’t Want in Charge","description":"Judges are people, too. What are their politics? The post Who Are the People Deciding Our Fate from the Bench? Here’s a Judge You Don’t Want in Charge appeared first on RedState.","url":"https://www.redstate.com/alexparker/2019/04/13/people-deciding-fate-bench-heres-profile-judge-dont-want-charge/","urlToImage":"https://www.redstate.com/wp-content/uploads/2019/04/simon-cowell-SCREENSHOT.jpg","publishedAt":"2019-04-13T22:59:17Z","content":"We know who’s legislating in America. But what about that other branch of power — the Judicial?\r\nThose in robes wield stunning power; yet we know very little of the personal leanings of men and women in charge of much of our country’s destiny.\r\nAs for U.S. Di… [+3536 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Allie Mazurek and Judson Jones, CNN","title":"Tornado touches down in Texas as severe storm system threatens Southeast","description":"A tornado ripped through Franklin, Texas, on Saturday, as the National Weather Service in the state posted one tornado warning after another, and more severe storms are forecast throughout the Southeast and Ohio River Valley.","url":"https://www.cnn.com/2019/04/13/us/tornado-texas-southeast-storms-wxc/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190413141538-texas-tornado-0413-super-tease.jpg","publishedAt":"2019-04-13T19:15:17Z","content":"(CNN)A tornado ripped through Franklin, Texas, on Saturday, as the National Weather Service in the state posted one tornado warning after another.\r\nThere were reports of multiple injuries, the NWS said, and CNN affiliate KWTX reported widespread damage. Trees… [+3408 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"David G. Allan","title":"Pre-cut melon sold at Whole Foods, Kroger and other stores in 9 states recalled; 93 people sick in salmonella outbreak","description":"Caito Foods, LLC is recalling pre-cut watermelon, honeydew melon, cantaloupe, and fruit medley products containing one of these melons due to the possibility of salmonella contamination, the Centers for Disease Control and Prevention announced.","url":"https://www.cnn.com/2019/04/12/health/melon-salmonella-outbreak-recall-bn/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180608165147-cut-melon-super-tease.jpg","publishedAt":"2019-04-13T03:44:07Z","content":"(CNN)Caito Foods LLC is voluntarily recalling pre-cut watermelon, honeydew melon, cantaloupe, and fruit medley products containing one of these melons due to the possibility of salmonella contamination, the Centers for Disease Control and Prevention, and the … [+1555 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Holly Thomas","title":"Don't underestimate Kim Kardashian, Esq.","description":"Her recent foray into criminal justice also isn't the first time that digging below her contoured surface has revealed unexpected depths, writes Holly Thomas.","url":"https://www.cnn.com/2019/04/13/opinions/kim-kardashian-turns-to-law-thomas/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190410201553-pba-kardashian-abogada-super-tease.jpg","publishedAt":"2019-04-13T15:14:07Z","content":"Holly Thomas is a writer and editor based in London. She tweets @HolstaT. The opinions expressed in this commentary are solely those of the author. View more opinion articles on CNN.\r\n (CNN)\"First year of law school,\" Kim Kardashian West told US Vogue in her … [+7062 chars]"},{"source":{"id":null,"name":"Wattsupwiththat.com"},"author":"charles the moderator","title":"White House eyes nuclear weapons expert to lead challenge to climate science","description":"From Science Mag By Scott Waldman, E&E News | Apr. 12, 2019, 8:20 AM Originally published by E&E News A controversial plan by the White House to review the connections between climate change and national security might be led by a former official with the Dep…","url":"https://wattsupwiththat.com/2019/04/13/white-house-eyes-nuclear-weapons-expert-to-lead-challenge-to-climate-science/","urlToImage":"https://4k4oijnpiu3l4c3h-zippykid.netdna-ssl.com/wp-content/uploads/2019/04/house-of-cards-jan-piller.jpg","publishedAt":"2019-04-13T17:00:00Z","content":"From Science Mag\r\nBy Scott Waldman, E&amp;E News | Apr. 12, 2019 , 8:20 AM\r\nOriginally published by E&amp;E News\r\nA controversial plan by the White House to review the connections between climate change and national security might be led by a former official … [+4517 chars]"},{"source":{"id":null,"name":"Thewrap.com"},"author":"Phil Owen","title":"All 52 ‘Game of Thrones’ Main Characters Ranked","description":"There are a lot of characters on “Game of Thrones.” Too many for me to make jokes about all of them here, anyway. 52 will have to satisfy. If you don’t like them, Littlefinger himself will return from the dead to poison your wine on your wedding day. 52. Vise…","url":"http://www.thewrap.com/all-52-game-of-thrones-main-characters-ranked/","urlToImage":"https://www.thewrap.com/wp-content/uploads/2019/04/every-game-of-thrones-main-character-ranked.jpg","publishedAt":"2019-04-13T17:42:17Z","content":"There are a lot of characters on “Game of Thrones.” Too many for me to make jokes about all of them here, anyway. 52 will have to satisfy. If you don’t like them, Littlefinger himself will return from the dead to poison your wine on your wedding day.\r\n52. Vis… [+8797 chars]"},{"source":{"id":null,"name":"Frequentbusinesstraveler.com"},"author":"Frequent Business Traveler","title":"Thousands of Flights Delayed, Canceled as Severe Storms and Tornados Hit the South","description":"Multiple dangerous and severe storms are forecast to impact parts of the South this weekend, forecasters said. As the National Weather Service posted one tornado warning after another in Texas Saturday, a tornado ripped through one town tearing off roofs and …","url":"http://www.frequentbusinesstraveler.com/2019/04/thousands-of-flights-delayed-canceled-as-severe-storms-and-tornados-hit-the-south/","urlToImage":null,"publishedAt":"2019-04-13T23:31:24Z","content":"An American Airlines 777 at DFW\r\nMultiple dangerous and severe storms are forecast to impact parts of the South this weekend, forecasters said.\r\nAs the National Weather Service posted one tornado warning after another in Texas Saturday, a tornado ripped throu… [+1120 chars]"},{"source":{"id":null,"name":"Reason.com"},"author":"Jacob Sullum","title":"Seeking to Clarify Its Opioid Prescribing Guidelines, CDC Joins FDA in Decrying ‘Mandated or Abrupt Dose Reduction’","description":"The CDC's advice has been widely interpreted as requiring involuntary tapering of medication so it does not exceed an arbitrary threshold.","url":"https://reason.com/2019/04/11/seeking-to-clarify-its-opioid-prescribin/","urlToImage":"https://reason.com/wp-content/uploads/2019/04/15549960145205.jpg","publishedAt":"2019-04-13T09:34:32Z","content":"Acknowledging the suffering caused by “misinterpretation” of the opioid prescribing guidelines it published in 2016, the U.S. Centers for Disease Control and Prevention (CDC) yesterday sought to clarify that it never recommended imposing involuntary dose redu… [+5539 chars]"},{"source":{"id":null,"name":"Reason.com"},"author":"Will Baude","title":"Death and the Shadow Docket","description":"The Supreme Court's efforts to shift procedures in death penalty litigation.","url":"https://reason.com/2019/04/12/death-and-the-shadow-docket/","urlToImage":"https://reason.com/wp-content/uploads/2019/04/Justice-Rfischia-_-Dreamstime-1200x630.jpg","publishedAt":"2019-04-13T05:20:23Z","content":"A couple months ago, the Supreme Court lifted a stay of execution in Dunn v. Ray, allowing Alabama to execute a man despite the prison’s refusal to let his imam attend to him in the execution chamber. While much of the controversy about the case was about the… [+6116 chars]"},{"source":{"id":null,"name":"Abc3340.com"},"author":"Leah Thomeer","title":"The Weather Authority | Potential For Severe Storms Late Night Tonight Into Sunday - Alabama's News Leader","description":"The Weather Authority | Potential For Severe Storms Late Night Tonight Into Sunday Alabama's News Leader Tornado hits central Texas town as severe storms forecast from Dallas to Birmingham, Alabama USA TODAY Southern states brace for severe weather; tornado w…","url":"http://abc3340.com/news/local/the-weather-authority-potential-for-severe-storms-late-night-tonight-into-sunday","urlToImage":"http://static-26.sinclairstoryline.com/resources/media/02c116e3-d039-485a-b0bb-65cf82902b76-large16x9_APR13_7day.png?1555170850821","publishedAt":"2019-04-13T15:56:00Z","content":null},{"source":{"id":null,"name":"Ajc.com"},"author":"Shaddi Abusaid","title":"Severe weather forecast across North Georgia Sunday - Atlanta Journal Constitution","description":"Severe weather forecast across North Georgia Sunday Atlanta Journal Constitution Southern US in the crosshairs of a dangerous severe weather, tornado outbreak AccuWeather.com Southern states brace for severe weather; tornado warnings issued Fox News Very seri…","url":"https://www.ajc.com/news/local/severe-weather-forecast-across-north-georgia-sunday/0hVJMWZKomGxJQ3lr5Ly9L/","urlToImage":"https://www.ajc.com/rf/image_large/Pub/p10/AJC/2019/04/13/Images/Weather.png","publishedAt":"2019-04-13T18:17:51Z","content":"Brace yourselves, Atlanta. Severe weather is coming. \r\nDamaging winds, large hail and even tornadoes are possible starting as early as 7 a.m. Sunday, Channel 2 Action News meteorologist Eboni Deon said. \r\nTiming could change, but the storms are expected to mo… [+2863 chars]"},{"source":{"id":null,"name":"Complex.com"},"author":"Joshua Espinoza","title":"Soulja Boy Hit With Lawsuit Threat After Canceling Alabama Gig","description":"The concert promoter claims Soulja pocketed nearly $9,000.","url":"https://www.complex.com/music/2019/04/promoter-threatens-to-sue-soulja-boy-over-concert-cancelation","urlToImage":"https://images.complex.com/complex/images/c_fill,g_center,w_1200/fl_lossy,pg_1,q_auto/zqldqoczrzb7gzqoupo7/promoter-threatens-sue-soulja-boy-over-missed-concert","publishedAt":"2019-04-13T01:05:03Z","content":"Soulja Boy's legal problems keep piling up.\r\nThe 28-year-old rapper is facing a potential lawsuit over a recent concert cancelation in Birmingham, Alabama. William Hicks says his event planning company had paid Soulja $8,750 for an April 6 gig at the Luxe Ult… [+1463 chars]"},{"source":{"id":null,"name":"Thefrisky.com"},"author":"Dragana Stepic","title":"Is There a Friendship Between Jennifer Aniston and Reese Witherspoon?","description":"When you think of Jennifer Aniston, your probably first thought is about popular series Friends, and her character Rachel. Reese Witherspoon is also a famous actress … The post Is There a Friendship Between Jennifer Aniston and Reese Witherspoon? appeared fir…","url":"https://thefrisky.com/is-there-a-friendship-between-jennifer-aniston-and-reese-witherspoon/","urlToImage":"https://thefrisky.com/wp-content/uploads/2019/04/Reese-Witherspoon-and-Jennifer-Aniston.jpg","publishedAt":"2019-04-13T18:00:36Z","content":"When you think of Jennifer Aniston, your probably first thought is about popular series Friends, and her character Rachel. Reese Witherspoon is also a famous actress in Hollywood, known for her movies Legally Blonde and Sweet Home Alabama.\r\nCharacters in the … [+2613 chars]"},{"source":{"id":null,"name":"247wallst.com"},"author":"Steven M. Peters","title":"WSJ: Why Apple’s Cook and Qualcomm’s Mollenkopf hate each other","description":"Both CEOs are expected to take the stand. Opening arguments Tuesday.","url":"http://247wallst.com/technology-3/2019/04/13/apple-cook-qualcomm-mollenkopf/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/247wallst/images/247-50x50.png","publishedAt":"2019-04-13T11:05:40Z","content":"Both CEOs are expected to take the stand in Apple v. Qualcomm. Opening arguments Tuesday.\r\nFrom Apple and Qualcomms Billion-Dollar Staredown ($) in the Wall Street Journal:\r\nMessrs. Cook and Mollenkopf are so entrenched in their competing positionsand have so… [+1638 chars]"},{"source":{"id":null,"name":"Typepad.com"},"author":"Paul Caron","title":"Mason Presents The Tax Subsidy War At American","description":"Ruth Mason (Virginia) presented The Tax Subsidy War, 69 Am. U. L. Rev. ___ (2019) (reviewed by Mirit Eyal-Cohen (Alabama) here) at Fordham on Thursday as part of its Faculty Workshop Series: In August 2016, the European Union dropped a bombshell: it would req…","url":"https://taxprof.typepad.com/taxprof_blog/2019/04/mason-presents-the-tax-subsidy-war-at-american.html","urlToImage":null,"publishedAt":"2019-04-13T07:03:00Z","content":null},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Tansey","title":"NFL Mock Draft 2019: Projections for Most Hyped 1st-Round Prospects","description":"The whirlwind that is the final few weeks before the 2019  NFL  draft is in full effect.     Every day produces a new destination on pre-draft tours for the top prospects in the draft class...","url":"https://bleacherreport.com/articles/2831139-nfl-mock-draft-2019-projections-for-most-hyped-1st-round-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/802/626/hi-res-42d889499c0d7291701264a545ee6441_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-13T18:10:51Z","content":"Darron Cummings/Associated Press\r\nThe whirlwind that is the final few weeks before the 2019 NFL draft is in full effect. \r\nEvery day produces a new destination on pre-draft tours for the top prospects in the draft class. \r\nAlthough some franchises may not app… [+5201 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Zach Buckley","title":"NFL Draft 2019: Mock Draft and Potential Surprise 1st-Round Picks to Watch","description":"The  NFL  draft is all about surprises.   Year after year, we see teams reaching, prospects falling and both fans and analysts alike wondering aloud what exactly is transpiring...","url":"https://bleacherreport.com/articles/2831088-nfl-draft-2019-mock-draft-and-potential-surprise-1st-round-picks-to-watch","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/802/520/hi-res-d7b797f72d4e09c92d6a577b2da2e193_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-13T15:07:13Z","content":"Darron Cummings/Associated Press\r\nThe NFL draft is all about surprises.\r\nYear after year, we see teams reaching, prospects falling and both fans and analysts alike wondering aloud what exactly is transpiring.\r\nAfter laying out our latest first-round mock, we'… [+4510 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Janna Herron, USA TODAY","title":"Where and how to mail your federal tax return","description":"There’s no one IRS address. The one you use depends on where you’re filing from. Here’s where to send yours.","url":"https://www.usatoday.com/story/money/2019/04/13/where-mail-tax-return-irs-mailing-addresses-each-state/3449584002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/257c0c5a7a7145e95f95627c9765273572a546c9/c=531-0-5969-3059/local/-/media/2019/04/12/USATODAY/usatsports/gettyimages-1089829680.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-13T11:02:07Z","content":"Running out of time to do your taxes? Filing for a six-month extension is simple.\r\n Josmar Taveras, USA TODAY\r\nIts getting down to the wire to mail in your tax returns on time.\r\nYour return must be postmarked by April 15, have the correct postage, and be addr… [+2496 chars]"},{"source":{"id":null,"name":"Coed.com"},"author":"Eric Italiano","title":"Alabama Teacher Lyndsey Bates Arrested For Allegedly Sleeping With Student","description":"Lyndsey Sherrod Bates, a 22-year-old former teacher in Madison County, Alabama, was arrested on Friday, April 12, for allegedly having a sexual relationship with an underage student.","url":"https://coed.com/2019/04/13/lyndsey-sherrod-bates-madison-county-teacher-alabama-arrested/","urlToImage":"https://coedmagazine.files.wordpress.com/2019/04/lyndsey-sherrod-bates.jpg?quality=88","publishedAt":"2019-04-13T13:45:12Z","content":"Lyndsey Sherrod Bates, a 22-year-old former teacher in Madison County, Alabama, was arrested on Friday, April 12, for allegedly having a sexual relationship with an underage student.\r\nAccording to reports from AL.com, Bates — who was teaching at Madison Count… [+2412 chars]"},{"source":{"id":null,"name":"Coed.com"},"author":"Josh Sanchez","title":"Here Is How To Watch The Alabama Football Team’s Annual ‘A-Day’ Spring Game","description":"It’s officially A-Day, with the 2019 Alabama football program’s annual spring game set to take place on Saturday, April 13....","url":"https://coed.com/2019/04/13/alabama-football-spring-game-live-stream-a-day/","urlToImage":"https://coedmagazine.files.wordpress.com/2017/01/gettyimages-182263890.jpg?quality=88","publishedAt":"2019-04-13T16:41:14Z","content":"It’s officially A-Day, with the 2019 Alabama football program’s annual spring game set to take place on Saturday, April 13. The reigning SEC Champions, which fell short to Clemson in the national championship game last season, will be giving the Crimson Tide … [+2605 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"The Associated Press","title":"Oklahoma QB Jalen Hurts taking changes in stride","description":"New Oklahoma quarterback Jalen Hurts learned at a basketball game just how much Sooners fans already had embraced him. The week Oklahoma announced that Hurts was transferring from Alabama, he was watching halftime festivities during the Sooners' game against …","url":"https://sports.yahoo.com/oklahoma-qb-jalen-hurts-taking-changes-stride-191124395--nfl.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/FWqGPGB3pLNQt9IlS6UnYA--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201904121422517763968","publishedAt":"2019-04-13T02:18:13Z","content":"NORMAN, Okla. (AP) -- New Oklahoma quarterback Jalen Hurts learned at a basketball game just how much Sooners fans already had embraced him.\r\nThe week Oklahoma announced that Hurts was transferring from Alabama, he was watching halftime festivities during the… [+4311 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Reuters","title":"Saban reveals he will require hip procedure","description":"Alabama coach Nick Saban revealed Saturday he has a hip issue that he plans to get \"fixed\" before the start of the 2019 season. Saban didn't divulge what the issue is or what type of procedure would be necessary. \"You know, I've been struggling a little bit w…","url":"https://ca.news.yahoo.com/saban-reveals-require-hip-procedure-220133841.html","urlToImage":null,"publishedAt":"2019-04-13T22:01:33Z","content":"Alabama coach Nick Saban revealed Saturday he has a hip issue that he plans to get \"fixed\" before the start of the 2019 season.\r\nSaban didn't divulge what the issue is or what type of procedure would be necessary. He said the recovery period would be no longe… [+1310 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"ProFootball Talk on NBC Sports","title":"Tua Tagovailoa thinks three-year rule is “fine for me,” but he'd possibly leave if he could","description":"Humans have an inherent knack for accepting their circumstances when those circumstances can't be changed. Alabama quarterback Tua Tagovailoa accepts his current circumstances that can't be changed. If they could be changed, Tua quite possibly would not accep…","url":"https://sports.yahoo.com/tua-tagovailoa-thinks-three-rule-131257114.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/t3eg22SfSG8xvjqMS7xOTg--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/profootballtalk.nbcsports.com/cc75cc12c600724fe9ccd58b69a659ad","publishedAt":"2019-04-13T13:12:57Z","content":"Humans have an inherent knack for accepting their circumstances when those circumstances cant be changed. Alabama quarterback Tua Tagovailoa accepts his current circumstances that cant be changed. If they could be changed, Tua quite possibly would not accept … [+3651 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Sporting News","title":"Alabama's defense may have been biggest winner from Tide's A-Day","description":"The unit blanketed receivers, picked off Tua Tagovailoa and surrendered nothing on the ground. Those are all positive signs for a group that took a back seat to the offense in 2018.","url":"https://ca.sports.yahoo.com/news/alabamas-defense-may-biggest-winner-235319321.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/E16YLQVAfRwjbtlxMlYvdg--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/article.sportingnews.com/cb850e68990ee42a6ea030eca046d0dc","publishedAt":"2019-04-13T23:53:19Z","content":"TUSCALOOSA, Ala. If Alabama fans hoped to glean anything of value from the Crimson Tide's spring game on Saturday (as much as can be extracted from a glorified scrimmage, anyway), then they need only look at two plays.\r\nThe first came on the Crimson Teams pen… [+3521 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"The Associated Press","title":"Nick Saban working with young Alabama team, not much depth","description":"Alabama's Nick Saban isn't likely to get much sympathy from his coaching peers regarding his offseason challenges.  The tasks include replacing some defensive stars, bringing along two freshman quarterbacks behind Heisman Trophy runner-up Tua Tagovailoa and g…","url":"https://sports.yahoo.com/nick-saban-working-young-alabama-team-not-much-070319654--ncaaf.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/GmsD.Cz.WHvjGq9amp26FA--~B/aD0zNTE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201904130002001245925","publishedAt":"2019-04-13T07:03:19Z","content":"Alabama's Nick Saban isn't likely to get much sympathy from his coaching peers regarding his offseason challenges.\r\nBut even the Crimson Tide faces some, especially on a defense that was uncharacteristically vulnerable late last season. Such challenges are in… [+3440 chars]"},{"source":{"id":null,"name":"Oregonlive.com"},"author":"OregonLive.com","title":"Kelee Ringo, nation's No. 2 CB, visiting Oregon Ducks this weekend","description":"The Oregon Ducks are expected to host a collection of the nation's top prospects next weekend for the spring game April 20. But Mario Cristobal and his coaching staff have also put together quite the list for this weekend. Consensus five-star outside lineback…","url":"https://www.oregonlive.com/ducks/2019/04/kelee-ringo-nations-no-2-cb-visiting-oregon-ducks-this-weekend.html","urlToImage":"https://www.oregonlive.com/resizer/MgvRQhpd3CIXeV83adglEqdpQoE=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/VUF6FDG3SZEZPMGCYWFSSJ25YQ.png","publishedAt":"2019-04-13T18:01:40Z","content":"The Oregon Ducks are expected to host a collection of the nations top prospects next weekend for the spring game April 20.\r\nBut Mario Cristobal and his coaching staff have also put together quite the list for this weekend.\r\nConsensus five-star outside linebac… [+1264 chars]"},{"source":{"id":null,"name":"Investmentwatchblog.com"},"author":"alexmark","title":"The Democrats can own US politics. This might sink them.","description":null,"url":"https://www.investmentwatchblog.com/the-democrats-can-own-us-politics-this-might-sink-them/","urlToImage":null,"publishedAt":"2019-04-13T19:30:08Z","content":"by Fabius Maximus\r\nSummary: The Democrats have a potentially winning game. But economics are trump in politics, just as in almost everything else. Past spending sins might crash their parade.\r\nThe Democratic Partys leaders probably believe they have a winning… [+4785 chars]"},{"source":{"id":null,"name":"Ncaa.com"},"author":"www.ncaa.com","title":"Alabama football: Nick Saban works to rebuild lineup after losing several stars from last year's team","description":"Alabama's Nick Saban isn't likely to get much sympathy from his coaching peers regarding his offseason challenges. But even the Crimson Tide faces some, especially on a defense that was uncharacteristically vulnerable late last season. Such challenges are ine…","url":"https://www.ncaa.com/news/football/article/2019-04-13/alabama-football-nick-saban-works-rebuild-lineup-after-losing","urlToImage":"https://www.ncaa.com/_flysystem-style-redirect/focal_point_large/public-s3/images/2019-04-13/Alabama-Spring.jpeg?h=2d44e782&itok=0H7M61Tu","publishedAt":"2019-04-13T09:57:02Z","content":"Alabamas Nick Saban isnt likely to get much sympathy from his coaching peers regarding his offseason challenges.\r\nBut even the Crimson Tide faces some, especially on a defense that was uncharacteristically vulnerable late last season. Such challenges are inev… [+4084 chars]"},{"source":{"id":null,"name":"Annistonstar.com"},"author":"College Heights Herald","title":"Alabama A-Day notebook: Spry Saban announces he'll address 'bothersome' hip issue this summer","description":"TUSCALOOSA — Nick Saban spent much of Saturday's A-Day spring game in his usual spot standing about 10-15 yards behind the line of scrimmage. In fact, Alabama's spry 67-year-old head coach never left his feet throughout the entirety of Saturday's 2-hour and 1…","url":"https://www.annistonstar.com/sports/alabama/alabama-a-day-notebook-spry-saban-announces-he-ll-address/article_b09e83c6-5e45-11e9-ac1a-7bce09a26084.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/wkuherald.com/content/tncms/assets/v3/editorial/f/ea/fea97122-43eb-5b5a-8156-0487b632db69/5cb28290bbcab.image.png?resize=400%2C262","publishedAt":"2019-04-13T23:41:00Z","content":"TUSCALOOSA Nick Saban spent much of Saturdays A-Day spring game in his usual spot standing about 10-15 yards behind the line of scrimmage.\r\nIn fact, Alabamas spry 67-year-old head coach never left his feet throughout the entirety of Saturdays 2-hour and 16-mi… [+5643 chars]"},{"source":{"id":null,"name":"Sportingnews.com"},"author":"Sporting News","title":"Alabama's defense may have been biggest winner from Tide's A-Day","description":"TUSCALOOSA, Ala. — If Alabama fans hoped to glean anything of value from the Crimson Tide's spring game on Saturday (as much as can be extracted from a glorified scrimmage, anyway), then they need only look at two plays. The first came on the Crimson Team's p…","url":"http://www.sportingnews.com/us/ncaa-football/news/alabamas-defense-may-have-been-biggest-winner-from-tides-a-day/l5u6imi90vpf1jtua76tswqky","urlToImage":"http://images.performgroup.com/di/library/sporting_news/90/6d/nick-saban-041319-zac-ftr_38bgwbebs9qz10kqwunvgzuqn.jpg?t=417728570","publishedAt":"2019-04-13T23:53:19Z","content":"TUSCALOOSA, Ala. If Alabama fans hoped to glean anything of value from the Crimson Tide's spring game on Saturday (as much as can be extracted from a glorified scrimmage, anyway), then they need only look at two plays.\r\nThe first came on the Crimson Teams pen… [+3521 chars]"},{"source":{"id":null,"name":"Dailycomet.com"},"author":"The Daily Comet","title":"Mike Detillier: SEC will again have major draft impact","description":"The SEC is the best conference in college football. It has many of the top coaches and assistants, but it also has the highest talent level. Like a diet, what you put in is what you get out and from year to year you may see a conference have a better upper-ti…","url":"https://www.dailycomet.com/article/20190413/SPORTS/190419178","urlToImage":"https://www.dailycomet.com/storyimage/DA/20190413/SPORTS/190419178/AR/0/AR-190419178.jpg","publishedAt":"2019-04-13T18:27:16Z","content":"The SEC is the best conference in college football.\r\nIt has many of the top coaches and assistants, but it also has the highest talent level.\r\nLike a diet, what you put in is what you get out and from year to year you may see a conference have a better upper-… [+4955 chars]"},{"source":{"id":null,"name":"Baltimoresun.com"},"author":"Baltimore Sun","title":"Three takeaways from Maryland football's first spring scrimmage","description":"First-year Maryland football coach Michael Locksley was in a decidedly better mood after Saturday's intrasquad scrimmage than he had been after practice Tuesday. The reason? Fewer mistakes were made, according to Locksley, especially on the offensive side of …","url":"https://www.baltimoresun.com/sports/terps/bs-sp-maryland-football-spring-scrimmage-takeaways-0413-story.html","urlToImage":"https://www.trbimg.com/img-5cb24648/turbine/bs-sp-maryland-football-spring-scrimmage-takeaways-0413","publishedAt":"2019-04-13T20:25:00Z","content":"First-year Maryland football coach Michael Locksley was in a decidedly better mood after Saturdays intrasquad scrimmage than he had been after practice Tuesday.\r\nThe reason? Fewer mistakes were made, according to Locksley, especially on the offensive side of … [+4961 chars]"},{"source":{"id":null,"name":"Cleveland.com"},"author":"cleveland.com","title":"Garrett Wilson makes his introduction at Ohio State football's Spring Game","description":"COLUMBUS, Ohio -- With less than nine minutes remaining in the first half Team Scarlet was still looking to put points on the board. Its defense had just given up a one-yard touchdown to Master Teague as Team Gray led 7-0. Quarterback Matthew Baldwin had just…","url":"https://www.cleveland.com/osu/2019/04/garrett-wilson-makes-his-introduction-at-ohio-state-footballs-spring-game.html","urlToImage":"https://www.cleveland.com/resizer/KVOqGBRucKVFSSIMK5pxs7HbRKU=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/2OSDNVP6HZHGRM452JC5UOWRLE.JPG","publishedAt":"2019-04-13T21:21:42Z","content":"COLUMBUS, Ohio -- With less than nine minutes remaining in the first half of Saturdays Ohio State football spring game, Team Scarlet was still looking to put points on the board.\r\nIts defense had just given up a 1-yard touchdown to Master Teague and Team Gray… [+3471 chars]"},{"source":{"id":null,"name":"Expressnews.com"},"author":"HoustonChronicle.com","title":"FBC Aggies Spring Game 4-13","description":"<p>COLLEGE STATION — Texas A&amp;M coach Jimbo Fisher reached for a lone silver lining after the Aggies moved their spring game up to Friday night from today because of anticipated threatening skies.</p> <p>“We’ll open up the first game like that,” Fisher sai…","url":"https://www.expressnews.com/sports/college_sports/aggies/article/FBC-Aggies-Spring-Game-4-13-13764627.php","urlToImage":"https://s.hdnux.com/photos/01/01/54/26/17221005/5/rawImage.jpg","publishedAt":"2019-04-13T03:19:29Z","content":"COLLEGE STATION — Texas A&amp;M coach Jimbo Fisher reached for a lone silver lining after the Aggies moved their spring game up to Friday night from today because of anticipated threatening skies.\r\n“We’ll open up the first game like that,” Fisher said of A&am… [+4131 chars]"},{"source":{"id":null,"name":"Upi.com"},"author":null,"title":"Tornado strikes central Texas town; more twisters forecast in South","description":"A tornado caused major damage and injuries to small town in central Texas as residents across the southern United States were bracing for significant twisters.","url":"https://www.upi.com/Top_News/US/2019/04/13/Tornado-strikes-central-Texas-town-more-twisters-forecast-in-South/9361555177548/","urlToImage":"https://cdnph.upi.com/sv/ph/og/i/9361555177548/2019/1/15551803681207/v1.5/Tornado-strikes-central-Texas-town-more-twisters-forecast-in-South.jpg","publishedAt":"2019-04-13T18:40:43Z","content":"April 13 (UPI) -- A tornado caused major damage and injuries to small town in central Texas on Saturday as residents across the southern United States were bracing for significant twisters.\r\nThrough Sunday, a low-pressure system with heavy winds and possible … [+2742 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Joel Shannon, USA TODAY","title":"An apparent stranger threw a 5-year-old boy nearly 40 feet from a mall balcony, police say","description":"Emmanuel Deshawn Aranda, 24, of Minneapolis, was arrested after the attack and has been jailed on a suspicion of attempted homicide charge.","url":"https://www.usatoday.com/story/news/nation/2019/04/13/mall-america-attack-boy-thrown-balcony-fell-40-ft/3459256002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/12/USAT/8209ac91-b8cc-43d2-be13-c289c4be8f58-fe3e68eb-2fc0-4c52-850e-0feaec125f45_thumbnail.png?crop=479,266,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-13T22:04:37Z","content":"A 24-year-old man was arrested Friday in an incident in which a 5-year-old child may have been pushed or thrown from a balcony at the Mall of America, police said. (April 12)\r\n AP\r\nPolice say a 5-year-old boy remains hospitalized on Saturday after he was thro… [+1609 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"An apparent stranger threw a 5-year-old boy nearly 40 feet from a mall balcony, police say","description":"Emmanuel Deshawn Aranda, 24, of Minneapolis, was arrested after the attack and has been jailed on a suspicion of attempted homicide charge.","url":"https://news.yahoo.com/apparent-stranger-threw-5-old-220437244.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/gDUKmb8ncM6B9RlKihGdww--~B/aD0zNjA7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/1009217/0bd135b1-59ca-4568-855e-40018156caec/b540af91-3879-5d6a-946c-78d6e4585ce3/data_3_0.jpg?s=9cb30554cfb432334d584f4b533c1754&c=f6efa3f792f438b0313c64edefa6b108&a=tripleplay4us&mr=0","publishedAt":"2019-04-13T22:04:37Z","content":"Police say a 5-year-old boy remains hospitalized on Saturday after he was thrown by an apparent stranger from a third-floor balcony at the Mall of America near Minneapolis on Friday.\r\nThe boy suffered serious injuries in the nearly 40 foot fall, Bloomington p… [+1402 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"UPDATE 1-Tornado hits small Texas town, seven reported hurt","description":"At least seven people were hurt and the small east Texas town of Franklin sustained major damage on Saturday when a tornado touched down amid severe thunderstorms in the region, police and local media said. \"The city of Franklin sustained heavy damage from th…","url":"https://news.yahoo.com/1-tornado-hits-small-texas-210214671.html","urlToImage":"https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png","publishedAt":"2019-04-13T21:02:14Z","content":"(Adds tornado damage to Texas town of Franklin)\r\nApril 13 (Reuters) - At least seven people were hurt and the small east Texas town of Franklin sustained major damage on Saturday when a tornado touched down amid severe thunderstorms in the region, police and … [+1915 chars]"},{"source":{"id":null,"name":"Mercola.com"},"author":"communities@mercola.com (Dr. Joseph Mercola)","title":"Pedestrian Deaths Are at an All-Time High","description":"As little as 150 minutes of walking each week may reduce your risk of all-cause mortality, 1 reduce your insulin resistance 2 and contribute to a fitness routine, helping improve your balance, metabolism and mood. 3 However, while walking is a simple and easy…","url":"https://articles.mercola.com/sites/articles/archive/2019/04/13/pedestrian-deaths.aspx","urlToImage":"https://media.mercola.com/ImageServer/Public/2019/April/FB/04-13-pedestrian-deaths-fb.jpg","publishedAt":"2019-04-13T00:00:00Z","content":"As little as 150 minutes of walking each week may reduce your risk of all-cause mortality,1 reduce your insulin resistance2 and contribute to a fitness routine, helping improve your balance, metabolism and mood.3 However, while walking is a simple and easy wa… [+9705 chars]"},{"source":{"id":null,"name":"Foodsafetynews.com"},"author":"News Desk","title":"93-case Salmonella outbreak brings recall of many melon products","description":"Caito Foods has recalled fresh cut watermelon, fresh cut honeydew melon, fresh cut cantaloupe and fresh cut mixed fruit containing one of these melons, produced at the Caito Foods facility in Indianapolis because these products have the potential to be contam…","url":"https://www.foodsafetynews.com/2019/04/93-case-salmonella-outbreak-brings-recall-of-many-melon-products/","urlToImage":"https://www.foodsafetynews.com/files/2019/04/melon_1000x565.jpg","publishedAt":"2019-04-13T04:06:43Z","content":"The federal Centers for Disease Control and Prevention (CDC) late Friday reported a multistate investigation which began on April 2, 2019, when PulseNet identified the outbreak. As of April 12, 2019, 93 people infected with the outbreak strain of Salmonella C… [+4347 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Greg Porter","title":"The South braces for severe weather and possible strong tornadoes through Saturday evening","description":"Severe storms could sweep across in the Appalachians into the Mid-Atlantic late Sunday.","url":"https://www.washingtonpost.com/weather/2019/04/13/south-braces-severe-weather-possible-strong-tornadoes-through-saturday-evening/","urlToImage":"https://www.washingtonpost.com/resizer/RQBx273BwhjL8h6jK4kfR3qyoe8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/62HBQ2T45VE4TNRL6ZL43OXUII.png","publishedAt":"2019-04-13T19:21:31Z","content":"With an extremely moist and unstable atmosphere in place, residents in the lower Mississippi Valley are bracing for several hours of severe weather Saturday afternoon and evening, featuring storms capable of producing long track and violent tornadoes.\r\nTornad… [+2576 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, George Schroeder, USA TODAY","title":"Confident and comfortable Jalen Hurts impresses, has some fun in Oklahoma's spring game","description":"Confident, comfortable and having fun, Jalen Hurts impresses in his on-field debut during Oklahoma's spring game.","url":"https://www.usatoday.com/story/sports/ncaaf/columnist/george-schroeder/2019/04/13/oklahoma-football-jalen-hurts-impresses-sooners-spring-game/3457451002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/13/USAT/9e47d4fe-572b-4233-87fe-ac3de255c14c-USP_NCAA_Football__Oklahoma_Spring_Game.JPG?crop=2050,1153,x301,y88&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-13T19:59:50Z","content":"SportsPulse: Miss college football action already? Well, Trysta Krick and Paul Myerberg tell us what to look forward to next season.\r\n USA TODAY\r\nNORMAN, Okla – In his retelling, it just felt right. That was Jalen Hurts’ explanation for the moment when, just … [+7061 chars]"},{"source":{"id":null,"name":"Startribune.com"},"author":"KENDRA MEINERT","title":"Rock lovers bid farewell to Brown County arena at final show","description":"Turn out the lights. The party's over.","url":"http://www.startribune.com/rock-lovers-bid-farewell-to-brown-county-arena-at-final-show/508530122/","urlToImage":"http://assets.startribune.com/static/img/branding/logos/strib-social-card.png?d=1555016758","publishedAt":"2019-04-13T05:10:44Z","content":"ASHWAUBENON, Wis. Turn out the lights. The party's over.\r\nBrown County Veterans Memorial Arena's six-decade reign as a concert venue came to an end recently in much the same way it's forever etched in so many memories in a dark haze of loud rock and blazing p… [+4146 chars]"},{"source":{"id":null,"name":"Startribune.com"},"author":"STAFF REPORT","title":"3 Minnesotans sickened by pre-cut melon bought at Trader Joe's","description":"They're among 93 people nationwide believed to have contracted salmonella from fruit distributed by an Indiana company.","url":"http://www.startribune.com/3-minnesotans-sickened-by-pre-cut-melon-bought-at-trader-joe-s/508523892/","urlToImage":"http://stmedia.stimg.co/1555121548_10055301+1cdc041319.JPG?h=630&w=1200&fit=crop&bg=999&crop=faces","publishedAt":"2019-04-13T02:21:44Z","content":"Three Minnesotans are among more than 90 people nationwide afflicted by salmonella linked to pre-cut melon supplied by an Indiana company, the Minnesota Department of Health said Friday.\r\nTwo children from the same household and an adult became ill with the f… [+1401 chars]"},{"source":{"id":null,"name":"Today.com"},"author":"TODAY.com","title":"Tornadoes, hail threaten nearly 20 million in the South","description":"Severe storms are expected from Texas to Alabama this weekend, bringing the chance of hail and tornadoes. TODAY’s Dylan Dreyer has the forecast.","url":"https://www.today.com/video/tornadoes-hail-threaten-nearly-20-million-in-the-south-1490940483563","urlToImage":"https://media11.s-nbcnews.com/j/MSNBC/Components/Video/201904/tdy_sat_dylan_wx_190413_1920x1080.social_share_1200x630_center.jpg","publishedAt":"2019-04-13T11:07:22Z","content":null},{"source":{"id":"abc-news","name":"ABC News"},"author":"The Associated Press","title":"The Latest: Possible Mississippi twister, no injuries","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews.  Find the top news online at ABC news.","url":"https://abcnews.go.com/US/wireStory/latest-mississippi-twister-injuries-62384476","urlToImage":"https://s.abcnews.com/images/Lifestyle/WireAP_5a2a9949406742a48d84be9676cd61d0_16x9_992.jpg","publishedAt":"2019-04-13T23:23:28Z","content":"The Latest on a powerful storm system moving through the southern United States (all times local):\r\n6:15 p.m.\r\nAuthorities say a possible tornado has touched down in western Mississippi, causing damage to several businesses and vehicles.\r\nJohn Moore, a foreca… [+3089 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"By The Associated Press","title":"Today in History","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews.  Find the top news online at ABC news.","url":"https://abcnews.go.com/US/wireStory/today-history-62373026","urlToImage":null,"publishedAt":"2019-04-13T04:01:12Z","content":"Today in History\r\nToday is Saturday, April 13, the 103rd day of 2019. There are 262 days left in the year.\r\nToday's Highlight in History:\r\nOn April 13, 1970, Apollo 13, four-fifths of the way to the moon, was crippled when a tank containing liquid oxygen burs… [+5614 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Zach Barnett","title":"Interceptions galore in Alabama spring game","description":"All four Crimson Tide quarterbacks were intercepted during Saturday's A-Day Game.","url":"https://collegefootballtalk.nbcsports.com/2019/04/13/interceptions-galore-in-alabama-spring-game/","urlToImage":"https://nbccollegefootballtalk.files.wordpress.com/2019/04/gettyimages-1029438194-e1555192107555.jpg","publishedAt":"2019-04-13T21:49:08Z","content":"Five players threw passes during Alabama’s A-Day Game on Saturday, and four of them were intercepted. The only one who wasn’t? Redshirt freshman Slade Bolden, who plays wide receiver.\r\nAll four of the Tide’s quarterbacks were picked off throughout the course … [+1913 chars]"},{"source":{"id":null,"name":"Commondreams.org"},"author":null,"title":"'It Is Not Enough to Simply Oppose US Military Intervention': A Response to WOLA on Venezuela","description":"The Washington Office on Latin America has yet to offer any explanation for why they do not oppose the Trump administration's illegal regime change effort in Venezuela, nor do they recognize the enormous damage that the president and his allies have done and …","url":"https://www.commondreams.org/views/2019/04/13/it-not-enough-simply-oppose-us-military-intervention-response-wola-venezuela","urlToImage":"https://www.commondreams.org/sites/default/files/views-article/thumbs/hands_off_venezuela_0.jpg","publishedAt":"2019-04-13T16:20:15Z","content":"The following open letter is a response to a letter from the Washington Office on Latin America (WOLA) dated March 8, and published on Common Dreams here. That letter from WOLA was a response to an initial open letter by 124 academics and scholars posted Marc… [+18499 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Mike Florio","title":"Tua Tagovailoa thinks three-year rule is “fine for me,” but he’d possibly leave if he could","description":"Humans have an inherent knack for accepting their circumstances when those circumstances can’t be changed. Alabama quarterback Tua Tagovailoa accepts his current circumstances that can’t be changed. If they could be changed, Tua quite possibly would not accep…","url":"https://profootballtalk.nbcsports.com/2019/04/13/tua-tagovailoa-thinks-three-year-rule-is-fine-for-me-but-hed-possibly-leave-if-he-could/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/gettyimages-1079274122.jpg","publishedAt":"2019-04-13T13:12:57Z","content":"Humans have an inherent knack for accepting their circumstances when those circumstances can’t be changed. Alabama quarterback Tua Tagovailoa accepts his current circumstances that can’t be changed. If they could be changed, Tua quite possibly would not accep… [+3691 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Eliza Relman","title":"Trump accused Ilhan Omar of trivializing 9/11, but has made his own controversial comments about the terror attacks","description":"President Donald Trump  attacked Democratic Rep. Ilhan Omar for a controversial comment she made appearing to trivialize the 9/11 terror attacks, but Trump has his own history of making what many believed were insensitive remarks about 9/11.","url":"https://www.businessinsider.com.au/trump-ilhan-omar-jabs-made-controversial-comments-about-911-despite-2019-4","urlToImage":"https://static.businessinsider.com/image/5cb1e885775bc757ac574332-640.jpg","publishedAt":"2019-04-13T15:25:40Z","content":"President Donald Trump attacked Democratic Rep. Ilhan Omar for a controversial comment she made about the 9/11 terror attacks, but Trump has his own history of making controversial remarks about 9/11.\r\nOn the day of the terror attacks in 2001, Trump mentioned… [+3328 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Joe Perticone","title":"Progressives like Alexandria Ocasio-Cortez may be the 'rock stars' of the Democratic House majority — but another group of freshman Democrats is reshaping Congress","description":"LEESBURG, Virginia – The massive group of freshman Democratic members of Congress elected in the 2018 midterms is the largest since the aftermath of the Watergate scandal in 1974. Since they have taken office, there has been a concerted effort from Republican…","url":"https://www.businessinsider.com.au/democrat-house-freshmen-centrist-moderate-alexandria-ocasio-cortez-ilhan-omar-2019-4","urlToImage":"https://static.businessinsider.com/image/5caf53c3cf22db216f6df355-640.jpg","publishedAt":"2019-04-13T13:43:00Z","content":"The freshman class of Democratic members of Congress is the largest since the post-Watergate scandal group in 1974.\r\nDespite progressives like Alexandria Ocasio-Cortez grabbing big headlines, most of the freshman Democrats are actually moderates, belonging to… [+7846 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Erin Brodwin","title":"A mysterious condition makes marijuana users violently ill, and it reveals a hidden downside to the drug's growing popularity","description":"Alice Moon once reviewed marijuana edibles for a living. So when a doctor told the 29-year-old Californian that she had to stop using cannabis because of a newly discovered syndrome, it threatened to turn her world upside down.","url":"https://www.businessinsider.com.au/marijuana-syndrome-vomiting-nausea-symptoms-do-i-have-chs-2019-4","urlToImage":"https://static.businessinsider.com/image/5cabca5777584e4b696f74f2-640.jpg","publishedAt":"2019-04-13T14:05:00Z","content":"Frequent marijuana use appears to be causing a mysterious syndrome characterised by severe nausea and repeated vomiting.\r\nLittle is known about the condition, which is called cannabinoid hyperemesis syndrome, or CHS.\r\nBusiness Insider interviewed half a dozen… [+18440 chars]"},{"source":{"id":"cnbc","name":"CNBC"},"author":"Natasha Turak","title":"Salmonella outbreak across 9 states is linked to pre-cut melons, CDC says; 93 people infected","description":"The pre-cut melon products have been recalled from Whole Foods, Kroger and other retailers across nine states reporting infections.","url":"https://www.cnbc.com/2019/04/13/salmonella-outbreak-across-9-states-linked-to-pre-cut-melons-cdc.html","urlToImage":"https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/24/104237216-RTSNYTA.1910x1000.jpg","publishedAt":"2019-04-13T12:49:00Z","content":"An outbreak of salmonella that's sickened 93 people across nine U.S. states is linked to pre-cut melons from Indianapolis-based produce company Caito Foods, the Centers for Disease Control and Prevention (CDC) said late Friday.\r\ndiv &gt; div.group &gt; p:firs… [+1346 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.facebook.com/DailyMail","title":"Powerful tornado rips through East Texas town causing 'significant damage'","description":"Multiple structures in Franklin, Texas were destroyed by a tornado on Saturday, as severe weather swept through eastern Texas toward Arkansas, Louisiana and Mississippi.","url":"https://www.dailymail.co.uk/news/article-6919417/Powerful-tornado-rips-East-Texas-town-causing-significant-damage.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/13/20/12237006-0-image-a-41_1555183136071.jpg","publishedAt":"2019-04-13T19:24:00Z","content":"A powerful tornado has ripped through East Texas, with reports of 'significant damage'.\r\nMultiple structures in Franklin, Texas were destroyed by a tornado on Saturday, as severe weather swept through eastern Texas toward Arkansas, Louisiana and Mississippi. … [+2582 chars]"}]}