{"status":"ok","totalResults":343,"articles":[{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"THE NEW YORK TIMES","title":"North Carolina Coach Sylvia Hatchell Resigns After Investigation","description":"Ms. Hatchell led U.N.C. women’s basketball for 33 years, but an investigation ordered by the university supported accusations that the coach had made racially insensitive remarks in front of her team.","url":"https://www.nytimes.com/2019/04/19/sports/basketball/north-carolina-sylvia-hatchell.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/sports/19unc1/19unc1-facebookJumbo.jpg","publishedAt":"2019-04-19T05:57:35Z","content":"The University commissioned a review of our womens basketball program, which found issues that led us to conclude that the program needed to be taken in a new direction, North Carolinas athletic director, Bubba Cunningham, said in the statement. It is in the … [+1263 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Kelly McLaughlin","title":"After weeks of speculation, officials say that a fifth grader who was hospitalized after a school fight actually died from a rare brain condition","description":"RaNiya Wright died on March 27, two days after getting into a fight with a classmate at Forest Hills Elementary in Walterboro, South Carolina. She was taken to the hospital on March 25, when she started vomiting and passed out. 14th Circuit Solicitor Duffie S…","url":"https://www.thisisinsider.com/raniya-wright-hospitalized-school-fight-died-of-natural-causes-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9ffaf2730ca08e0572bc4-1536-768.jpg","publishedAt":"2019-04-19T17:04:14Z","content":"A 10-year-old girl in South Carolina who was hospitalized after a school fight died from a rare brain condition, officials said. \r\n RaNiya Wright was taken to Medical University of South Carolina on March 25, after getting into a fight at Forest Hills Element… [+2113 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joe Perticone","title":"The Mueller report changes nothing for Congress, which remains as fiercely divided as ever","description":"The release of the Mueller report has only hardened the previously-held stances Democrats and Republicans have on President Donald Trump. Democrats took issue with Attorney General William Barr's handling of the report's release. Republicans focused on part o…","url":"https://www.businessinsider.com/mueller-report-changes-nothing-fiercely-divided-congress-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb8a041d1a2f817dc5aa468-2732-1366.jpg","publishedAt":"2019-04-19T14:12:38Z","content":"WASHINGTON — The special counsel's final report released Thursday, revealing that no one in President Donald Trump's 2016 campaign colluded with the Russians to fix the election but left the question of obstruction of justice somewhat open-ended. \r\n For every… [+5295 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"With Sylvia Hatchell out, what's next for North Carolina?","description":"This isn't the ending anyone envisioned for Sylvia Hatchell. But now, the athletic administration should commit to returning UNC to an elite program.","url":"http://www.espn.com/womens-college-basketball/story/_/id/26559619/with-sylvia-hatchell-next-north-carolina","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0419%2Fr531461_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T14:37:24Z","content":"For the first time since 1986, the North Carolina women's basketball head coaching position is open. North Carolina announced late Thursday that Sylvia Hatchell was resigning after 33 years at the school following an independent investigation into player and … [+5846 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"UNC coach Hatchell resigns after program review","description":"Sylvia Hatchell has stepped down as North Carolina's women's basketball coach after an external review found she had made \"racially insensitive\" comments and applied \"undue influence\" regarding players' ability to compete through medical issues.","url":"http://www.espn.com/womens-college-basketball/story/_/id/26557340/unc-coach-hatchell-resigns-program-review","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F1217%2Fr303790_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:36:40Z","content":"RALEIGH, N.C. -- North Carolina women's basketball coach Sylvia Hatchell resigned Thursday after an external review found she had made \"racially insensitive\" comments and applied \"undue influence\" regarding players' ability to compete through medical issues.\r… [+2223 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Nate Davis, USA TODAY","title":"Which NFL teams could draft a quarterback? Ranking all 32 teams by need for a passer","description":"Whether it's finding a quarterback for the future or picking up an immediate starter, all 32 NFL teams have varying needs for a passer in the draft.","url":"https://www.usatoday.com/story/sports/nfl/draft/2019/04/19/nfl-draft-qb-needs-teams-patriots-giants-broncos/3500353002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/eb3fe69c-2525-4682-bb5f-80366678a9d1-USATSI_11919810.jpg?crop=1882,1059,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T10:17:24Z","content":"SportsPulse: The NFL schedule is out and we couldn't be more excited about the ridiculousness of it all. USA TODAY's Trysta Krick breaks down the biggest storylines from the schedule.\r\n USA TODAY\r\nEven in a year when defensive stars are expected to dominate t… [+14924 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Ann Schmidt","title":"North Carolina girl finds megalodon shark tooth buried on beach: 'Is this a dream?'","description":"A middle school girl found a megalodon shark tooth while she was spending her spring break on the beach in North Carolina.","url":"https://www.foxnews.com/science/megalodon-shark-tooth-north-carolina-beach","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Megalodon20tooth20iStock.jpg","publishedAt":"2019-04-19T16:37:00Z","content":"A middle school girl stumbled upon a buried treasure while spending her spring break on a beach in North Carolina.\r\nAvery Fauth and her family love to scour the sand for shark teeth whenever they’re on a beach. But Fauth attributes her recent prehistoric find… [+1548 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Isabel Fattal","title":"How the Columbine Shooting Changed American Teenhood","description":"The year 1999 is, for many, a bright line that divides two radically different types of school experiences.","url":"https://www.theatlantic.com/education/archive/2019/04/before-columbine-what-was-high-school-like/587527/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_1137712715/facebook.jpg?1555611984","publishedAt":"2019-04-19T12:00:00Z","content":"Jake Wakefield, who graduated from high school in Fort Collins, Colorado, in 2003, recalls that April 20 was the date of his Senior Ditch Day. One reason for the chosen date was “a tongue-in-cheek thing,” he told me; April 20 is an unofficial cannabis holiday… [+11867 chars]"},{"source":{"id":null,"name":"Deadspin.com"},"author":"Laura Wagner","title":"UNC Basketball Coach Sylvia Hatchell, Who Sounds Like A Real Nightmare, Resigns After Investigation","description":"Longtime University of North Carolina women’s basketball coach Sylvia Hatchell has resigned after more than three decades with the program, following the conclusion of an investigation that found she made “racially insensitive” remarks, pressured players to p…","url":"https://deadspin.com/unc-basketball-coach-sylvia-hatchell-who-sounds-like-a-1834165498","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--Ppdy8S3v--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/crdcr8vln01njj97ly9t.png","publishedAt":"2019-04-19T14:08:00Z","content":"Longtime University of North Carolina womens basketball coach Sylvia Hatchell has resigned after more than three decades with the program, following the conclusion of an investigation that found she made racially insensitive remarks, pressured players to play… [+3135 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Jeff Tollefson","title":"‘Global deal for nature’ fleshed out with specific conservation goals","description":"To maintain a liveable planet, governments need to protect 30% of Earth's land and sea and sustainably manage another 20%, say researchers.","url":"https://www.nature.com/articles/d41586-019-01253-z?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01253-z/d41586-019-01253-z_16659406.jpg","publishedAt":"2019-04-19T00:00:00Z","content":"Tropical forests, such as this one in Borneo, are among several types of ecosystems that scientists are pushing to conserve.Credit: Nick Garbbutt/NPL/Getty Images\r\nGovernments around the world must fully protect 30% of Earths surface and sustainably manage an… [+3462 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Michele Debczak","title":"Middle School Student Discovers Megalodon Tooth Fossil on Spring Break","description":"Avery Fauth was looking for shark teeth at North Topsail Beach in North Carolina when she found a Megalodon fossil the length of her palm.","url":"http://mentalfloss.com/article/580859/middle-school-student-discovers-megalodon-tooth-fossil","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_2914,w_5184,x_0,y_271/v1555685045/shape/mentalfloss/istock-478352665.jpg?itok=V329tyLA","publishedAt":"2019-04-19T15:45:00Z","content":"If you love ancient history and eerie, abandoned places, it might be time to break out the scuba diving gear and book a flight to Greece. As AFAR reports, the site of an ancient shipwreck near Alonissos, a Greek island in the Aegean Sea, has been turned into … [+1944 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Joe Rao","title":"April's Lyrid Meteors Peak Early this Week, But the Moon May Interfere","description":"One of the oldest known annual meteor showers, peaking early this week, may unfortunately be hindered by an almost-full moon.","url":"https://www.space.com/moonlit-lyrids-peak-this-weekend.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/5cdM7hbqDBsJUWM4MYNCei-1200-80.jpg","publishedAt":"2019-04-19T15:00:01Z","content":"One of the oldest known annual meteor showers, peaking early this week, may unfortunately be hindered by an almost-full moon.\r\nThe moon reaches full phase during the overnight hours of April 18-19, so many will likely dismiss this year's performance of the Ly… [+4853 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Fareehan Elgakhlab","title":"Vox Sentences: Decoding the Mueller report","description":"A (redacted) Mueller report is finally released; North Korea’s foreign minister wants Pompeo out of nuclear negotiations.","url":"https://www.vox.com/vox-sentences/2019/4/18/18485860/vox-sentences-mueller-report-takeaways","urlToImage":"https://cdn.vox-cdn.com/thumbor/nUjKToa3i9vDS74WZvm2lqtBMa0=/0x38:600x352/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16168065/4.18.jpg","publishedAt":"2019-04-19T00:00:00Z","content":"Vox Sentences is your daily digest for whats happening in the world. Sign up for the Vox Sentences newsletter, delivered straight to your inbox Monday through Friday, or view the Vox Sentences archive for past editions.\r\nA (redacted) Mueller report is finally… [+5972 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Paul Kasabian","title":"UNC HC Sylvia Hatchell Resigns After Investigation into Alleged Racist Remarks","description":"North Carolina women's basketball head coach Sylvia Hatchell  has resigned  after the university conducted an investigation into alleged racist remarks and \" perceived and undue influence \" over forcing Tar Heels to play through injuries...","url":"https://bleacherreport.com/articles/2832080-unc-hc-sylvia-hatchell-resigns-after-investigation-into-alleged-racist-remarks","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/677/hi-res-db1156ddef47fe83ffce472e136b15c2_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T05:25:54Z","content":"Peyton Williams/Getty Images\r\nNorth Carolina women's basketball head coach Sylvia Hatchell has resigned after the university conducted an investigation into alleged racist remarks and \"perceived and undue influence\" over forcing Tar Heels to play through inju… [+2663 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Steve Silverman","title":"Jordan Brand Classic 2019: Rosters, Live Stream Schedule and Preview","description":"The 18th annual Jordan Classic will be held in a new venue Saturday, as many of the nation's top high school seniors will descend on the T-Mobile Arena in Las Vegas with an opportunity ...","url":"https://bleacherreport.com/articles/2832082-jordan-brand-classic-2019-rosters-live-stream-schedule-and-preview","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/688/hi-res-525c30ae2921b4805854d0d3f64b3d7b_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T11:10:36Z","content":"James Wiseman will be competing in the Jordan Brand Classic Saturday in Las Vegas.Sam Forencich/Getty Images\r\nThe 18th annual Jordan Classic will be held in a new venue Saturday, as many of the nation's top high school seniors will descend on the T-Mobile Are… [+5847 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Russell Dean Stone","title":"Kelsey Lu Casts a Captivating Spell on Debut Album ‘Blood’","description":"3.5/5.0 Alongside albums from King Princess and Billie Eilish, Blood, the first full-length offering from Kelsey Lu, has undoubtedly been one of 2019’s most eagerly anticipated debut drops. The North Carolina-born singing, song-writing, cello playing avant-po…","url":"https://www.highsnobiety.com/p/kelsey-lu-blood-review/","urlToImage":"https://static.highsnobiety.com/thumbor/l5EEM9gXh_yAtbFurGW8VDmoeHQ=/fit-in/1000x600/smart/static.highsnobiety.com/wp-content/uploads/2019/04/17160032/kelsey-lu-blood-review-00.jpg","publishedAt":"2019-04-19T14:06:04Z","content":"Highsnobiety\r\n3.5/5.0\r\nAlongside albums from King Princess and Billie Eilish, Blood, the first full-length offering from Kelsey Lu, has undoubtedly been one of 2019s most eagerly anticipated debut drops. The North Carolina-born singing, song-writing, cello pl… [+4630 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Vanessa Romo","title":"UNC Basketball Coach Sylvia Hatchell Resigns After Investigation","description":"An 18-day probe into the women's basketball program found the Hall of Fame coach is not racist but did make \"racially insensitive\" remarks. She also pressured players to play through serious injuries.","url":"https://www.npr.org/2019/04/19/715137550/unc-basketball-coach-sylvia-hatchell-resigns-after-investigation","urlToImage":"https://media.npr.org/assets/img/2019/04/19/ap_19109181714934_wide-98cdafe16b62846bf81f1174802fbf620b46ebf3.jpg?s=1400","publishedAt":"2019-04-19T19:41:40Z","content":"Hatchell, who has led the Tar Heels since 1986, did not address the allegations against her or the findings of the independent report.\r\nRobert Franklin/AP\r\nAfter more than three decades, University of North Carolina women's basketball coach Sylvia Hatchell ha… [+4099 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"E.A. Crunden","title":"2020 Democratic contenders seize on opposition to offshore drilling in South Carolina","description":"Democratic presidential contenders are taking note of swelling opposition to offshore drilling in the Southeast, especially in the early primary state of South Carolina, where lawmakers are working to head off federal drilling efforts. The issue is emerging a…","url":"https://thinkprogress.org/offshore-drilling-warren-2020-south-carolina-trump-3cd0f9640132/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1133048933.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-19T17:08:41Z","content":"Democratic presidential contenders are taking note of swelling opposition to offshore drilling in the Southeast, especially in the early primary state of South Carolina, where lawmakers are working to head off federal drilling efforts.\r\nThe issue is emerging … [+6375 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"D'lyn Ford","title":"When coastal hazards threaten your Outer Banks trip","description":"A trip to the Outer Banks is a tradition for some North Carolina families and a bucket-list destination for other tourists. A new study from North Carolina State University asked visitors for their reactions to having travel plans disrupted by coastal hazards…","url":"https://phys.org/news/2019-04-coastal-hazards-threaten-outer-banks.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/whencoastalh.jpg","publishedAt":"2019-04-19T11:40:01Z","content":"A trip to the Outer Banks is a tradition for some North Carolina families and a bucket-list destination for other tourists. A new study from North Carolina State University asked visitors for their reactions to having travel plans disrupted by coastal hazards… [+5797 chars]"},{"source":{"id":null,"name":"Fivethirtyeight.com"},"author":"Adam Kelsey and Will Steakin, Adam Kelsey https://fivethirtyeight.com/contributors/adam-kelsey/ Adam.M.Kelsey@abc.com","title":"What The Potential 2020 Candidates Are Doing And Saying, Vol. 15","description":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 — Democrats and even some Republicans — we’re keeping tabs on the field as it develops. Each week, we’ll run…","url":"https://fivethirtyeight.com/features/what-the-potential-2020-candidates-are-doing-and-saying-vol-15/","urlToImage":"https://fivethirtyeight.com/wp-content/uploads/2019/04/2020roundup-0419-16x9.png?w=1600","publishedAt":"2019-04-19T09:59:29Z","content":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 Democrats and even some Republicans were keeping tabs on the field as it develops. Each week, well run throu… [+15151 chars]"},{"source":{"id":null,"name":"Geek.com"},"author":"Stephanie Valera","title":"Seashell Hunter Hits ‘Jackpot,’ Finds Giant Shell at North Carolina Park","description":"It’s a sheller’s dream come true: A basketball-sized helmet shell — four times bigger than average — was found recently at a national seashore in North Carolina, according to National Park Service (NPS) […] The post Seashell Hunter Hits ‘Jackpot,’ Finds Giant…","url":"https://www.geek.com/news/seashell-hunter-hits-jackpot-finds-giant-shell-at-north-carolina-park-1783812/","urlToImage":"https://www.geek.com/wp-content/uploads/2019/04/helmetshell1.jpg","publishedAt":"2019-04-19T19:53:06Z","content":"It’s a sheller’s dream come true: A basketball-sized helmet shell four times bigger than average was found recently at a national seashore in North Carolina, according to National Park Service (NPS) officials.\r\nThe giant shell was discovered at Cape Lookout N… [+1617 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"IE Online","title":"Indian student in US faces 10 years jail for destroying computers at New York college","description":"Vishwanath Akuthota, 27, residing in the United States on a student visa, has been in custody since he was arrested in North Carolina in February this year.","url":"https://indianexpress.com/article/india/indian-student-in-us-faces-10-years-jail-for-destroying-computers-at-new-york-college-5684969/","urlToImage":"https://images.indianexpress.com/2019/04/arrest-generic759x422.jpg?w=759","publishedAt":"2019-04-19T15:33:13Z","content":"United States Attorney Grant Jaquith said that he pleaded guilty this week to causing damage to computers owned by The College of St Rose. (Representational image)\r\nAn Indian student has pleaded guilty to intentionally causing damage of over USD 58,000 to mor… [+1589 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Helen Murphy","title":"North Carolina Basketball Coach Sylvia Hatchell Resigns After 33 Years Following Investigation","description":"Longtime University of North Carolina head women’s basketball coach Sylvia Hatchell has resigned following an investigation, the university announced on Friday. A statement released by the university said that Hatchell, 67, had made “racially insensitive” com…","url":"https://people.com/sports/north-carolina-basketball-coach-sylvia-hatchell-resigns/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/sylvia-haskell.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-19T15:39:30Z","content":"Longtime University of North Carolina head women’s basketball coach Sylvia Hatchell has resigned following an investigation, the university announced on Friday.\r\nA statement released by the university said that Hatchell, 67, had made “racially insensitive” co… [+2379 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Chris Harris","title":"Missing N.C. Woman, 20, Was 'Dragged' into Car and Is Being 'Held Against Her Will': Police","description":"Authorities are searching for a North Carolina woman who police allege was taken against her will and is likely being held hostage by a man 16 years older. Lauren Hall, 20, has not been seen since Thursday morning, according to the Wilkes County Sheriff’s Off…","url":"https://people.com/crime/missing-woman-dragged-into-car-being-held-against-her-will-police-say/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/lauren-hall.jpg?crop=0px%2C0px%2C1080px%2C567px&resize=1200%2C630","publishedAt":"2019-04-19T15:07:22Z","content":"Authorities are searching for a North Carolina woman who police allege was taken against her will and is likely being held hostage by a man 16 years older.\r\nLauren Hall, 20, has not been seen since Thursday morning, according to the Wilkes County Sheriff’s Of… [+1160 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Yves Smith","title":"Making American Schools Less Great Again","description":"An on-the-ground report from a teacher in Beverton on how the war on schools' funding is leading teachers to strike.","url":"https://www.nakedcapitalism.com/2019/04/making-american-schools-less-great-again.html","urlToImage":"http://www.tomdispatch.com/images/managed/everybody_gologorsky.jpg","publishedAt":"2019-04-19T04:58:26Z","content":"Yves here. This is a personal vignette about setting up government for failure. A teacher describes how budget cuts to schools in her district produced predictable results: overcrowded classrooms, diminished attention to students, particularly ones who would … [+13446 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Devin Thorpe, Contributor, Devin Thorpe, Contributor https://www.forbes.com/sites/devinthorpe/","title":"Honoring Their Immigrant Roots, Entrepreneurs Combine Impact Investing And Film","description":"These entrepreneurs are combining impact investing and documentary filmmaking to create a social enterprise that recognizes the value immigrants bring to our communities.","url":"https://www.forbes.com/sites/devinthorpe/2019/04/19/honoring-their-immigrant-roots-entrepreneurs-combine-impact-investing-and-film/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fdevinthorpe%2Ffiles%2F2019%2F04%2FAndrew-Leon-Hanna-by-Victoria-Burns-1-300x300.jpg","publishedAt":"2019-04-19T13:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAndrew Leon Hanna, 27, and David Delaney Mayer, also 27, became fast friends at Duke, based, at least in part, on their shared status as descendants of immigrants they have known. After years of searchin… [+11960 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Bill Whalen, Contributor, Bill Whalen, Contributor https://www.forbes.com/sites/billwhalen/","title":"Now That Bernie Has Discovered Fox News, Will He Further Explore Red-State America?","description":"Now that he's conquered the beast that is Fox News -- more the holding his own in a town hall event earlier this week -- what's the next move for Bernie Sanders if he wants to learn more about red-state America? Try: dining at Chick-fil-A, attending a \"megach…","url":"https://www.forbes.com/sites/billwhalen/2019/04/18/now-that-bernie-has-discovered-fox-news-will-he-further-explore-red-state-america/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fa0a315e402db4935ae25025ce8fe640f%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T02:22:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nSen. Bernie Sanders did something unusual for a Democratic presidential hopeful: a town hall interview with Fox News anchors Bret Baier and Martha MacCallum. (Photo: Matt Rourke/Associated Press)\r\nIn new… [+12783 chars]"},{"source":{"id":null,"name":"Wlos.com"},"author":"WLOS STAFF","title":"Friday Weather Update: Powerful storm system brings heavy rains, thunderstorms - WLOS","description":"The National Weather Service has issued a Tornado Watch for parts ofGeorgia, North Carolina, South Carolina and Virginia until 5 p. m. Friday.  The watch area includesAvery, Burke, McDowell, Polk and Rutherford counties in Western North Carolina.  There is al…","url":"http://wlos.com/news/local/friday-weather-update-powerful-storm-system-brings-heavy-rains-thunderstorms","urlToImage":"http://static-32.sinclairstoryline.com/resources/media/5c1abf09-9678-47bd-958e-7c1bab2d6ebb-large16x9_04.19floodwarning.JPG?1555696287908","publishedAt":"2019-04-19T11:01:00Z","content":null},{"source":{"id":"fox-news","name":"Fox News"},"author":"Ryan Gaydos","title":"North Carolina woman allegedly taken from her home, being 'held against her will,' police say - Fox News","description":"North Carolina woman allegedly taken from her home, being 'held against her will,' police say Fox News Sheriff: Wilkes Co. Woman Was Dragged Across Yard, Kidnapped and Being Held Against Her Will WFMY News 2 Search for suspect, woman held against her will in …","url":"https://www.foxnews.com/us/north-carolina-woman-allegedly-taken-from-her-home-being-held-against-her-will-police-say","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/NC-Hall-Duarte.jpg","publishedAt":"2019-04-19T13:51:27Z","content":"A North Carolina woman is being “held against her will” after she was seen being dragged through her front yard Thursday morning, police said.\r\nRosalino Duarte-Cruz, 37, is feared to have taken Lauren Hall, 20, from her home “against her will,” the Wilkes Cou… [+746 chars]"},{"source":{"id":null,"name":"Wbaltv.com"},"author":null,"title":"Tornado watch in effect in Maryland - WBAL TV Baltimore","description":"Tornado watch in effect in Maryland WBAL TV Baltimore Tornado watch issued for southwest, central Virginia WSLS 10 Virginia family finds American flag still flying in tornado wreckage WTVR CBS 6 News Tornado warning issued for western York County as storm bar…","url":"https://www.wbaltv.com/article/severe-storms-maryland-weather-april-19/27206229","urlToImage":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/tornado-watch-1555692685.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*","publishedAt":"2019-04-19T18:38:00Z","content":"BALTIMORE —Maryland is under an elevated risk for severe storms Friday with a tornado watch in effect until midnight.\r\nGet Alerts | Radar | Forecast\r\nAs of 2 p.m., storms in Virginia and Maryland were moving north-northeast at about 30 mph. They will produce … [+946 chars]"},{"source":{"id":null,"name":"Hickoryrecord.com"},"author":"Emily Willis ewillis@hickoryrecord.com","title":"Tornado watch issued for Catawba County; flooding, winds also a concern - Hickory Daily Record","description":"Tornado watch issued for Catawba County; flooding, winds also a concern Hickory Daily Record Storm destroys 2 homes in Franklin County Roanoke Times Tornado watch continues for Upstate, Piedmont, North Carolina as severe storms move through region WYFF News 4…","url":"https://www.hickoryrecord.com/news/tornado-watch-issued-for-catawba-county-flooding-winds-also-a/article_54d5a336-62c2-11e9-ab8f-cbb531b621ad.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/hickoryrecord.com/content/tncms/assets/v3/editorial/5/4d/54d5a336-62c2-11e9-ab8f-cbb531b621ad/5cb9fb9815105.preview.jpg?crop=1678%2C944%2C0%2C145&resize=1120%2C630&order=crop%2Cresize","publishedAt":"2019-04-19T16:43:00Z","content":"The National Weather Service issued a tornado watch for Catawba County and surrounding areas until 5 p.m. today.\r\nScotty Powell, meteorologist with Carolina Weather Group, said damaging winds and flash flooding is the main concern for the Catawba Valley area.… [+480 chars]"},{"source":{"id":null,"name":"Spectrumlocalnews.com"},"author":null,"title":"Severe Storms Appear Likely for Friday - Spectrum News","description":"Severe Storms Appear Likely for Friday Spectrum News Storms kill 2 in Mississippi, 1 in Alabama AL.com WEATHER ALERT DAY: Severe thunderstorms with damaging wind gusts; isolated tornadoes possible WBTW - Myrtle Beach and Florence SC Storms batter South, kill …","url":"https://spectrumlocalnews.com/nc/triangle-sandhills/news/2019/04/18/severe-storms-appear-likely-for-friday","urlToImage":"https://s7d2.scene7.com/is/image/TWCNews/1031_nc_storm_clouds_weather_2","publishedAt":"2019-04-19T00:00:00Z","content":"Thursday could be the calm before a stormy Friday across North Carolina.\r\nWhile you enjoy another warm day with highs in the low 80s, take some time Thursday to make sure you are prepared for Friday's severe weather threat.  You will want a plan of where you … [+2228 chars]"},{"source":{"id":null,"name":"Wral.com"},"author":"WRAL","title":"Deadly storms roll in today; some schools to close early - WRAL.com","description":"The U.S. Storm Prediction Center upgraded the Triangle's threat for severe weather on Friday to a level 4 of 5, which means the area is at a major risk for severe thunderstorms, particularly in the evening. Residents should prepare for tornadoes and wind dama…","url":"https://www.wral.com/the-latest-tornado-warnings-expire-for-vance-warren-granville-and-franklin-counties/18335574/","urlToImage":"https://wwwcache.wral.com/asset/news/local/2019/04/19/18335582/25303-severe1-DMID1-5iinkhf57-640x480.jpg","publishedAt":"2019-04-19T08:24:00Z","content":"By Elizabeth Gardner, WRAL meteorologist\r\nRaleigh, N.C. — LATEST DEVELOPMENTS:\r\nEntire Triangle area under Level 4 risk for severe weather that extends until 11 p.m. Friday.\r\nSeveral counties are under a tornado watch, including Alamance, Chatham, Durham, Har… [+2967 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Associated Press","title":"The Latest: Storm topples tree, kills girl in Florida - Fox News","description":"The Latest: Storm topples tree, kills girl in Florida Fox News The Latest on severe weather in the South (all times local): 9:40 a.m.. View full coverage on Google News","url":"https://www.foxnews.com/us/the-latest-storm-topples-tree-kills-girl-in-florida","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-715214aa0f614406ae9be93479029bdb.png","publishedAt":"2019-04-19T13:57:39Z","content":"ATLANTA The Latest on severe weather in the South (all times local):\r\n1:40 p.m.\r\nA storm system moving through the South is being blamed for the death of an 8-year-old girl in Florida.\r\nThe Leon County Sheriff's Office says a tree fell Friday into a house in … [+3995 chars]"},{"source":{"id":null,"name":"Newsobserver.com"},"author":"Drew Jackson","title":"Storms bring winds, tornadoes Friday to the Triangle - Raleigh News & Observer","description":"Storms bring winds, tornadoes Friday to the Triangle Raleigh News & Observer Storm destroys 2 homes in Franklin County Roanoke Times Tornado watch in effect in Maryland WBAL TV Baltimore Multiple reports of damage in Franklin County after tornado hits Richmon…","url":"https://www.newsobserver.com/news/local/article229455119.html","urlToImage":"https://cf-images.us-east-1.prod.boltdns.net/v1/static/5615998031001/96ad2c05-d4fb-4440-bcf3-461c1838ba26/e7259da4-e8b6-424b-bf9e-732e2c3f2f79/1280x720/match/image.jpg","publishedAt":"2019-04-19T12:01:00Z","content":"Tornado reported in Hillsborough; power outages around the Triangle\r\n×\r\nSevere weather toppled trees surrounding the house of Rep. Graig Meyer in the White Cross community near Chapel Hill, NC Friday afternoon, April 19, 2019. Amazingly, no trees hit the hous… [+4613 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"JOHN BOYER Richmond Times-Dispatch","title":"Severe storms on the way to the Richmond area this evening; tornado watch in effect until midnight - Richmond.com","description":"Severe storms on the way to the Richmond area this evening; tornado watch in effect until midnight Richmond.com LIVE: At least five fatalities confirmed as severe outbreak brings tornadoes, flooding from Florida to Virginia AccuWeather.com The Latest: Mississ…","url":"https://www.richmond.com/weather/storms-will-bring-widespread-heavy-rain-isolated-tornadoes-to-central/article_8b880d5f-bb86-502f-a004-ed6532a9e04c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/0/5e/05e74de6-608d-590a-977c-5bd61fd67476/5cba4d1a2bc22.image.png?resize=920%2C505","publishedAt":"2019-04-19T21:55:00Z","content":"Conditions are favorable for severe storms with damaging winds, brief tornadoes and flash flooding across Virginia this evening.\r\nReview your weather safety plan and be sure you can receive any warnings issued by the National Weather Service.\r\n6:45 p.m. updat… [+2397 chars]"},{"source":{"id":null,"name":"Ajc.com"},"author":"Chelsea Prince","title":"LIVE UPDATES: Another wave of severe weather moving across the Eastside - Atlanta Journal Constitution","description":"LIVE UPDATES: Another wave of severe weather moving across the Eastside Atlanta Journal Constitution UPDATES: Tornado warning for Fulton County, Gwinnett County and southern Forsyth County 11Alive COUNTY-BY-COUNTY: Damage after line of strong storms moves thr…","url":"https://www.ajc.com/weather/weather-alert-tornado-warning-issued-for-metro-atlanta-counties/Ev4d2UBepC8EAUZGFVAZcN/","urlToImage":"https://www.ajc.com/rf/image_large/Pub/p10/WSBTV/2019/04/19/Videos/4638489.vpx","publishedAt":"2019-04-19T13:18:45Z","content":"North Georgia is waking up to heavy rain, severe thunderstorms and lots of traffic problems Friday morning.\r\nMultiple counties have been under tornado warnings, and Channel 2 Action News meteorologist Brian Monahan said the atmosphere is right at any time for… [+14018 chars]"},{"source":{"id":null,"name":"Weather.com"},"author":"","title":"Severe Weather Kills 3 as Tornadoes, Thunderstorms March Across South - The Weather Channel","description":"Severe Weather Kills 3 as Tornadoes, Thunderstorms March Across South The Weather Channel The latest impacts from a line of strong thunderstorms moving across the southern United States. View full coverage on Google News","url":"https://weather.com/news/news/2019-04-19-tornadoes-storms-deaths-south-mississippi-alabama","urlToImage":"https://s.w-x.co/damage_24.jpg","publishedAt":"2019-04-19T10:55:19Z","content":"At a Glance\r\nTwo people died in Mississippi, where nine tornadoes were reported.\r\nAn Alabama woman died after a tree fell on her home.\r\nDelta Airlines is allowing passengers flying through several major airports in the northeast on Friday to change their tick… [+4502 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Rachel Kleinman","title":"Nancy Pelosi plans Monday meeting on Mueller report: 'Congress will not be silent' - AOL","description":"Nancy Pelosi plans Monday meeting on Mueller report: 'Congress will not be silent' AOL Mueller Hands Dems a Gift and They're Already Fumbling It The Daily Beast Alexandria Ocasio-Cortez, George Conway Back Impeachment Proceedings Against Trump As #ImpeachTrum…","url":"https://www.aol.com/article/news/2019/04/19/nancy-pelosi-plans-monday-meeting-on-mueller-report-congress-will-not-be-silent/23714400/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2734x1792+0+399/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2F43a504f0-6298-11e9-bf07-23f8dfd13ecc","publishedAt":"2019-04-19T11:43:28Z","content":"House Speaker Nancy Pelosi (D-Calif.) organized a meeting with House Democrats scheduled after the Easter weekend to discuss what to do next in response to the release of Robert Muellers long-awaited redacted report.\r\nPelosi asked for the conference call to t… [+13016 chars]"},{"source":{"id":null,"name":"Bikeexif.com"},"author":"Chris Hunter","title":"Bodacious: An 80s style Iron 1200 from Prism Supply Co.","description":"Despite being steeped in the custom scene, Harley-Davidson doesn’t often donate bikes to custom builders. So this Sportster Iron 1200 from Prism Supply Co., dripping with early 80s style, is something of a rarity. It’s a Sporty with an impeccable pedigree: br…","url":"http://www.bikeexif.com/iron-1200-sportster-prism-supply","urlToImage":"http://kickstart.bikeexif.com/wp-content/uploads/2019/04/fb-15.jpg","publishedAt":"2019-04-19T17:01:23Z","content":"Despite being steeped in the custom scene, Harley-Davidson doesn’t often donate bikes to custom builders. So this Sportster Iron 1200 from Prism Supply Co., dripping with early 80s style, is something of a rarity.\r\nIt’s a Sporty with an impeccable pedigree: b… [+4172 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"University of North Carolina women's basketball coach Sylvia Hatchell resigns - Yahoo Sports","description":"University of North Carolina women's basketball coach Sylvia Hatchell resigns Yahoo Sports UNC woman's basketball coach Sylvia Hatchell resigns over 'racially insensitive' comments NBCNews.com 'The game has changed' - Chiney Ogwumike on Sylvia Hatchell resign…","url":"https://sports.yahoo.com/unc-womens-basketball-coach-sylvia-hatchell-resigns-following-internal-review-044109796.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/OquQvvKzcGg8VjsYqRs4Kw--~B/aD0zMjQzO3c9NDcwNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cb94f82240000df01044d0d.jpeg","publishedAt":"2019-04-19T04:41:00Z","content":"University of North Carolinas womens basketball coach Sylvia Hatchell has resigned following an internal review that determined the program needed to be taken in a new direction.\r\nBig news from UNC - Sylvia Hatchell resigns as UNC Womens Basketball coach afte… [+4094 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"","title":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up - CBS Sports","description":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up CBS Sports Five NFL General Managers Under the Most Pressure on Draft Day Sports Illustrated 2019 NFL Draft: late-round targets who are just as good as early-round prosp…","url":"https://www.cbssports.com/nfl/news/2019-nfl-draft-the-24-prospects-who-are-locks-for-the-first-round-plus-a-look-at-the-next-guys-up/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/19/dadb3583-ec12-4d9c-80bc-7dffe95d12a6/thumbnail/770x433/9dc26e1b036a62e0e201173f8b6f21cc/irv.jpg","publishedAt":"2019-04-19T14:15:00Z","content":"In most years, there are about 20-24 players in a draft who represent a safe bet to be first-round picks. The exact number can certainly vary by the year, but you can usually identify 75 percent of the players who will eventually comprise the top 32 picks.\r\nT… [+6291 chars]"},{"source":{"id":null,"name":"Shorpy.com"},"author":"Dave","title":"Kennon's Cafe: 1939","description":"November 1939. \"Cafe next to tobacco warehouse. Mebane, Orange County, North Carolina.\" Medium format negative by Marion Post Wolcott. View full size.","url":"https://www.shorpy.com/node/24561?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+shorpy+%28Shorpy+-+The+100-Year-Old+Photo+Blog%29","urlToImage":"https://www.shorpy.com/files/images/SHORPY-8c11277a.preview.jpg","publishedAt":"2019-04-19T17:06:34Z","content":"Our holdings include hundreds of glass and film negatives/transparencies that we've scanned ourselves; in addition, many other photos on this site were extracted from reference images (high-resolution tiffs) in the Library of Congress research archive. (To qu… [+479 chars]"},{"source":{"id":null,"name":"Shorpy.com"},"author":"Dave","title":"Owen's Warehouse: 1939","description":"November 1939. \"Tobacco warehouse during auction sales in Oxford, Granville County, North Carolina.\" Photo by Marion Post Wolcott. View full size.","url":"https://www.shorpy.com/node/24562?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+shorpy+%28Shorpy+-+The+100-Year-Old+Photo+Blog%29","urlToImage":"https://www.shorpy.com/files/images/SHORPY-8c11184a1.preview.jpg","publishedAt":"2019-04-19T18:32:47Z","content":"Our holdings include hundreds of glass and film negatives/transparencies that we've scanned ourselves; in addition, many other photos on this site were extracted from reference images (high-resolution tiffs) in the Library of Congress research archive. (To qu… [+479 chars]"},{"source":{"id":null,"name":"Shorpy.com"},"author":"Dave","title":"Smokes-N-Cokes: 1939","description":"September 1939. \"Students on steps of building between classes. University of North Carolina, Chapel Hill, Orange County.\" Medium format negative by Marion Post Wolcott for the Farm Security Administration. View full size.","url":"https://www.shorpy.com/node/24560?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+shorpy+%28Shorpy+-+The+100-Year-Old+Photo+Blog%29","urlToImage":"https://www.shorpy.com/files/images/SHORPY-8c11122a.preview.jpg","publishedAt":"2019-04-19T05:26:45Z","content":"Our holdings include hundreds of glass and film negatives/transparencies that we've scanned ourselves; in addition, many other photos on this site were extracted from reference images (high-resolution tiffs) in the Library of Congress research archive. (To qu… [+479 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"UNC's Hatchell resigns after findings from program review","description":"UNC's Hatchell resigns after findings from program review","url":"https://www.foxsports.com/wnba/story/unc-s-hatchell-resigns-after-findings-from-program-review-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T04:41:45Z","content":"RALEIGH, N.C. (AP) — North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made “racially insensitive” comments and applied “undue influence” regarding players’ ability to compete through medical issues.\r\n… [+625 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Vikings will look to address O-line needs in draft","description":"With the offensive line still in flux, the Minnesota Vikings have a clear need to address yet again in NFL draft","url":"https://www.foxsports.com/north/story/minnesota-vikings-will-look-to-address-o-line-needs-through-draft-kirk-cousins-adam-thielen-stefon-diggs-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/274fe79e312543aa85d8914a36d0671f.vresize.1200.630.high.51.jpg","publishedAt":"2019-04-19T17:06:17Z","content":"MINNEAPOLIS The Minnesota Vikings will be constructing a new front five yet again this year.\r\nPerhaps this will be the spring they can finally plant a couple of seeds for stability.\r\nThe Vikings have consistently fielded one of the NFL’s best defenses since c… [+6106 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Associated Press","title":"UNC woman's basketball coach resigns over 'racially insensitive' comments","description":"North Carolina women's basketball coach Sylvia Hatchell had built a Hall of Fame career over more than three decades with the Tar Heels.","url":"https://www.nbcnews.com/news/sports/unc-woman-s-basketball-coach-sylvia-hatchell-resigns-over-racially-n996256","urlToImage":"https://media3.s-nbcnews.com/j/newscms/2019_14/2807156/190402-sylvia-hatchell-mc-1146_7397a9b3d8d6213b718c5a7a52677095.nbcnews-fp-1200-630.JPG","publishedAt":"2019-04-19T11:46:00Z","content":"Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\r\nSUBSCRIBE\r\nApril 19, 2019, 11:46 AM GMT\r\nRALEIGH, N.C. North Carolina women's basketball coach Sylvia Hatchell had built a Hall of Fame career over mo… [+4041 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Jimmy Im, CNBC","title":"These are the 10 best places to live in the U.S. in 2019","description":"When it comes to value for the money, strong job markets, quality of life and being desirable places to live, these American cities come out on top, according to U.S. News & World Report.","url":"https://www.nbcnews.com/better/lifestyle/these-are-10-best-places-live-us-2019-ncna996331","urlToImage":"https://media1.s-nbcnews.com/j/newscms/2019_16/2433616/180515-austin-texas-skyline-2016-ac-513p_79e83dae95266af38e4f85e6ee0b663d.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-19T14:06:00Z","content":"Get the Better newsletter.\r\nSUBSCRIBE\r\nApril 19, 2019, 2:06 PM GMT\r\nAustin, Texas is the No. 1 place to live in America for 2019, according to U.S. News &amp; World Reports 125 Best Places to Live in the USA.\r\nFor the second year in a row Austin tops the list… [+2600 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Courtney Kube and Mosheh Gains","title":"Hidden camera found in women's bathroom aboard Navy ship","description":"A female Marine reported finding the device, said an official, who said the device could record images but did not specify whether that meant stills or video.","url":"https://www.nbcnews.com/news/military/hidden-camera-found-women-s-bathroom-aboard-navy-ship-n996446","urlToImage":"https://media1.s-nbcnews.com/j/newscms/2019_16/2827836/190419-uss-arlington-al-1141_bcc8af83581b678638eb6e3462fab71b.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-19T19:55:00Z","content":"Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\r\nSUBSCRIBE\r\nApril 19, 2019, 7:55 PM GMT\r\nBy Courtney Kube and Mosheh Gains\r\nWASHINGTON The U.S. Navy is investigating a report that a female Marine fou… [+1531 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Ronda Racha Penrice","title":"Beyoncé's 'Homecoming' is a crash course in black excellence","description":"Beyoncé’s 'Homecoming' on Netflix, a documentary of her historic Beychella Coachella performance, is a win for black culture and a celebration of HBCU greatness","url":"https://www.nbcnews.com/think/opinion/beyonc-s-homecoming-netflix-ode-black-culture-hbcu-greatness-ncna996116","urlToImage":"https://media2.s-nbcnews.com/j/newscms/2019_16/2826771/190418-homecoming-beyonce-1-cs-111p_105114eac9698c1436eb6725911ef8ad.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-19T15:01:00Z","content":"Get the Think newsletter.\r\nSUBSCRIBE\r\nApril 19, 2019, 3:01 PM GMT\r\nWhen I decided to do Coachella, instead of me pulling out my flower crown, it was more important that I brought our culture to Coachella, Beyoncé shares more than 30 minutes into Homecoming, h… [+5271 chars]"},{"source":{"id":null,"name":"Yellowjackedup.com"},"author":"Dylan Callaghan-Croley","title":"Georgia Tech Baseball: Jacket drop series opener to Virginia Tech - Yellow Jacked Up","description":"Georgia Tech Baseball: Jacket drop series opener to Virginia Tech Yellow Jacked Up The Georgia Tech baseball team dropped their third straight series opener on Thursday, this time to the Virginia Tech Hokies.","url":"https://yellowjackedup.com/2019/04/19/georgia-tech-baseball-jacket-drop-series-opener-to-virginia-tech/","urlToImage":"https://imagesvc.timeincapp.com/v3/fan/image?url=https://yellowjackedup.com/wp-content/uploads/getty-images/2017/07/271478.jpeg&","publishedAt":"2019-04-19T16:07:30Z","content":"Georgia Tech baseball narrowly fell to the Virginia Tech Hokies on Thursday night in the first game of their three-game series over the holiday weekend. Xzavion Curry picked up his second loss of the season despite giving just three runs on the evening. The l… [+1539 chars]"},{"source":{"id":null,"name":"Ramblinwreck.com"},"author":null,"title":"Tech Takes Commanding Lead at ACC Golf Championship - Georgia Tech Official Athletic Site","description":"Tech Takes Commanding Lead at ACC Golf Championship Georgia Tech Official Athletic Site No. 8 Yellow Jackets lead by 17 shots after 36 holes, Andy Ogletree on top of individual leaderboard.","url":"https://ramblinwreck.com/tech-takes-commanding-lead-at-acc-golf-championship/","urlToImage":"https://ramblinwreck.com/amt-media/332631","publishedAt":"2019-04-19T01:01:46Z","content":"Pairings and Live Scoring via Golfstat  |  Watch Online Saturday (1 p.m.)  |  Coach Heppler post-round audio\r\nNew London, N.C. Andy Ogletree fired rounds of 66 and 65 Thursday to take the individual lead and lift No. 8 Georgia Tech to a commanding 17-stroke a… [+3878 chars]"},{"source":{"id":null,"name":"Techlunchpail.com"},"author":"Tim Thomas","title":"Virginia Tech Hosting Former Wofford Commit Hunter Cattoor on a Visit - Tech Lunch Pail","description":"Virginia Tech Hosting Former Wofford Commit Hunter Cattoor on a Visit Tech Lunch Pail Virginia Tech is hosting former Wofford commit Hunter Cattoor on an official visit this weekend. The 6'3'' combo guard has been released from his NLI.","url":"https://techlunchpail.com/2019/04/19/virginia-tech-hosting-former-wofford-hunter-cattoor-official-visit/","urlToImage":"https://techlunchpail.com/wp-content/uploads/2019/04/VT-Students-Miami-1-1024x683.jpg","publishedAt":"2019-04-19T06:00:00Z","content":"Former Wofford signee and 6’3” guard Hunter Cattoor is taking an official visit to Virginia Tech this weekend after the Hokies recently offered the former Terriers’ commit.\r\nThe Orlando, FL native received his release from the Terriers last week and arrived i… [+2444 chars]"},{"source":{"id":null,"name":"Dailypress.com"},"author":"Daily Press","title":"Thursday's regional sports roundup and results: Hokies upend No. 11 Georgia Tech in baseball - Daily Press","description":"Thursday's regional sports roundup and results: Hokies upend No. 11 Georgia Tech in baseball Daily Press Tanner Thomas' two-run home run in the sixth inning lifted Virginia Tech (22-16, 7-12) to a 3-2 victory over No. 11 Georgia Tech in an Atlantic Coast Conf…","url":"https://www.dailypress.com/sports/dp-spt-virginia-sports-roundup-20190419-story.html","urlToImage":"https://www.trbimg.com/img-544e4b85/turbine/dp-daily-press-default-fb-icon","publishedAt":"2019-04-19T04:20:00Z","content":"Tanner Thomas' two-run home run in the sixth inning lifted Virginia Tech (22-16, 7-12) to a 3-2 victory over No. 11 Georgia Tech in an Atlantic Coast Conference baseball series opener Thursday in Blacksburg.\r\nThe Hokies' bullpen, which tossed a combined 4 2/3… [+7389 chars]"},{"source":{"id":null,"name":"Jhu.edu"},"author":null,"title":"Big tech, China, and the new age of activism: A conversation with Zeynep Tufekci and Alec Ross - The Hub at Johns Hopkins","description":"Big tech, China, and the new age of activism: A conversation with Zeynep Tufekci and Alec Ross The Hub at Johns Hopkins Zeynep Tufekci and Alec Ross discuss the complex intersection of technology and democracy at event hosted by SNF Agora Institute.","url":"https://hub.jhu.edu/2019/04/19/tufekci-ross-democracy-dialogues/","urlToImage":"https://api.hub.jhu.edu/factory/sites/default/files/styles/hub_thumbnail/public/2_democracy_dialogues_041819.jpg?itok=r3v1pYMU","publishedAt":"2019-04-19T18:00:00Z","content":"For a sense of where technology may be taking us, many social commentators are looking to present-day China, where surveillance cameras line the streets, facial recognition scanners help catch criminals, and the government is assigning each individual a \"soci… [+4514 chars]"},{"source":{"id":null,"name":"Sportswar.com"},"author":"Jake Lyman","title":"Virginia Tech Softball Ready for Big Series With UNC - TechSideline.com","description":"Virginia Tech Softball Ready for Big Series With UNC TechSideline.com Virginia Tech's softball team has experienced a historic rebirth this season, as the Hokies have the best record in the ACC.","url":"https://virginiatech.sportswar.com/article/2019/04/19/virginia-tech-softball-ready-for-unc/","urlToImage":"https://virginiatech.sportswar.com/wp-content/uploads/sites/15/2019/04/darby_trull_softball-1.jpg","publishedAt":"2019-04-19T10:32:00Z","content":"Darby Trull has been one of the ACC’s best hitters this season. (Photo by Virginia Tech)\r\nVirginia Techs softball team has experienced a historic rebirth this season. First-year head coach Pete DAmour has led the team to the best start in program history with… [+4288 chars]"},{"source":{"id":null,"name":"Juancole.com"},"author":"Belle Chesler","title":"De-Funding the Great American School System for the 1%","description":"(Tomdispatch.com) - Three weeks ago, I sat in a cramped conference room in the large public high school where I teach in Beaverton, Oregon. I was listening to the principal deliver a scripted PowerPoint presentation on the $35 million budget deficit our distr…","url":"https://www.juancole.com/2019/04/funding-american-school.html","urlToImage":"https://www.juancole.com/images/2019/04/de-funding-the-great-american-sc.jpg","publishedAt":"2019-04-19T04:07:58Z","content":"(Tomdispatch.com) – Three weeks ago, I sat in a cramped conference room in the large public high school where I teach in Beaverton, Oregon. I was listening to the principal deliver a scripted PowerPoint presentation on the $35 million budget deficit our distr… [+13647 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Thursday Sports in Brief","description":"Thursday Sports in Brief","url":"https://www.foxsports.com/other/story/thursday-sports-in-brief-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T07:14:35Z","content":"COLLEGE BASKETBALL\r\nRALEIGH, N.C. (AP) — North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made “racially insensitive” comments and applied “undue influence” regarding players’ ability to compete throu… [+6475 chars]"},{"source":{"id":null,"name":"Thestranger.com"},"author":"Katie Herzog","title":"Human Composting Bill Passes in Washington State","description":"Washington will likely be the first state to legalize this form of body disposal. by Katie Herzog An artist rendering of the future Recompose Seattle Katrina Spade Some excellent news for people who want to be composted came down from Olympia Friday when the …","url":"https://www.thestranger.com/slog/2019/04/19/39962696/human-composting-bill-passes-in-washington-state","urlToImage":"https://media2.fdncms.com/stranger/imager/u/original/39963093/1555701018-1546550746-img_2169.jpeg","publishedAt":"2019-04-19T19:33:41Z","content":"Some excellent news for people who want to be composted came down from Olympia Friday when the Legislature passed Senate Bill 5001, which could change the future of after-death care in Washington state.\"I am over the moon!\" Katrina Spade says about the bill's… [+3102 chars]"},{"source":{"id":null,"name":"Chiefs.com"},"author":null,"title":"Mock Draft Round-Up: Who Do the Experts Have the Chiefs Taking in the First Round? - chiefs.com","description":"Mock Draft Round-Up: Who Do the Experts Have the Chiefs Taking in the First Round? chiefs.com Will the Giants select a quarterback in Round 1? Let’s read the tea leaves Big Blue View Are the Giants looking to trade for Josh Rosen instead of drafting a QB? | G…","url":"https://www.chiefs.com/news/mock-draft-round-up-who-do-the-experts-have-the-chiefs-taking-in-the-first-round","urlToImage":"https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/chiefs/i3r4gs8zmghimgvhyqkb","publishedAt":"2019-04-19T13:20:30Z","content":"ESPN.com analyst Todd McShay also forecasted a defensive back to Kansas City in his latest mock draft, tabbing LSU cornerback Greedy Williams as the Chiefs' pick at No. 29.\r\nThe six-foot-two Williams put together a decorated collegiate career in Baton Rouge, … [+929 chars]"},{"source":{"id":null,"name":"Goodmenproject.com"},"author":"The Conversation US","title":"How Columbine Became a Blueprint for School Shooters","description":"Columbine’s influence continues until this day The post How Columbine Became a Blueprint for School Shooters appeared first on The Good Men Project.","url":"https://goodmenproject.com/health/how-columbine-became-a-blueprint-for-school-shooters/","urlToImage":"https://goodmenproject.com/wp-content/uploads/2019/04/shutterstock_157664345.jpg","publishedAt":"2019-04-19T05:00:30Z","content":"Jillian Peterson, Hamline University and James Densley, Metropolitan State University \r\nWhen 12 students and one teacher were killed in Littleton, Colorado, 20 years ago, it not only became what at the time was the worst high school shooting in U.S. history. … [+7079 chars]"},{"source":{"id":null,"name":"Kdnuggets.com"},"author":"Matt Mayo Editor","title":"Data Driven Government Workshops Announced!","description":"The workshops have been announced for Data Driven Government (formerly known as Predictive Analytics World for Government), Sep 25 in Washington, DC. Use the code KDNUGGETS for a 15% discount on your Deep Learning World ticket.","url":"https://www.kdnuggets.com/2019/04/paw-data-driven-government-workshops-announced.html","urlToImage":null,"publishedAt":"2019-04-19T17:29:47Z","content":"Workshops announced!\r\nThe workshops have been announced for Data Driven Government! Formerly known as Predictive Analytics World for Government, this premier conference covers the emerging trends and best practices of how government agencies (at both Federal,… [+6535 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1968 Datsun 2000 Roadster","description":"This 1968 Datsun 2000 Roadster was sold new at Holiday Imports in Durham, North Carolina, and stayed in Central North Carolina until being acquired by the seller as a restoration project approximately five years ago. The car was refinished in green with a tan…","url":"https://bringatrailer.com/listing/1968-datsun-2000-roadster-10/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/03/1968_datsun_2000_roadster_15541634843b37ba7d31-exterior1_46771671444_o-e1555430704875.jpg","publishedAt":"2019-04-19T17:20:17Z","content":"This 1968 Datsun 2000 Roadster was sold new at Holiday Imports in Durham, North Carolina, and stayed in Central North Carolina until being acquired by the seller as a restoration project approximately five years ago. The car was refinished in green with a tan… [+2441 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 38k-Mile 1999 Mercedes-Benz S320 at No Reserve","description":"This 1999 Mercedes-Benz S320 shows just 38k miles and is finished in Smoke Silver Metallic over Parchment leather. Power comes from a 3.2L inline-six paired with a 5-speed automatic transmission. The car was recently acquired by the seller, and subsequent ser…","url":"https://bringatrailer.com/listing/1999-mercedes-benz-s-320-2/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/1999_mercedes-benz_s_320_15556205747401f0611b9IMG_3356.jpg","publishedAt":"2019-04-19T03:40:14Z","content":"This 1999 Mercedes-Benz S320 shows just 38k miles and is finished in Smoke Silver Metallic over Parchment leather. Power comes from a 3.2L inline-six paired with a 5-speed automatic transmission. The car was recently acquired by the seller, and subsequent ser… [+1825 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 35k-Mile 1995 Porsche 911 Carrera Coupe 6-Speed","description":"This 1995 Porsche 911 Carrera coupe was sold new by Putnam Imports in Elkhart, Indiana and stayed with its original owner until the current owner's purchase in October 2014. The car is finished in Polar Silver Metallic over over Midnight Blue partial leather …","url":"https://bringatrailer.com/listing/1995-porsche-911-carrera-47/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/02/1995_porsche_911_carrera_155449770193c1c474674751f9DSC08387.jpg","publishedAt":"2019-04-19T15:30:03Z","content":"This 1995 Porsche 911 Carrera coupe was sold new by Putnam Imports in Elkhart, Indiana and stayed with its original owner until the current owner’s purchase in October 2014. The car is finished in Polar Silver Metallic over over Midnight Blue partial leather … [+2768 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Lisa Rapaport","title":"Higher state minimum wage tied to lower suicide rates","description":"(Reuters Health) - Suicide rates grow more slowly in states that increase their minimum wage, according to a U.S. study that suggests this might be one strategy for curbing deaths by suicide.","url":"https://www.reuters.com/article/us-health-suicide-wages-idUSKCN1RV17R","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2019-04-19T19:35:07Z","content":"(Reuters Health) - Suicide rates grow more slowly in states that increase their minimum wage, according to a U.S. study that suggests this might be one strategy for curbing deaths by suicide. \r\nAlthough a small proportion of the population works for minimum w… [+3369 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Lisa Rapaport","title":"Older people feel more youthful when they also feel in control","description":"(Reuters Health) - Older adults may feel younger than their age on days when they feel most in control of their lives, a small study suggests.","url":"https://www.reuters.com/article/us-health-aging-control-idUSKCN1RV0YA","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2019-04-19T14:40:14Z","content":"(Reuters Health) - Older adults may feel younger than their age on days when they feel most in control of their lives, a small study suggests. \r\nPeople who believe they can influence the outcomes and events in their daily lives generally do feel a greater sen… [+2920 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Omar Villafranca","title":"4 dead as powerful storm system rips through the South","description":"The storm system stretches from Florida to New England","url":"https://www.cbsnews.com/news/deadly-storm-flash-flooding-southern-states-forecast-latest-updates-today-2019-04-19/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/19/23dacf75-4963-4f41-8883-3836807dcb53/thumbnail/1200x630/abf5d74839ecad7a7667738a9520b7fc/a12-villafranca-deadly-tornadoes-011919-aircut-frame-70.jpg","publishedAt":"2019-04-19T22:30:18Z","content":"A violent weekend storm has already created a wave of problems ahead of the holiday weekend. Flash flooding and damaging winds were reported in North and South Carolina. Tornado watches and warnings are up into Virginia. \r\nThe system stretches from Florida to… [+1023 chars]"},{"source":{"id":null,"name":"Wralsportsfan.com"},"author":"WRAL","title":"Sylvia Hatchell resigns as UNC women's basketball coach - WRALSportsFan.com","description":"Sylvia Hatchell resigns as UNC women's basketball coach WRALSportsFan.com UNC women's basketball coach Sylvia Hatchell resigns following internal review Yahoo Sports North Carolina Coach Sylvia Hatchell Resigns After Investigation The New York Times North Car…","url":"https://www.wralsportsfan.com/sylvia-hatchell-resigns-as-unc-womens-basketball-coach/18335371/","urlToImage":"https://wwwcache.wralsportsfan.com/asset/colleges/2018/02/25/17372907/UNC-at-Duke-WBB-25-Feb-0838-DMID1-5iijw4rsj-640x480.jpg","publishedAt":"2019-04-19T04:29:00Z","content":"Chapel Hill, N.C. — After an investigation by a Charlotte law firm found \"widespread support for\" allegations of racially insensitive comments and pressure to play through injury, Sylvia Hatchell resigned on Thursday as head coach of the University of North C… [+2878 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Adrian Higgins, Adrian Higgins","title":"Florist makes business nursing ailing orchids back to health","description":"People pay Art Chadwick a sizeable fee to care for their precious orchids, Adrian Higgins finds","url":"https://www.independent.co.uk/property/gardening/florist-orchids-business-gardening-a8865566.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/11/16/cattelya.jpg","publishedAt":"2019-04-19T14:30:43Z","content":"Even within Richmond, Virginias redbrick historic neighbourhood known as the Museum District, Art Chadwicks flower shop seems like a quaint throwback to an earlier time. A bell chimes as you open the door, and fans swirl below a pressed-tin ceiling. Cymbidium… [+12935 chars]"},{"source":{"id":null,"name":"Dailysignal.com"},"author":"Katrina Trinko","title":"Mueller Report Proves Russian Collusion Claim Is a Hoax","description":"The Heritage Foundation’s Hans von Spakovsky analyzes the redacted report about the findings from special counsel Robert Mueller, and why it’s time to investigate why... Read More The post Mueller Report Proves Russian Collusion Claim Is a Hoax appeared first…","url":"https://www.dailysignal.com/2019/04/19/mueller-report-proves-russian-collusion-claim-is-a-hoax/","urlToImage":"https://www.dailysignal.com/wp-content/uploads/190418_trump.jpg","publishedAt":"2019-04-19T07:01:38Z","content":"The Heritage Foundation’s Hans von Spakovsky analyzes the redacted report about the findings from special counsel Robert Mueller, and why it’s time to investigate why President Donald Trump was ever suspected of collusion in the first place. Read the transcri… [+10366 chars]"},{"source":{"id":"msnbc","name":"MSNBC"},"author":"Steve Benen","title":"The Senate Intelligence Committee's GOP...","description":"Did the chairman of the Senate Intelligence Committee, investigating the Russia scandal, provide the White House with inside information on the investigation?","url":"http://www.msnbc.com/rachel-maddow-show/the-senate-intelligence-committees-gop-chair-has-some-explaining-do","urlToImage":"http://www.msnbc.com/sites/msnbc/files/styles/ratio--1_91-1--1200x630/public/ap116045350612.jpg?itok=sUt0wWhk","publishedAt":"2019-04-19T13:00:29Z","content":"It’s easy to forget that the Senate Intelligence Committee’s investigation into the Russia scandal is ongoing. The probe doesn’t generate a lot of attention or drama, but it’s been quietly proceeding in the background, and it’s likely the committee’s members … [+2784 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"ProFootball Talk on NBC Sports","title":"NFL VP regrets lengthy road odysseys for Raiders, Buccaneers","description":"Developing the 256-game regular season schedule in a fair and balanced fashion isn’t the easiest talk to accomplish each spring. When trying to account for stadium availability, broadcast partners, international games and other variables, random quirks can su…","url":"https://sports.yahoo.com/nfl-vp-regrets-lengthy-road-055211429.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/X0u93XV5b71PQsd8uE5l_Q--~B/aD0yNzE7dz00ODI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/profootballtalk.nbcsports.com/a568bb2df21767a1b2aa87d08f8be0df","publishedAt":"2019-04-19T05:52:11Z","content":"Developing the 256-game regular season schedule in a fair and balanced fashion isnt the easiest talk to accomplish each spring. When trying to account for stadium availability, broadcast partners, international games and other variables, random quirks can sur… [+1401 chars]"},{"source":{"id":null,"name":"Ninersnation.com"},"author":"Niners Nation","title":"NFL exec is already regretting some schedules","description":"If you read the comments when we wrote on the San Francisco 49ers 2019 schedule, you'd know fans are none too happy with the way things worked out. The 49ers have four road games with the dreaded 10:00 A.M. start times which can cause all sorts of issues with…","url":"https://www.ninersnation.com/2019/4/19/18507364/nfl-schedule-2019-redo-parity","urlToImage":"https://cdn.vox-cdn.com/thumbor/KFEBhstpa3YLURHndih-xlLBBuA=/0x0:2664x1395/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16177616/1074741746.jpg.jpg","publishedAt":"2019-04-19T17:32:00Z","content":"If you read the comments when we wrote on the San Francisco 49ers 2019 schedule, youd know fans are none too happy with the way things worked out. The 49ers have four road games with the dreaded 10:00 A.M. start times which can cause all sorts of issues with … [+2986 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Yahoo Sports","title":"NFL exec admits they already screwed up the schedule for Raiders and Bucs","description":"An NFL executive knows Raiders and Bucs fans have a legitimate gripe.","url":"https://sports.yahoo.com/nfl-exec-admits-they-already-screwed-up-the-schedule-for-raiders-and-bucs-172305320.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/UyLpEqSRwz493NqwuKcoyg--~B/aD0yMjAzO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cba01cd240000f102044d72.jpeg","publishedAt":"2019-04-19T17:23:05Z","content":"The NFL had a fun time unveiling the schedules for its 100th season, but it didnt soften the blow for those who felt they got the bad draw.\r\nOne NFL executive agrees, telling USA Today Sports if the league could do it over, it would tweak the Oakland Raiders … [+2626 chars]"},{"source":{"id":null,"name":"Oregonlive.com"},"author":"OregonLive.com","title":"Breaking down Seattle Seahawks' 2019 schedule","description":"Earlier this week, the NFL released the full schedule for the 2019 season. Based on the winning percentage of last season's opponents, the Seattle Seahawks face the eighth-easiest schedule in the league. Combined, opponents on the schedule for this season won…","url":"https://www.oregonlive.com/sports/2019/04/breaking-down-seattle-seahawks-2019-schedule.html","urlToImage":"https://www.oregonlive.com/resizer/zgPG8-dFHW9T5ZZUD0JDRMH65H0=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/KFDMIWSL4FAIFFRCKD3VAT5AZI.jpg","publishedAt":"2019-04-19T23:10:35Z","content":"Earlier this week, the NFL released the full schedule for the 2019 season. Based on the winning percentage of last seasons opponents, the Seattle Seahawks face the eighth-easiest schedule in the league.\r\nCombined, opponents on the schedule for this season won… [+6032 chars]"},{"source":{"id":null,"name":"Sportingnews.com"},"author":"Sporting News","title":"Who has the hardest NFL schedule in 2019? Strength of schedule for all 32 teams","description":"Each year, the release of the NFL regular-season schedule comes with surprises in terms of dates for each team's 16 games, and the order in which those games will fall on the schedule. What does not come as a surprise with the NFL schedule release, though, is…","url":"https://www.sportingnews.com/au/nfl/news/who-has-the-hardest-nfl-schedule-in-2019-strength-of-schedule-for-all-32-teams/mdhuqscrve3b17muemuvolhg6","urlToImage":"https://images.performgroup.com/di/library/sporting_news/e3/ce/carr-gruden-041619-getty-ftrjpg_u93cipyctbhn1mwwqpu5npq93.jpg?t=653014570&quality=100","publishedAt":"2019-04-19T13:24:35Z","content":"Each year, the release of the NFL regular-season schedule comes with surprises in terms of dates for each team's 16 games, and the order in which those games will fall on the schedule. What does not come as a surprise with the NFL schedule release, though, is… [+5237 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Pam Fessler","title":"Mueller Report Raises New Questions About Russia's Hacking Targets In 2016","description":"The special counsel's report said the FBI believes Russian military intelligence was able to gain access to at least one Florida county government's computer network during the 2016 campaign.","url":"https://www.npr.org/2019/04/19/714890832/mueller-report-raises-new-questions-about-russias-hacking-targets-in-2016","urlToImage":"https://media.npr.org/assets/img/2019/04/18/gettyimages-621758822_wide-c0f4957d35d11bbb7349ac16a7c6fc7ace3c78ec.jpg?s=1400","publishedAt":"2019-04-19T09:00:55Z","content":"Voters casting ballots at voting machines at a high school in North Las Vegas on Election Day, Nov. 8, 2016. The newly-released Mueller report detailed more about Russia's efforts to hack election-related systems.\r\nEthan Miller/Getty Images\r\nWhile the headlin… [+6138 chars]"},{"source":{"id":null,"name":"Thehollywoodgossip.com"},"author":"Ally Lewber","title":"Jenelle Evans Reveals The Scary Reason Why She Had An Ovary Removed!","description":"Jenelle Evans revealed why one of her ovaries was removed while she underwent a surgical procedure to tie her tubes. The \"Teen Mom 2\" star answered fan questions via her Instagram Stories on Wednesday, April 17, and opened up about her scary surgical experien…","url":"https://www.thehollywoodgossip.com/2019/04/jenelle-evans-the-scary-reason-why-she-had-an-ovary-removed/","urlToImage":"https://the-hollywood-gossip-res.cloudinary.com/iu/s--5Wb9_iyR--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1548254264/jenelle-evans-her-selfie.png","publishedAt":"2019-04-19T19:56:55Z","content":"The ovaries are an important part of the female reproductive system. Their job is what got Jenelle Evans a job on the MTV hit show Teen Mom 2. But now the 27-year-old is opening up about why one of her ovaries was recently removed while she underwent a surgic… [+2456 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Kevin Skiver","title":"College baseball: Watch UConn vs. No. 12 East Carolina on CBS Sports Digital","description":"ECU is looking to make a top 10 push","url":"https://www.cbssports.com/general/news/college-baseball-watch-uconn-vs-no-12-east-carolina-on-cbs-sports-digital/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/18/8027d86d-7b1a-4e13-8527-13909b7e72b8/thumbnail/770x433/a23ef786b823224f136cae5e02820bf9/ecu-base-evanodum2019.jpg","publishedAt":"2019-04-19T02:09:41Z","content":"It seems like both Carolinas have a very solid baseball presence, so it shouldn't be surprising to see East Carolina flirting with a top 10 spot in the country. No. 12 ECU is looking to continue its impressive start to the 2019 season with a series against Co… [+1354 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Kyle Boone","title":"UNC women's basketball coach Sylvia Hatchell resigns after investigation reveals 'racially insensitive' remarks","description":"Hatchell, a Hall-of-Famer, agreed to step down atfer a UNC-commissioned probe found problems with her conduct","url":"https://www.cbssports.com/college-basketball/news/unc-womens-basketball-coach-sylvia-hatchell-resigns-after-investigation-reveals-racially-insensitive-remarks/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/19/c0de944b-26e3-4301-b05b-1e1832f72ad8/thumbnail/770x433/9beb42f0839fab90c16b08803360b9ec/sylvia-hatchell.jpg","publishedAt":"2019-04-19T14:58:25Z","content":"Hall of Fame women's basketball coach Sylvia Hatchell submitted her resignation to North Carolina on Thursday after findings from a investigation revealed that she made racially insensitive remarks to her players and pressured some to play through injury. \r\nH… [+2613 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Kyle Boone","title":"Matthew Hurt, the No. 8 recruit in the nation, commits to Duke over Kansas, Kentucky and UNC","description":"By landing Hurt, the Blue Devils are poised to have the no. 1 recruiting class in the nation","url":"https://www.cbssports.com/college-basketball/news/matthew-hurt-the-no-8-recruit-in-the-nation-commits-to-duke-over-kansas-kentucky-and-unc/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/17/1b029104-28ec-4ab7-8291-2f11048e191f/thumbnail/770x433/37922452e0140d04beeaeda62080440b/usatsi-12407414.jpg","publishedAt":"2019-04-19T20:23:10Z","content":"Duke is poised to finish with the No. 1 recruiting class for a fourth consecutive cycle after adding five-star Matthew Hurt, the No. 8 overall prospect in the Class of 2019, to its recruiting class on Friday. Hurt chose the Blue Devils over Kansas, Kentucky a… [+1470 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Jason La Canfora","title":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up","description":"Irv Smith Jr. is among three tight ends that make the list, but it's light on defensive backs and wide receivers","url":"https://www.cbssports.com/nfl/news/2019-nfl-draft-these-24-prospects-are-first-round-locks-plus-a-look-at-the-next-guys-up/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/19/dadb3583-ec12-4d9c-80bc-7dffe95d12a6/thumbnail/770x433/9dc26e1b036a62e0e201173f8b6f21cc/irv.jpg","publishedAt":"2019-04-19T14:15:15Z","content":"Generally, there are about 20-24 players in a draft who seem a safe bet to go in the first round. It can certainly vary by the year, but you can usually identify three quarters of the players who will eventually comprise the top 32 picks.\r\nTrades and surprise… [+6013 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Honeywell to clean up chemical pollution in North Carolina","description":"RIEGELWOOD, N.C. (AP) — Federal authorities say they’ve reached a proposed settlement with two companies for the cleanup of a former chemical plant near the Cape Fear River. The Justice Department and the Environmental Protection Agency said in a news release…","url":"https://www.seattletimes.com/business/honeywell-to-clean-up-chemical-pollution-in-north-carolina/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-19T11:50:41Z","content":"RIEGELWOOD, N.C. (AP) Federal authorities say they’ve reached a proposed settlement with two companies for the cleanup of a former chemical plant near the Cape Fear River.\r\nThe Justice Department and the Environmental Protection Agency said in a news release … [+535 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"AARON BEARD","title":"UNC’s Hatchell resigns after findings from program review","description":"RALEIGH, N.C. (AP) — North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made “racially insensitive” comments and applied “undue influence” regarding players’ ability to compete through medical issues. T…","url":"https://www.seattletimes.com/sports/college/uncs-hatchell-resigns-after-findings-from-program-review/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-19T04:41:45Z","content":"RALEIGH, N.C. (AP) North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made “racially insensitive” comments and applied “undue influence” regarding players’ ability to compete through medical issues.\r\nTh… [+805 chars]"},{"source":{"id":null,"name":"Dailycaller.com"},"author":"Neetu Chandak","title":"UNC Basketball Coach Resigns Amid Claims Of ‘Racially Insensitive’ Comments","description":"The University of North Carolina announced Thursday that women's basketball head coach Sylvia Hatchell resigned, ending her 33-year coaching career at the school.","url":"https://dailycaller.com/2019/04/19/unc-basketball-coach-resigns/","urlToImage":"https://cdn01.dailycaller.com/wp-content/uploads/2019/04/Hatchell-Reuters-1-e1555678098968.jpg","publishedAt":"2019-04-19T13:26:24Z","content":"The University of North Carolina announced Thursday that women’s basketball head coach Sylvia Hatchell resigned after a review stated she made “racially insensitive” comments among other claims, ending her 33-year coaching career at the university.\r\n“The Univ… [+2628 chars]"},{"source":{"id":null,"name":"Dailycaller.com"},"author":"Evie Fordham","title":"Yankees Pull Seventh-Inning Stretch Song While Investigating Claim Of Racism Against Dead Singer","description":"Both the New York Yankees and Philadelphia Flyers have reacted to an allegation of racism against the late Kate Smith, who recorded \"God Bless America.\"","url":"https://dailycaller.com/2019/04/19/kate-smith-yankees-flyers-america/","urlToImage":"https://cdn01.dailycaller.com/wp-content/uploads/2019/04/yankee-stadium-new-york-e1555691653489.jpg","publishedAt":"2019-04-19T17:06:04Z","content":"Both the New York Yankees and Philadelphia Flyers have reacted to an allegation of racism against Kate Smith, the late singer who performed a 1939 rendition of “God Bless America” played at both teams’ home games.\r\nSmith sang songs titled “Pickaninny Heaven” … [+3305 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":"Brianna Labuskes","title":"Must-Reads Of The Week From Brianna Labuskes","description":"Newsletter editor Brianna Labuskes wades through hundreds of health articles from the week so you don’t have to.","url":"https://khn.org/news/must-reads-of-the-week-from-brianna-labuskes-24/","urlToImage":"https://kaiserhealthnews.files.wordpress.com/2018/04/friday-breeze.jpg?w=1200","publishedAt":"2019-04-19T17:23:06Z","content":"Brianna Labuskes\r\nThe Friday Breeze\r\nHappy Friday! This week, I discovered a new, salty Twitter account that really speaks to my soul: @justsayinmice. The creator behind the thing is fed up! with click-baity headlines on stories about research done in mice yo… [+25771 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Aaron Beard","title":"North Carolina women’s basketball coach Sylvia Hatchell resigns amid controversy","description":"External review found Hall of Fame coach used “racially insensitive” comments with players.","url":"https://www.bostonglobe.com/sports/2019/04/18/north-carolina-women-basketball-coach-sylvia-hatchell-resigns-amid-controversy/gXk3P0l28Q9Um12R93DxCK/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/05/BostonGlobe.com/Sports/Images/8addd09eec5748a0b5047bff8307cc29-8addd09eec5748a0b5047bff8307cc29-0.jpg","publishedAt":"2019-04-19T05:09:32Z","content":"RALEIGH, N.C. — North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made ‘‘racially insensitive’’ comments and applied ‘‘undue influence’’ regarding players’ ability to compete through medical issues.\r\nT… [+632 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Martin Finucane","title":"Who were the winners and losers of the Mueller report?","description":"Here are some of the big winners and losers from the Mueller report.","url":"https://www.bostonglobe.com/news/nation/2019/04/19/who-were-winners-and-losers-mueller-report/aoME07yaFqjXgY72m9KlwI/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/19/BostonGlobe.com/Metro/Images/1137877401.jpg","publishedAt":"2019-04-19T17:27:18Z","content":"Here are some of the big winners and losers from the release Thursday of the long-awaited report by Special Counsel Robert Mueller on his Trump-Russia investigation:\r\nTHE WINNERS\r\nPresident Trump and his family\r\nThe president, who was at his Mar-a-Lago resort… [+6791 chars]"},{"source":{"id":null,"name":"Russianmachineneverbreaks.com"},"author":null,"title":"All tied up: Hurricanes beat Caps 2-1 - Russian Machine Never Breaks","description":"All tied up: Hurricanes beat Caps 2-1 Russian Machine Never Breaks Warren Foegele Injured TJ Oshie With A Hard Shove In The Back And Was Only Given A Two-Minute Minor Penalty Deadspin How the Carolina Hurricanes reinvented hockey in North Carolina, and what's…","url":"https://russianmachineneverbreaks.com/2019/04/18/all-tied-up-hurricanes-beat-caps-2-1/","urlToImage":"https://i2.wp.com/russianmachineneverbreaks.com/wp-content/uploads/2019/04/caps-canes-game-four-recap.jpg?fit=1068%2C598&ssl=1","publishedAt":"2019-04-19T01:38:04Z","content":"The Washington Capitals and Carolina Hurricanes were due to do battle once more in Game Four of this Eastern Conference first round playoff matchup. The surging, suffocating Canes blew the Caps out of Raleigh on Monday night and looked to do the same again Th… [+2672 chars]"},{"source":{"id":null,"name":"Truthout.org"},"author":"britney","title":"No More Excuses. Donald Trump Must Be Impeached.","description":"The Mueller report is a brutal, vital read from front to back. The post No More Excuses. Donald Trump Must Be Impeached. appeared first on Truthout.","url":"https://truthout.org/articles/no-more-excuses-donald-trump-must-be-impeached/","urlToImage":"https://truthout.org/wp-content/uploads/2019/04/2019_0419-donald-trump-1200x800.jpg","publishedAt":"2019-04-19T15:41:41Z","content":"Over the course of more than 400 scalding pages, the Mueller report details the parallel and often cooperative course traveled by Donald Trump’s 2016 presidential campaign and the sophisticated Russian operation devoted to his victory. Mueller’s report also l… [+18874 chars]"},{"source":{"id":null,"name":"Kicksonfire.com"},"author":"jamalkhan","title":"Nike Air Max 98 GS Court Purple Arriving At Retailers","description":"The 2019 NBA All-Star festivities took place in North Carolina, and the Nike Air Max 98 in its GS form just arrived in a new colorway that looks to be perfect for the Charlotte Hornets. Featuring leather and nubuck uppers covered in a mixture of Court Purple,…","url":"https://www.kicksonfire.com/nike-air-max-98-gs-court-purple-arriving-at-retailers/","urlToImage":"https://cdn5.kicksonfire.com/wp-content/uploads/2019/04/Nike-Air-Max-98-GS-Court-Purple.jpg?x77451","publishedAt":"2019-04-19T13:37:02Z","content":null},{"source":{"id":null,"name":"Theroot.com"},"author":"Jay Connor","title":"Racial Profiling or Nah? TSA Scanners Are Singling Out Black Women","description":"For black women throughout the world, “Don’t Touch My Hair” is much more than the pinnacle of Solange’s discography, it’s dogma—or an ominous warning that both life and limb can be lost should you cross that line. Read more...","url":"https://www.theroot.com/racial-profiling-or-nah-tsa-scanners-are-singling-out-1834164809","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--v2znLq2d--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/jla8byd2wd1m1w4zi8an.jpg","publishedAt":"2019-04-19T14:45:00Z","content":"For black women throughout the world, Dont Touch My Hair is much more than the pinnacle of Solanges discography, its dogmaor an ominous warning that both life and limb can be lost should you cross that line. \r\nBut TSA agents play by a different set of rules. … [+3580 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"North Carolina Governor Vetoes ‘Born Alive’ Legislation Calling It An Unnecessary Interference Between Patient, Doctor","description":"There are already laws protecting babies who are born alive, whether it is as a result of a botched abortion or not, said North Carolina Gov. Roy Cooper. Meanwhile, a look at the rare occurrence where infants actually are born following an abortion attempt.","url":"https://khn.org/morning-breakout/north-carolina-governor-vetoes-born-alive-legislation-calling-it-an-unnecessary-interference-between-patient-doctor/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-19T12:44:29Z","content":"There are already laws protecting babies who are born alive, whether it is as a result of a botched abortion or not, said North Carolina Gov. Roy Cooper. Meanwhile, a look at the rare occurrence where infants actually are born following an abortion attempt. \r… [+1862 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"First Edition: April 19, 2019","description":"Today's early morning highlights from the major news organizations.","url":"https://khn.org/morning-breakout/first-edition-april-19-2019/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-19T10:25:59Z","content":"Today's early morning highlights from the major news organizations.\r\nKaiser Health News:\r\nLiver Illness Strikes Latino Children Like A Silent TsunamiSaira Diaz uses her fingers to count the establishments selling fast food and sweets near the South Los Angele… [+15886 chars]"},{"source":{"id":null,"name":"Insidehighered.com"},"author":"Doug Lederman","title":"New presidents or provosts: Beaver Bloomfield Bucknell Clarke Goldey-Beacom John Carroll Modesto Norfolk Paterson St. Francis Southwestern","description":"Javaune Adams-Gaston, senior vice president for student life at Ohio State University, has been chosen as president of Norfolk State University, in Virginia. Thom D. Chesney, president of Brookhaven College, part of the Dallas County Community College Distric…","url":"http://www.insidehighered.com/news/2019/04/19/new-presidents-or-provosts-beaver-bloomfield-bucknell-clarke-goldey-beacom-john","urlToImage":"https://www.insidehighered.com/sites/all/themes/ihecustom/images/facebook_icon_large.jpg","publishedAt":"2019-04-19T07:00:00Z","content":"{* #emailNewsletterEnrollmentForm *}\r\n{* signInEmailAddress *}\r\nNewsletters\r\n{* optInDailyNewsUpdate *}\r\nNews, opinion and jobs in higher education - delivered each weekday. View a sample &gt;&gt;\r\n{* optInWeeklyNewsUpdate *}\r\nYour need-to-know digest of the … [+7716 chars]"},{"source":{"id":null,"name":"Sbnation.com"},"author":"Ricky O'Donnell","title":"Cole Anthony is built for greatness","description":"The stud point guard is going to be college basketball’s next freshman sensation.","url":"https://www.sbnation.com/college-basketball/2019/4/19/18485587/cole-anthony-recruiting-north-carolina-oregon-nba-draft-highlights","urlToImage":"https://cdn.vox-cdn.com/thumbor/AojtZ4gt0UR0e1Yl7KXJG7lN-9s=/0x0:720x377/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16177338/cole_anthony_720.jpg","publishedAt":"2019-04-19T16:51:43Z","content":"The stud point guard is going to be college basketball’s next freshman sensation. Cole Anthony’s path to stardom has been atypical even among teenage basketball prodigies. As the son of 11-year NBA veteran Greg Anthony, Cole has had all the advantages of a pr… [+5559 chars]"},{"source":{"id":null,"name":"Redstate.com"},"author":"Sister Toldjah","title":"Republican Former NC Governor Says His Car Was Vandalized in a Politically Motivated Attack – While He Was in It","description":"\"He proceeds to take this big limb...and he slams it on top of my car.\" The post Republican Former NC Governor Says His Car Was Vandalized in a Politically Motivated Attack – While He Was in It appeared first on RedState.","url":"https://www.redstate.com/sister-toldjah/2019/04/19/republican-former-nc-governor-says-car-vandalized-politically-motivated-attack/","urlToImage":"https://www.redstate.com/wp-content/uploads/2016/12/McCrory2016.jpg","publishedAt":"2019-04-19T15:30:22Z","content":"There’s never a dull moment in North Carolina politics, as recent events have shown. But on Wednesday afternoon in Charlotte, one man allegedly took things to the extreme – and politics might have been his motivator.\r\nCharlotte news station WCNCreports:\r\nPat … [+2449 chars]"}]}