{"status":"ok","totalResults":1064,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Zack Whittaker","title":"What you missed in cybersecurity this week","description":"It’s been a busy week — it’s tough to keep up with all the cybersecurity news. We’ve collected some of the biggest cybersecurity stories from the week — from TechCrunch and afar — to keep you up to date with the latest hacks, privacy breaches and security sto…","url":"http://techcrunch.com/2019/04/21/cybersecurity-what-you-missed-this-week/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/04/password.gif?w=603","publishedAt":"2019-04-21T19:07:07Z","content":"It’s been a busy week it’s tough to keep up with all the cybersecurity news. We’ve collected some of the biggest cybersecurity stories from the week from TechCrunch and afar to keep you up to date with the latest hacks, privacy breaches and security stories y… [+4015 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Tom McKay","title":"Sri Lanka Blocks Facebook, WhatsApp After Easter Bombings Leave Hundreds Dead","description":"After at least 207 people were killed and over four hundred more were reported wounded after a series of bombs went off at Easter services in Sri Lanka, the Sri Lankan government has moved to block access to Facebook, TechCrunch reported on Sunday. Read more.…","url":"https://gizmodo.com/sri-lanka-blocks-facebook-whatsapp-after-easter-bombin-1834199629","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--lce--cRi--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/qu7mp06uawwawgdmocj1.jpg","publishedAt":"2019-04-21T17:55:00Z","content":"After at least 207 people were killed and over four hundred more were reported wounded after a series of bombs went off at Easter services in Sri Lanka, the Sri Lankan government has moved to block access to Facebook, TechCrunch reported on Sunday.\r\nIn a brie… [+5024 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"BEN PROTESS, WILLIAM K. RASHBAUM and MAGGIE HABERMAN","title":"How Michael Cohen Turned Against President Trump","description":"The president’s longtime fixer had, for months, sought “a little loving and respect.” Confidential emails and texts chronicle their momentous falling out.","url":"https://www.nytimes.com/2019/04/21/us/politics/michael-cohen-trump.html","urlToImage":"https://static01.nyt.com/images/2019/04/15/obituaries/archives/00trumpcohen/00trumpcohen-facebookJumbo.jpg","publishedAt":"2019-04-21T09:00:11Z","content":"By early July, Mr. Cohen was making overtly hostile moves toward the president. He appeared on ABCs Good Morning America and declared, My wife, my daughter and my son have my first loyalty and always will. He deleted the line in his Twitter biography about wo… [+1445 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Sam Fossum, Em Steck, Liz Stark and Caroline Kelly, CNN","title":"What we learned watching Robert Mueller for 18 months","description":"Editor's Note: When special counsel Robert Mueller was appointed to investigate Russian meddling in the US election, CNN, like most news organizations, endeavored to learn what we could about the famously secretive team's work. So, in addition to other newsga…","url":"https://www.cnn.com/2019/04/21/politics/robert-mueller-stakeout/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190419180029-cnn-mueller-stake-out-restricted-super-tease.jpg","publishedAt":"2019-04-21T12:04:45Z","content":"(CNN)Editor's Note: When special counsel Robert Mueller was appointed to investigate Russian meddling in the US election, CNN, like most news organizations, endeavored to learn what we could about the famously secretive team's work. So, in addition to other n… [+17467 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"U.S. to announce end to sanctions waivers for Iran oil imports: Washington Post","description":"The United States is preparing to announce on Monday that all importers of Iranian oil will have to end their imports shortly or be subject to U.S. sanctions, the Washington Post reported on Sunday.","url":"https://www.reuters.com/article/us-usa-iran-oil-idUSKCN1RX0R1","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20190421&t=2&i=1379317945&w=1200&r=LYNXNPEF3K0SY","publishedAt":"2019-04-21T23:47:29Z","content":"WASHINGTON (Reuters) - The United States is preparing to announce on Monday that all importers of Iranian oil will have to end their imports shortly or be subject to U.S. sanctions, the Washington Post reported on Sunday. \r\nThe U.S. reimposed sanctions in Nov… [+1816 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Lesley Wroughton","title":"Exclusive: U.S. carves out exceptions for foreigners dealing with IRGC","description":"The United States has largely carved out exceptions so that foreign governments, firms and NGOs do not automatically face U.S. sanctions for dealing with Iran's Revolutionary Guards after the group's designation by Washington as a foreign terrorist group, acc…","url":"https://www.reuters.com/article/us-usa-iran-irgc-exclusive-idUSKCN1RX0ME","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20190421&t=2&i=1379244108&w=1200&r=LYNXNPEF3K0KP","publishedAt":"2019-04-21T18:04:10Z","content":"WASHINGTON (Reuters) - The United States has largely carved out exceptions so that foreign governments, firms and NGOs do not automatically face U.S. sanctions for dealing with Iran’s Revolutionary Guards after the group’s designation by Washington as a forei… [+6849 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"John Ruwitch","title":"In nod to debt concerns, China Belt and Road summit to urge sustainable financing","description":"World leaders meeting in Beijing this week for a summit on China's Belt and Road initiative will agree to project financing that respects global debt goals and promotes green growth, according to a draft communique seen by Reuters.","url":"https://www.reuters.com/article/us-china-silkroad-idUSKCN1RX04U","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20190421&t=2&i=1379088691&w=1200&r=LYNXNPEF3K066","publishedAt":"2019-04-21T06:02:56Z","content":"SHANGHAI (Reuters) - World leaders meeting in Beijing this week for a summit on China’s Belt and Road initiative will agree to project financing that respects global debt goals and promotes green growth, according to a draft communique seen by Reuters. \r\nThe … [+2643 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Associated Press","title":"Can a Texas town move on 20 years after a black man was dragged to death in one of the most famous hate crimes in US history?","description":"David J. Phillip, File via AP Citizens of Jasper, Texas have grappled for more than 20 years with the memory of an incident when three white men killed a black man by dragging him behind a pickup. James Byrd Jr. is remembered as the victim of one of the most …","url":"https://www.thisisinsider.com/jasper-texas-20-years-after-james-byrd-jr-was-dragged-to-death-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbcd8972730ca15d42e3b32-1920-960.jpg","publishedAt":"2019-04-21T20:54:22Z","content":"JASPER, Texas (AP) — A technology company was almost ready to bring up to 300 new jobs to Jasper, Texas, but in the final stages of recent negotiations, a potential deal-breaker emerged: the community's history as the place where three white men dragged a bla… [+5429 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Becky Peterson","title":"This map shows which states in the US are competing to top California-based Uber's $15.7 billion in equity funding","description":"With $15.7 billion in equity funding, Uber is the most highly-funded tech startup in the United States. This map by CB Insights shows that there's plenty of money to go around. Florida's Magic Leap, an augmented reality has raised $2.4 billion in funding, whi…","url":"https://www.businessinsider.com/map-top-funded-tech-startups-us-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba232416c65a440d1b22d4-2732-1366.jpg","publishedAt":"2019-04-21T14:00:00Z","content":"With $15.7 billion in equity funding in its pocket, the San Francisco, California-based ride-hailing company Uber has raised more money than any other tech startup in the country. But California isn't the only state in the union harboring highly-funded tech s… [+3249 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ellen Cranley","title":"A Ukranian comedian just won the presidential election, according to exit polls. Some are concerned about his lack of experience or firm policy positions","description":"Volodymyr Zelensky, a comedian with no political experience, has won Ukraine's presidential election, according to national exit polls released Sunday. Zelensky's campaign caught international attention because he was previously known as the star of \"Servant …","url":"https://www.businessinsider.com/exit-polls-ukranian-comedian-volodymyr-zelensky-won-presidential-election-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbcab3316c65a5cbe671605-1334-667.jpg","publishedAt":"2019-04-21T19:35:07Z","content":"Comedian Volodymyr Zelensky has won Ukraine's presidential election, according to national exit polls released Sunday. \r\n Before declaring his campaign, Zelensky starred in \"Servant of the People,\" a TV show where he plays a history teacher who is elected pre… [+2324 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Michaela Cabrera and Noémie Olive, R","title":"At Easter service in Paris, a bible that survived the Notre-Dame fire was given to the city's fire chief and worshipers prayed for their cathedral","description":"Paris' displaced worshipers gathered at Saint-Eustache church on Easter Sunday to pray for Notre-Dame's quick restoration. The project was compared to the resurrection of Jesus. Halfway through the service the head of Paris' fire service General Jean-Claude G…","url":"https://www.businessinsider.com/at-easter-mass-parisians-pray-for-notre-dames-swift-restoration-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbca1e712ece257fa1383b5-1920-960.jpg","publishedAt":"2019-04-21T17:01:00Z","content":"PARIS (Reuters) - With no cathedral to go to, hundreds of Parisians gathered for Easter Sunday mass at the smaller Saint-Eustache catholic church on the city's right bank, and prayed for the swift restoration of Notre-Dame after its devastating fire. \r\n The a… [+2434 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Andy Kiersz","title":"'I never plan to fly on it': Workers reportedly recount poor practices at a Boeing factory in South Carolina that could spell trouble for Dreamliner plane","description":"After two tragic crashes that led to the widespread grounding of Boeing's 737 MAX airplanes, The New York Times reports that issues at a South Carolina factory could mean problems for the company's 787 Dreamliner plane as well. The Times report includes sever…","url":"https://www.businessinsider.com/boeing-787-dreamliner-south-carolina-factory-production-problems-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbc7ca012ece25684030303-1920-960.jpg","publishedAt":"2019-04-21T14:34:17Z","content":"In the wake of two tragic crashes that led to the widespread grounding of Boeing's 737 MAX airplanes, The New York Times reports that poor practices at a South Carolina factory could raise questions about the safety of the company's 787 Dreamliner plane as we… [+2125 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Paulina Dedaj","title":"Washington state lawmaker riles nurses by saying that some spend 'considerable' time playing cards - Fox News","description":"Washington state lawmaker riles nurses by saying that some spend 'considerable' time playing cards Fox News Washington state senator slammed for saying nurses 'play cards' for 'considerable amount of the day' CNN Sen. Maureen Walsh says nurses spend 'consider…","url":"https://www.foxnews.com/politics/washington-state-lawmaker-riles-nurses-by-saying-that-some-spend-considerable-time-playing-cards","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/walsh.jpg","publishedAt":"2019-04-21T01:15:19Z","content":"A Washington state lawmaker has provoked the ire of nursing professionals after saying that some nurses “play cards” for a “considerable” portion of their shifts.\r\nState Sen. Maureen Walsh, R-Walla Walla, was debating a bill on Tuesday that would require unin… [+1771 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/emily-larsen","title":"Impeach or pivot: Democratic presidential candidates grapple with Mueller report strategy - Washington Examiner","description":"Impeach or pivot: Democratic presidential candidates grapple with Mueller report strategy Washington Examiner Catching Up on the Mueller Report: What’s Next? The New York Times Trump expresses anger after release of Mueller report CBS News The Mueller report …","url":"https://www.washingtonexaminer.com/news/impeach-or-pivot-democratic-presidential-candidates-grapple-with-mueller-report-strategy","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/0b95752/2147483647/strip/true/crop/1143x600+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F8e%2F08%2Fdbba5dd640888769af51612cd8d2%2Fdownloadfjfjm.jpg","publishedAt":"2019-04-21T04:00:00Z","content":"Democratic presidential candidates face a choice between trying to use the Mueller report against President Trump or sticking to issues that appeal to a broader range of voters, such as healthcare and income inequality. \r\nSen. Elizabeth Warren, D-Mass., on Fr… [+3656 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/zachary-halaschak","title":"From TV presidency to the real thing: Ukraine elects a comedian as its next head of state - Washington Examiner","description":"From TV presidency to the real thing: Ukraine elects a comedian as its next head of state Washington Examiner Ukraine election result: Volodymyr Zelensky, comedian, is new president Vox.com Ukraine election: Voters choose between comic and tycoon BBC News Com…","url":"https://www.washingtonexaminer.com/news/from-tv-presidency-to-the-real-thing-ukraine-elects-a-comedian-as-its-next-head-of-state","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/79fef20/2147483647/strip/true/crop/5472x2873+0+143/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F0f%2F74%2F6bad9a474730885e6da0479e653d%2Fap-19111680243480.jpg","publishedAt":"2019-04-21T19:01:00Z","content":"A comedian who played the role of president in a popular Ukrainian TV show is now on track to become the actual president of Ukraine. \r\nVolodymyr Zelenskiy, 41, appears to have won the presidency by a wide margin in a runoff election against the incumbent pre… [+1705 chars]"},{"source":{"id":"the-globe-and-mail","name":"The Globe And Mail"},"author":"Kanishka Singh","title":"U.S. intelligence claims Huawei funded by Chinese state security, report says - The Globe and Mail","description":"U.S. intelligence claims Huawei funded by Chinese state security, report says The Globe and Mail CIA Claims Huawei Has Been Funded by Chinese Intelligence, Offers Proof iPhone in Canada China's Huawei to launch 5G at Africa Cup of Nations CTV News CIA reporte…","url":"https://www.theglobeandmail.com/world/article-us-intelligence-says-huawei-funded-by-chinese-state-security-report-2/","urlToImage":"https://www.theglobeandmail.com/resizer/vdpLL2OIZ9RnZnrN-SHMsTlYJfk=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/WUT25CSQZZCBJA3RP42Q2BHDHA.JPG","publishedAt":"2019-04-21T14:24:02Z","content":"The CIA accused Huawei of receiving funding from Chinas National Security Commission, the Peoples Liberation Army and a third branch of the Chinese state intelligence network, The Times newspaper reported, citing a source. \r\nALY SONG/Reuters\r\nU.S. intelligenc… [+2467 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":null,"title":"What Mayock's past rankings mean for Raiders' draft plans - NBCSports.com","description":"What Mayock's past rankings mean for Raiders' draft plans NBCSports.com Welcome To The Jon Gruden Show Deadspin A Q&A with Kolton Miller: The Raiders' 2018 top pick has bulked up, healed up and is getting a house built in... The Athletic Report: Raiders likel…","url":"https://www.nbcsports.com/bayarea/raiders/what-mike-mayocks-past-nfl-draft-rankings-can-tell-us-about-raiders","urlToImage":"https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2019/04/21/mayockrealusatsi.jpg","publishedAt":"2019-04-21T22:05:30Z","content":"The Raiders could certainly trade down from one of their three first-round picks to pick up extra selections later in the 2019 NFL Draft.\r\nAn early trade would net a strong return that could add Day 2 picks to their cache, something general manager Mike Mayoc… [+4486 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Top Democrats leave option of impeaching Trump open after Mueller report","description":"Top congressional Democrats left the door open on Sunday to pursue the impeachment of U.S. President Donald Trump, but said they would first need to complete their own investigations into whether he obstructed justice in Special Counsel Robert Mueller's Russi…","url":"https://news.yahoo.com/house-judiciary-chair-nadler-says-obstruction-trump-proven-135231050.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/sTTTzM2NdpHb9F_8KPlHrw--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2019-04-21T135231Z_1_LYNXNPEF3K0G7_RTROPTP_2_USA-TRUMP.JPG","publishedAt":"2019-04-21T14:25:17Z","content":"By Sarah N. Lynch and Yasmeen Abutaleb\r\nWASHINGTON (Reuters) - Top congressional Democrats left the door open on Sunday to pursue the impeachment of U.S. President Donald Trump, but said they would first need to complete their own investigations into whether … [+1455 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Managing North Korea","description":"We are in the eye of the storm of U.S.-North Korea relations. Both sides are assessing the Hanoi summit between President Donald Trump and Chairman Kim Jong-un and its aftermath, and we await a significant public pronouncement by Kim. Despite the drama of Kim…","url":"https://news.yahoo.com/managing-north-korea-173300838.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/09hjaAGW2QfayGgH0iyXtQ--~B/aD05NTU7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/f1ed9efe80a046f012f899559591fa73","publishedAt":"2019-04-21T17:33:00Z","content":"Thomas Cynkin\r\nSecurity, Asia\r\nHere's what Washington should do to test Pyongyang's intentions and move forward successfully.\r\nManaging North Korea\r\nWe are in the eye of the storm of U.S.-North Korea relations. Both sides are assessing the Hanoi summit betwee… [+1358 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Democrats to meet in the next few weeks to discuss impeachment of Trump, key lawmaker says","description":"House Democrats will hold a meeting to discuss whether to pursue impeachment proceedings against Donald Trump, a key lawmaker said on Sunday.House Intelligence Committee chairman Adam Schiff said on Fox News Sunday that the House Democratic caucus will meet i…","url":"https://news.yahoo.com/democrats-meet-next-few-weeks-162836337.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/2g0txNJm.dl9EHuAxNcGEA--~B/aD01NzY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/98fd19e95fd041ee8f43bab4497171a6","publishedAt":"2019-04-21T16:28:36Z","content":"House Democrats will hold a meeting to discuss whether to pursue impeachment proceedings against Donald Trump, a key lawmaker said on Sunday.\r\nHouse Intelligence Committee chairman Adam Schiff said on Fox News Sunday that the House Democratic caucus will meet… [+2534 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Hayley Miller","title":"Nadler: Mueller Report’s Potential Obstruction Claims Impeachable ‘If Proven’","description":"\"We're going to see where the facts lead us,\" said Rep. Jerry Nadler (D-N.Y.), chairman of the House Judiciary Committee.","url":"https://www.huffpost.com/entry/jerry-nadler-trump-impeachment_n_5cbc8abee4b068d795cdadd4","urlToImage":"https://img.huffingtonpost.com/asset/5cbca3be230000b603ea2376.jpeg?cache=qxUdgx78Bz&ops=1200_630","publishedAt":"2019-04-21T17:13:13Z","content":"Rep. Jerry Nadler, chairman of the House Judiciary Committee, said he believes special counsel Robert Mueller’s report contains information that could be grounds for impeachment against President Donald Trump “if proven.”\r\n“If proven, some of this would be im… [+2473 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Igor Bobic","title":"How Freshman Rep. Katie Porter Puts Wall Street In The Hot Seat","description":"The former law professor is taking notes and even assigning math homework. Wall Street better be paying attention.","url":"https://www.huffpost.com/entry/katie-porter-wall-street-dimon_n_5cb6470be4b0ffefe3b889db","urlToImage":"https://img.huffingtonpost.com/asset/5cb64a3a230000c2006db3bd.jpeg?cache=lzycdeg8pj&ops=1910_1000","publishedAt":"2019-04-21T17:30:16Z","content":"WASHINGTON You dont often see some of the smartest people in the country being asked to do math at a congressional hearing. (You rarely see tough questions at all, really).\r\nThats exactly what Wall Street executives and regulators face when freshman Rep. Kati… [+9639 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Soo Rin Kim","title":"Russia-linked figures in Mueller's probe come in from the cold","description":"With Mueller's report out, some of its subjects are turning up in public again.","url":"https://abcnews.go.com/Politics/russia-linked-figures-muellers-probe-cold-reports-release/story?id=62518830","urlToImage":"https://s.abcnews.com/images/Politics/sergei-millian-ap-jc-180828_hpMain_16x9_992.jpg","publishedAt":"2019-04-21T21:14:47Z","content":"A cast of Russia-linked figures caught up in special counsel's probe have begun emerging out from under a veil of suspicion now that Robert Mueller has delivered his verdict that there was no incontrovertible proof of collusion.\r\nFor the first time in more th… [+6519 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Shannon K. Crawford, Pete Madden","title":"Maria Butina's lawyers ask for leniency ahead of sentencing","description":"Her defense paints the portrait of a “compassionate civil activist”—the government says she was a threat to national security.","url":"https://abcnews.go.com/Politics/maria-butinas-lawyers-leniency-ahead-sentencing/story?id=62527630","urlToImage":"https://s.abcnews.com/images/Blotter/maria-butina-ap-jpo-180717_hpMain_16x9_992.jpg","publishedAt":"2019-04-21T02:50:29Z","content":"Federal prosecutors claim Maria Butina conspired to act as a foreign agent who sought to create a backchannel between American power players and Russia. But letters from her family and friends paint her in a far different light -- as an empathetic and hard-wo… [+4865 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Kristin Lam, USA TODAY","title":"Washington state lawmaker angers nurses after saying some 'probably play cards' in rural areas","description":"Washington state Sen. Maureen Walsh drew backlash after saying nurses in smaller, rural hospitals may spend a lot of time playing cards.","url":"https://www.usatoday.com/story/news/nation/2019/04/21/washington-state-lawmaker-maureen-walsh-nurses/3535457002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/21/USAT/14c51652-db8a-4511-8ea5-81063359256b-AP_Washington_State_Senator_Nurses.JPG?crop=2879,1645,x0,y119&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T22:46:39Z","content":"A Washington state lawmaker is facing backlash from nurses  including multiple online petitions, one calling for her resignation  after saying nurses in smaller, rural hospitals may spend much of their time playing cards.\r\nRepublican state Sen. Maureen Walsh … [+2877 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Capitals' T.J. Oshie out of playoffs with broken clavicle","description":"Washington Capitals winger T.J. Oshie is expected to miss the rest of the playoffs after undergoing surgery to repair a broken right clavicle","url":"https://www.usatoday.com/story/sports/nhl/2019/04/21/capitals-tj-oshie-out-of-playoffs-with-broken-clavicle/39374519/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/0859695bc2daf97421be63f65fef995e8c70be43/c=0-174-2976-1848/local/-/media/2019/04/21/USATODAY/usatsports/2d48069019354912856edd10370e2dc7.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T16:58:36Z","content":"ARLINGTON, Va. (AP) Washington Capitals winger T.J. Oshie is expected to miss the rest of the playoffs after undergoing surgery to repair a broken right clavicle.\r\nThe team announced Oshie's surgery Sunday afternoon. Coach Todd Reirden had already called Oshi… [+957 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Granderson homers, Marlins tag Scherzer in 9-3 win over Nats","description":"Curtis Granderson homered and the Miami Marlins busted out at the plate after changing hitting coaches, roughing up ace Max Scherzer in beating the Washington Nationals 9-3 to win a series for the first time this season","url":"https://www.usatoday.com/story/sports/mlb/2019/04/20/granderson-homers-marlins-tag-scherzer-in-9-3-win-over-nats/39371987/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/cafe1ee1761e1baba802e9e900270aadf3ab0b02/c=0-755-1595-1652/local/-/media/2019/04/20/USATODAY/usatsports/657280b31a664ed697d8eb9e13dca37b.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T02:10:49Z","content":"MIAMI (AP) Curtis Granderson homered and the Miami Marlins busted out at the plate after changing hitting coaches, roughing up ace Max Scherzer in beating the Washington Nationals 9-3 on Saturday night to win a series for the first time this season.\r\nBrian An… [+2423 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Gray, Rockies beat Phillies 4-1 for 6th win in 7 games","description":"Jon Gray pitched six scoreless innings, Tony Wolters had a two-run double and the Colorado Rockies beat the Philadelphia Phillies 4-1 for their sixth win in seven games","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/gray-rockies-beat-phillies-4-1-for-6th-win-in-7-games/39376253/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/72ea179e357439843c8c55433dcea893ca9a0a47/c=0-621-4182-2973/local/-/media/2019/04/21/USATODAY/usatsports/62d2da812b954b4caab1663870d52f93.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T23:03:17Z","content":"DENVER (AP) Jon Gray pitched six scoreless innings, Tony Wolters had a two-run double and the Colorado Rockies beat the Philadelphia Phillies 4-1 Sunday for their sixth win in seven games.\r\nTrevor Story and Ian Desmond also had RBI singles for the Rockies, wh… [+2682 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Eliza Collins, USA TODAY","title":"Mueller report revives Trump impeachment talk, even as Democratic leaders try to tamp it down","description":"“Damning” details found in Robert Mueller’s probe into Russian interference in the 2016 election have sparked impeachment talk again.","url":"https://www.usatoday.com/story/news/politics/elections/2019/04/21/mueller-report-democrats-struggle-impeachment-president-donald-trump/3518879002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/733efd55-4e3b-452d-8176-253accb0d585-GTY_1143605890.JPG?crop=2999,1686,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T11:00:01Z","content":"WASHINGTON With just a year and a half to go until the presidential election, Democratic leaders have been saying President Donald Trump should be voted out of office, not depart through impeachment.\r\nBut damning details found in Special Counsel Robert Muelle… [+8093 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Syndergaard battered despite gift homer, Cards top Mets 6-4","description":"Paul Goldschmidt drove in two runs and Noah Syndergaard had better luck at the plate than on the mound, hitting a homer with Dexter Fowler's help as the St. Louis Cardinals beat the New York Mets 6-4","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/syndergaard-battered-despite-gift-homer-cards-top-mets-6-4/39375753/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/110ee4ac34cd70db97b22433153bb7fce242555f/c=0-340-5470-3417/local/-/media/2019/04/21/USATODAY/usatsports/c3f5a21fbc14451cb682fdf6f6a209de.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T21:56:40Z","content":"ST. LOUIS (AP) Paul Goldschmidt drove in two runs and Noah Syndergaard had better luck at the plate than on the mound, hitting a homer with Dexter Fowler's help as the St. Louis Cardinals beat the New York Mets 6-4 on Sunday.\r\nSyndergaard (1-2) allowed six ru… [+2874 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Maureen Groppe, USA TODAY","title":"The 'weird parallels' between Vice President Mike Pence and presidential hopeful Pete Buttigieg","description":"While Vice President Mike Pence and presidential hopeful Pete Buttigieg are at odds on many issues, they also have many things in common.","url":"https://www.usatoday.com/story/news/politics/elections/2019/04/21/how-mike-pence-and-pete-buttigieg-more-alike-than-you-think/3451334002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/17/USAT/a81d3b44-ccb4-4769-8243-b09aace43107-Buttigieg_and_Pence.JPG?crop=3599,2008,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T12:00:03Z","content":"Presidential candidate Pete Buttigieg responds to anti-gay hecklers at a rally in Iowa.\r\n USA TODAY\r\nWASHINGTON There are more similarities between Vice President Mike Pence and presidential hopeful Pete Buttigieg than you might think.\r\nAnd its not just that … [+10374 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Lamoriello, Trotz orchestrate Islanders' big turnaround","description":"Lou Lamoriello and Barry Trotz didn't know exactly what to expect from the New York Islanders this season","url":"https://www.usatoday.com/story/sports/nhl/2019/04/21/lamoriello-trotz-orchestrate-islanders-big-turnaround/39374113/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/2b0481b791713aac1a00dbeb48baa51232039164/c=0-496-1794-1505/local/-/media/2019/04/21/USATODAY/usatsports/3636bb1e142a4731a0b7d11792bf101f.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T14:18:13Z","content":"NEW YORK (AP) Lou Lamoriello and Barry Trotz say they didn't know exactly what to expect from the New York Islanders this season.\r\nThere were plenty of questions after the Islanders gave up 293 goals the most in the NHL since 2006-07 while missing the playoff… [+5559 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, USA TODAY","title":"Why a 'cashless' society wouldn't work in the US: Readers sound off","description":"From cashless societies to Medicare for All to extending the support provided to the Notre-Dame Cathedral, our readers sound off on recent headlines.","url":"https://www.usatoday.com/story/opinion/readers/2019/04/21/why-cashless-society-wouldnt-work-us-readers/3508639002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/03013952-3129-4c37-a25b-bea5175c9ad3-231_223406.jpg?crop=1280,720,x0,y111&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T11:00:02Z","content":"From cashless societies to Medicare for All to extending the support provided to the Notre-Dame Cathedral, our readers sound off on recent headlines.\r\nLetter to the editor:\r\nI am pleased to see news coverage of Amazons reported decision to accept cash at its … [+5197 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Peter Beinart","title":"U.S. Trade Hawks Exaggerate China’s Threat","description":"Democrats and Republicans echo Trump’s anti-Beijing rhetoric, but escalating tensions could leave Americans far worse off.","url":"https://www.theatlantic.com/ideas/archive/2019/04/us-trade-hawks-exaggerate-chinas-threat/587536/?utm_source=feed","urlToImage":null,"publishedAt":"2019-04-21T10:00:00Z","content":"N ews reports suggest that in the coming weeks, the United States and China will sign an agreement that repeals the tariffs the two nations have been levying on each other’s goods for the past nine months. If past behavior is any guide, Donald Trump will call… [+17229 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Garrett Epps","title":"A Supreme Court Case That Will Affect Every Aspect of National Life","description":"Can the federal census form ask whether each member of a household is a U.S. citizen?","url":"https://www.theatlantic.com/ideas/archive/2019/04/can-census-ask-about-citizenship/587503/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/RTX6S2UC/facebook.jpg?1555603018","publishedAt":"2019-04-21T10:00:00Z","content":"The outcome in New York v. Department of Commerce, which the Supreme Court will hear on April 23, will affect virtually every aspect of our national life, from the right to vote to the balance of power in Congress and the Electoral College to the scope of fed… [+11729 chars]"},{"source":{"id":null,"name":"Popula.com"},"author":null,"title":"Grandpa's Beer","description":"The thing that Bob G. cared about a lot, and would NOT RELAX ABOUT, was the temperature of beer.","url":"https://popula.com/2019/04/11/grandpas-beer/","urlToImage":"https://i1.wp.com/popula.com/wp-content/uploads/2019/04/Bob-Lying-Down.jpg?resize=1200,630","publishedAt":"2019-04-21T08:56:10Z","content":"My boyfriend Tors grandfather, Bob Greensfelder, died in November at the age of 95. His memorial service was held last Saturday at North Columbia Schoolhouse in Nevada County, California, where Bob had lived for the last 45 years, after spending much of his a… [+12077 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Giuliani: Trump camp did no wrong by taking Russian help","description":"WASHINGTON (AP) — President Donald Trump's lawyer Rudy Giuliani insisted Sunday the president's 2016 campaign did nothing wrong by taking information from the Russians, as House Democrats pledged stepped-up investigations into campaign misconduct and possible…","url":"https://news.yahoo.com/nadler-evidence-against-trump-impeachable-proven-151212449--politics.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/0MUNVKdeM_rc8puftKm._w--~B/aD0zNDg1O3c9NTIyODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/8698f0f2fab94c96b16e7657890b5321.jpg","publishedAt":"2019-04-21T16:49:56Z","content":"WASHINGTON (AP) President Donald Trump's lawyer Rudy Giuliani insisted Sunday the president's 2016 campaign did nothing wrong by taking information from the Russians, as House Democrats pledged stepped-up investigations into campaign misconduct and possible c… [+6114 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump says immigrants who legally work in cannabis industry could be denied US citizenship","description":"Immigrants who use marijuana or who work in the cannabis industry can be denied citizenship, even if they are doing so in states where it is legal, the US Citizenship and Immigration Services said on Friday.The guidance, issued – coincidentally or not – just …","url":"https://news.yahoo.com/trump-says-immigrants-legally-cannabis-121756020.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/10eItMSKo6WvPcGA4K5TNA--~B/aD01NzY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/ff36406e210778fc684f62bd683f49dd","publishedAt":"2019-04-21T12:17:56Z","content":"Immigrants who use marijuana or who work in the cannabis industry can be denied citizenship, even if they are doing so in states where it is legal, the US Citizenship and Immigration Services said on Friday.\r\nThe guidance, issued coincidentally or not just be… [+4330 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Schiff Says Democrats Will Debate Impeachment Amid Left Pressure","description":"(Bloomberg) -- House Intelligence Committee Chairman Adam Schiff said Sunday that the Democrats will discuss whether to begin impeachment hearings of President Donald Trump after progressives ratcheted up the pressure on a reluctant party leadership.","url":"https://news.yahoo.com/schiff-says-democrats-debate-impeachment-151531933.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/G1.ONymIkudZ947Z9DuIOQ--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/bloomberg_politics_602/0e217fd441a038b665c193f0d23a32f1","publishedAt":"2019-04-21T15:15:31Z","content":"(Bloomberg) -- House Intelligence Committee Chairman Adam Schiff said Sunday that the Democrats will discuss whether to begin impeachment hearings of President Donald Trump after progressives ratcheted up the pressure on a reluctant party leadership.\r\nWere go… [+4804 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Alexandra Witze","title":"Sexual harassment is pervasive in US physics programmes","description":"Survey of undergraduate women finds that most experienced some type of unwanted sexual attention during their physics studies.","url":"https://www.nature.com/articles/d41586-019-01303-6?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01303-6/d41586-019-01303-6_16667082.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"Students attend a meeting as part of the Conferences of Undergraduate Women in Physics in 2017.Credit: CCUWiP 2017\r\nA survey of women pursuing undergraduate degrees in physics has found that nearly three-quarters report experiencing at least one type of sexua… [+3110 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Alexandra Witze","title":"Sexual harassment is pervasive in US physics programmes","description":"Survey of undergraduate women finds that most experienced some type of unwanted sexual attention during their physics studies.","url":"https://www.nature.com/articles/d41586-019-01303-6","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01303-6/d41586-019-01303-6_16667082.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"Students attend a meeting as part of the Conferences of Undergraduate Women in Physics in 2017.Credit: CCUWiP 2017\r\nA survey of women pursuing undergraduate degrees in physics has found that nearly three-quarters report experiencing at least one type of sexua… [+3110 chars]"},{"source":{"id":null,"name":"Dpreview.com"},"author":"Gannon Burgett","title":"Tokina announces new 10mm F2.8 1:1 macro lens for Sony E mount cameras","description":"Tokina has announced the FiRIN 100m F2.8 FE Macro Lens for Sony E mount camera systems. The lens is constructed of nine elements in eight groups and features a nine blade aperture diaphragm. It features 1:1 maximum magnification, has a minimum focusing distan…","url":"https://www.dpreview.com/news/7801373680/tokina-announces-new-10mm-f2-8-1-1-macro-lens-for-sony-e-mount-cameras","urlToImage":"https://1.img-dpreview.com/files/p/E~TS940x788~articles/7801373680/Tokina-100mm-Beach-29.jpeg","publishedAt":"2019-04-21T16:19:00Z","content":"The lens features a 1:1 maximum magnification ratio, a minimum focusing distance of 30cm (11.8in) and weighs 570g (1.3lbs). \r\nSeattle-based photographer Neil Buckland has been working with University of Washington scientist Dr. Tony Irving to photograph, in i… [+4817 chars]"},{"source":{"id":null,"name":"Dpreview.com"},"author":"Carey Rose","title":"Seeing into space: Cosmic Microscapes with photographer Neil Buckland","description":"A slice of meteorite, sandwiched between two linear polarizers. Neil Buckland is obsessed with detail. For more than fifteen years, the Seattle-based photographer has been doing stitched landscape photography composed of dozens of images, captured on everythi…","url":"https://www.dpreview.com/articles/4355145584/cosmic-microscopy-neil-buckland-interview","urlToImage":"https://4.img-dpreview.com/files/p/E~TS940x788~articles/4355145584/Novo_Urei_S1A-30x40.jpeg","publishedAt":"2019-04-21T13:00:00Z","content":"Neil Buckland is obsessed with detail. For more than fifteen years, the Seattle-based photographer has been doing stitched landscape photography composed of dozens of images, captured on everything from Micro Four Thirds cameras all the way up to medium forma… [+6839 chars]"},{"source":{"id":null,"name":"Dpreview.com"},"author":"Carey Rose","title":"Seeing into space: Cosmic Microscapes with photographer Neil Buckland","description":"A slice of meteorite, sandwiched between two linear polarizers. Neil Buckland is obsessed with detail. For more than fifteen years, the Seattle-based photographer has been doing stitched landscape photography composed of dozens of images, captured on everythi…","url":"https://www.dpreview.com/interviews/4355145584/cosmic-microscopy-neil-buckland-interview","urlToImage":"https://4.img-dpreview.com/files/p/E~TS940x788~articles/4355145584/Novo_Urei_S1A-30x40.jpeg","publishedAt":"2019-04-21T13:00:00Z","content":"Neil Buckland is obsessed with detail. For more than fifteen years, the Seattle-based photographer has been doing stitched landscape photography composed of dozens of images, captured on everything from Micro Four Thirds cameras all the way up to medium forma… [+6834 chars]"},{"source":{"id":null,"name":"Avclub.com"},"author":"Mike Vago on AUX, shared by Mike Vago to The A.V. Club","title":"In the past 50 years, one thing U.S. Senators have agreed on is candy—but barely","description":"This week’s entry: Candy Desk Read more...","url":"https://aux.avclub.com/in-the-past-50-years-one-thing-u-s-senators-have-agre-1834067815","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--AzVwNWsd--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rpmu6jgoxqwh6ycq7lsa.jpg","publishedAt":"2019-04-21T15:00:00Z","content":"This weeks entry: Candy Desk\r\nWhat its about: The United States Senate. That august body plays a vital role as a check against executive power, whether its looking the other way while the president lines his pockets with taxpayer money, or looking the other w… [+5007 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Ben Pearson","title":"Ryan Murphy is Bringing ‘The Boys in the Band’ to Netflix, Starring Jim Parsons, Zachary Quinto, and More","description":"Ryan Murphy, the prolific writer/producer/director of Glee and American Horror Story who signed one of the biggest production deals in television history with Netflix last year, has lined up another project for the streaming service. He’ll produce a film adap…","url":"https://www.slashfilm.com/ryan-murphy-is-bringing-the-boys-in-the-band-to-netflix-starring-jim-parsons-zachary-quinto-and-more/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Boys-in-the-Band.jpg","publishedAt":"2019-04-21T17:00:24Z","content":"Ryan Murphy, the prolific writer/producer/director of Glee and American Horror Story who signed one of the biggest production deals in television history with Netflix last year, has lined up another project for the streaming service.\r\nHe’ll produce a film ada… [+2241 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Alex Ward","title":"A comedian just became Ukraine’s next president","description":null,"url":"https://www.vox.com/2019/4/21/18507822/volodymyr-zelensky-ukraine-president-comedian","urlToImage":null,"publishedAt":"2019-04-21T18:09:28Z","content":"Volodymyr Zelensky rode a populist, anti-corruption message straight to the presidency. Ukrainians on Sunday overwhelmingly voted to make a comedian their next president — ushering in a new era of politics in the struggling country. Volodymyr Zelensky, a famo… [+5747 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"Elliot Carter","title":"When the Washington Easter Egg Roll Was Chaos","description":"The president now hosts the annual event because Congress literally kicked the kids off their lawn. Here’s why.","url":"https://www.politico.com/magazine/story/2019/04/21/when-the-washington-easter-egg-roll-was-chaos-226669","urlToImage":"https://static.politico.com/00/79/8a46597d4d33871256a632b9a18f/eastern-roll-eggs-in-the-white-house-in-1929.jpg","publishedAt":"2019-04-21T11:02:24Z","content":"Elliot Carter is a writer and researcher in Washington, D.C.\r\nThe White House Easter Egg Roll is upon us again, with its usual light-hearted fanfare and wholesome traditions. There will be bunny costumes, live music performances and senior government official… [+6852 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"mseverns@politico.com (Maggie Severns)","title":"Republican National Committee raises $15.5 million in March","description":"But the RNC spent almost as much.","url":"https://www.politico.com/story/2019/04/20/republicans-fundraising-rnc-trump-1283782","urlToImage":"https://static.politico.com/13/0e/ffaad6274275a3d2bc385ec21ba5/19420-rncc-ap-773.jpg","publishedAt":"2019-04-21T00:37:08Z","content":"President Donald Trump at the National Republican Congressional Committee's annual spring dinner in Washington, April 2. The RNC has raised close to $46 million this year. | Susan Walsh/AP Photo\r\nThe Republican National Committee raised $15.5 million in March… [+1738 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"Andrew Desiderio","title":"Meet the Democrats’ New Voice on Foreign Policy","description":"Tom Malinowski is an unlikely member of Congress. But he's fast becoming a force on Capitol Hill.","url":"https://www.politico.com/story/2019/04/21/democrats-foreign-policy-tom-malinowski-226695","urlToImage":"https://static.politico.com/3a/2c/be8ab42140f48546c095e4af96c5/190421-malinowski-mahaskey-773.jpg","publishedAt":"2019-04-21T12:31:32Z","content":"SOMERVILLE, N.J. It was a Friday in March at 5:00 p.m. on the dot. Rep. Tom Malinowski\r\n and I had just sat down in his largely empty temporary congressional office here when special counsel Robert Mueller informed Attorney General William Barr that his 22-mo… [+21052 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"Andrew Desiderio","title":"Meet the Democrats’ New Voice on Foreign Policy","description":"Tom Malinowski is an unlikely member of Congress. But he's fast becoming a force on Capitol Hill.","url":"https://www.politico.com/magazine/story/2019/04/21/democrats-foreign-policy-tom-malinowski-226703","urlToImage":"https://static.politico.com/3a/2c/be8ab42140f48546c095e4af96c5/190421-malinowski-mahaskey-773.jpg","publishedAt":"2019-04-21T12:31:32Z","content":"SOMERVILLE, N.J. It was a Friday in March at 5:00 p.m. on the dot. Rep. Tom Malinowski\r\n and I had just sat down in his largely empty temporary congressional office here when special counsel Robert Mueller informed Attorney General William Barr that his 22-mo… [+20962 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"daniel@politico.com (Daniel Lippman)","title":"Rudy to Tapper on taking oppo from foreign sources: ‘Who says it’s even illegal’","description":null,"url":"https://www.politico.com/newsletters/playbook/2019/04/21/rudy-to-tapper-on-taking-oppo-from-foreign-sources-who-says-its-even-illegal-426841","urlToImage":"https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg","publishedAt":"2019-04-21T14:30:17Z","content":"DRIVING THE DAY\r\nBREAKING -- Explosions kill at least 207 in Sri Lanka on Easter Sunday, by APs Bharatha Mallawarachi and Krishan Francis in Colombo, Sri Lanka: At least 207 people were killed and hundreds more injured in eight blasts that rocked churches and… [+24419 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"asnider@politico.com (Annie Snider)","title":"Interior’s Bernhardt worked closely on matters he promised to avoid","description":"New disclosures of the secretary's schedule add to questions surrounding his ties to past lobbying clients, including a California water district.","url":"https://www.politico.com/story/2019/04/21/david-bernhardt-water-law-interior-department-1370107","urlToImage":"https://static.politico.com/2b/8b/f7dc91674e849b600ef4eec370fd/19419-david-bernhardt-gty-773.jpg","publishedAt":"2019-04-21T10:57:53Z","content":"Interior Secretary David Bernhardt shaped the department'sresponse to a key portion of awater infrastructurelaw he hadhelped pass as a lobbyist for California farmers. | Zach Gibson/Getty Images\r\nInterior Secretary David Bernhardtbegan working on policies tha… [+10755 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Zach Buckley","title":"2019 NFL Mock Draft: Predictions for Where 1st-Round Prospects Will End Up","description":"It's finally the week of the 2019  NFL  draft.   Do you know which prospect your team will soon select?   The further you move down the draft board, the more variables that enter the equation...","url":"https://bleacherreport.com/articles/2832307-2019-nfl-mock-draft-predictions-for-where-1st-round-prospects-will-end-up","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/959/hi-res-b19b37066aa212c9dafed41355814235_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T11:09:40Z","content":"Michael Reaves/Getty Images\r\nIt's finally the week of the 2019 NFL draft.\r\nDo you know which prospect your team will soon select?\r\nThe further you move down the draft board, the more variables that enter the equation. But in a class like this, the question ma… [+4795 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Chris Roling","title":"NFL Mock Draft 2019: Projections for Round 1, Analysis for Underrated Prospects","description":"It isn't hard for some high-quality prospects to fall into the underrated realm as the build for the 2019  NFL  draft concludes.    The usual suspects dominate the conversation and shove these prospects to the side...","url":"https://bleacherreport.com/articles/2832387-nfl-mock-draft-2019-projections-for-round-1-analysis-for-underrated-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/035/hi-res-3b7239373cb4889305918d455d267ed8_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T18:09:52Z","content":"Michael Conroy/Associated Press\r\nIt isn't hard for some high-quality prospects to fall into the underrated realm as the build for the 2019 NFL draft concludes. \r\nThe usual suspects dominate the conversation and shove these prospects to the side. Kyler Murray … [+6804 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Timothy Rapp","title":"Donovan Mitchell Says Jazz Won't 'Lay Over'; Uses Cavs-Warriors as Inspiration","description":"The  Utah Jazz  find themselves on the brink of elimination after falling down 3-0 in their series against the  Houston Rockets  with Saturday's 104-101 loss...","url":"https://bleacherreport.com/articles/2832381-donovan-mitchell-says-jazz-wont-lay-over-uses-cavs-warriors-as-inspiration","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/028/hi-res-fca13b1815b8aa59a9a63c1b7b04de97_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T14:05:49Z","content":"Melissa Majchrzak/Getty Images\r\nThe Utah Jazz find themselves on the brink of elimination after falling down 3-0 in their series against the Houston Rockets with Saturday's 104-101 loss.\r\nBut star guard Donovan Mitchell isn't giving up hope just yet, per Ben … [+2843 chars]"},{"source":{"id":null,"name":"Thehustle.co"},"author":null,"title":"The Yodeler Who Sued Yahoo","description":"Twenty years ago, Yahoo decided to roll out a new national advertising campaign. Unfortunately, it didn't reveal this plan to its star yodeler.","url":"https://thehustle.co/the-yodeler-who-sued-yahoo/","urlToImage":"https://thehustle.co/wp-content/uploads/2019/04/share-1.jpg","publishedAt":"2019-04-21T21:52:26Z","content":"In the late 90s, the Yahoo Yodel was inescapable.\r\nFor a time, the 3-note audio clip  Ya-hooooooooo-oooo! defined the young tech company: It came preloaded in Yahoo-branded bottle-openers, doorbells, and plush toys. It chimed through computer speakers. It mad… [+8823 chars]"},{"source":{"id":null,"name":"Theringer.com"},"author":"Tyler Tynes","title":"NBA Players Speak Out Against Verbal Abuse In Arenas","description":"Russell Westbrook's confrontation with a Utah Jazz fan last month exposed a corrosive problem in NBA arenas and the challenge the league faces in protecting its players.","url":"https://www.theringer.com/nba/2019/4/19/18485810/nba-fan-abuse-russell-westbrook-utah-jazz","urlToImage":"https://cdn.vox-cdn.com/thumbor/47m-HdPD9FxmObY8P3WCmxFSJmQ=/0x0:3200x1675/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16162562/westbrook_fan_interaction_getty_AP_ringer.jpg","publishedAt":"2019-04-21T17:58:44Z","content":"Russell Westbrook could no longer ignore the insults or contain his anger. On March 11, in a road game against the Utah Jazz, the Oklahoma City guard was visibly upset as he stood near the end of his teams bench. You think Im playing? I swear to God, he calle… [+16477 chars]"},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"Sri Lanka blocks access to social media platforms, including WhatsApp and Facebook, to curb spread of misinformation after a series of deadly explosions (Washington Post)","description":"Washington Post : Sri Lanka blocks access to social media platforms, including WhatsApp and Facebook, to curb spread of misinformation after a series of deadly explosions — LONDON — The Sri Lankan government blocked access to social media platforms on Sunday,…","url":"https://www.techmeme.com/190421/p7","urlToImage":"http://www.washingtonpost.com/resizer/lg2MmHVe1Covaupy9r4op3mWmaA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LWIZPGDEDEI6TJUYFKHYBDE47M.jpg","publishedAt":"2019-04-21T14:05:01Z","content":null},{"source":{"id":null,"name":"Stereogum.com"},"author":"Julia Gray","title":"Watch Brandi Carlile And Dave Grohl Busk At A Seattle Market","description":"On Saturday afternoon, Brandi Carlile and Dave Grohl gave a surprise acoustic performance at Pike Place Market in Seattle, Washington. According to the Seattle Times, they played for about 15 or 20 minutes. Grohl closed the impromptu busking with Foo Fighters…","url":"https://www.stereogum.com/2040595/brandi-carlile-dave-grohl/news/","urlToImage":"https://static.stereogum.com/uploads/2019/04/GettyImages-1124725201-1555863466-608x485.jpg","publishedAt":"2019-04-21T16:41:59Z","content":"On Saturday afternoon, Brandi Carlile and Dave Grohl gave a surprise acoustic performance at Pike Place Market in Seattle, Washington. According to the Seattle Times, they played for about 15 or 20 minutes. Grohl closed the impromptu busking with Foo Fighters… [+547 chars]"},{"source":{"id":null,"name":"Stereogum.com"},"author":"Julia Gray","title":"Watch Brandi Carlile And Dave Grohl Busk At A Seattle Market","description":"On Saturday afternoon, Brandi Carlile and Dave Grohl gave a surprise acoustic performance at Pike Place Market in Seattle, Washington. According to the Seattle Times, they played for about 15 or 20 minutes. Grohl closed the impromptu busking with Foo Fighters…","url":"https://www.stereogum.com/2040595/brandi-carlile-dave-grohl/video/","urlToImage":"https://static.stereogum.com/uploads/2019/04/GettyImages-1124725201-1555863466-608x485.jpg","publishedAt":"2019-04-21T16:41:59Z","content":"On Saturday afternoon, Brandi Carlile and Dave Grohl gave a surprise acoustic performance at Pike Place Market in Seattle, Washington. According to the Seattle Times, they played for about 15 or 20 minutes. Grohl closed the impromptu busking with Foo Fighters… [+547 chars]"},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Hamza Mohamed","title":"Sudan's military leader vows to hand 'power to people'","description":"Sudan's interim leader says military council is waiting for the opposition to submit proposal for a civilian government.","url":"https://www.aljazeera.com/news/2019/04/sudan-military-leader-vows-hand-power-people-190421164606187.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/4/13/f2c56731c02b4d16a90661efb1a2fe10_18.jpg","publishedAt":"2019-04-21T17:36:59Z","content":"Khartoum, Sudan - Sudan's interim leader said the transitional military council that has run the country since the overthrow of longtime leader Omar al-Bashir is committed to handing power to a civilian authority.\r\nOpposition leaders said on Sunday they will … [+2494 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Gary Gramling","title":"The NFL Mock Draft for The People","description":"A realistic look at Thursday's first round: Everyone wants to trade down.","url":"https://www.si.com/nfl/2019/04/20/mock-draft-trade-down-giants-kyler-murray","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/21/nfl-mock-draft-trades-2.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-21T04:43:13Z","content":"Lets get the hell out of here!\r\nThats the famous line, spoken by a ruggedly handsome veteran lead actor in a motion picture. If I remember correctly, he was the leader, and he and others were trying to overcome an obstacle of some kind. Aliens? Or a shark? Wa… [+18824 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Lindsay Gibbs","title":"Breanna Stewart’s injury adds another layer of urgency to WNBA collective bargaining negotiations","description":"The 23rd season of the WNBA tips off in a little over a month, and it looks to be a momentous one for the leagues’s athletes. On court, the 12 teams and 144 players will be looking to capitalize on last year’s blockbuster season, which saw a healthy increase …","url":"https://thinkprogress.org/breanna-stewart-wnba-collective-bargaining-salaries/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1004924326.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-21T12:00:17Z","content":"The 23rd season of the WNBA tips off in a little over a month, and it looks to be a momentous one for the leagues’s athletes. On court, the 12 teams and 144 players will be looking to capitalize on last year’s blockbuster season, which saw a healthy increase … [+7368 chars]"},{"source":{"id":null,"name":"Wstale.com"},"author":null,"title":"Free Speech Puts USA on Collision Course With Global Limits on Big Tech...","description":"WASHINGTON — When Mark Zuckerberg of Facebook called for regulating harmful internet content in an opinion column last month, Republicans in Washington expressed","url":"https://wstale.com/technology/free-speech-puts-u-s-on-a-collision-course-with-global-limits-on-big-tech/","urlToImage":"https://wstale.com/wp-content/uploads/2019/04/cnewsfoto00techspeech-facebookJumbo.jpg","publishedAt":"2019-04-21T21:40:38Z","content":"WASHINGTON When Mark Zuckerberg of Facebook called for regulating harmful internet content in an opinion column last month, Republicans in Washington expressed outrage that he was calling on the government to regulate speech.\r\nWithin hours, the companys top l… [+7786 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump brushes off Romney criticism, points to loss in 2012...","description":"WASHINGTON (AP) — Sen. Mitt Romney says he's \"sickened\" by the dishonesty the Russia investigation found in the Trump White House, but the president fires back that Romney should have put the same energy into running for president in 2012 that the Utah Republ…","url":"https://news.yahoo.com/trump-brushes-off-romneys-criticism-232500380.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/V6jFyFS70igIO0_OClJROQ--~B/aD00ODYxO3c9NjQyNjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/7aaf7872a5ee460695fbd167b4536ac9.jpg","publishedAt":"2019-04-21T06:22:36Z","content":"WASHINGTON (AP) Sen. Mitt Romney says he's \"sickened\" by the dishonesty the Russia investigation found in the Trump White House, but the president fires back that Romney should have put the same energy into running for president in 2012 that the Utah Republic… [+545 chars]"},{"source":{"id":null,"name":"Postguam.com"},"author":"Tribune News Service","title":"Trump-friendly spin puts heat on Barr...","description":"Trump-friendly spin puts heat on Barr... (Second column, 3rd story, link ) Related stories: MAG: Most chilling moment in Mueller report occurs on page 446... Dems debate impeachment... Broke Roger Stone Speaking for Money at Strip Club... How 'Suicidal' Micha…","url":"https://www.postguam.com/the_globe/nation/trump-friendly-spin-puts-heat-on-barr/article_cc6cd6ca-63d1-11e9-b00c-93d0be1fd50c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/f/21/f21a0546-63d1-11e9-9821-43438bfffed1/5cbbc3bb8a6f4.image.jpg?resize=952%2C630","publishedAt":"2019-04-21T19:40:39Z","content":"WASHINGTON  Ninety minutes before Robert Muellers final report on his Russia probe was released, Attorney General William Barr previewed it from a podium on the seventh floor of the Justice Department.\r\nBarr declared the special counsel had found substantial … [+4133 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Leonard Williams faces uncertain future as Jets mull defensive-line pick","description":"Entering a contract year, the pressure is on the defensive end to produce. And the questions will only intensify if New York selects a D-line prospect.","url":"http://www.espn.com/blog/new-york/jets/post/_/id/79664/leonard-williams-faces-uncertain-future-as-jets-mull-defensive-line-pick","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0419%2Fr531438_1296x729_16%2D9.jpg","publishedAt":"2019-04-21T13:25:17Z","content":"A look at what's happening around the New York Jets:\r\n1. Year of the (Big) Cat? The last time the Jets had a high-profile defensive lineman entering the final year of his contract (Sheldon Richardson, 2017), they traded him. The time before that (Muhammad Wil… [+8549 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Highly rated WRs have found it tough to catch on with Patriots","description":"With an extensive playbook and high expectations, New England has had a difficult time finding rookie pass-catchers who can make an early impact.","url":"http://www.espn.com/blog/boston/new-england-patriots/post/_/id/4817397/highly-rated-wrs-have-found-it-tough-to-catch-on-with-patriots","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2012%2F0122%2Fnfl_u_branch01jr_576.jpg","publishedAt":"2019-04-21T13:25:17Z","content":"FOXBOROUGH, Mass. -- Quick-hit thoughts and notes around the New England Patriots and NFL:\r\n1. Patriots looking for Deion Branch-type pick: If the Patriots could pull off what they did in 2002, when they drafted receiver Deion Branch at the end of the second … [+11695 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Sports Desk","title":"IPL 2019, RCB vs CSK Live Cricket Score: Royal Challengers Bangalore host Chennai Super Kings","description":"IPL 2019 Live Cricket Score Online Today Match, RCB vs CSK VIVO IPL 2019 Live Cricket Match Score Streaming Online, Star Sports 1, Hotstar IPL Live: Catch Live score and updates of IPL 2019 match between Royal Challengers Bangalore and Chennai Super Kings.","url":"https://indianexpress.com/article/sports/ipl/ipl-2019-rcb-vs-csk-live-cricket-score-online-updates-5687079/","urlToImage":"https://images.indianexpress.com/2019/04/rcb-vs-csk-live-759.jpg?w=759","publishedAt":"2019-04-21T13:30:30Z","content":"IPL 2019, RCB vs CSK Live Cricket Score: Royal Challengers Bangalore take on Chennai Super Kings. (Source: IPL)\r\nIPL 2019, RCB vs CSK Live Cricket Score Online today Match: Royal Challengers Bangalore will host MS Dhoni-led Chennai Super Kings as they look to… [+1621 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Adam Carlson","title":"Donald and Melania Trump Retreat to Mar-a-Lago for Easter in the Wake of Mueller Report's Release","description":"President Donald Trump and First Lady Melania Trump returned to a favorite retreat — the Mar-a-Lago Club in Palm Beach, Florida — in the days after the release of Robert Mueller’s report on Russia. In Florida, the president resumed what has been a nearly two-…","url":"https://people.com/politics/donald-trump-melania-easter-mar-a-lago-after-mueller-report/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/easter-b.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630","publishedAt":"2019-04-21T21:00:16Z","content":"President Donald Trump and First Lady Melania Trump returned to a favorite retreat the Mar-a-Lago Club in Palm Beach, Florida in the days after the release of Robert Mueller’s report on Russia.\r\nIn Florida, the president resumed what has been a nearly two-yea… [+3314 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Rachel DeSantis","title":"More Than 200 People Killed in Series of Deadly Church and Hotel Bombings in Sri Lanka","description":"A series of bombs tore through Sri Lanka on Easter Sunday, killing more than 200 people in churches and popular tourist hotels in and around the island nation’s capital of Colombo. Six blasts went off simultaneously Sunday morning, targeting Easter mass atten…","url":"https://people.com/crime/sri-lanka-bombings-more-than-200-people-killed/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/sri-lanka.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630","publishedAt":"2019-04-21T15:55:27Z","content":"A series of bombs tore through Sri Lanka on Easter Sunday, killing more than 200 people in churches and popular tourist hotels in and around the island nations capital of Colombo.\r\nSix blasts went off simultaneously Sunday morning, targeting Easter mass atten… [+3957 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Sarah N. Lynch","title":"U.S.' Pompeo: Americans were among those killed in Sri Lanka attacks","description":"U.S. Secretary of State Mike Pompeo said on Sunday that \"several U.S. citizens were among those killed\" in a series of bomb blasts in Sri Lanka on Easter morning that killed more than 200 people and injured at least 450 others.","url":"https://www.reuters.com/article/us-sri-lanka-blasts-usa-idUSKCN1RX0J3","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20190421&t=2&i=1379222044&w=1200&r=LYNXNPEF3K0IL","publishedAt":"2019-04-21T16:24:35Z","content":"WASHINGTON (Reuters) - U.S. Secretary of State Mike Pompeo said on Sunday that “several U.S. citizens were among those killed” in a series of bomb blasts in Sri Lanka on Easter morning that killed more than 200 people and injured at least 450 others. \r\nThe Wh… [+265 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Michaela Cabrera","title":"At Easter mass, Parisians pray for Notre-Dame's swift restoration","description":"With no cathedral to go to, hundreds of Parisians gathered for Easter Sunday mass at the smaller Saint-Eustache catholic church on the city's right bank, and prayed for the swift restoration of Notre-Dame after its devastating fire.","url":"https://www.reuters.com/article/us-france-notredame-easter-idUSKCN1RX0D4","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20190421&t=2&i=1379175360&w=1200&r=LYNXNPEF3K0FD","publishedAt":"2019-04-21T12:47:03Z","content":"PARIS (Reuters) - With no cathedral to go to, hundreds of Parisians gathered for Easter Sunday mass at the smaller Saint-Eustache catholic church on the city’s right bank, and prayed for the swift restoration of Notre-Dame after its devastating fire. \r\nThe ar… [+2032 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Jerri-Lynn Scofield","title":"Judge Brian Morris Halts New Trump Coal Sales on Federal Lands","description":"US federal district judge Brian Morris dealt a serious setback to the Trump administration’s agenda of resuming coal mining on federal lands.","url":"https://www.nakedcapitalism.com/2019/04/judge-brian-morris-halts-new-trump-coal-sales-on-federal-lands.html","urlToImage":null,"publishedAt":"2019-04-21T15:25:13Z","content":"By Jerri-Lynn Scofield, who has worked as a securities lawyer and a derivatives trader. She is currently writing a book about textile artisans.\r\nUS federal district judge Brian Morris dealt a serious setback to the Trump administrations decision to increase c… [+6862 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Jerri-Lynn Scofield","title":"Judge Brian Morris Stymies New Trump Coal Sales on Federal Lands","description":"US federal district judge Brian Morris dealt a serious setback to the Trump administration’s agenda of resuming coal mining on federal lands.","url":"https://www.nakedcapitalism.com/2019/04/judge-brian-morris-stymies-new-trump-coal-sales-on-federal-lands.html","urlToImage":null,"publishedAt":"2019-04-21T15:25:13Z","content":"By Jerri-Lynn Scofield, who has worked as a securities lawyer and a derivatives trader. She is currently writing a book about textile artisans.\r\nUS federal district judge Brian Morris dealt a serious setback to the Trump administrations decision to increase c… [+6888 chars]"},{"source":{"id":null,"name":"Psychologytoday.com"},"author":"Liz Swan Ph.D.","title":"Resurrecting Jesús Cristo at United States’ Southern Border","description":"Easter celebrates the resurrection of Jesus. Our relationship with migrants coming across the U.S. southern border is broken. Here's a take on a parallel between the two...","url":"https://www.psychologytoday.com/us/blog/the-philosopher-is-in/201904/resurrecting-jes-s-cristo-united-states-southern-border","urlToImage":"https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-04/butterfly.jpg?itok=mW9GytbT","publishedAt":"2019-04-21T00:53:51Z","content":"This post is written by guest blogger Erica Lee.\r\nPew Research Center hosted the RLS survey asking more than 35,000 Americans from all 50 states about their religious affiliations, beliefs and practices, and social and political views. 70% of participants rep… [+7270 chars]"},{"source":{"id":null,"name":"Psychologytoday.com"},"author":"Darcia F. Narvaez Ph.D.","title":"Sustainable Wisdom: Indigenous Style","description":"Many societies lived sustainably for thousands and even tens of thousands of years. What do they know that we can learn from?","url":"https://www.psychologytoday.com/ca/blog/moral-landscapes/201904/sustainable-wisdom-indigenous-style","urlToImage":"https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-04/narvaez_cover.jpg?itok=7TWXHAZ_","publishedAt":"2019-04-21T14:36:01Z","content":"Humanity is facing unprecedented planetary disruption not only from global warming but the devastation of natural ecologies and extensive pollution. It is easy to feel that this is inevitable, collateral damage from progress. But this damage is largely recent… [+9232 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Bruce Y. Lee, Contributor, Bruce Y. Lee, Contributor https://www.forbes.com/sites/brucelee/","title":"Why Sen. Walsh Said Nurses \"Play Cards For A Considerable Amount Of The Day\"","description":"Here is what Washington State Senator Maureen Walsh (R) said about a bill that would mandate uninterrupted meal and rest periods for nurses","url":"https://www.forbes.com/sites/brucelee/2019/04/21/why-sen-walsh-said-nurses-play-cards-for-a-considerable-amount-of-the-day/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F7e42609c5dfa4e91828bb8ece6b6f4b2%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-21T14:29:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nA statement by Maureen Walsh, R-Walla Walla, (pictured here hugging a colleague) didn't quite come up aces with the nursing profession. (AP Photo/Ted S. Warren)\r\nA hospital is not a casino or a cruise sh… [+10086 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jo Piazza, Contributor, Jo Piazza, Contributor https://www.forbes.com/sites/jopiazza/","title":"This Women-Led Company Gives New Moms the Things They Actually Need","description":"This direct to consumer delivery service brings new moms all of the things no one tells them they'll need in the weeks after giving birth. Founders Amelia Makin and Kiki Burger are hoping to revolutionize the way women care for themselves postpartum.","url":"https://www.forbes.com/sites/jopiazza/2019/04/21/this-woman-led-company-gives-new-moms-the-things-they-actually-need/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fjopiazza%2Ffiles%2F2019%2F03%2FAmelia-Kiki-Pregnant-2016-e1551554911851-1200x900.jpg","publishedAt":"2019-04-21T16:29:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAmelia Makin and Kiki Burger met before they delivered their first children. They bonded over the difficulty of post-partum recovery. Now the two women are on a mission to help women get what they need a… [+10121 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Amit Chowdhry, Contributor, Amit Chowdhry, Contributor https://www.forbes.com/sites/amitchowdhry/","title":"Social Media Roundup: Instagram Hidden Likes Count Test, Facebook AI Assistant Coming, Pinterest IPO","description":"In this week’s “Social Media Roundup,” you will learn about Instagram testing a hidden like count interface, Facebook's Messenger getting a dark mode, the Pinterest IPO and more!","url":"https://www.forbes.com/sites/amitchowdhry/2019/04/21/social-media-roundup-instagram-hidden-likes-count-test-facebook-ai-assistant-coming-pinterest-ipo/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_2529%2Fpt_2529_29307_o.jpg%3Ft%3D1555884002","publishedAt":"2019-04-21T22:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nA banner for Pinterest Inc. hanging from the New York Stock Exchange (NYSE) on the morning that the company made&amp;nbsp;its initial public offering on April 18, 2019. (Photo by Spencer Platt/Getty Imag… [+19700 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Zak Doffman, Contributor, Zak Doffman, Contributor https://www.forbes.com/sites/zakdoffman/","title":"Has China Been Using Huawei To Break U.S. Intelligence Sharing Arrangements?","description":"The battle between Washington and Huawei, under the watchful gaze of Beijing, has been framed around cybersecurity. But what if it was more complex? What if the disruption to international intelligence-sharing arrangements now being discussed was the focus al…","url":"https://www.forbes.com/sites/zakdoffman/2019/04/21/has-china-been-using-huawei-to-break-u-s-intelligence-sharing-arrangements/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1125651159%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-21T10:49:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\n&amp;quot;Huawei hampers U.S. efforts to spy on whomever it wants,&amp;quot; the company's rotating chairman Guo Ping claimed in the&amp;nbsp;Financial Times&amp;nbsp;in February. &amp;quot;The more Huaw… [+17035 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Kevin Murnane, Contributor, Kevin Murnane, Contributor https://www.forbes.com/sites/kevinmurnane/","title":"How To Create Unique Passwords For Every Account That Are Hard To Guess And Easy To Remember","description":"Here's a useful template for creating good passwords.","url":"https://www.forbes.com/sites/kevinmurnane/2019/04/21/how-to-create-unique-passwords-for-every-account-that-are-hard-to-guess-and-easy-to-remember/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkevinmurnane%2Ffiles%2F2019%2F04%2FLock_640sq_JanBaby_PB-500x500.png","publishedAt":"2019-04-21T15:55:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nCreate a good password\r\nCredit: JanBaby/Pixabay\r\nPasswords are a problem. Every account should have a unique password thats hard to guess. But how do you remember all those unique passwords when you have… [+13968 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Steve Denning, Contributor, Steve Denning, Contributor https://www.forbes.com/sites/stevedenning/","title":"Understanding Mueller","description":"Congress Should Focus Less On Impeaching Trump And More On Executing Remedies To The Reprehensible Behavior Mueller Has Uncovered","url":"https://www.forbes.com/sites/stevedenning/2019/04/21/understanding-mueller/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fd18dbe576dcf4121a824b2096ececebe%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-21T22:48:00Z","content":"Its long. Its dense. Its complex. Its detailed. Its full of footnotes. Once you get into it, its gripping. But life is short. For most of us, reading the entire Mueller Report is just too much.Mueller Report(AP Photo/Cliff Owen)\r\nSo, lets dive in at the end, … [+38860 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Alejandro Cremades, Contributor, Alejandro Cremades, Contributor https://www.forbes.com/sites/alejandrocremades/","title":"This Entrepreneur Went From $400,000 In Credit Card Debt To Selling His Business For $1.65 Billion","description":"Son of Indian immigrants, a former lawyer and now a CEO, Reggie Aggarwal took on an industry worth more than the GDP of 90% of countries in the world and built a billion-dollar business in the process.","url":"https://www.forbes.com/sites/alejandrocremades/2019/04/21/this-entrepreneur-went-from-400000-in-credit-card-debt-to-selling-his-business-for-1-65-billion/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Falejandrocremades%2Ffiles%2F2019%2F04%2FScreen-Shot-2019-04-20-at-9.50.59-PM.png","publishedAt":"2019-04-21T10:44:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nReggie Aggarwal\r\nReggie Aggarwal\r\nSon of Indian immigrants, a former lawyer and now a CEO, Reggie Aggarwal took on an industry worth more than the GDP of 90% of countries in the world and built a billion… [+15035 chars]"},{"source":{"id":null,"name":"Slashgear.com"},"author":"Brittany A. Roston","title":"CIA leak claims Huawei received funds from Chinese state security","description":"A new leak claims the CIA has accused Chinese company Huawei of receiving funds from the People’s Liberation Army, China’s National Security Commission, and the nation’s state intelligence network. This allegation has reportedly been passed on to officials in…","url":"https://www.slashgear.com/cia-leak-claims-huawei-received-funds-from-chinese-state-security-21574225/","urlToImage":"https://edge.slashgear.com/wp-content/uploads/2019/04/huawei_main.jpg","publishedAt":"2019-04-21T11:15:31Z","content":"A new leak claims the CIA has accused Chinese company Huawei of receiving funds from the People’s Liberation Army, China’s National Security Commission, and the nation’s state intelligence network. This allegation has reportedly been passed on to officials in… [+1408 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Edward-Isaac Dovere","title":"The Last Kennedy","description":"A number of Democratic power brokers wanted Representative Joe Kennedy to run for president. He consulted with family members and said no.","url":"https://www.theatlantic.com/politics/archive/2019/04/representative-joe-kennedy-said-no-presidential-race/587401/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_542344246_toned/facebook.jpg?1555530137","publishedAt":"2019-04-21T11:00:00Z","content":"FALL RIVER, Mass.—Four new members of the House were hanging out at a bar back at the end of 2012, after a long day of new-member orientation at Harvard’s Kennedy School: Joe Kennedy of Massachusetts, Beto O’Rourke of Texas, Tulsi Gabbard of Hawaii, and Eric … [+26319 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/washington-examiner","title":"Rebuild this temple - Washington Examiner","description":"Rebuild this temple Washington Examiner Notre Dame fire pledges inflame yellow vest protesters Al Jazeera English France's Yellow Vest protesters return to the streets enraged by billions pledged to rebuild Notre Dame Fox News Macron popularity rises to 23-we…","url":"https://www.washingtonexaminer.com/opinion/editorials/rebuild-this-temple","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/457aa17/2147483647/strip/true/crop/2273x1194+8+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F0d%2Fc8%2F6127d9b141a1b5e595a24a07cd2f%2Fap-19107654622626.jpg","publishedAt":"2019-04-21T04:00:00Z","content":"People were getting carried away about the fire at Notre Dame Cathedral, one Catholic bishop felt. Some commentators are reading, imposing, waaaaay too much spiritual significance into the Notre Dame fire, Bishop Thomas Tobin of Providence, R.I., wrote on Twi… [+3694 chars]"},{"source":{"id":"the-washington-times","name":"The Washington Times"},"author":"Valerie Richardson","title":"Rashida Tlaib's Passover greeting falls flat - Washington Times","description":"Rashida Tlaib's Passover greeting falls flat Washington Times Ilhan Omar wishes Jews a 'Happy Passover' New York Post Labour forced to delete tweet after EMBARRASSING Passover message mocked by Jews Express Rabbi Abraham Cooper: Passover mixes recollections o…","url":"https://www.washingtontimes.com/news/2019/apr/21/rashida-tlaibs-passover-greeting-falls-flat/","urlToImage":"https://twt-thumbs.washtimes.com/media/image/2019/04/12/house_democrats_100_days_78564_s2048x1366.jpg?c33dbafc5dce9b4912eaa4af7b06a97f0e06f219","publishedAt":"2019-04-21T14:57:44Z","content":"Rep. Rashida Tlaib, Michigan Democrat, offered Passover greetings to her “Jewish sisters and brothers” with a graphic that included two fluffy loaves of bread.\r\nThere’s just one problem: Jewish people don’t eat leavened bread on Passover.\r\nThe first-term cong… [+3346 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"After Mueller report, Democrats weigh impeachment - The Washington Post","description":"After Mueller report, Democrats weigh impeachment The Washington Post House Intelligence Committee Chairman Adam B. Schiff (D-Calif.) on April 21 said House Democrats will meet in the coming weeks to discuss whether to pursue... View full coverage on Google N…","url":"https://www.youtube.com/watch?v=iKkuIX4Qtp4","urlToImage":null,"publishedAt":"2019-04-21T21:29:11Z","content":null},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/naomi-lim","title":"Maxine Waters: Forget investigations, impeach Trump now - Washington Examiner","description":"Maxine Waters: Forget investigations, impeach Trump now Washington Examiner Schiff on Mueller Report: “In Every Way This Is More Significant Than Watergate” Slate Chris Wallace challenges Giuliani over Trump's 'no obstruction' claim: 'Mayor, that's not true' …","url":"https://www.washingtonexaminer.com/news/maxine-waters-forget-investigations-impeach-trump-now","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/be78780/2147483647/strip/true/crop/3000x1575+0+79/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fd8%2F14%2Ff6e246ca4688bdb1fc6612292cd9%2Fap-19090115496709.jpg","publishedAt":"2019-04-21T17:17:00Z","content":"Rep. Maxine Waters, D-Calif., demanded her caucus proceed straight to impeaching President Trump on Sunday, questioning the efficacy of some of her colleagues insisting they conduct investigations first.\r\n\"If the Democrats cannot decide that they're going to … [+1546 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/naomi-lim","title":"Jerrold Nadler: Don McGahn will be called to testify - Washington Examiner","description":"Jerrold Nadler: Don McGahn will be called to testify Washington Examiner House Judiciary chair to call on McGahn to testify before Congress | TheHill The Hill Nadler says he will call McGahn POLITICO Nadler says Democrats will call Donald McGahn to testify Th…","url":"https://www.washingtonexaminer.com/news/jerry-nadler-don-mcgahn-will-be-called-to-testify","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/a136292/2147483647/strip/true/crop/5472x2873+0+143/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F0f%2F79%2F8bcd9ca04dc2b2f3b4ad2d049239%2Fap-19108018007230.jpg","publishedAt":"2019-04-21T15:31:00Z","content":"Former White House counsel Don McGahn will be called to testify before the House Judiciary Committee, Chairman Jerrold Nadler, D-N.Y., said Sunday.\r\nMcGahn's appearance would help the panel understand whether President Trump obstructed justice when he asked M… [+1399 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/zachary-halaschak","title":"Kellyanne Conway rips Trump critics after release of Mueller report - Washington Examiner","description":"Kellyanne Conway rips Trump critics after release of Mueller report Washington Examiner Kellyanne Conway: Mueller didn't need to use the word 'exoneration' in report | TheHill The Hill 'This Week' Transcript 4-21-19: Kellyanne Conway and Rep. Adam Schiff ABC …","url":"https://www.washingtonexaminer.com/news/kellyanne-conway-rips-trump-critics-after-release-of-mueller-report","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/e5559ae/2147483647/strip/true/crop/2290x1202+0+8/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F61%2Fd8%2F252925d74d098a16bda60c9a85ea%2Fkc.jpg","publishedAt":"2019-04-21T13:46:00Z","content":"Counselor to the president Kellyanne Conway tore into people who questioned the legitimacy of President Trumps presidency on Sunday, arguing special counsel Robert Muellers report shows they were wrong. \r\nFor two years people denied the electability of Donald… [+1270 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/claude-thompson","title":"BuzzFeed News editor crushed by Twitter ratio for Sri Lanka bombings jab at Trump - Washington Examiner","description":"BuzzFeed News editor crushed by Twitter ratio for Sri Lanka bombings jab at Trump Washington Examiner Pres. Trump incorrectly tweets that millions have died in Sri Lanka bombing USA TODAY BuzzFeed News editor takes heat for suggesting Trump would be more outr…","url":"https://www.washingtonexaminer.com/news/buzzfeed-news-editor-crushed-by-twitter-ratio-for-sri-lanka-bombings-jab-at-trump","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/71d0f05/2147483647/strip/true/crop/2300x1208+0+25/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F67%2Ff6%2Fc6a7a959445b8db994dc12666684%2Fbuzzfeed.jpg","publishedAt":"2019-04-21T19:05:00Z","content":"A BuzzFeed News journalist suggested on Twitter there would be more outrage from President Trump's administration over the deadly Sri Lanka bombings if the victims were white. \r\nBuzzFeed News world editor Miriam Elder tweeted hours after explosions on Easter … [+2320 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/naomi-lim","title":"Chris Wallace challenges Adam Schiff on Trump-Russia collusion 'in plain sight' claim - Washington Examiner","description":"Chris Wallace challenges Adam Schiff on Trump-Russia collusion 'in plain sight' claim Washington Examiner 'In every way, this is more significant than Watergate': House Intel Chairman Schiff ABC News Schiff rips Conway's 'display of alternative facts' on Russ…","url":"https://www.washingtonexaminer.com/news/chris-wallace-challenges-adam-schiff-on-trump-russia-collusion-in-plain-sight-claim","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/8db09e1/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fd8%2Fbf%2Ff4e007ca49889bb8aa52597ac44c%2Fchris-wallace-screenshot-092718.jpg","publishedAt":"2019-04-21T14:43:00Z","content":"Fox News host Chris Wallace skewered House Intelligence Chairman Adam Schiff, D-Calif., on Sunday over his insistence that there is clear evidence President Trump's 2016 campaign colluded with Russia.\r\nDuring a segment of \"Fox News Sunday,\" Wallace played Sch… [+1639 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/daniel-chaitin","title":"Rudy Giuliani: 'Nothing wrong' with Trump campaign taking info from Russians - Washington Examiner","description":"Rudy Giuliani: 'Nothing wrong' with Trump campaign taking info from Russians Washington Examiner Giuliani: 'There's nothing wrong with taking information from Russians' CNN Giuliani: 'Nothing wrong' with campaign taking information from Russians | TheHill The…","url":"https://www.washingtonexaminer.com/news/rudy-giuliani-nothing-wrong-with-trump-campaign-taking-info-from-russians","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/b912dab/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F8c%2Fef%2F6ae90d6d447596088d50b88e1dcd%2Fap-18214022515872.jpg","publishedAt":"2019-04-21T13:35:00Z","content":"President Trump's lawyer Rudy Giuliani said \"there's nothing wrong\" with a presidential campaign taking information from the Russians.\r\nDuring an interview on CNN's \"State of the Union,\" host Jake Tapper brought up the infamous June 2016 Trump Tower meeting, … [+1414 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"","title":"Iran's Guard gets a long-overdue but much-deserved terrorist designation - Washington Examiner","description":"The United States has decided to designate the Islamic Revolutionary Guard Corps a foreign terrorist organization under section 219 of the Immigration and Nationality Act. This is a major step toward effectively countering Tehran’s systemic use of terrorism a…","url":"https://www.washingtonexaminer.com/opinion/op-eds/irans-guard-gets-a-long-overdue-but-much-deserved-terrorist-designation","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/522a5c3/2147483647/strip/true/crop/2290x1202+0+52/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fa8%2F64%2F0a327723412ba0f3c15f41e13bf8%2Firgc.jpg","publishedAt":"2019-04-21T04:00:00Z","content":"The United States has decided to designate the Islamic Revolutionary Guard Corps a foreign terrorist organization under section 219 of the Immigration and Nationality Act\r\n. This is a major step toward effectively countering Tehrans systemic use of terrorism … [+4021 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/claude-thompson","title":"Florida police investigating cops seen in viral video shoving black teen's head into ground - Washington Examiner","description":"Florida police investigating cops seen in viral video shoving black teen's head into ground Washington Examiner Florida deputy under investigation after video of him punching black teen in the head goes viral USA TODAY A Florida deputy is under investigation …","url":"https://www.washingtonexaminer.com/news/florida-police-investigating-cops-seen-in-viral-video-shoving-black-teens-head-into-ground","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/4ad9acc/2147483647/strip/true/crop/5048x2650+0+132/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F63%2F2d%2F5f8a215449c1bd6c8ed9ce5f188e%2Fap-19011827832977.jpg","publishedAt":"2019-04-21T18:09:00Z","content":"Two white Florida deputies are being investigated after a video circulated on social media showing them throwing a black teenager to the ground, forcibly pushing his head into concrete, and arresting him while in the middle of an arrest of another black youth… [+2350 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/daniel-chaitin","title":"George Conway offers subpoena tip to Democrats related to Don McGahn - Washington Examiner","description":"George Conway offers subpoena tip to Democrats related to Don McGahn Washington Examiner Trump expresses anger after release of Mueller report CBS News The Mueller Report: A New Tell-All About Trump's White House NPR Tom Perez: No one – not even President Tru…","url":"https://www.washingtonexaminer.com/news/george-conway-offers-subpoena-tip-to-democrats-related-to-don-mcgahn","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/b178d30/2147483647/strip/true/crop/2300x1208+0+63/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Ffc%2F6c%2F8487c7e84e3db453c2134502e251%2Fconways.jpg","publishedAt":"2019-04-21T12:39:00Z","content":"George Conway, White House counselor Kellyanne Conway's husband, advised congressional Democrats to subpoena \"everyone and everything\" related to President Trump's reelection campaign dropping the law firm that employs his former counsel Don McGahn.\r\nThe move… [+1953 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/zachary-halaschak","title":"Mike Lee compares Mueller report to Pinocchio from 'Shrek' - Washington Examiner","description":"Mike Lee compares Mueller report to Pinocchio from 'Shrek' Washington Examiner Sen. Mike Lee says it would be a \"mistake\" for Democrats to pursue Trump's impeachment Face the Nation GOP senator compares Mueller report's obstruction findings to 'Pinocchio' in …","url":"https://www.washingtonexaminer.com/news/mike-lee-compares-mueller-report-to-pinocchio-from-shrek","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/c8ec078/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F87%2F61%2Faac6db4b4be9971beca069d28c99%2Fpinocchio.jpg","publishedAt":"2019-04-21T17:42:00Z","content":"Sen. Mike Lee, R-Utah, said parts of special counsel Robert Muellers report remind him of Pinocchio from the Shrek movie franchise. \r\nAppearing on CBSs Face the Nation Sunday, Lee said Muellers details of the report on obstruction of justice contain double ne… [+1685 chars]"}]}