{"status":"ok","totalResults":2657,"articles":[{"source":{"id":null,"name":"Gizmodo.com"},"author":"Adam Clark Estes","title":"Mark Zuckerberg May, Personally, Be in Big Trouble With the FTC","description":"Two sources familiar with the Federal Trade Commission’s investigation into Facebook say that Mark Zuckerberg himself is now a target. According to The Washington Post, the agency wants to hold the company’s co-founder, chief executive, and board chairman—Zuc…","url":"https://gizmodo.com/mark-zuckerberg-may-personally-be-in-big-trouble-with-1834165495","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--vNtIqOXD--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oyso2iqwcqujq5bxshro.jpg","publishedAt":"2019-04-19T14:50:00Z","content":"Two sources familiar with the Federal Trade Commissions investigation into Facebook say that Mark Zuckerberg himself is now a target. According to The Washington Post, the agency wants to hold the companys co-founder, chief executive, and board chairmanZuck i… [+3300 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Catie Keck","title":"Lyft's Messy IPO Gets More Complicated Thanks to Two Investor Class-Action Lawsuits","description":"Lyft’s initial public offering headache just got worse. Read more...","url":"https://gizmodo.com/lyfts-messy-ipo-gets-more-complicated-thanks-to-two-inv-1834159382","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--Q1N9kZEi--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/js8k22y0fd8nkfexbaue.jpg","publishedAt":"2019-04-19T04:40:00Z","content":"Lyfts initial public offering headache just got worse.\r\nBloomberg reported Wednesday that following Lyfts initial public offering, which didnt exactly go super well, the company is now looking at two separate lawsuits from its investors. At the time the compa… [+1373 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"CARL HULSE","title":"On Washington: Mueller Findings Kick Off a Political Tug of War That’s Only Just Beginning","description":"Democrats appear to be gearing up, with Representative Jerrold Nadler of New York describing the report as a road map to holding the president accountable.","url":"https://www.nytimes.com/2019/04/19/us/politics/republican-democratic-reaction-to-mueller-report.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/obituaries/19dc-hulse/19dc-husle-facebookJumbo.jpg","publishedAt":"2019-04-19T09:00:19Z","content":"The threat of fallout is even greater now, with Republicans able to cite Mr. Muellers report that found no conspiracy by the Trump campaign to cooperate with Russian agents along with the special counsels refusal to cite the president for obstruction of justi… [+1731 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"CARL HULSE","title":"On Washington: Mueller Findings Kick Off a Political Tug of War That’s Only Just Beginning","description":"Democrats appear to be gearing up, with Representative Jerrold Nadler of New York describing the report as a road map to holding the president accountable.","url":"https://www.nytimes.com/2019/04/19/us/politics/mueller-congress-house.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/obituaries/19dc-hulse/19dc-husle-facebookJumbo.jpg","publishedAt":"2019-04-19T09:00:19Z","content":"The threat of fallout is even greater now, with Republicans able to cite Mr. Muellers report that found no conspiracy by the Trump campaign to cooperate with Russian agents along with the special counsels refusal to cite the president for obstruction of justi… [+1731 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"ERIC V. COPAGE","title":"As a Black Child in Los Angeles, I Couldn’t Understand Why Jesus Had Blue Eyes","description":"As Christians prepare to celebrate Easter, a Times journalist wonders how others first visualized Jesus as a child — and what those images mean now. Share your experience in the comments.","url":"https://www.nytimes.com/2019/04/19/reader-center/jesus-images.html","urlToImage":"https://static01.nyt.com/images/2019/04/21/us/21readers-jesus3/21readers-jesus3-facebookJumbo.jpg","publishedAt":"2019-04-19T09:00:01Z","content":"The first time I saw images of a black Christ it was shocking, Dr. Yancy, who is black, told me. It was like, How dare they! But when youve seen a white Jesus all your life you think that can be the only acceptable image.\r\nDr. Yancy, a philosophy professor at… [+1304 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"ROBERT D. McFADDEN","title":"James W. McCord Jr., Who Led the Watergate Break-In, Is Dead at 93","description":"James W. McCord Jr., who led the burglars in the Watergate scandal, testifying in 1973 at Senate hearings about the break-in at Democratic National Committee headquarters.","url":"https://www.nytimes.com/2019/04/18/obituaries/james-mccord-watergate-dead.html","urlToImage":"https://static01.nyt.com/images/2019/04/18/obituaries/18McCord-sub/18McCord-sub-facebookJumbo.jpg","publishedAt":"2019-04-19T00:51:29Z","content":"Disclosures by investigators and conspirators of a White House taping system that had recorded incriminating conversations between the president and his aides led to the brink of impeachment and Nixons resignation on Aug. 9, 1974. Dozens of conspirators went … [+2399 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"SCOTT SHANE, ADAM GOLDMAN and MATTHEW ROSENBERG","title":"Mueller Report Likely to Renew Scrutiny of Steele Dossier","description":"The London offices of Orbis Business Intelligence. The firm’s co-owner is Christopher Steele, who wrote a series of memos in 2016 alleging ties between the Trump campaign and the Kremlin.","url":"https://www.nytimes.com/2019/04/19/us/politics/steele-dossier-mueller-report.html","urlToImage":"https://static01.nyt.com/images/2019/04/18/obituaries/archives/00dossier-orbis/merlin_153692079_82d0a212-301b-4b0b-a78d-c57a4edaddbb-facebookJumbo.jpg","publishedAt":"2019-04-19T19:23:41Z","content":"Mr. Trumps former lawyer Michael D. Cohen negotiated for a Trump Tower project in Moscow many months into the campaign and later admitted lying about it to Congress, along with tax evasion and other crimes. But Mr. Cohen did not, as the dossier claimed, trave… [+2266 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Daniel Burke, CNN Religion Editor","title":"DC attorney general investigating preschool at prominent Washington synagogue","description":"The attorney general of Washington is investigating the preschool at Washington Hebrew Congregation, a prominent synagogue in the nation's capital, several days after parents filed a civil suit against the school alleging their children were sexually abused b…","url":"https://www.cnn.com/2019/04/19/us/washington-hebrew-ag/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190416081321-boy-reading-torah-stock-super-tease.jpg","publishedAt":"2019-04-19T20:20:17Z","content":"(CNN)The attorney general of Washington is investigating the preschool at Washington Hebrew Congregation, a prominent synagogue in the nation's capital, several days after parents filed a civil suit against the school alleging their children were sexually abu… [+4547 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Kara Scannell, CNN","title":"Analysis: Mueller's report leaves open possibility of post-White House criminal exposure for Trump","description":"Special counsel Robert Mueller abided by Justice Department guidelines that a sitting president can't be indicted, but in preparing the detailed 448-page report, the long-time law enforcement official has teed up an investigation into obstruction that could o…","url":"https://www.cnn.com/2019/04/19/politics/trump-mueller-criminal-exposure-possibility-after-white-house/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/170613101920-trump-mueller-split-2-super-tease.jpg","publishedAt":"2019-04-19T23:17:01Z","content":"Washington (CNN)Special counsel Robert Mueller abided by Justice Department guidelines that a sitting president can't be indicted, but in preparing the detailed 448-page report, the long-time law enforcement official has teed up an investigation into obstruct… [+6526 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Holmes Lybrand, Sarah Westwood and Betsy Klein, CNN","title":"Fact check: What Trump associates told the public vs. what they told Mueller","description":"For two years, President Donald Trump and his close associates contradicted, denied and dodged reports and questions of Russian involvement in the 2016 campaign. Now that the Mueller report is out, redacted as it may be, we have the chance to fact-check those…","url":"https://www.cnn.com/2019/04/19/politics/fact-check-trump-public-statements-mueller-report/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190418135841-20190418-mueller-report-redacted-illustration-super-tease.jpg","publishedAt":"2019-04-19T16:02:13Z","content":"Washington (CNN)For two years, President Donald Trump and his close associates contradicted, denied and dodged reports and questions of Russian involvement in the 2016 campaign. Now that the Mueller report is out, redacted as it may be, we have the chance to … [+8289 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Fredreka Schouten and David Wright, CNN","title":"Small donations drive more than half of 2020 Democratic money","description":"In a striking reversal from previous elections, small-dollar donors are providing most of the early money to Democrats seeking the presidency -- as candidates seek to capitalize on the energy of their party's activist base and build a grassroots foundation to…","url":"https://www.cnn.com/2019/04/19/politics/2020-democrats-small-donations/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190329191331-20190329-democrats-fundraising-deadline-super-tease.jpg","publishedAt":"2019-04-19T19:25:22Z","content":"Washington (CNN)In a striking reversal from previous elections, small-dollar donors are providing most of the early money to Democrats seeking the presidency -- as candidates seek to capitalize on the energy of their party's activist base and build a grassroo… [+4713 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Marshall Cohen","title":"4 times Barr twisted and cherry-picked Mueller's report","description":"There is a widening divide between what Attorney General William Barr has said publicly about the special counsel's investigation and Robert Mueller's actual report. Barr previewed the report in a four-page letter to lawmakers last month and again on Thursday…","url":"https://www.cnn.com/2019/04/19/politics/barr-versus-mueller-report/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190222150952-20190222-mueller-barr-super-tease.jpg","publishedAt":"2019-04-19T20:24:03Z","content":"Washington (CNN)There is a widening divide between what Attorney General William Barr has said publicly about the special counsel's investigation and Robert Mueller's actual report. Barr previewed the report in a four-page letter to lawmakers last month and a… [+6961 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Jon Brodkin","title":"Facebook fights to “shield Zuckerberg” from punishment in US privacy probe","description":"Facebook/FTC settlement could include \"heightened oversight\" of Zuckerberg.","url":"https://arstechnica.com/tech-policy/2019/04/ftc-may-hold-zuckerberg-personally-responsible-for-facebook-privacy-failures/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2019/04/getty-mark-zuckerberg-760x380.jpg","publishedAt":"2019-04-19T16:07:50Z","content":"Enlarge/ Facebook CEO Mark Zuckerberg leaving the Merrion Hotel in Dublin after meeting with Irish politicians to discuss regulation of social media on Tuesday, April 2, 2019.\r\n4 with 4 posters participating\r\nFederal Trade Commission officials are discussing … [+3362 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"House Judiciary Committee issues subpoena for full Mueller report","description":"U.S. House Judiciary Committee Chairman Jerrold Nadler issued a subpoena on Friday to obtain the full Russia investigation report by Special Counsel Robert Mueller, saying he cannot accept a redacted version that \"leaves most of Congress in the dark.\"","url":"https://www.reuters.com/article/us-usa-trump-russia-subpoena-report-idUSKCN1RV0W6","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378586679&w=1200&r=LYNXNPEF3I0MB","publishedAt":"2019-04-19T13:23:44Z","content":"WASHINGTON (Reuters) - U.S. House Judiciary Committee Chairman Jerrold Nadler issued a subpoena on Friday to obtain the full Russia investigation report by Special Counsel Robert Mueller, saying he cannot accept a redacted version that “leaves most of Congres… [+416 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"Top Democrats in Congress reject Barr's proposal to limit Mueller report access","description":"Top Democrats in the U.S. House of Representatives and Senate on Friday rejected Attorney General William Barr's proposal to allow them access to a less-redacted version of Special Counsel Robert Mueller's Russia investigation report.","url":"https://www.reuters.com/article/us-usa-trump-russia-democrats-idUSKCN1RV18U","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2019-04-19T20:28:43Z","content":"WASHINGTON (Reuters) - Top Democrats in the U.S. House of Representatives and Senate on Friday rejected Attorney General William Barr’s proposal to allow them access to a less-redacted version of Special Counsel Robert Mueller’s Russia investigation report. \r… [+654 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Karen Freifeld","title":"Trump lawyers reviewed Mueller report for 10 hours before it was made public","description":"U.S. President Donald Trump's personal lawyers spent at least 10 hours reviewing Special Counsel Robert Mueller's report on Russian meddling in the 2016 election before it was made public, two of the lawyers told Reuters on Friday.","url":"https://www.reuters.com/article/us-usa-trump-russia-lawyers-idUSKCN1RV18M","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378676866&w=1200&r=LYNXNPEF3I0XS","publishedAt":"2019-04-19T20:22:02Z","content":"WASHINGTON (Reuters) - U.S. President Donald Trump’s personal lawyers spent at least 10 hours reviewing Special Counsel Robert Mueller’s report on Russian meddling in the 2016 election before it was made public, two of the lawyers told Reuters on Friday. \r\nRu… [+2906 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Mark Hosenball","title":"U.S. arrests former Marine connected to North Korea embassy raid in Spain","description":"U.S. authorities on Thursday arrested a former U.S. Marine who is a member of a group that allegedly raided the North Korean embassy in Madrid in February and stole electronics, according to two sources familiar with the arrest.","url":"https://www.reuters.com/article/us-spain-northkorea-usa-idUSKCN1RV1AJ","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2019-04-19T22:11:47Z","content":"WASHINGTON (Reuters) - U.S. authorities on Thursday arrested a former U.S. Marine who is a member of a group that allegedly raided the North Korean embassy in Madrid in February and stole electronics, according to two sources familiar with the arrest. \r\nChris… [+1422 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Andy Sullivan","title":"Barr releases Mueller's report - and feels the heat","description":"Attorney General William Barr could have buried Special Counsel Robert Mueller's Russia report deep in the recesses of the U.S. Justice Department and simply told the public that President Donald Trump would not face criminal prosecution.","url":"https://www.reuters.com/article/us-usa-trump-russia-barr-idUSKCN1RV0PU","urlToImage":"https://s1.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378554508&w=1200&r=LYNXNPEF3I0GA","publishedAt":"2019-04-19T11:05:22Z","content":"WASHINGTON (Reuters) - Attorney General William Barr could have buried Special Counsel Robert Mueller’s Russia report deep in the recesses of the U.S. Justice Department and simply told the public that President Donald Trump would not face criminal prosecutio… [+4853 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Andrew Chung","title":"Supreme Court girds for fight over Trump census citizenship question","description":"Sitting on a working-class commercial strip in the shadows of an above-ground rail line, a group called Make the Road New York's busy street-level offices are easy to miss. But its mission to support and advocate for immigrants is front and center.","url":"https://www.reuters.com/article/us-usa-court-census-idUSKCN1RV0Q0","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378555533&w=1200&r=LYNXNPEF3I0GC","publishedAt":"2019-04-19T11:10:33Z","content":"NEW YORK (Reuters) - Sitting on a working-class commercial strip in the shadows of an above-ground rail line, a group called Make the Road New York’s busy street-level offices are easy to miss. But its mission to support and advocate for immigrants is front a… [+6302 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Sarah N. Lynch","title":"Mueller gives Democrats political ammunition but they are split on how to use it","description":"Special Counsel Robert Mueller's report into Russia's role in the 2016 U.S. election provided extensive details on President Donald Trump's efforts to thwart a federal investigation, giving Democrats plenty of political ammunition against the Republican but n…","url":"https://www.reuters.com/article/us-usa-trump-russia-idUSKCN1RV094","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378567858&w=1200&r=LYNXNPEF3I0HU","publishedAt":"2019-04-19T12:05:29Z","content":"WASHINGTON (Reuters) - Special Counsel Robert Mueller’s report into Russia’s role in the 2016 U.S. election provided extensive details on President Donald Trump’s efforts to thwart a federal investigation, giving Democrats plenty of political ammunition again… [+6751 chars]"},{"source":{"id":null,"name":"Cnet.com"},"author":"Queenie Wong","title":"Facebook's privacy mishaps: Zuckerberg could be held accountable, report says - CNET","description":"The Federal Trade Commission is reportedly looking into Facebook CEO Mark Zuckerberg's past remarks about privacy.","url":"https://www.cnet.com/news/facebooks-privacy-mishaps-zuckerberg-could-be-held-accountable-report-says/","urlToImage":"https://cnet2.cbsistatic.com/img/xN0QkwJPLchTqCVnIjn9f7u-Bno=/756x567/2019/04/19/7531a265-394b-43b4-8076-a8ede3853060/gettyimages-944480672.jpg","publishedAt":"2019-04-19T19:46:18Z","content":"Facebook co-founder and CEO Mark Zuckerberg.\r\nAlex Wong/Getty Images\r\nFacebook CEO and co-founder Mark Zuckerberg may find himself in hot water with federal regulators.\r\nThe Washington Post, which cited two people familiar with the discussion, reported that t… [+1706 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Francesca Paris","title":"'National Enquirer' To Be Sold To Hudson News Heir James Cohen","description":"The tabloid's parent company, American Media Inc., has become embroiled in controversies surrounding President Trump. It also sparred with Jeff Bezos over blackmail accusations.","url":"https://www.npr.org/2019/04/19/715050724/national-enquirer-to-be-sold-to-hudson-news-heir-james-cohen","urlToImage":"https://media.npr.org/assets/img/2019/04/19/gettyimages-1142037878_wide-8e8f24651442aa6c78a650f94cccedb6f8560418.jpg?s=1400","publishedAt":"2019-04-19T09:59:00Z","content":"American Media Inc., parent company of the National Enquirer, struck a deal to sell the tabloid and two other publications.\r\nScott Olson/Getty Images\r\nAmerican Media Inc. has made a deal to sell the National Enquirer, following months of scandals involving th… [+1922 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Merrit Kennedy","title":"Three Top Climbers Presumed Dead After Avalanche In Canada","description":"Jess Roskelley, David Lama and Hansjörg Auer had been attempting a route in Canada's Banff National Park. The park said that all three are \"presumed to be deceased.\"","url":"https://www.npr.org/2019/04/19/715124102/three-top-climbers-presumed-dead-after-avalanche-in-canada","urlToImage":"https://media.npr.org/assets/img/2019/04/19/gettyimages-684294946-edit_wide-919cb0a49c788f0e495294b2c20e1ab1a80670ea.jpg?s=1400","publishedAt":"2019-04-19T17:29:57Z","content":"A truck travels along the Trans-Canada Highway at dusk in Banff National Park in 2017 in Alberta, Canada. Three climbers are presumed dead after an avalanche in the park.\r\nRobyn Beck/AFP/Getty Images\r\nThree of the world's most elite climbers are missing and p… [+3003 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Susanna Heller","title":"An 18-foot-long snake escaped captivity and climbed onto a roof, scaring neighbors","description":"An 18-foot-long python got loose in Detroit on Thursday. People were scared. The snake is an 8-year-old python named Juliet, by the way. Her owner, 25-year-old Devin Jones-White, got her off the roof. He believes she got out of her cage. He has a snake becaus…","url":"https://www.thisisinsider.com/18-foot-long-on-roof-scares-detroit-neighborhood-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9ee14d2ce780a3c279b1d-960-480.jpg","publishedAt":"2019-04-19T15:49:24Z","content":"It's a bird ... It's a plane ... It's an 18-foot-snake ... and people are scared! \r\n Let's get some key details out of the way: That snake is a python, her name is Juliet, and she had escaped her home in Detroit and ended up on a neighbor's roof, giving every… [+2019 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joe Perticone","title":"The Mueller report changes nothing for Congress, which remains as fiercely divided as ever","description":"The release of the Mueller report has only hardened the previously-held stances Democrats and Republicans have on President Donald Trump. Democrats took issue with Attorney General William Barr's handling of the report's release. Republicans focused on part o…","url":"https://www.businessinsider.com/mueller-report-changes-nothing-fiercely-divided-congress-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb8a041d1a2f817dc5aa468-2732-1366.jpg","publishedAt":"2019-04-19T14:12:38Z","content":"WASHINGTON — The special counsel's final report released Thursday, revealing that no one in President Donald Trump's 2016 campaign colluded with the Russians to fix the election but left the question of obstruction of justice somewhat open-ended. \r\n For every… [+5295 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"J.K. Trotter","title":"BuzzFeed is struggling to defend its major Trump scoop after Mueller's report discredited it","description":"BuzzFeed published a bombshell story in January asserting that President Donald Trump ordered his former fixer Michael Cohen to lie to Congress about plans for a Trump-branded skyscraper in Moscow. No other news outlet matched the story, and the redacted vers…","url":"https://www.thisisinsider.com/buzzfeed-struggling-to-defend-trump-cohen-scoop-after-mueller-report-discredited-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba55ef2730ca0fd17b46c2-1920-960.jpg","publishedAt":"2019-04-19T23:12:04Z","content":"When BuzzFeed reported on January 17 that President Donald Trump ordered his former fixer Michael Cohen to lie to Congress about plans for a Trump-branded skyscraper in Moscow, the upstart outlet framed the story as a revelation of world-historical importance… [+7186 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Eliza Relman","title":"Democrats have an intra-party battle brewing over impeaching Trump after the Mueller report's release","description":"Democrats are torn over the politics and consequences associated with impeaching President Donald Trump. After special counsel Robert Mueller's Russia investigation report was made public on Thursday, House Majority Leader Steny Hoyer said it's \"not worthwhil…","url":"https://www.businessinsider.com/democrats-battle-brewing-over-impeaching-trump-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9e094207d463cb900683a-1536-768.jpg","publishedAt":"2019-04-19T17:10:45Z","content":"Democrats are torn over the politics of impeachment — a division on display on Thursday when Democrats delivered contradictory responses on the subject following the release of special counsel Robert Mueller's Russia report. \r\n Hours after the report was made… [+6933 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Michelle Mark","title":"How Columbine changed American schools forever","description":"The 1999 mass shooting at Columbine High School transformed the way American schools and law-enforcement agencies prepare for violent or deadly incidents. Though school shootings are still relatively rare, fear that one could occur has sparked a number of pre…","url":"https://www.thisisinsider.com/how-columbine-changed-american-schools-forever-2019-4","urlToImage":"https://static.businessinsider.com/image/5cba32c7d2ce78102e1a6e0f-750.jpg","publishedAt":"2019-04-19T20:42:05Z","content":"Twenty years ago, two students clad in black trench coats and armed with sawed-off shotguns approached Columbine High School in Littleton, Colorado, and opened fire on dozens of their classmates. \r\n Eric Harris and Dylan Klebold killed 13 people and left more… [+8897 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/diana-stancy-correll","title":"Trump gave South Korean president message for Kim Jong Un - Washington Examiner","description":"Trump gave South Korean president message for Kim Jong Un Washington Examiner North Korea doesn't want Mike Pompeo involved in nuclear talks CBS This Morning Vox Sentences: Decoding the Mueller report Vox.com Secretary Of State Pompeo Says Lifting Sanctions O…","url":"https://www.washingtonexaminer.com/news/trump-gave-south-korean-president-message-for-kim-jong-un","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/e860107/2147483647/strip/true/crop/3976x2087+12+80/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fd7%2Fa9%2Fad191e7241c2a2cd9a83d686167b%2Fap-18109180986680.jpg","publishedAt":"2019-04-19T14:43:00Z","content":"President Trump reportedly gave South Korean President Moon Jae-in a message for North Korean dictator Kim Jong Un when the two leaders met at the White House last week. \r\nA South Korean source told CNN the message concerns \"things that matter to the current … [+1281 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/byron-york","title":"Mueller: Michael Flynn was under FBI investigation before transition calls - Washington Examiner","description":"Mueller: Michael Flynn was under FBI investigation before transition calls Washington Examiner Mueller report exposes all the president’s liars Los Angeles Times White House press secretary Sarah Sanders responds to Mueller report ABC News Mueller report: Sar…","url":"https://www.washingtonexaminer.com/opinion/columnists/byron-york-mueller-michael-flynn-was-under-fbi-investigation-before-transition-calls","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/38713d5/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F73%2Fdf%2F675076f141ff8494e6e9d51f5e7e%2Fap-18352545411652.jpg","publishedAt":"2019-04-19T19:12:00Z","content":"In his new report on the Trump-Russia affair, special counsel Robert Mueller revealed that former national security adviser Michael Flynn was already under FBI investigation when he spoke with the Russian ambassador during the transition before President Trum… [+3242 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Howard Kurtz","title":"Why the Mueller report, for all its meticulous detail, fell flat - Fox News","description":"Why the Mueller report, for all its meticulous detail, fell flat Fox News Opinion | The Mueller report is riddled with Trump's lies and manipulation The Washington Post Rep. Nadler: \"Disturbing evidence\" in Mueller report CBS News Mueller report: A corrupt, u…","url":"https://www.foxnews.com/politics/why-the-mueller-report-for-all-its-meticulous-detail-fell-flat","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2018/09/trump_mueller2.jpg","publishedAt":"2019-04-19T07:35:09Z","content":"If you've watched cable news or read newspapers for the last two years, you know most of what's in the Mueller report.\r\nThat was perhaps the biggest surprise in poring over it. Even the president's lawyers were surprised by that.\r\nOn issue after issue, the sp… [+4845 chars]"},{"source":{"id":null,"name":"Derrynow.com"},"author":"Derry Now","title":"Deputy Chief Constable says 'warped ideologists' need to 'hang their heads in shame' over Lyra McKee murder - Derry Now","description":"Deputy Chief Constable says 'warped ideologists' need to 'hang their heads in shame' over Lyra McKee murder Derry Now ‘Derry tonight. Absolute madness:’ Journalist killed in Northern Ireland clash The Washington Post Lyra McKee murder: Journalist shot dead du…","url":"https://www.derrynow.com/news/deputy-chief-constable-says-warped-ideologists-need-hang-heads-shame-lyra-mckee-murder/275622","urlToImage":"https://img.resized.co/derrynow/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL3MzLWV1LXdlc3QtMS5hbWF6b25hd3MuY29tXFxcL3N0b3JhZ2UucHVibGlzaGVycGx1cy5pZVxcXC9tZWRpYS5yaXZlcm1lZGlhLmllXFxcL3VwbG9hZHNcXFwvMjAxOVxcXC8wNFxcXC8xOTEzNTEyNlxcXC9TdGVwaGVuLU1hcnRpbi5qcGdcIixcIndpZHRoXCI6NjQ3LFwiaGVpZ2h0XCI6MzQwLFwiZGVmYXVsdFwiOlwiaHR0cHM6XFxcL1xcXC9jYWNoZS5yZXNpemVkLmNvXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiI1OGM5MGNmZGZhYzcxZjIxMTU4Y2JkZjk2YmMwODI3N2Y3OWNiNTg5In0=/deputy-chief-constable-says-warped-ideologists-need-to-hang-their-heads-in-shame-over-lyra-mckee-murder.jpg","publishedAt":"2019-04-19T12:51:00Z","content":"13:51 Friday 19th of April 2019\r\nPSNI Deputy Chief Constable Stephen Martin has described the murder of journalist Lyra McKee in Derry on Thursday night as a \"dark day.\"\r\nSpeaking to media at the city's Guildhall, Mr Martin said: First and foremost, I want to… [+2517 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter seven-round mock draft - NFL.com","description":"Chad Reuter seven-round mock draft NFL.com Devin Bush on cusp of NFL with a style all his own: 'You won't break' him Detroit Free Press 2019 NFL Mock Draft: Falcons' blockbuster move into top five headlines nine projected trades CBS Sports Which Positions Do …","url":"http://www.nfl.com/news/story/0ap3000001027100/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-1","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/04/18/0ap3000001027062_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+7602 chars]"},{"source":{"id":null,"name":"Edmontonjournal.com"},"author":null,"title":"Does Steve Yzerman hiring in Detroit make Edmonton a more or less likely landing spot for Ken Holland? - Edmonton Journal","description":"Does Steve Yzerman hiring in Detroit make Edmonton a more or less likely landing spot for Ken Holland? Edmonton Journal Detroit Red Wings press conference with Steve Yzerman Detroit Free Press Red Wings to name Yzerman general manager TSN Reports: Red Wings w…","url":"https://edmontonjournal.com/sports/hockey/nhl/cult-of-hockey/does-steve-yzerman-hiring-in-detroit-make-edmonton-a-more-or-less-likely-landing-spot-for-ken-holland","urlToImage":"https://postmediaedmontonjournal2.files.wordpress.com/2015/05/general-manager-holland-detroit-wings-attends-2013.jpg","publishedAt":"2019-04-19T15:51:14Z","content":"Later today, the Detroit Red Wings will welcome home Steve Yzerman as their new General Manager.\r\nWhile no doubt some Oilers fans were hoping that Stevie Y would consider bringing his act to Edmonton that was never, ever in the cards. There has been a months-… [+3524 chars]"},{"source":{"id":"the-globe-and-mail","name":"The Globe And Mail"},"author":null,"title":"Opinion: The Mueller report puts Donald Trump back into Democratic Party crosshairs - The Globe and Mail","description":"Opinion: The Mueller report puts Donald Trump back into Democratic Party crosshairs The Globe and Mail Donald Trump: ‘I could have fired everyone, including Mueller, if I wanted. I chose not to’ Global News Mueller report details 'inadequate' Trump answers, a…","url":"https://www.theglobeandmail.com/opinion/article-the-mueller-report-puts-donald-trump-back-into-democratic-party/","urlToImage":"https://www.theglobeandmail.com/resizer/O6qtTKGulGZF42-SQXYFn3lZMa4=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/A43FNKDQ65BHZN3RN3G3XS6YTQ.jpg","publishedAt":"2019-04-19T01:26:59Z","content":"Though the Mueller report affirms that there was no collusion with the Russians by the Trump team in the 2016 campaign, it is damning on the obstruction question.\r\nJoe Raedle/Getty Images\r\nThere are no bombshells. But the redacted Mueller report provides smal… [+4039 chars]"},{"source":{"id":"the-globe-and-mail","name":"The Globe And Mail"},"author":null,"title":"House committee issues subpoena for full Mueller report, some Democrats talk impeachment, Trump fires off tweets - The Globe and Mail","description":"House committee issues subpoena for full Mueller report, some Democrats talk impeachment, Trump fires off tweets The Globe and Mail How Trump’s legal team was able to battle the Mueller investigation Global News Trump continues lashing out at Mueller report f…","url":"https://www.theglobeandmail.com/world/us-politics/article-president-trump-blasts-ex-advisers-unleashes-tweets-after-claims-he/","urlToImage":"https://www.theglobeandmail.com/resizer/xvS7RBXVMVxGBmIa-eGkzn-Tn0w=/1200x0/filters:quality(80)/arc-anglerfish-tgam-prod-tgam.s3.amazonaws.com/public/7F3S6S6BUVHBZNVHZ3BP4G65AQ.jpg","publishedAt":"2019-04-19T15:11:10Z","content":"President Donald Trump gives a 'thumbs-up' as he prepares to board Air Force One, on April 18, 2019, at Andrews Air Force Base.\r\nThe Associated Press\r\nThe chairman of the U.S. House Judiciary Committee issued a subpoena on Friday for special counsel Robert Mu… [+8593 chars]"},{"source":{"id":null,"name":"Castanet.net"},"author":null,"title":"Flood warnings, heavy rain - Canada News - Castanet.net","description":"Flood warnings, heavy rain - Canada News Castanet.net Canadian Armed Forces to help Quebec with flooding Montreal Gazette Rainfall warnings issued throughout southern Quebec as waterways overflow CBC.ca Expect flooding as heavy rain falls on Greater Montreal:…","url":"https://www.castanet.net/news/Canada/254378/Feds-help-with-flood-prep","urlToImage":"https://www.castanet.net/content/2019/4/gmh112543217_p3382052_p3382054.jpg","publishedAt":"2019-04-19T15:40:00Z","content":"Canada  \r\nUPDATE: 10:15 a.m.\r\nThe parents of celebrated Austrian climber David Lama said Friday that he had \"lived his dream,\" as hopes he and two other top climbers survived an avalanche in the Canadian Rockies faded.\r\nLama, fellow Austrian Hansjorg Auer and… [+28846 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"David Pescovitz","title":"For sale: charred remains of Aleister Crowley and Jimmy Page's Loch Ness home","description":"For sale: Boleskine House, occultist Aleister Crowley's infamous digs on the shores of Loch Ness in Scotland that Jimmy Page later owned. The Georgian home, sitting on 9.3 hectares (22.9 acres), burned in 2015 but the exterior walls remain. The real estate ag…","url":"https://boingboing.net/2019/04/19/for-sale-charred-remains-of-a.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/ckdrps-INV190064_Image_R-4-1555661881.jpg","publishedAt":"2019-04-19T14:21:45Z","content":"For sale: Boleskine House, occultist Aleister Crowley's infamous digs on the shores of Loch Ness in Scotland that Jimmy Page later owned. The Georgian home, sitting on 9.3 hectares (22.9 acres), burned in 2015 but the exterior walls remain. The real estate ag… [+2295 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"TSA admits that its pornoscanners flag Black women and others with curly hair for humiliating, invasive searches","description":"Black women have long complained that they get flagged for secondary screening at TSA checkpoints after passing through a full-body scanner; after years of complaints, the TSA has admitted that its scanners struggle to with curled hair, and are prone to flagg…","url":"https://boingboing.net/2019/04/19/racist-algorithms.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/SafeView_PS5MAR15rA_200.jpg","publishedAt":"2019-04-19T19:03:21Z","content":"Black women have long complained that they get flagged for secondary screening at TSA checkpoints after passing through a full-body scanner; after years of complaints, the TSA has admitted that its scanners struggle to with curled hair, and are prone to flagg… [+4711 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Eillie Anzilotti","title":"High CO2 levels will wreck plants’ nutritional value, so don’t plan on surviving on vegetables","description":"CO2 is stripping the food we eat of essential proteins and nutrients as well as warming the planet, says the lead author on last year’s IPCC report at TED in Vancouver. We know that rising carbon dioxide levels in the atmosphere are raising global temperature…","url":"https://www.fastcompany.com/90337161/high-co2-levels-will-wreck-plants-nutritional-value-so-dont-plan-on-surviving-on-vegetables?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/poster-kristie-ebi-ted-talk-conference-co2-nutrition-value.jpg","publishedAt":"2019-04-19T12:30:21Z","content":"We know that rising carbon dioxide levels in the atmosphere are raising global temperatures and creating unstable and extreme weather patterns that will continue to threaten communities across the globe. And perhaps few people are more familiar with this fact… [+2961 chars]"},{"source":{"id":"time","name":"Time"},"author":"Associated Press","title":"Sarah Sanders Says She Didn’t Lie, Despite Mueller Report Findings That She Did","description":"President Trump spokeswoman Sarah Sanders pushed back against allegations of lying from the special counsel Robert Mueller's Russia report.","url":"http://time.com/5574073/sarah-sanders-mueller-report-lie/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/sarah-sanders-mueller-report-lie.jpg?quality=85","publishedAt":"2019-04-19T15:13:30Z","content":"(WASHINGTON) — President Donald Trump’s spokeswoman Sarah Sanders pushed back Friday against allegations that special counsel Robert Mueller’s Russia report exposed a culture of lying at the White House.\r\nSanders also disputed allegations that she personally … [+1168 chars]"},{"source":{"id":"time","name":"Time"},"author":"Lily Rothman","title":"What a Watergate Expert Thinks of the Mueller Report","description":"\"I was just struck by how many echoes there were,\" Nixon historian Ken Hughes tells TIME","url":"http://time.com/5574419/mueller-report-nixon-history/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/mueller.jpeg?quality=85","publishedAt":"2019-04-19T21:33:24Z","content":"The release on Thursday of a redacted version of Robert Mueller’s full report on the Russia probe represents a major moment in the history of special counsels in the United States — but no use of that office looms as large in the American imagination as the i… [+7959 chars]"},{"source":{"id":"time","name":"Time"},"author":"ALEX VEIGA / AP","title":"Corporate America Gears Up for ‘Weed Day’ Celebrations on April 20","description":"The counter-culture celebration on Apr. 20 was all about getting stoned, but is now so mainstream brands are starting to embrace it.","url":"http://time.com/5573878/420-april-20-weed-marijuana-cannabis-day-marketing-brands/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/gettyimages-949250036.jpg?quality=85","publishedAt":"2019-04-19T05:49:27Z","content":"LOS ANGELES — Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn’t yet have… [+5217 chars]"},{"source":{"id":"time","name":"Time"},"author":"Andrea Rodriguez and Michael Weissenstein / AP","title":"Food Shortages in Cuba Are Raising Fears of a New Economic Crisis","description":"After two decades of relative stability, shortages of food and medicine have once again become a serious daily problem for millions in Cuba.","url":"http://time.com/5573850/cuba-food-shortage-economic-crisis/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/cuba-food-shortage-line.jpg?quality=85","publishedAt":"2019-04-19T03:15:48Z","content":"(BAUTA, Cuba) — Just after 8 a.m., Pura Castell got in line behind about 100 other people waiting for a chance to buy frozen chicken legs. For two hours she leaned on her cane watching people leave the state-run market with their 5-pound limit.\r\nThe chicken r… [+7197 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Analysis: Mueller paints a damning portrait of the president","description":"WASHINGTON (AP) — To Donald Trump, the start of special counsel Robert Mueller's investigation looked alarmingly like the end of his presidency. So he tried to stop it.","url":"https://news.yahoo.com/analysis-mueller-paints-damning-portrait-president-225749760.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/u.LCsRR1vTyUZb9IJQA5DA--~B/aD0yODk0O3c9NDA1NjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/e67d023c5bc640528908fd952f6b6726.jpg","publishedAt":"2019-04-19T05:30:24Z","content":"WASHINGTON (AP) To Donald Trump, the start of special counsel Robert Mueller's investigation looked alarmingly like the end of his presidency. So he tried to stop it.\r\nHis months-long effort pushed the boundaries of presidential powers and the law, revealing … [+4885 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller probe over, but little chance for US-Russia reconciliation","description":"A long-awaited US probe on Russian election meddling has divided Washington but on one point virtually all US policymakers are clear -- there will be no reconciliation with Moscow. The 400-page document by Special Counsel Robert Mueller laid out Russia's pers…","url":"https://news.yahoo.com/mueller-probe-over-litte-chance-us-russia-reconciliation-181745335.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/TQr_WfH3FGhZkjy3xq8U1g--~B/aD03MTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/796e6353c1af00b7667061551960f83dc8f37fed.jpg","publishedAt":"2019-04-19T18:24:26Z","content":"Washington (AFP) - A long-awaited US probe on Russian election meddling has divided Washington but on one point virtually all US policymakers are clear -- there will be no reconciliation with Moscow.\r\nThe 400-page document by Special Counsel Robert Mueller la… [+3818 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"North Korea urges Trump to drop Pompeo from talks; U.S. plays down weapons test","description":"North Korea's state news agency said Kwon Jong Gun, in charge of U.S. affairs at the foreign ministry, had warned that no one could predict what would happen if Washington did not abandon the \"root cause\" that compelled Pyongyang to develop nuclear weapons. T…","url":"https://news.yahoo.com/north-korea-urges-trump-drop-pompeo-talks-u-053840974.html","urlToImage":"https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png","publishedAt":"2019-04-19T05:38:40Z","content":"By Joyce Lee and David Brunnstrom\r\nSEOUL/WASHINGTON (Reuters) - North Korea said on Thursday it no longer wanted to deal with U.S. Secretary of State Mike Pompeo and that he should be replaced in talks by someone more mature, hours after it announced its firs… [+5332 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller report shows ‘fake news’ repeatedly came from Trump, not the media","description":"If special counsel Robert Mueller‘s investigation makes one thing clear, it’s that many of the news reports that President Donald Trump branded as “fake news“ were, in fact, very real news indeed.While Mr Mueller’s report didn’t establish a criminal conspirac…","url":"https://news.yahoo.com/mueller-report-shows-fake-news-074500289.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/._fBQWG3DHTFyHRuq.BtRQ--~B/aD01NzY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/867f2fbb0f02f0d99fca816ab2ccb533","publishedAt":"2019-04-19T07:45:00Z","content":"If special counsel Robert Muellers investigation makes one thing clear, its that many of the news reports that President Donald Trump branded as fake news were, in fact, very real news indeed.\r\nWhile Mr Muellers report didnt establish a criminal conspiracy an… [+4764 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump lawyers reviewed Mueller report for 10 hours before it was made public","description":"Rudy Giuliani, Jay Sekulow and two other Trump lawyers went to the U.S. Justice Department on Tuesday and Wednesday for an early look at the 448-page report into whether Trump's team colluded with Russia and whether Trump obstructed the investigation, which w…","url":"https://news.yahoo.com/trump-lawyers-reviewed-mueller-report-10-hours-made-202202244.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/yWY.V55Aj5CDGHWLp9rgHg--~B/aD0zMTI7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2019-04-19T202202Z_1_LYNXNPEF3I0XS_RTROPTP_2_USA-TRUMP-RUSSIA-INTERVIEW.JPG","publishedAt":"2019-04-19T20:22:02Z","content":"By Karen Freifeld\r\nWASHINGTON (Reuters) - U.S. President Donald Trump's personal lawyers spent at least 10 hours reviewing Special Counsel Robert Mueller's report on Russian meddling in the 2016 election before it was made public, two of the lawyers told Reut… [+2911 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller report: House issues subpoena for full unredacted version","description":"Jerry Nadler issues subpoena for Robert Mueller’s full report and the underlying documents ‘to make informed decisions’ * Mueller report latest – live updates * Support the Guardian’s independent journalism and make a contributionThe House judiciary chairman,…","url":"https://news.yahoo.com/democrats-vow-investigate-trump-wake-120249647.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/swgg_iJ7YN0yXeR5Aqgjcg--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/ef59082d6c3f48c7e288394da65393f7","publishedAt":"2019-04-19T13:23:36Z","content":"The House judiciary chairman, Jerry Nadler, on Friday issued a subpoena for the full, unredacted report by special counsel Robert Mueller on Russian interference in the 2016 US election and the Trump campaign.\r\nRelated: 'No new information': Russia shrugs off… [+6462 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller Report: Assange Smeared Seth Rich to Cover for Russians","description":"Photo Illustration by Sarah Rogers/The Daily Beast / Photo by GettyJulian Assange not only knew that a murdered Democratic National Committee staffer wasn’t his source for thousands of hacked party emails, he was in active contact with his real sources in Rus…","url":"https://news.yahoo.com/mueller-report-assange-smeared-seth-005723239.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/rFRyOQHiak.XcQooeAnjHA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/c3cb49d19e668df1c31ee4371c9d0d96","publishedAt":"2019-04-19T00:57:23Z","content":"Julian Assange not only knew that a murdered Democratic National Committee staffer wasnt his source for thousands of hacked party emails, he was in active contact with his real sources in Russias GRU months after Seth Richs death. At the same time he was publ… [+6101 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller Report Has a Hidden Message for Barr","description":"Photo Illustration by Sarah Rogers/The Daily Beast / Photo by Getty/FBIRobert Mueller’s report contains a catalog of misconduct by President Trump, detailing repeated efforts to undermine law enforcement investigations. But the special counsel also provides a…","url":"https://news.yahoo.com/mueller-report-hidden-message-barr-180712685.html","urlToImage":null,"publishedAt":"2019-04-19T18:07:12Z","content":null},{"source":{"id":"time","name":"Time"},"author":"Associated Press","title":"Senator Mitt Romney ‘Sickened’ by Level of Dishonesty Mueller Report Found in Trump Administration","description":"Sen. Mitt Romney says he's \"sickened\" by the level of dishonesty Robert Mueller's report found in President Donald Trump's administration.","url":"http://time.com/5574525/mitt-romney-trump-mueller-report/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/mitt-romney-trump-mueller-report.jpg?quality=85","publishedAt":"2019-04-19T21:11:24Z","content":"(WASHINGTON) — Republican Sen. Mitt Romney says he’s “sickened” by the level of dishonesty the special counsel found in President Donald Trump’s administration.\r\nRomney also said Friday he was “appalled” that, according to special counsel Robert Mueller’s fin… [+457 chars]"},{"source":{"id":"time","name":"Time"},"author":"Associated Press","title":"Elizabeth Warren Calls for House to Start Impeachment Proceeding Against President Trump","description":"Elizabeth Warren wants the House to \"initiate impeachment proceedings\" against President Donald Trump since the release of Mueller report.","url":"http://time.com/5574479/elizabeth-warren-impeachment-trump/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/elizabeth-warren-impeachment-trump.jpg?quality=85","publishedAt":"2019-04-19T20:39:43Z","content":"(WASHINGTON) — Elizabeth Warren is urging the Democratic-controlled House to “initiate impeachment proceedings” against President Donald Trump.\r\nWarren is reacting on Twitter to the report by special counsel Robert Mueller released Thursday.\r\nThe Massachusett… [+464 chars]"},{"source":{"id":"time","name":"Time"},"author":"SUZAN FRASER / AP","title":"Turkish Police Arrest 2 Men Suspected of Spying for the United Arab Emirates With Possible Link To Khashoggi Killing","description":"Turkish authorities arrested two men spying for the UAE and were investigating possible involvement in the murder of Jamal Khashoggi.","url":"http://time.com/5574457/men-arrested-spying-uae-khashoggi/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/men-arrested-spying-uae-khashoggi.jpg?quality=85","publishedAt":"2019-04-19T20:32:52Z","content":"(ANKARA, Turkey) — Turkish authorities on Friday formally arrested two men on charges of spying for the United Arab Emirates, Turkey’s state-run news agency said.\r\nAuthorities were also investigating the possibility that the men could have been involved in th… [+1674 chars]"},{"source":{"id":"time","name":"Time"},"author":"Eltaf Najafizada / Bloomberg","title":"‘We Won’t Be Silenced,’ Afghan Female Musicians Tell Taliban","description":"Afghanistan’s first female conductor is convinced music can help deliver peace to her war-torn country.","url":"http://time.com/5573842/afghanistan-female-women-musicians-music-taliban/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/gettyimages-631945842.jpg?quality=85","publishedAt":"2019-04-19T02:39:49Z","content":"Fresh from a sold-out concert tour of the U.K. and Sweden, Afghanistan’s first female conductor is convinced music can help deliver peace to her war-torn country. If only the Taliban would listen.\r\nAt just 22, Negin Khpelwak has already stared down threats an… [+5772 chars]"},{"source":{"id":"time","name":"Time"},"author":"Vera Bergengruen","title":"The Mueller Probe Made Them Famous. They Plan to Keep Cashing In","description":"Over the course of Mueller's secretive two-year investigation, a mix of online sleuths, Twitter activists and former Trump aides have cashed in on America's obsession with the story.","url":"http://time.com/5574513/mueller-report-celebrities/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/george-papadopoulos.jpg?quality=85","publishedAt":"2019-04-19T22:43:02Z","content":"During Robert Mueller’s investigation, consultant Eric Garland charged hundreds of fans $10 per month for access to his locked Twitter feed promising “troll-free, disinformation-free” insight into Russia’s 2016 election meddling.\r\nJohn Schindler, a former U.S… [+4921 chars]"},{"source":{"id":"time","name":"Time"},"author":"Alana Abramson","title":"Robert Mueller Told Congress They Can Prosecute the President. Now It Gets Ugly","description":"More than two years after Robert Mueller began investigating whether President Donald Trump attempted to obstruct justice, the Special Counsel offered the American people a sobering conclusion in his final report, released Thursday: the most powerful law enfo…","url":"http://time.com/5572397/mueller-report-congress-referral/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/jerrold-nadler-press-conference-mueller-report.jpg?quality=85","publishedAt":"2019-04-19T02:37:46Z","content":"More than two years after Robert Mueller began investigating whether President Donald Trump attempted to obstruct justice, the Special Counsel offered the American people a sobering conclusion in his final report, released Thursday: the most powerful law enfo… [+7349 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Andy Campbell","title":"Virginia Officers Fired Over Ties To White Supremacist Groups","description":"Virginia Capitol Police Sgt. Robert A. Stamm and school resource officer Daniel Morley lost their jobs after anti-fascists connected them to racist groups.","url":"https://www.huffpost.com/entry/virginia-officers-fired-white-supremacist-groups_n_5cb9fc5be4b032e7ceb7f854","urlToImage":"https://img.huffingtonpost.com/asset/5c91015a200000ed0470fc6d.png?cache=sju5lpfblp&ops=1910_1000","publishedAt":"2019-04-19T18:33:15Z","content":"Two Virginia police officers have been fired over their ties to white supremacist groups.\r\nIn separate incidents, anti-fascist organizations revealed that Virginia Capitol Police Sgt. Robert A. Stamm and Daniel Morley, a school resource officer with the Chest… [+1773 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"AP","title":"Joe Biden Expected To Announce 2020 Campaign Next Week","description":"The former vice president has been teasing a presidential run for months.","url":"https://www.huffpost.com/entry/joe-biden-2020_n_5cb9c8dbe4b068d795cbb356","urlToImage":"https://img.huffingtonpost.com/asset/5cb9c95024000080094f6e47.jpeg?cache=tlsvttuvaa&ops=1910_1000","publishedAt":"2019-04-19T13:34:21Z","content":"WASHINGTON (AP) Former Vice President Joe Biden is expected to join the crowded 2020 Democratic presidential next week.\r\nThe decision answers one of the most significant outstanding questions of the early presidential primary season, which has already seen an… [+2921 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"College football spring games: How to watch, what to expect","description":"Here are this weekend's spring games, featuring playoff hopefuls Georgia and Oregon, plus Washington State, UCLA, new-look Miami and more.","url":"http://www.espn.com/college-football/story/_/id/26559717/college-football-spring-games-how-watch-expect","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1128%2Fr470198_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T14:59:08Z","content":"The last big weekend of college football spring games is upon us, with playoff hopefuls such as Georgia and Oregon taking the field. We'll also get to see Mike Leach and Washington State, Chip Kelly and UCLA, plus new-look Miami under first-year coach Manny D… [+4015 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Max Golembo","title":"Severe weather outbreak hits East Coast just before long weekend","description":"Over the last two days, 18 tornadoes have been reported over five states.","url":"https://abcnews.go.com/US/severe-weather-outbreak-hits-east-coast-long-weekend/story?id=62503531","urlToImage":"https://s.abcnews.com/images/US/weather-2-ap-er-190414_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T10:29:55Z","content":"The major storm is moving east, leaving in its wake at least 18 tornadoes and more than 300 damaging storm reports over two days in five states, as the East Coast braces for severe weather.\r\nNine of those tornadoes, reported yesterday, were in Texas, Oklahoma… [+713 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Cheyenne Haslett, Lucien Bruggeman","title":"5 key takeaways from special counsel Robert Mueller's report","description":"Here are five key takeaways from special counsel Robert Mueller's report.","url":"https://abcnews.go.com/Politics/key-takeaways-special-counsel-robert-muellers-report/story?id=62493619","urlToImage":"https://s.abcnews.com/images/Politics/mueller-report-pages2-ap-ps-190418_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T08:30:18Z","content":"While there will be no legal case brought against President Donald Trump by special counsel Robert Muellers team, the much-anticipated redacted report made public Thursday documented, in vivid detail, actions by members of the then-candidates campaign and lat… [+9060 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP, AP","title":"North Korea looms large over US-Japan talks","description":"The U.S. and Japan presented a united front on the complete, verifiable, irreversible, denuclearization (CVID) of North Korea as the two countries conducted security talks in Washington. (April 19)","url":"https://www.usatoday.com/videos/news/nation/2019/04/19/north-korea-looms-large-over-us-japan-talks/3519929002/","urlToImage":"https://mp4media.gannett-cdn.com/28911775001/28911775001_6027994602001_6027994630001-vs.jpg?pubId=28911775001","publishedAt":"2019-04-19T16:15:25Z","content":null},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, N'dea Yancey-Bragg, USA TODAY","title":"DNA from an old razor helped police solve 41-year-old rape and murder California cold case","description":"After more than four decades, a suspect has been identified in the rape and murder of two women in California.","url":"https://www.usatoday.com/story/news/nation/2019/04/18/old-razor-41-year-old-california-cold-case/3515419002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/fd61a888-26c1-4879-aee1-9dd65124aaec-AP_Cold_Case_Murders_Suspect_Dead.JPG?crop=2275,1320,x0,y839&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T02:13:09Z","content":"This undated photo provided by the San Luis Obispo County Sheriff's Office shows Arthur Rudy Martinez. Authorities say DNA evidence has linked the cold-case rape and murder of two women in California's Central Coast to a man who died in a prison in Washington… [+5159 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Associated Press, Julie Pace, Thomas Beaumont and Meg Kinnard, Associated Press","title":"Joe Biden expected to launch 2020 presidential campaign next week","description":"Joe Biden would enter the race as a front-runner in Democrats' efforts to challenge President Donald Trump.","url":"https://www.usatoday.com/story/news/politics/elections/2019/04/19/joe-biden-expected-launch-2020-presidential-bid-next-week/3518485002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/05/USAT/8d7722ef-89c0-4e48-a308-7f225e44c70d-XXX__JG_137932_Joe_Biden_4-5-2019_jmg_75771.JPG?crop=2735,1538,x0,y61&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T13:39:16Z","content":"The list of 2020 democratic candidates President Donald Trump's attacked continues to grow.\r\n USA TODAY\r\nWASHINGTON Former Vice President Joe Biden is expected to announce hes running for president next week.\r\nThats according to three people with knowledge of… [+674 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Rookie coaches enjoying chess match that comes in playoffs","description":"Rookie coaches Rod Brind'Amour of the Hurricanes and Jim Montgomery of the Stars are thriving with the chess match of NHL playoff hockey in their first opportunity to call the shots","url":"https://www.usatoday.com/story/sports/nhl/2019/04/19/rookie-coaches-enjoying-chess-match-that-comes-in-playoffs/39368167/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/6756e32f5e67049d308588345266eb385b6a02c2/c=0-106-3000-1794/local/-/media/2019/04/19/USATODAY/usatsports/4dd5b65faa534c209ff234d5199e9d3b.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T20:39:59Z","content":"Rod Brind'Amour does not think what he is doing is anything special.\r\nBrind'Amour not only has the Carolina Hurricanes in the playoffs in his first season as coach but has made the necessary adjustments to tie their series against the defending Stanley Cup ch… [+5637 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, David Jackson, USA TODAY","title":"Donald Trump golfs with Rush Limbaugh day after Mueller report is released","description":"The conservative radio talk show host has been another critic of the Robert Mueller report.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/trump-golfs-rush-limbaugh-day-after-mueller-report-released/3523021002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/9575d7ff-9432-44f3-b7ff-7adbe9d04cfc-AFP_AFP_1AL749.JPG?crop=5567,3117,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T19:46:33Z","content":"The redacted version of the Mueller report is now available from the attorney general. Here are the key takeaways from it.\r\n USA TODAY\r\nWASHINGTON  President Donald Trump certainly found a sympathetic ear Friday for his frustrations over the Robert Mueller re… [+1062 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Joel Shannon, USA TODAY","title":"'Just bricks and mortar': Massive Notre Dame Cathedral donations draw high-profile backlash","description":"A common position among critics: The mega-donations prove social problems could be quickly addressed if the wealthy were motivated to do so.","url":"https://www.usatoday.com/story/news/world/2019/04/18/notre-dame-cathedral-fire-billionaires-donations-spark-backlash/3514968002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/16/USAT/4af48dca-e948-4c94-928a-eb2271cfe149-AP_France_Notre_Dame_Fire.2.jpg?crop=1782,1002,x24,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T04:03:46Z","content":"After a massive fire tore across the Notre Dame cathedral in Paris, France thousands have reached out to help rebuild the iconic landmark.\r\n Buzz60\r\nMultiple French billionaires joined an international effort this week to raise funds to rebuild the Notre Dame… [+3463 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Sara M Moniuszko, USA TODAY","title":"Meghan McCain goes after anti-vaxxers, slams their 'stupidity' for endangering children","description":"Meghan McCain isn't mincing words when it comes to her take on anti-vaxxers, taking to Twitter Friday to send a message about their \"stupidity.\"","url":"https://www.usatoday.com/story/life/allthemoms/2019/04/19/meghan-mccain-slams-abominable-anti-vaxxers-their-stupidity/3521239002/?utm_source=google&utm_medium=amp&utm_campaign=speakabl","urlToImage":"https://www.gannett-cdn.com/presto/2018/12/26/USAT/4d9a86bb-816b-40c2-a821-fb58db8e3178-148113__OS_0639_.jpg?crop=2999,1687,x0,y119&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T17:39:56Z","content":"Meghan McCain appears on ABC's \"The View.\"\r\n (Photo: Lou Rocco/ ABC)\r\nMeghan McCain isn't mincing words when it comes to her take on anti-vaxxers.\r\n\"The View\" co-host took to Twitter Friday to send a message to those who do not get vaccinated.\r\n\"Dear (anti-va… [+1736 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Seattle Storm coach Dan Hughes diagnosed with cancer","description":"Seattle Storm coach Dan Hughes has been diagnosed with an undisclosed form of cancer that was discovered after a recent emergency appendectomy","url":"https://www.usatoday.com/story/sports/wnba/2019/04/19/seattle-storm-coach-dan-hughes-diagnosed-with-cancer/39368261/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-19T21:22:21Z","content":"SEATTLE (AP) Seattle Storm coach Dan Hughes has been diagnosed with an undisclosed form of cancer that was discovered after a recent emergency appendectomy.\r\nHughes said in a video released by the team Friday that a treatment plan is still being finalized by … [+1505 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, USA TODAY","title":"6 of our top opinion pieces this week: ICYMI","description":"From the release of the Muller report to Pete Buttigieg's campaign to criminal justice reforms, here are some of our top columns this week.","url":"https://www.usatoday.com/story/opinion/2019/04/19/mueller-report-pete-buttigieg-trumps-taxes-top-columns/3489781002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/67762477-50e7-4e1b-9f2e-6e2ccd2a49cf-205_224219.jpg?crop=1279,719,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T12:00:10Z","content":"In today's fast-paced news environment, it can be hard to keep up. For your weekend reading, we've started in-case-you-missed-it compilations of some the week's top USA TODAY Opinion pieces. As always, thanks for reading, and for your feedback.\r\n USA TODAY Op… [+3653 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, David Jackson, USA TODAY","title":"Vladimir Putin's team doesn't like Robert Mueller's report on election interference, Trump","description":"Kremlin seeks to downplay the findings of the special counsel on Russia's election activity in the United States.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/vladimir-putins-team-doesnt-like-robert-muellers-report/3517874002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/ae4c36d5-59d6-4991-a9f9-80cb56d94516-AP_Russia_Putin.JPG?crop=3174,1809,x0,y70&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T11:56:30Z","content":"The redacted version of the Mueller report is now available from the attorney general. Here are the key takeaways from it.\r\n USA TODAY\r\nWASHINGTON  The Mueller report on Russian interference in the 2016 U.S. presidential election is getting poor reviews from … [+2053 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Bart Jansen, USA TODAY","title":"After months clamoring for Mueller's findings, Congress weighs what's next. First, a subpoena for everything","description":"Congress is wrestling with how to respond to revelations in special counsel Robert Mueller's report, but will start by seeking more information.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/congress-weighs-next-steps-after-mueller-sends-subpoena-for-full-report/3519575002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/cf826d86-cbff-4719-abbf-66f84a0aef73-EPA_epaselect_USA_TRUMP_MUELLER_REPORT.jpg?crop=5122,2881,x0,y289&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T17:44:44Z","content":"House Intelligence Committee Chairman Adam Schiff says Attorney General William Barr did a \"grave disservice\" to the country by misrepresenting significant parts of special counsel Robert Mueller's report. (April 18)\r\n AP, AP\r\nWASHINGTON Congress spent months… [+7761 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Ryan W. Miller, USA TODAY","title":"Trio of North Face climbers presumed dead in avalanche at Canada's Banff park","description":"American Jess Roskelley and Austrians David Lama and Hansjorg Auer were attempting to climb Howse Peak in Canada's Banff National Park, officials say.","url":"https://www.usatoday.com/story/news/world/2019/04/19/david-lama-jess-roskelley-hansjorg-auer-presumed-dead-banff-park/3517772002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/9a9e070b-cd8e-4aa4-b733-9382d10ebe4a-AP_Canada_Avalanche.JPG?crop=2438,1371,x0,y1125&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T10:29:17Z","content":"In this March 13, 2003 file photo, Jess Roskelley, then 20, answers questions during a news conference in Seattle.\r\n (Photo: Elaine Thompson, AP)\r\nA trio of professional climbers missing at Banff National Park are presumed dead after an avalanche, Canadian pa… [+2703 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Christal Hayes, USA TODAY","title":"GOP Sen. Mitt Romney: 'I am sickened' over Trump's conduct revealed in Mueller report","description":"Republican Sen. Mitt Romney said the conduct by President Donald Trump and his campaign outlined in special counsel Robert Mueller's report left him \"sickened\" and \"appalled\"","url":"https://www.usatoday.com/story/news/politics/2019/04/19/mueller-report-republican-mitt-romney-trumps-conduct/3523884002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/01/02/USAT/48466c78-5b67-4677-9c4a-7f97b2e7a7c3-AFP_AFP_1BX500.JPG?crop=2335,1304,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T21:12:08Z","content":"The redacted version of the Mueller report is now available from the attorney general. Here are the key takeaways from it.\r\n USA TODAY\r\nWASHINGTON  Republican Sen. Mitt Romney said the conduct by President Donald Trump and his campaign outlined in special cou… [+3460 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Kevin Johnson and Kristine Phillips, USA TODAY","title":"Attorney General William Barr faces a political firestorm after release of the Mueller report","description":"President Trump's new attorney general is facing sharp criticism for his handling of the release of the special counsel's final Trump-Russia report.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/ag-barr-center-political-firestorm-after-mueller-report-release/3519319002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/cf826d86-cbff-4719-abbf-66f84a0aef73-EPA_epaselect_USA_TRUMP_MUELLER_REPORT.jpg?crop=5122,2881,x0,y289&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T20:50:05Z","content":"Attorney General Barr announced that the special counsel found that while Russia interfered in the 2016 election, there was \"no collusion\" by Trump.\r\n USA TODAY\r\nWASHINGTON  William Barr knew that he was stepping into a firestorm when he accepted President Do… [+10078 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Christal Hayes, USA TODAY","title":"'More damning than all those reports': Watergate, Whitewater officials react to Mueller report","description":"Those involved in high-profile investigations into past presidents had a lot to say about special counsel Robert Mueller's report.","url":"https://www.usatoday.com/story/news/politics/2019/04/18/mueller-report-watergate-clinton-officials-react-trump/3513133002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/50d95f83-9ee2-472d-914f-3608b9adee50-USP_News-_Mueller_Report_Released.2.jpg?crop=5567,3117,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T02:27:04Z","content":"Attorney General William Barr continues to frustrate Democrats over the Mueller report.\r\n Mike Thompson, Detroit Free Press\r\nWASHINGTON Those involved in high-profile investigations into past presidents had a lot to say about special counsel Robert Mueller's … [+5553 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Christal Hayes, USA TODAY","title":"Trump supporter threatens to kill Democratic lawmakers over Rep. Omar's 9/11 comments, docs say","description":"A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmakers, specifically citing his support for President Donald Trump and his disdain for Rep. Ilhan Omar in light of her comments about the 9/11 terr…","url":"https://www.usatoday.com/story/news/politics/2019/04/19/rep-ilhan-omar-rashida-tlaib-targeted-racist-death-threats-man-arrested/3522754002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/17/USAT/87ba844a-78fb-4eb4-aafc-b7ef974a0530-AP_Trump_Jewish_Politics.JPG?crop=3681,2061,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T20:17:23Z","content":"Rep. Ilhan Omar said since President Donald Trump tweeted about her, she's received an increase in \"direct threats.\"\r\n USA TODAY\r\nWASHINGTON  A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmaker… [+4321 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"For The Win, Henry McKenna, For The Win","title":"Ranking each week of the NFL season, from worst to best","description":"The 2019 NFL schedule has been released, and here are the weeks to circle on the calendar.","url":"https://ftw.usatoday.com/2019/04/ranking-nfl-schedule-release?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/d0b5c5eac8a261665211261029b9bd4289a43093/c=0-207-3978-2445/local/-/media/2019/04/18/USATODAY/usatsports/usatsi_12031052.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T11:15:23Z","content":"SportsPulse: Lorenzo Reyes looks at four of this upcoming season's biggest matchups that will offer the most fireworks for NFL fans.\r\n USA TODAY Sports\r\nThe anticipation for the NFL season is building. A look at the calendar released this week has definitely … [+6282 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, John Fritze and David Jackson, USA TODAY","title":"Mueller report sets up fresh battle for Donald Trump as Democrats demand answers","description":"Democrats ramped up their rhetoric after Robert Mueller's report, kicking off a fresh fight over an investigation Donald Trump wants to leave behind.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/mueller-report-donald-trump-faces-fresh-battle-dems-demand-answers/3474091002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/15/USAT/17514e30-0d01-48ec-87ce-ced73a8d4a24-610603738_85541176.JPG?crop=3057,1720,x535,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T10:00:30Z","content":"House Intelligence Committee Chairman Adam Schiff says Attorney General William Barr did a \"grave disservice\" to the country by misrepresenting significant parts of special counsel Robert Mueller's report. (April 18)\r\n AP, AP\r\nStory Highlights\r\n\"If you were a… [+7424 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Special to USA TODAY, Christopher Elliott, Special to USA TODAY","title":"Hackers are trying to steal your vacation. Here's how to stop them","description":"Hackers are coming after your personal data, your credit card information and your loyalty points.","url":"https://www.usatoday.com/story/travel/advice/2019/04/19/hackers-cybersecurity-wi-fi/3506014002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/f9b4a636-0ae6-40df-8660-793c4c968430-GettyImages-946613770.jpg?crop=3839,2159,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T16:00:02Z","content":"Last SlideNext Slide\r\nHackers are trying to steal your vacation. They're coming after your personal data, your credit card information and your loyalty points.\r\nWorst of all, they might already have them.\r\nConsider what happened to Jill Frankfort, a teacher f… [+6716 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Penguins and Lightning exits show playoff hockey differences","description":"First-round sweeps of the NHL-best Lightning and two-time champion Penguins show just how different playoff hockey is from the regular season","url":"https://www.usatoday.com/story/sports/nhl/2019/04/18/penguins-and-lightning-exits-show-playoff-hockey-differences/39364433/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/eb82a1d6b7d420155ae26c7d27be26168760b0f8/c=0-146-4500-2677/local/-/media/2019/04/18/USATODAY/usatsports/3c3d8925f8d04de0bb7ffe71d93fed57.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T02:05:45Z","content":"Scotty Bowman had already coached six teams to the Stanley Cup championship when his high-powered Detroit Red Wings that won 12 of their first 14 playoff games couldn't get the puck away from the New Jersey Devils and got swept in the 1995 final.\r\n\"They just … [+6818 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Nate Davis, USA TODAY","title":"Which NFL teams could draft a quarterback? Ranking all 32 teams by need for a passer","description":"Whether it's finding a quarterback for the future or picking up an immediate starter, all 32 NFL teams have varying needs for a passer in the draft.","url":"https://www.usatoday.com/story/sports/nfl/draft/2019/04/19/nfl-draft-qb-needs-teams-patriots-giants-broncos/3500353002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/eb3fe69c-2525-4682-bb5f-80366678a9d1-USATSI_11919810.jpg?crop=1882,1059,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T10:17:24Z","content":"SportsPulse: The NFL schedule is out and we couldn't be more excited about the ridiculousness of it all. USA TODAY's Trysta Krick breaks down the biggest storylines from the schedule.\r\n USA TODAY\r\nEven in a year when defensive stars are expected to dominate t… [+14924 chars]"},{"source":{"id":null,"name":"Moz.com"},"author":"randfish","title":"The One-Hour Guide to SEO: Link Building - Whiteboard Friday","description":"Posted by randfish The final episode in our six-part One-Hour Guide to SEO series deals with a topic that's a perennial favorite among SEOs: link building. Today, learn why links are important to both SEO and to Google, how Google likely measures the value of…","url":"https://moz.com/blog/one-hour-guide-to-seo-link-building","urlToImage":"https://moz.com/uploads/og_image/5cb904dfa6d937.73543712.jpg","publishedAt":"2019-04-19T00:02:00Z","content":"Posted by randfish The final episode in our six-part One-Hour Guide to SEO series deals with a topic that's a perennial favorite among SEOs: link building. Today, learn why links are important to both SEO and to Google, how Google likely measures the value of… [+14697 chars]"},{"source":{"id":null,"name":"Socialmediaexaminer.com"},"author":"Michael Stelzner","title":"How to Develop a Thriving Community","description":"Is community important to your business? Wondering where you should build your community? To explore how to develop a thriving community beyond Facebook Groups, I interview Cate Stillman. Cate is podcaster, blogger, and author of the book Body Thrive. She’s a…","url":"https://www.socialmediaexaminer.com/how-to-develop-thriving-community-cate-stillman/","urlToImage":"https://www.socialmediaexaminer.com/wp-content/uploads/2019/04/develop-thriving-community-cate-stillman-1200.png","publishedAt":"2019-04-19T10:00:33Z","content":"Is community important to your business? Wondering where you should build your community?\r\nTo explore how to develop a thriving community beyond Facebook Groups, I interview Cate Stillman. Cate is podcaster, blogger, and author of the book Body Thrive. She’s … [+11853 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Yara Bayoumy","title":"The French Ambassador Is Retiring Today. Here’s What He Really Thinks About Washington.","description":"Gérard Araud says that Trump is right about trade. Kushner is “extremely smart” but has “no guts.” And John Bolton’s not so bad, actually.","url":"https://www.theatlantic.com/politics/archive/2019/04/conversation-outgoing-french-ambassador-gerard-araud/587458/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GoKateShoot36071-1/facebook.jpg?1555638514","publishedAt":"2019-04-19T16:46:00Z","content":"Kate Warren Gérard Araud, the charmingly blunt French ambassador to the United States, is famous for two things: the lavish parties he hosts at his Kalorama mansion, and his willingness to say (and tweet) things that other ambassadors might not even think, mu… [+12261 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"David A. Graham","title":"No One Listens to the President","description":"Trump keeps issuing orders, and staffers keep ignoring them because they’re illegal or unwise. It’s an unsustainable situation—but it shows no sign of abating.","url":"https://www.theatlantic.com/ideas/archive/2019/04/no-one-listens-to-the-president/587557/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/RTS2AL0T/facebook.jpg?1555637036","publishedAt":"2019-04-19T10:00:00Z","content":"It’s been another dizzying few days in Washington, starting with yet another border controversy, as President Donald Trump threatened to bus unauthorized immigrants to sanctuary cities, and ending with the release of Special Counsel Robert Mueller’s report, w… [+5568 chars]"},{"source":{"id":null,"name":"Militarytimes.com"},"author":"Robert Burns, The Associated Press","title":"US halts recent practice of disclosing nuclear weapon total","description":"The Trump administration has halted, without explanation, the recent U.S. government practice of disclosing the current size of the nuclear weapons stockpile.","url":"https://www.militarytimes.com/news/pentagon-congress/2019/04/18/us-halts-recent-practice-of-disclosing-nuclear-weapon-total/","urlToImage":"https://www.armytimes.com/resizer/9ofrSPJaepXOqpppD7BuXjdsHDs=/1200x630/filters:quality(100)/arc-anglerfish-arc2-prod-mco.s3.amazonaws.com/public/26PF65JTNFHVNDRBP5J7OVKX4Q.jpg","publishedAt":"2019-04-19T07:57:37Z","content":"WASHINGTON The Trump administration has halted, without explanation, the recent U.S. government practice of disclosing the current size of the nuclear weapons stockpile.\r\n The decision was revealed in a recent Department of Energy letter to the Federation of … [+2696 chars]"},{"source":{"id":null,"name":"Thecrimereport.org"},"author":"","title":"Big Pimping (2010)","description":"Why is it so hard to catch men who sell teen girls for sex? Like a lot of 14-year-old girls, all Shaquana wanted was a boyfriend. The skinny Brooklyn, N.Y. eighth-grader was on the honor roll at school, but unhappy at home. She hadn't seen her father in years…","url":"https://thecrimereport.org/2010/06/14/big-pimping/","urlToImage":"https://thecrimereport.org/wp-content/uploads/2016/02/screen_shot_2011-01-31_at_4.51.18_pm.png","publishedAt":"2019-04-19T11:09:23Z","content":"Why is it so hard to catch men who sell teen girls for sex?\r\nLike a lot of 14-year-old girls, all Shaquana wanted was a boyfriend. The skinny Brooklyn, N.Y. eighth-grader was on the honor roll at school, but unhappy at home. She hadn't seen her father in year… [+11979 chars]"},{"source":{"id":null,"name":"Buzzfeednews.com"},"author":"Gabriel H. Sanchez","title":"21 Of The Most Powerful Photos Of This Week","description":"From the release of special counsel Robert Mueller's redacted report on Russian interference to the inferno that ripped through the Notre Dame Cathedral on Monday, these are the most striking and memorable pictures from this past week. View Entire Post ›","url":"https://www.buzzfeednews.com/article/gabrielsanchez/most-powerful-photos-of-this-week-april-19","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2019-04/19/17/campaign_images/buzzfeed-prod-web-05/21-of-the-most-powerful-photos-of-this-week-2-12525-1555708117-0_dblbig.jpg","publishedAt":"2019-04-19T21:20:16Z","content":"Jonathan Ernst / Reuters\r\nUS Attorney General William Barr, flanked by Deputy US Attorney General Rod Rosenstein, speaks at a news conference to discuss Special Counsel Robert Mueller's report on Russian interference in the 2016 presidential race, in Washingt… [+19 chars]"},{"source":{"id":null,"name":"Popsci.com"},"author":"Neel V. Patel, Neel V. Patel","title":"This comet stuffed inside a meteorite is the ultimate cosmic turducken","description":"Space And it could teach us about the early solar system. It’s hard to imagine the cosmos putting its own spin on the classic turducken dish, but it looks like scientists have found it.","url":"https://www.popsci.com/comet-in-meteorite","urlToImage":"https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/04/515_cometisonvirgo1200w.jpg?itok=oIOmXaM1","publishedAt":"2019-04-19T15:00:49Z","content":"Its hard to imagine the cosmos putting its own spin on the classic turducken dish (a chicken stuffed into a duck stuffed into a turkey) but it looks like scientists have found it. In a new study published in Nature Astronomy, a group of international research… [+5681 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Engadget","title":"Lyft offers free bikeshare trips on Earth Day","description":"Filed under: Green, Bikes You'll need your network's app and the promo code EARTHDAY19. Continue reading Lyft offers free bikeshare trips on Earth Day Lyft offers free bikeshare trips on Earth Day originally appeared on Autoblog on Fri, 19 Apr 2019 12:45:00 E…","url":"https://www.autoblog.com/2019/04/19/lyft-free-bikeshare-earth-day/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/5565x3130+0+939/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-images/2019-04/d856c980-62c0-11e9-befb-d507d862f165","publishedAt":"2019-04-19T16:45:00Z","content":"While you might still think of Lyft primarily as a ridesharing company, it also has the largest bike-sharing network in the country — thanks to its Motivate acquisition last summer. To celebrate Earth Day and promote its carbon-free transport, the company is … [+637 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Reuters","title":"Fiat Chrysler recalls 320,000 Dodge Dart cars that could roll away","description":"Filed under: Recalls, Dodge, Sedan Defective part could allow shifter cable to detach. Continue reading Fiat Chrysler recalls 320,000 Dodge Dart cars that could roll away Fiat Chrysler recalls 320,000 Dodge Dart cars that could roll away originally appeared o…","url":"https://www.autoblog.com/2019/04/19/fiat-chrysler-recalls-320-000-dodge-dart-cars-that-could-roll-aw/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/1279x720+0+112/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-04/8fc75f30-62a3-11e9-bfcd-938dcac6f38a","publishedAt":"2019-04-19T13:15:00Z","content":"WASHINGTON — Fiat Chrysler Automobiles NV said Friday it is recalling more than 320,000 Dodge Dart compact cars in North America that could roll away because of a defective part that could allow the shift cable to detach from the transmission.\r\nThe Italian-Am… [+1097 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Victor Reklaitis","title":"Capitol Report: George Conway calls for Trump impeachment after Mueller report | Laura Ingraham says president owed an apology","description":"“There is a cancer in the presidency: President Donald J. Trump,” writes George Conway. Meanwhile, Fox’s Laura Ingraham says Trump is owed an apology now that the Mueller report has been released.","url":"https://www.marketwatch.com/story/george-conway-calls-for-trump-impeachment-after-mueller-report-laura-ingraham-says-president-owed-an-apology-2019-04-19","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-GD965_muelle_ZG_20180216132042.jpg","publishedAt":"2019-04-19T13:32:57Z","content":"George Conway says Mueller report shows Trump is cancer on the presidency: What the Mueller report disturbingly shows, with crystal clarity, is that today there is a cancer in the presidency: President Donald J. Trump, writes George Conway in a Washington Pos… [+2797 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"The Mueller report: Recap, fact-check, reaction & 2020 Russia concerns","description":"Mueller report analysis and insight from ABC News' team in Washington.","url":"https://news.yahoo.com/mueller-report-recap-fact-check-210323694.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/kkoFFf6cEBp2HlSyLE4sDg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/video/video.abcnewsplus.com/bf198060b730677c9240a84cc7cb81b1","publishedAt":"2019-04-19T21:03:23Z","content":"Mueller report analysis and insight from ABC News' team in Washington."},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller drops obstruction dilemma on Congress","description":"WASHINGTON (AP) — It's now up to Congress to decide what to do with special counsel Robert Mueller's findings about President Donald Trump.","url":"https://news.yahoo.com/mueller-drops-obstruction-dilemma-congress-002806731--politics.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/u1Wkx7VdhgZDFmpRQh9qBg--~B/aD0zNTMyO3c9NTI5ODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/8a6e1675dea6404eaa26ffb0099229b0.jpg","publishedAt":"2019-04-19T01:18:52Z","content":"WASHINGTON (AP) It's now up to Congress to decide what to do with special counsel Robert Mueller's findings about President Donald Trump.\r\nWhile the special counsel declined to prosecute Trump on obstruction of justice, he did not exonerate him, all but leavi… [+6379 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Warren becomes first 2020 Democrat to call for impeachment","description":"WASHINGTON (AP) — Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of specia…","url":"https://news.yahoo.com/warren-calls-house-begin-impeachment-proceedings-202730326--election.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/zN9mWTaBX2gDTEq6qEWB_g--~B/aD0zMjAyO3c9NDgwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/9e5a3e2700234d3fb75d3b6c94dde56b.jpg","publishedAt":"2019-04-19T23:34:03Z","content":"WASHINGTON (AP) Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of special … [+2827 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"US, Japan meet amid standstill on North Korea","description":"Top leaders of the United States and Japan gathered for talks Friday amid a standstill in diplomacy aimed at reaching a deal with their mutual adversary North Korea. Secretary of State Mike Pompeo welcomed Foreign Minister Taro Kono for talks ahead of a plann…","url":"https://news.yahoo.com/us-japan-meet-amid-standstill-north-korea-004017949.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/.f71TsMXFtk8U5IujaxiRQ--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/b3c4e7fa174da6b613e4c88e8c9f58b52d5c1ff4.jpg","publishedAt":"2019-04-19T00:40:17Z","content":"Washington (AFP) - Top leaders of the United States and Japan gathered for talks Friday amid a standstill in diplomacy aimed at reaching a deal with their mutual adversary North Korea.\r\nSecretary of State Mike Pompeo welcomed Foreign Minister Taro Kono for ta… [+1046 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Pompeo says US will take 'tough action' on Russian meddling","description":"Secretary of State Mike Pompeo vowed Friday the United States would keep taking \"tough action\" on Russia after Special Counsel Robert Mueller revealed widespread attempts by Moscow to help elect President Donald Trump. A day after Mueller's 400-page report wa…","url":"https://news.yahoo.com/pompeo-says-us-tough-action-russian-meddling-153555699.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Jv79bdyWuzIClHEJP9HBYw--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/504dc9b86e85f410c55d5c10a8a74b5c9ecc59e9.jpg","publishedAt":"2019-04-19T15:35:55Z","content":"Washington (AFP) - Secretary of State Mike Pompeo vowed Friday the United States would keep taking \"tough action\" on Russia after Special Counsel Robert Mueller revealed widespread attempts by Moscow to help elect President Donald Trump.\r\nA day after Mueller'… [+982 chars]"}]}