{"status":"ok","totalResults":559,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Kate Clark","title":"Postmates has launched in 1,000 new cities since December","description":"The on-demand delivery platform is expanding rapidly ahead of its 2019 IPO.","url":"http://techcrunch.com/2019/04/23/postmates-has-launched-in-1000-new-cities-since-december/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/04/GettyImages-976735324.jpg?w=533","publishedAt":"2019-04-23T21:06:19Z","content":"Postmates is expanding like crazy ahead of an initial public offering expected later this year. The food delivery business has launched in 1,000 new cities since December, the company announced today.\r\nSan Francisco-based Postmates now operates its on-demand … [+1684 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Brian Kahn on Earther, shared by Maddie Stone to Gizmodo","title":"Americans' Top Environmental Concern May Surprise You","description":"When it comes to worrying about the environment, it’s hard to pick just one issue. On the one hand, you have the sixth mass extinction underway. On the other, there’s climate change fueling a whole raft of problems. Oh, and don’t forget toxic air pollution. S…","url":"https://earther.gizmodo.com/americans-top-environmental-concern-may-surprise-you-1834246160","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--3wNnmn9e--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ugfjufdrwepuaezcahcm.jpg","publishedAt":"2019-04-23T18:03:00Z","content":"When it comes to worrying about the environment, its hard to pick just one issue. On the one hand, you have the sixth mass extinction underway. On the other, theres climate change fueling a wholeraftofproblems. Oh, and dont forget toxic air pollution. So much… [+3429 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MICHAEL WINES","title":"Should Noncitizens Be Counted in America’s Political Maps?","description":"The Supreme Court is reviewing whether 2020 census respondents should say whether they are citizens. Their answer could affect political maps for generations to come.","url":"https://www.nytimes.com/2019/04/23/us/noncitizens-census-political-maps.html","urlToImage":"https://static01.nyt.com/images/2019/04/23/us/politics/noncitizen-pop-us-1555983395740/noncitizen-pop-us-1555983395740-facebookJumbo.png","publishedAt":"2019-04-23T09:00:26Z","content":"In Houston, redrawing maps without noncitizens could amount to a political sea change. Removing noncitizens from redistricting calculations would force immigrant-rich districts like Houstons 29th to expand their borders to make up for the loss of population. … [+2375 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Jennifer Ouellette","title":"What Starry Night has in common with gassy clouds where stars are born","description":"Several of Vincent van Gogh's paintings show evidence of turbulent scaling.","url":"https://arstechnica.com/science/2019/04/what-starry-night-has-in-common-with-gassy-clouds-where-stars-are-born/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2019/04/goghTOP-760x380.jpg","publishedAt":"2019-04-23T22:41:39Z","content":"Starry Night (1889) share turbulent properties with the molecular clouds that give birth to stars.\"/&gt;\r\n Enlarge/ The bold blue and yellow swirls of Vincent van Gogh's Starry Night (1889) share turbulent properties with the molecular clouds that give birth … [+5204 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Michelle Mark","title":"The Trump administration reportedly once considered housing migrant children in Guantanamo Bay","description":"The Department of Homeland Security weighed detaining migrant children in Guantanamo Bay, The New York Times reported Monday. The news comes amid a surge of migrants apprehended at the US-Mexico border in recent months, ramping up pressure on Trump administra…","url":"https://www.thisisinsider.com/dhs-considered-housing-migrant-children-in-guantanamo-bay-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf3a31d2ce7833f6579fda-1920-960.jpg","publishedAt":"2019-04-23T16:14:55Z","content":"Officials from the Department of Homeland Security recently considered detaining migrant children in Guantanamo Bay, the US military base best known for housing terror suspects, according to The New York Times. \r\n A surge of migrants apprehended at the US-Mex… [+1748 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Nicole Einbinder","title":"The US is threatening to veto a UN resolution intended to offer support to survivors of rape because of reproductive health language","description":"The US is reportedly threatening to veto a resolution in the United Nations Security Council that would prevent rape as a weapon of war and terrorism — because the resolution includes language about \"sexual and reproductive health.\" The resolution comes as th…","url":"https://www.thisisinsider.com/us-threatening-to-veto-a-un-resolution-intended-to-offer-support-to-survivors-of-rape-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf5e172730ca34b962f151-1920-960.jpg","publishedAt":"2019-04-23T18:47:32Z","content":"The United States is reportedly threatening to veto a resolution in the United Nations Security Council that would prevent rape as a weapon of war and terrorism — because the resolution includes language about \"sexual and reproductive health,\" which some in t… [+4675 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Connie Chen","title":"What is Amazon Prime Day? Everything you need to know and what to expect this July","description":"Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…","url":"https://www.businessinsider.com/what-is-amazon-prime-day","urlToImage":"https://amp.businessinsider.com/images/5b1eac281ae6621f008b4e8e-750-375.jpg","publishedAt":"2019-04-23T16:50:00Z","content":"Insider Picks writes about products and services to help you navigate when shopping online. Insider, Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object… [+5259 chars]"},{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Mica Allan","title":"5 clever startups that are making money recycling waste","description":"Can you remember what you were doing on New Year’s Day, 2018? Celebrating or perhaps nursing a hangover? What happened that day created a significant change in global recycling. China, the world’s largest scrap importer, stopped accepting recycled plastic, un…","url":"https://thenextweb.com/?p=1200092","urlToImage":"https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F04%2Ftrash_happiness_money.jpg&signature=b6d28b130c838720ac031c36bdd07f3a","publishedAt":"2019-04-23T12:56:19Z","content":"Can you remember what you were doing on New Years Day, 2018? Celebrating or perhaps nursing a hangover?\r\nWhat happened that day created a significant change in global recycling. China, the worlds largest scrap importer, stopped accepting recycled plastic, uns… [+7177 chars]"},{"source":{"id":"time","name":"Time"},"author":"Cedar Attanasio / AP","title":"Leader of Border Militia Claimed to Be Training to Assassinate Clinton, Obama and Soros, FBI Says","description":"The leader of an armed group that detained asylum-seekers near the border said he was training supporters to kill Obama, Clinton and Soros","url":"http://time.com/5575949/armed-group-migrant-mexico-assassination/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/u.s.-mexico-border-fence-militia.jpg?quality=85","publishedAt":"2019-04-23T03:33:13Z","content":"(LAS CRUCES, N.M.) — The leader of an armed group that has been detaining asylum-seeking families from Central America near the Mexican border said two years ago that he was training supporters to assassinate Hillary Clinton, Barack Obama and billionaire Demo… [+3225 chars]"},{"source":{"id":"time","name":"Time"},"author":"Kristin L. Hoganson","title":"What We Get Wrong About the American Heartland","description":"The real heartland, unlike the myth, was never closed off in the first place, argues historian Kristin L. Hoganson.","url":"http://time.com/5575686/heartland-myth/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/field.jpeg?quality=85","publishedAt":"2019-04-23T13:30:48Z","content":"If you were to buzz at bumblebee height over flyover country this month, you would find spring unfurling petal by petal, the crocuses, daffodils, tulips, forsythia and even the indomitable dandelion blooming noticeably earlier than several decades ago. But if… [+5981 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Mary Papenfuss","title":"FBI Received Reports Militia Leader Talked Of Assassin Training Targeting Obama","description":"The FBI learned in 2017 that Larry Mitchell Hopkins' home was a \"base\" for members \"armed with AK-47 rifles and other firearms,\" an FBI affidavit says.","url":"https://www.huffpost.com/entry/larry-mitchell-hopkins-united-constitutional-patriots-assassin-threat_n_5cbe35f7e4b0315683fbdb70","urlToImage":"https://img.huffingtonpost.com/asset/5cbe49cb2a0000e8044f9464.jpeg?cache=M2pOrItwko&ops=1200_630","publishedAt":"2019-04-23T00:53:48Z","content":"FBI agents received reports in 2017 that the leader of a right-wing militia that has been detaining immigrants in New Mexico had said then that his group was “training” to kill former President Barack Obama, former Democratic presidential candidate Hillary Cl… [+3627 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Max Golembo","title":"Southern Plains brace for more severe weather, flooding","description":"Texas is expecting heavy rain the next several days.","url":"https://abcnews.go.com/US/southern-plains-brace-severe-weather-flooding/story?id=62570090","urlToImage":"https://s.abcnews.com/images/US/weather-ap-190422_hpMain_16x9_992.jpg","publishedAt":"2019-04-23T10:24:52Z","content":"Severe storms moved through western Texas and parts of the Midwest overnight, delivering hail, damaging winds, flooding and at least two reported tornadoes.\r\nInterested in Weather?\r\nAdd Weather as an interest to stay up to date on the latest Weather news, vid… [+610 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Self-styled citizen border patrol abandons New Mexico camp: police","description":"SUNLAND PARK, N.M./TAOS, N.M. (Reuters) - An armed group that has been stopping migrants illegally crossing the U.S.-Mexico border honored a request to leave their camp in New Mexico on Tuesday and appeared to be heading home, the local police chief said. The…","url":"https://news.yahoo.com/armed-americans-stopping-migrants-agree-move-not-halting-200545134.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/G9dG.ib1idKg3PSuY7KJng--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2019-04-23T212656Z_1_LYNXNPEF3M1OQ_RTROPTP_2_USA-IMMIGRATION-MEXICO.JPG","publishedAt":"2019-04-23T22:28:38Z","content":"By Julio-Cesar Chavez and Andrew Hay\r\nSUNLAND PARK, N.M./TAOS, N.M. (Reuters) - An armed group that has been stopping migrants illegally crossing the U.S.-Mexico border honored a request to leave their camp in New Mexico on Tuesday and appeared to be heading … [+2160 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Armed militia group that detained migrants kicked out of their New Mexico camp","description":"Members of the United Constitutional Patriots militia, who had set up camp in Sunland Park, New Mexico, were told to leave their campsite by Friday.","url":"https://news.yahoo.com/armed-militia-group-detained-migrants-005914571.html","urlToImage":null,"publishedAt":"2019-04-23T00:59:14Z","content":null},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Victor Reklaitis","title":"Capitol Report: U.S. labor leader on USMCA: Mexico first must prove it’s killing ‘700,000 protectionist contracts’","description":"Before a replacement deal for Nafta takes effect, Mexico needs to prove it will enforce labor reforms that it’s in the process of enacting, said AFL-CIO President Richard Trumka on Tuesday, detailing a key objection to the USMCA.","url":"https://www.marketwatch.com/story/us-labor-leader-on-usmca-mexico-first-must-prove-its-killing-700000-protectionist-contracts-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI127_trumka_ZG_20190423161413.jpg","publishedAt":"2019-04-23T20:42:49Z","content":"Before a replacement deal for Nafta takes effect, Mexico needs to prove it will enforce labor reforms that its enacting, said AFL-CIO President Richard Trumka on Tuesday, detailing a key objection to the new U.S.-Mexico-Canada Agreement.\r\nHe said Democratic l… [+3448 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Michele Debczak","title":"The Most-Googled Mental Health Symptoms in Each State","description":"From depression to social media addiction, these are the mental health conditions and symptoms people are Googling across the U.S.","url":"http://mentalfloss.com/article/581050/most-googled-mental-health-symptoms-each-state","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_4822,w_8578,x_0,y_225/v1555951622/shape/mentalfloss/istock-643897728.jpg?itok=dIHzfb1L","publishedAt":"2019-04-23T13:00:00Z","content":"Does geographical location influence taste when it comes to binge-watching TV shows? That was the question tackled by Geek.com, which polled 1500 people across the country recently to discover which shows rank among the most popular in each state. Heres what … [+1289 chars]"},{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"Tame Impala Reveal Plans for Several New Tour Dates","description":"Fresh off a much-talked-about and critically-acclaimed Coachella performance, Tame Impala are adding several new shows to their current 2019 tour itinerary. Specifically, Tame Impala's latest spring and summer trek now has dates for newly-announced New York, …","url":"https://hypebeast.com/2019/4/tame-impala-2019-us-north-american-tour-dates-europe-world-global","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F04%2Ftame-impala-2019-us-north-american-tour-dates-europe-world-global-tw.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2019-04-23T04:55:42Z","content":"Fresh off a much-talked-about and critically-acclaimed Coachella performance, Tame Impala are adding several new shows to their current 2019 tour itinerary.\r\nSpecifically, Tame Impala’s latest spring and summer trek now has dates for newly-announced New York,… [+1952 chars]"},{"source":{"id":null,"name":"Cupofjo.com"},"author":"Kelsey Miller","title":"This Apartment Is a Plant Lover’s Dream","description":"Hilton Carter is an interior designer and the author of Wild at Home: How to Style and Care for Beautiful Plants. He is also the proud (and slightly overwhelmed) owner of about 300 stunning house plants, which he and his wife, Fiona, reside among in their Bal…","url":"https://cupofjo.com/2019/04/hilton-carter-plant-apartment/","urlToImage":"https://cupofjo.com/wp-content/uploads/2019/04/Home_Hallway_8.jpg","publishedAt":"2019-04-23T15:35:37Z","content":"Hilton Carter is an interior designer and the author of Wild at Home: How to Style and Care for Beautiful Plants. He is also the proud (and slightly overwhelmed) owner of about 300 stunning house plants, which he and his wife, Fiona, reside among in their Bal… [+6143 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"arestuccia@politico.com (Andrew Restuccia)","title":"Mueller report exposes diminishing power of Trump denials","description":"The report has reignited a long-running media debate about when, if ever, to accept White House denials at face value.","url":"https://www.politico.com/story/2019/04/23/mueller-report-trump-denials-1287870","urlToImage":"https://static.politico.com/cc/c4/0b40137943cfa232c1c8a22f9fe2/190423-trump-gty-773.jpg","publishedAt":"2019-04-23T17:17:41Z","content":"An increasingly agitated President Donald Trump let loose on Twitter on Tuesday morning, asserting that Democrats and the media have gone totally insane! | Joe Raedle/Getty Images\r\nPresident Donald Trump wants New York Times journalists to beg for forgiveness… [+6851 chars]"},{"source":{"id":null,"name":"Eater.com"},"author":"Angelica Rubio","title":"My Mom Was The First Person To See Jesus In A Tortilla, And It Changed Our Lives","description":"A white couple stood in front of me, bearing cheesy grins and a giant camera. \"Oh-lah! Is this the Rubio residence?\" one of them asked. \"We're here to see the Jesus tortilla!\"","url":"https://www.eater.com/2019/4/23/18412505/jesus-tortilla-original-maria-rubio-new-mexico","urlToImage":"https://cdn.vox-cdn.com/thumbor/BBDd6fDxY0LOxxbFwKxa4N_e1GA=/0x131:1907x1129/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16181396/tortilla_lede.jpeg","publishedAt":"2019-04-23T21:38:17Z","content":"On a spring evening in 1989, one of those sunny and windy days when I decided to stay home from school for the millionth time, I had just settled in for the night with a big, sodium-rich bowl of instant ramen and an episode of Threes Company when I heard a kn… [+10880 chars]"},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Al Jazeera","title":"New Mexico militia leader boasted of assassination training: FBI","description":"FBI says it was told that militia leader Larry Hopkins said his group trained to kill Obama, Clinton and Soros.","url":"https://www.aljazeera.com/news/2019/04/mexico-militia-leader-boasted-assassination-training-fbi-190423201042551.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/4/23/af3ca21c5c2549e5931f482a8dc5378c_18.jpg","publishedAt":"2019-04-23T21:11:23Z","content":"Larry Hopkins's arrest on Saturday came amid an uproar over videos his New Mexico-based militia group posted online, some of which showed camouflaged militiamen surrounding and detaining hundreds of migrants who had crossed the US-Mexico border.\r\nThe FBI arre… [+4170 chars]"},{"source":{"id":null,"name":"Thepointsguy.com"},"author":"Jessica Puckett","title":"Sri Lanka Attacks: The Latest Information Travelers Should Know","description":"Two days after hotels and churches in Sri Lanka were targeted in a series of bombings that killed more than 300 people on Easter Sunday, officials in the capital city, Colombo, were warned to look out for vehicles carrying explosives on Tuesday. “All police s…","url":"http://thepointsguy.com/news/sri-lanka-attacks-traveler-information/","urlToImage":"https://i2.wp.com/thepointsguy.com/wp-content/uploads/2020/04/GettyImages-1138922607.jpg?fit=1024%2C683px&ssl=1","publishedAt":"2019-04-23T16:25:33Z","content":"Two days after hotels and churches in Sri Lanka were targeted in a series of bombings that killed more than 300 people on Easter Sunday, officials in the capital city, Colombo, were warned to look out for vehicles carrying explosives on Tuesday.\r\n“All police … [+4400 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Libby Hill","title":"ESPN, PBS, and BBC Among Final Batch of 78th Peabody Winners","description":"Coverage of both the Larry Nassar USA Gymnastics scandal and ongoing humanitarian crisis at the U.S.–Mexico border were repeatedly celebrated.","url":"https://www.indiewire.com/2019/04/espn-pbs-and-bbc-78th-peabody-winners-1202127172/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2019/04/Spartan-Silence_ESPNW-ESPY.jpg","publishedAt":"2019-04-23T18:00:33Z","content":"The 78th Peabody Awards Board of Jurors announced its final batch of winners on April 23, revealing the winners of the News and Radio/Podcast categories and completing its list of Peabody 30 for programs released in 2018.\r\nThe stories told by the News and Rad… [+3142 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"To make up for Iran oil loss, India looks at alternate sources","description":"India will stop importing crude oil from Iran following the US move to end sanction waivers, and will use alternate supply sources such as Saudi Arabia to make up for the lost volumes, top officials and industry sources said on Tuesday. The Trump administrati…","url":"https://timesofindia.indiatimes.com/business/india-business/india-to-stop-importing-oil-from-iran-make-up-lost-volumes-from-alternate-sources/articleshow/69005553.cms","urlToImage":"https://static.toiimg.com/thumb/msid-69008914,width-1070,height-580,imgsize-154407,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2019-04-23T08:19:27Z","content":"NEW DELHI: India will stop importing crude oil from Iran following the US move to end sanction waivers, and will use alternate supply sources such as Saudi Arabia to make up for the lost volumes, top officials and industry sources said on Tuesday. The Trump a… [+5177 chars]"},{"source":{"id":null,"name":"R29.com"},"author":"Us, written by Us","title":"35 Celebrities Who Ditch Makeup On Their Day Off","description":"There is only one rule of makeup, which is that there are none. Foundation diehard? Allow us to direct you to our favorite ones. More the fiercely fresh-faced type? Here's the skin-care routine that will make you glow. We don't subscribe to the narrative that…","url":"https://www.amate.r29.com/en-us/2016/10/125623/celebrities-without-makeup-photos?utm_source=feed&utm_medium=rss","urlToImage":null,"publishedAt":"2019-04-23T18:10:00Z","content":null},{"source":{"id":null,"name":"Phys.org"},"author":"Alex Russell","title":"Protecting small farms in Mozambique from drought","description":"During the months that Jonathan Malacarne spent traveling from village to village in rural Mozambique, the weather could be dry and dusty or soaking wet from heavy rain. Either way, people from the community would walk and ride bikes from miles away to meet u…","url":"https://phys.org/news/2019-04-small-farms-mozambique-drought.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/2-protectingsm.jpg","publishedAt":"2019-04-23T13:20:01Z","content":"During the months that Jonathan Malacarne spent traveling from village to village in rural Mozambique, the weather could be dry and dusty or soaking wet from heavy rain. Either way, people from the community would walk and ride bikes from miles away to meet u… [+8413 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Ryan Devereaux","title":"The Bloody History of Border Militias Runs Deep — And Law Enforcement Is Part of It","description":"The Border Patrol appeared unconcerned when a border militia carrying AR-15s decorated with Punisher skulls captured hundreds of immigrants. The post The Bloody History of Border Militias Runs Deep — And Law Enforcement Is Part of It appeared first on The Int…","url":"https://theintercept.com/2019/04/23/border-militia-migrants/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/GettyImages-1132815926-1556035666-e1556035839344.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-23T17:24:41Z","content":"Customs and Border Protection, the agency that oversees the Border Patrol, provided The Intercept and several other news organizations with same statement when asked about the militias operations:\r\nU.S. Customs and Border Protection does not endorse private g… [+22628 chars]"},{"source":{"id":null,"name":"Skysports.com"},"author":null,"title":"Ole Gunnar Solskjaer LIVE!","description":"The best sports coverage from around the world, covering: Football, Cricket, Golf, Rugby, WWE, Boxing, Tennis and much more.","url":"https://www.skysports.com/football/live-blog/11095/11701373/ole-gunnar-solskjaer-live","urlToImage":null,"publishedAt":"2019-04-23T07:47:00Z","content":"Home\r\nNews\r\nSelect a team\r\nAll Teams\r\nArsenal\r\nBournemouth\r\nBrighton\r\nBurnley\r\nCardiff City\r\nChelsea\r\nCrystal Palace\r\nEverton\r\nFulham\r\nHuddersfield Town\r\nLeicester City\r\nLiverpool\r\nManchester City\r\nManchester United\r\nNewcastle United\r\nSouthampton\r\nTottenham H… [+3403 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Nick Njegomir","title":"Scientists create first billion-atom biomolecular simulation","description":"Researchers at Los Alamos National Laboratory have created the largest simulation to date of an entire gene of DNA, a feat that required one billion atoms to model and will help researchers to better understand and develop cures for diseases like cancer.","url":"https://phys.org/news/2019-04-scientists-billion-atom-biomolecular-simulation.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/6-scientistscr.jpg","publishedAt":"2019-04-23T10:36:51Z","content":"Researchers at Los Alamos National Laboratory have created the largest simulation to date of an entire gene of DNA, a feat that required one billion atoms to model and will help researchers to better understand and develop cures for diseases like cancer.\r\n\"It… [+3523 chars]"},{"source":{"id":null,"name":"Skysports.com"},"author":null,"title":"Premier League build-up LIVE!","description":"The best sports coverage from around the world, covering: Football, Cricket, Golf, Rugby, WWE, Boxing, Tennis and much more.","url":"https://www.skysports.com/football/live-blog/11095/11701373/premier-league-build-up-live","urlToImage":null,"publishedAt":"2019-04-23T07:47:00Z","content":"Home\r\nNews\r\nSelect a team\r\nAll Teams\r\nArsenal\r\nBournemouth\r\nBrighton\r\nBurnley\r\nCardiff City\r\nChelsea\r\nCrystal Palace\r\nEverton\r\nFulham\r\nHuddersfield Town\r\nLeicester City\r\nLiverpool\r\nManchester City\r\nManchester United\r\nNewcastle United\r\nSouthampton\r\nTottenham H… [+3403 chars]"},{"source":{"id":null,"name":"Trust.org"},"author":"Thomson Reuters Foundation","title":"'NOT BREAKING ANY LAWS'...","description":"'NOT BREAKING ANY LAWS'... (Third column, 2nd story, link ) Related stories: Leader of armed group stopping illegals at border to face federal charges... UPDATE: Mexican soldiers detain American soldiers on U.S. soil... 'Deep concern'... Advertise here","url":"http://news.trust.org/item/20190422163842-5wcam","urlToImage":"https://d2sh4fq2xsdeg9.cloudfront.net/contentAsset/image/c53dd3cd-b6d6-49ea-89d1-e16bab58018f/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100","publishedAt":"2019-04-23T01:37:40Z","content":"(Adds details from courtroom, background on group, UCP comment)\r\nBy Julio-Cesar Chavez and Andrew Hay\r\nLAS CRUCES, N.M./TAOS, N.M., April 22 (Reuters) - The head of an armed group that stops migrants who cross the U.S.-Mexico border illegally allegedly boaste… [+3885 chars]"},{"source":{"id":null,"name":"Conservativereview.com"},"author":"Daniel Horowitz","title":"UPDATE: Mexican soldiers detain American soldiers on U.S. soil...","description":"UPDATE: Mexican soldiers detain American soldiers on U.S. soil... (Third column, 3rd story, link ) Related stories: Leader of armed group stopping illegals at border to face federal charges... 'NOT BREAKING ANY LAWS'... 'Deep concern'... Advertise here","url":"https://www.conservativereview.com/news/mexican-soldiers-detain-american-soldiers-u-s-soil-government-response/","urlToImage":"https://www.conservativereview.com/wp-content/uploads/US-mexican-flags-on-pavement-sized.jpg","publishedAt":"2019-04-23T01:37:40Z","content":"The Mexican government is powerless to control the cartels at our border. But somehow when it comes to belligerently confronting our own soldiers on our own soil, the Mexicans seem to muster the personnel and temerity to defend their side of the border. Moreo… [+6782 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/anna-giaritelli","title":"Rules under review...","description":"A senior defense official says the Pentagon is reviewing how U.S. soldiers responded during an incident this month in which a Mexican troops detained and disarmed Americans on Texas soil.","url":"https://www.washingtonexaminer.com/news/us-military-rules-under-review-after-soldiers-surrendered-pistol-to-mexican-troops-on-american-soil","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/8588e8e/2147483647/strip/true/crop/1060x557+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F43%2F27%2Fdf42e35b4547877e198dacf18db1%2Fap-18320806280628.jpg","publishedAt":"2019-04-23T02:04:37Z","content":"A senior defense official says the Pentagon is reviewing how U.S. soldiers responded during an incident this month in which a Mexican troops detained and disarmed Americans on Texas soil.\r\nThe standoff between two U.S. soldiers and as many as six Mexican mili… [+2879 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcription)","title":"Helix Energy Solutions Group Inc (HLX) Q1 2019 Earnings Call Transcript","description":"HLX earnings call for the period ending March 31, 2019","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/helix-energy-solutions-group-inc-hlx-q1-2019-earni.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520242/featured-transcript-logo.png","publishedAt":"2019-04-23T20:36:15Z","content":"Image source: The Motley Fool.\r\nHelix Energy Solutions Group Inc  (NYSE:HLX)Q1 2019 Earnings Conference CallApril 23, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGreetings, and welco… [+47523 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Steel Dynamics Inc (STLD) Q1 2019 Earnings Call Transcript","description":"STLD earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/steel-dynamics-inc-stld-q1-2019-earnings-call-tran.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520072/featured-transcript-logo.png","publishedAt":"2019-04-23T10:05:13Z","content":"Image source: The Motley Fool.\r\nSteel Dynamics Inc  (NASDAQ:STLD)Q1 2019 Earnings CallApril 22, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, and welcome to the Steel Dynamic… [+64449 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Chris Hill)","title":"Samsung's Foldable Phone Isn’t as Robust as Advertised","description":"Amid reports of breakage, the tech company is postponing the launch of its flexible-screen Galaxy Fold.","url":"https://www.fool.com/investing/2019/04/23/market-foolery-04-22-2019.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520037/mf04222019_thumb.jpg","publishedAt":"2019-04-23T20:52:00Z","content":"If you're a tech company that wants to debut a smartphone with a revolutionary new feature, the one thing you don't want your early reviewers to tell the world is that the aforementioned feature rapidly broke their devices. That's probably doubly true when it… [+15909 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Coca-Cola Co (KO) Q1 2019 Earnings Call Transcript","description":"KO earnings call for the period ending March 29, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/coca-cola-co-ko-q1-2019-earnings-call-transcript.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520163/featured-transcript-logo.png","publishedAt":"2019-04-23T18:01:48Z","content":"Image source: The Motley Fool.\r\nCoca-Cola Co  (NYSE:KO)Q1 2019 Earnings CallApril 23, 2019, 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator --\r\nAt this time, I'd like to welcome everyone to The … [+52425 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Hasbro Inc (HAS) Q1 2019 Earnings Call Transcript","description":"HAS earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/hasbro-inc-has-q1-2019-earnings-call-transcript.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520158/featured-transcript-logo.png","publishedAt":"2019-04-23T17:43:15Z","content":"Image source: The Motley Fool.\r\nHasbro Inc  (NASDAQ:HAS)Q1 2019 Earnings CallApril 23, 2019, 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning, and welcome to the Hasbro First Quarte… [+58291 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Centene Corp (CNC) Q1 2019 Earnings Conference Call Transcript","description":"CNC earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/centene-corp-cnc-q1-2019-earnings-conference-call.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520243/featured-transcript-logo.png","publishedAt":"2019-04-23T20:40:59Z","content":"Image source: The Motley Fool.\r\nCentene Corp  (NYSE:CNC)Q1 2019 Earnings Conference CallApril 23, 2019, 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, and welcome to the Centene Corp… [+72796 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Nucor Corp (NUE) Q1 2019 Earnings Call Transcript","description":"NUE earnings call for the period ending March 30, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/nucor-corp-nue-q1-2019-earnings-call-transcript.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520277/featured-transcript-logo.png","publishedAt":"2019-04-23T22:49:21Z","content":"Image source: The Motley Fool.\r\nNucor Corp  (NYSE:NUE)Q1 2019 Earnings CallApril 23, 2019, 2:00 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, everyone, and welcome to the Nucor Corporati… [+43350 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribing)","title":"Whirlpool (WHR) Q1 2019 Earnings Call Transcript","description":"WHR earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/whirlpool-whr-q1-2019-earnings-call-transcript.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520282/featured-transcript-logo.png","publishedAt":"2019-04-23T23:16:45Z","content":"Image source: The Motley Fool.\r\nWhirlpool(NYSE:WHR)Q1 2019 Earnings CallApril 23, 2019 8:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning, and welcome to Whirlpool Corporation's first… [+45872 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Enterprise Financial Services Corp (EFSC) Q1 2019 Earnings Call Transcript","description":"EFSC earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/enterprise-financial-services-corp-efsc-q1-2019-ea.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520300/featured-transcript-logo.png","publishedAt":"2019-04-23T23:51:39Z","content":"Image source: The Motley Fool.\r\nEnterprise Financial Services Corp  (NASDAQ:EFSC)Q1 2019 Earnings CallApril 23, 2019, 3:30 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day and welcome to the… [+44709 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Procter & Gamble Co (PG) Q3 2019 Earnings Call Transcript","description":"PG earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/procter-gamble-co-pg-q3-2019-earnings-call-transcr.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520212/featured-transcript-logo.png","publishedAt":"2019-04-23T19:40:09Z","content":"Image source: The Motley Fool.\r\nProcter &amp; Gamble Co  (NYSE:PG)Q3 2019 Earnings CallApril 23, 2019, 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning, and welcome to Procter &amp;… [+59018 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Franklin Electric Co Inc (FELE) Q1 2019 Earnings Call Transcript","description":"FELE earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/franklin-electric-co-inc-fele-q1-2019-earnings-cal.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520239/featured-transcript-logo.png","publishedAt":"2019-04-23T20:26:27Z","content":"Image source: The Motley Fool.\r\nFranklin Electric Co Inc  (NASDAQ:FELE)Q1 2019 Earnings CallApril 23, 2019, 9:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, ladies and gentlemen, and w… [+47994 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Patrick Hipes","title":"Peabody Awards: ProPublica, ‘Frontline’, ESPN, New York Times Among News/Radio Podcast Winners","description":"The Peabody Awards on Tuesday revealed its winners in the News and Radio/Podcast categories, rounding out the organization’s honors for 2018’s most powerful, enlightening and invigorating stories in TV, radio and digital media. Winners of the 78th annual awar…","url":"https://deadline.com/2019/04/peabody-awards-2018-winners-news-radio-podcasts-list-1202600115/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/cambridge-analytica-e1556030873345.jpg?w=1024","publishedAt":"2019-04-23T18:00:19Z","content":"The Peabody Awards on Tuesday revealed its winners in the News and Radio/Podcast categories, rounding out the organization’s honors for 2018’s most powerful, enlightening and invigorating stories in TV, radio and digital media. Winners of the 78th annual awar… [+9574 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Nancy Tartaglione","title":"‘Avengers: Endgame’ China Midnights Rocket To Record $27M – International Box Office","description":"China is at the endgame now as Avengers: Endgame is ready to rumble with midnight screenings just kicking off. The estimated presale total is a record-shattering $26.8M (RMB 180M). Showings at 3AM and 6AM are also included in the midnights tally which should …","url":"https://deadline.com/2019/04/avengers-endgame-china-midnights-record-opening-weekend-international-box-office-1202600409/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/03/endgame-china-poster.jpg?w=1024","publishedAt":"2019-04-23T17:03:38Z","content":"China is at the endgame now as Avengers: Endgame is ready to rumble with midnight screenings just kicking off. The estimated presale total is a record-shattering $26.8M (RMB 180M). Showings at 3AM and 6AM are also included in the midnights tally which should … [+2435 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Anil Sasi","title":"Explained: Life without Iranian oil","description":"How has India been preparing for the tightening of US sanctions? What key metrics could be impacted? What are the main concerns, and what role are the ongoing elections likely to play in India’s response?","url":"https://indianexpress.com/article/explained/explained-life-without-iranian-oil-5691253/","urlToImage":"https://images.indianexpress.com/2019/03/iran-sanctions-759.jpg?w=759","publishedAt":"2019-04-23T19:02:40Z","content":"A gas flare on an oil production platform in the Soroush oil fields is seen alongside an Iranian flag in the Gulf (Reuters)\r\nIndia has said the country is sufficiently prepared to deal with the impact of the US decision to curtail the temporary exemption from… [+8886 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Chris Lee","title":"How Hollywood Writers Are Finding Jobs After Firing Their Agents","description":"Can the WGA’s internet jobs board, a Twitter hashtag, and networking “mixers” provide the employment connections agents once did?","url":"http://www.vulture.com/2019/04/how-wga-writers-are-finding-jobs-after-firing-agents.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/19/19-wga-mixer.w1200.h630.jpg","publishedAt":"2019-04-23T12:30:09Z","content":"Im looking for diverse voices. Were looking for upper-level women. Were looking for queer voices whove lived in Chicago. Were looking for people with experience with cars.\r\nThese are some of the messages that greet members of the Writers Guild of America when… [+11730 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Aurelie Corinthios","title":"Scott Disick Lands New E! Show Flipping and Remodeling High-End Homes in Flip It Like Disick","description":"Lord Disick is in the house! (Pun intended.) PEOPLE can exclusively announce that Scott Disick, of Keeping Up with the Kardashians fame, has landed a new show on E! flipping and remodeling high-end homes. Flip It Like Disick, an eight-episode, one-hour series…","url":"https://people.com/tv/scott-disick-new-show-flip-it-like-disick/","urlToImage":"https://peopledotcom.files.wordpress.com/2017/07/scott-disick-1.jpg?crop=0px%2C69px%2C1500px%2C787px&resize=1200%2C630","publishedAt":"2019-04-23T14:00:38Z","content":"Lord Disick is in the house! (Pun intended.)\r\nPEOPLE can exclusively announce that Scott Disick, of Keeping Up with the Kardashians fame, has landed a new show on E! flipping and remodeling high-end homes. Flip It Like Disick, an eight-episode, one-hour serie… [+1634 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Sanjeev Choudhary","title":"Oil's not looking well for India in May","description":"Oil's not looking well for India in MayUS waivers that allowed India to continue importing Iranian oil for six months ends May 1.","url":"https://economictimes.indiatimes.com/industry/energy/oil-gas/india-prepares-for-life-without-iran-oil/articleshow/69000287.cms","urlToImage":"https://img.etimg.com/thumb/msid-69000292,width-1070,height-580,imgsize-447176,overlay-economictimes/photo.jpg","publishedAt":"2019-04-23T02:52:19Z","content":"New Delhi: India and seven other countries will not be able to import cheaper Iranian oil without attracting US sanctions after May 1when the Donald Trump administration will end all the waivers. The US decision has jacked up global oil prices, which can pote… [+3348 chars]"},{"source":{"id":null,"name":"Gq.com"},"author":"Luke Darby","title":"Militia Guy Mad About \"Illegals\" Gets Arrested for Doing Lots of Illegal Stuff","description":"The leader of a New Mexico militia that detained hundreds of migrants is under arrest. And it's not the first time.","url":"https://www.gq.com/story/militia-guy-gets-arrested-for-doing-illegal-stuff","urlToImage":"https://media.gq.com/photos/5cbf528d145008853c54d090/16:9/w_1280,c_limit/GettyImages-1132815926.jpg","publishedAt":"2019-04-23T20:04:07Z","content":"Last week, a New Mexico militia released shocking video, showing nearly 300 migrants held at gunpoint by the self-appointed border enforcers. The United Constitutional Patriots have been patrolling the U.S.-Mexico border for months now, claiming that they're … [+2075 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Lily Meyer","title":"'The Moment Of Lift' Is More Of A Whisper Than A Call To Action","description":"If Melinda Gates had fully owned her goal — writing a book that would strengthen some readers' abortion-rights convictions and open others' minds — she would have called for greater advocacy.","url":"https://www.npr.org/2019/04/23/716066240/the-moment-of-lift-is-more-of-a-whisper-than-a-call-to-action","urlToImage":"https://media.npr.org/assets/img/2019/04/23/gettyimages-1127618959_wide-2005bfe288af3b91331b510d86ed6d46a85d2263.jpg?s=1400","publishedAt":"2019-04-23T17:52:43Z","content":"Melinda Gates speaks during Oprah's SuperSoul Conversations at PlayStation Theater on Feb. 5 in New York City.\r\nJamie McCarthy/Getty Images\r\nWriting about Melinda Gates' philanthropic manifesto The Moment of Lift: How Empowering Women Changes the World poses … [+5912 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Phil Levy, Contributor, Phil Levy, Contributor https://www.forbes.com/sites/phillevy/","title":"Trump Brings Trade Tranquility?!","description":"It seems absurd to say that President Trump’s approach to trade policy reduces uncertainty about trade barriers. But if you’re unwilling to say that, then the ITC finds the new NAFTA to be a loser.","url":"https://www.forbes.com/sites/phillevy/2019/04/23/trump-brings-trade-tranquility/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_4893%2Fpt_4893_782_o.jpg%3Ft%3D1556013422","publishedAt":"2019-04-23T09:57:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nU.S. President Donald Trump, on April 4,&amp;nbsp;demanded&amp;nbsp;that the Mexican government stop the flow of illegal drugs into the U.S. within a year or face car tariffs. Chris Kleponis/Pool via Blo… [+10205 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jeff Arnold, Contributor, Jeff Arnold, Contributor https://www.forbes.com/sites/jeffarnold/","title":"Adding Former Cubs Pitcher Carlos Zambrano Ushers In A Perfect Storm For Independent Chicago Dogs","description":"As 37-year-old Carlos Zambrano attempts to make a comeback with an independent minor league baseball team, the former Cubs pitcher will do so as just another player. On a payroll that sits between $120,000 and $130,000, Zambrano won't be one the team's three …","url":"https://www.forbes.com/sites/jeffarnold/2019/04/23/adding-former-cubs-pitcher-carlos-zambrano-ushers-in-a-perfect-storm-for-independent-chicago-dogs/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fjeffarnold%2Ffiles%2F2019%2F04%2F0.jpeg","publishedAt":"2019-04-23T12:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nNew Chicago Dogs pitcher Carlos Zambrano (left) poses with team owner Shawn Hunter (right) and team mascot Squeeze during a media tour last week.\r\nThe Chicago Dogs\r\nIf the notion of providing a 37-year-o… [+13290 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Joe Cornell, Contributor, Joe Cornell, Contributor https://www.forbes.com/sites/joecornell/","title":"KAR Auctions Services Targets Spin Of Insurance Auto Auctions Spinco In 2Q","description":"On April 1, 2019, KAR Auction Services, Inc. announced that it has received a favorable private letter ruling from the IRS to the IAA spin. As per the latest Form 10, IAA’s debt is pegged at approximately $1,330.0 million upon completion of the separation. Sp…","url":"https://www.forbes.com/sites/joecornell/2019/04/23/kar-auctions-services-targets-spin-of-insurance-auto-auctions-spinco-in-2q/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1083374350%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-23T16:18:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\n(Photo by Igor Golovniov/SOPA Images/LightRocket via Getty Images)\r\nGetty\r\nOn April 1, 2019, KAR Auction Services, Inc. (NYSE: KAR, $55.98, Market Capitalization: $7.5 billion), a leading provider of who… [+20032 chars]"},{"source":{"id":null,"name":"Theparisreview.org"},"author":"Victor Serge","title":"Notes from an Exiled Revolutionary","description":"In his notebooks, the writer and revolutionary Victor Serge reflects on life in exile, world at war, and the cruel fates of his friends.","url":"https://www.theparisreview.org/blog/2019/04/23/notes-from-an-exiled-revolutionary/","urlToImage":"https://www.theparisreview.org/blog/wp-content/uploads/2019/04/hoberman_1-102209.jpg","publishedAt":"2019-04-23T15:26:04Z","content":"The writer and revolutionary Victor Serge was one of the few prominent opponents of Stalin to escape the despots wrath. In 1936, in the midst of the Great Terror, Serge fled the Soviet Union for France. When the Nazis took Paris, in 1940, he fled to Mexico, w… [+15000 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Andrew DePietro, Contributor, Andrew DePietro, Contributor https://www.forbes.com/sites/andrewdepietro/","title":"Here's How Much Money Graphic Designers Earn In Every State","description":"Find out where you can earn the most money as a graphic designer in the United States.","url":"https://www.forbes.com/sites/andrewdepietro/2019/04/23/graphic-designer-salary-state/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_5036%2Fpt_5036_585_o.jpg%3Ft%3D1556000109","publishedAt":"2019-04-23T06:15:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nGraphic designers earn slightly more than the U.S. average wage for all occupations.\r\nGetty\r\nWith the explosion of the internet and digital revolution in general, the career of a graphic designer has bee… [+8680 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Russ Espinoza, Contributor, Russ Espinoza, Contributor https://www.forbes.com/sites/russespinoza/","title":"No: Giancarlo Esposito Did Not Declare 'Better Call Saul' Will End After Six Seasons","description":"Fans of the hit AMC prequel series are advised to read carefully.","url":"https://www.forbes.com/sites/russespinoza/2019/04/23/no-giancarlo-esposito-did-not-declare-better-call-saul-will-end-after-six-seasons/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F61b19a3e5ae24be7a424784f5ded976c%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-23T07:36:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nGiancarlo Esposito appeared as Gustavo Fring in Seasons 2-4 of AMC's 'Breaking Bad' and reprised the role in Seasons 3 and 4 of 'Better Call Saul.' (Photo by Richard Shotwell/Invision/AP)\r\nAMC's acclaime… [+7155 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/anna-giaritelli","title":"Mexico says it deported 15,000 migrants in April but thousands are still headed north - Washington Examiner","description":"Mexico says it deported 15,000 migrants in April but thousands are still headed north Washington Examiner Trump renews threat to close portions of southern border ABC News Trump warns Mexico over guns drawn on US troops: ‘Better not happen again!’ Fox News Mi…","url":"https://www.washingtonexaminer.com/news/mexico-says-it-deported-15-000-migrants-in-april-but-thousands-are-still-headed-north","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/8d00290/2147483647/strip/true/crop/5328x2797+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F2c%2F1f%2Fc8f5eb664f0489befcefb4b400e4%2Fap-19059819963001.jpg","publishedAt":"2019-04-23T18:30:00Z","content":"The Mexican government says it has deported 15,000 migrants who illegally entered Mexico from Guatemala and had been traveling as part of caravans in hopes of reaching the United States' southern border.\r\nMexico's National Institute of Migration office said m… [+2483 chars]"},{"source":{"id":null,"name":"Bbc.com"},"author":"https://www.facebook.com/bbcnews","title":"US 'border militia training to assassinate Obama' - FBI - BBC News","description":"US 'border militia training to assassinate Obama' - FBI BBC News New Mexico militia leader's arrest connected to 2017 FBI search of his home CBS News Militia in New Mexico Planned to Kill Obama and Clinton, F.B.I. Was Told The New York Times The U.S.-Mexico b…","url":"https://www.bbc.com/news/world-us-canada-48027190","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/1795E/production/_106560669_tv053502938.jpg","publishedAt":"2019-04-23T15:01:02Z","content":"Image copyrightPAUL RATJE/AFP/Getty ImagesImage caption\r\n Larry Mitchell Hopkins, who also goes by the alias Striker (left), speaking with a militia member\r\nThe suspected leader of a New Mexico militia group allegedly boasted of plans to assassinate former Pr… [+2655 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":null,"title":"Militia Defiant in New Mexico: ‘It's My God-Given Right to Be Here’ - The New York Times","description":"Militia Defiant in New Mexico: ‘It's My God-Given Right to Be Here’ The New York Times Militia that has held hundreds of migrants at the border will leave their camp, police say CNN Self-styled U.S. citizen border patrol unravels after leader's arrest Reuters…","url":"https://www.nytimes.com/2019/04/23/us/new-mexico-militia-border.html","urlToImage":"https://static01.nyt.com/images/2019/04/23/us/23militia2/23militia2-facebookJumbo.jpg","publishedAt":"2019-04-23T23:50:46Z","content":"If you ask me this is all about politics, said Mr. Gonzalez, adding that he was a disabled Army veteran with post-traumatic stress disorder. The Democrats want illegal immigration because that means more votes for them.\r\nBut I took an oath to protect my count… [+1273 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"William La Jeunesse","title":"Heavily armed men escort migrants across US border, surveillance video shows - Fox News","description":"Heavily armed men escort migrants across US border, surveillance video shows Fox News New government video obtained by Fox News shows heavily armed men at the U.S.-Mexico border escorting a migrant mother and son into the United States.","url":"https://www.foxnews.com/us/heavily-armed-men-escort-migrants-across-us-border-surveillance-video-shows","urlToImage":"https://media2.foxnews.com/BrightCove/694940094001/2019/04/23/694940094001_6029130936001_6029113577001-vs.jpg","publishedAt":"2019-04-23T17:51:05Z","content":"New government video obtained by Fox News shows heavily armed men at the U.S.-Mexico border escorting a migrant mother and son into the United States. Border Patrol officials told Fox News this is an unusual event and express concern that it will become a mor… [+2381 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"https://www.facebook.com/lindseybever","title":"Militia leader at the border said members were training to kill Obama, Clinton and Soros, FBI said - Washington Post","description":"Militia leader at the border said members were training to kill Obama, Clinton and Soros, FBI said Washington Post Commander of U.S. border militia appears before federal judge CBS This Morning Militia in New Mexico Planned to Kill Obama and Clinton, F.B.I. W…","url":"https://www.washingtonpost.com/immigration/2019/04/23/militia-leader-border-said-members-were-training-kill-obama-clinton-soros-fbi-said/","urlToImage":"https://www.washingtonpost.com/resizer/tZM_cuUHuidhz1g2OpIy4N2_v9U=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/S27ISWTD3QI6TPZE3NFZ7NRKUI.jpg","publishedAt":"2019-04-23T13:46:09Z","content":"The leader of an armed militia that scours the southern border for undocumented migrants had once claimed that his group was training to assassinate former president Barack Obama, former secretary of state Hillary Clinton and billionaire Democratic donor Geor… [+7547 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Kamini Ramdeen","title":"Democrat calls Biden's jokes about touching 'disrespectful' - AOL","description":"Democrat calls Biden's jokes about touching 'disrespectful' AOL Biden accuser Lucy Flores: Tone-deaf jokes 'incredibly disrespectful' New York Post Biden accuser Lucy Flores questions sincerity of former vice president's pledge to change his behavi Fox News B…","url":"https://www.aol.com/article/news/2019/04/23/democrat-calls-bidens-jokes-about-touching-disrespectful/23715861/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/3334x2188+0+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2F7ddb7300-65c4-11e9-89fd-cbe68109e2cf","publishedAt":"2019-04-23T12:37:29Z","content":"WASHINGTON (AP) A Nevada Democrat who accused Joe Biden of touching her without permission says the former vice president has been \"so incredibly disrespectful\" by joking about the matter.\r\nLucy Flores leveled her criticism Monday on Fox News as Biden nears a… [+14617 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Rachel Kleinman","title":"Jared Kushner: Russia investigations 'more harmful' than 'a couple of Facebook ads' - AOL","description":"Jared Kushner: Russia investigations 'more harmful' than 'a couple of Facebook ads' AOL Kushner says Russia investigations more harmful to US 'than a couple Facebook ads' CNN Jared Kushner says probes more harmful to U.S. than Russian meddling CBS News Kushne…","url":"https://www.aol.com/article/news/2019/04/23/jared-kushner-russia-investigations-more-harmful-than-a-couple-of-facebook-ads/23716031/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/4079x2675+0+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2Fff5a4420-65e6-11e9-afbd-6675fb798976","publishedAt":"2019-04-23T16:44:25Z","content":"NEW YORK Jared Kushner on Tuesday said he believes the investigations into Russian interference in the 2016 presidential election have been way more harmful to our democracy than the interference itself.\r\nIf you look what Russia did, you know, buying some Fac… [+5466 chars]"},{"source":{"id":null,"name":"Manrepeller.com"},"author":"Jenna Birch","title":"I Asked Other Couples to Tell Me About Their Most Absurd Fights","description":"From pink Power Rangers to cheese boards, couples share their weirdest, most absurd fights they've gotten into. What's yours?","url":"https://www.manrepeller.com/2019/04/20-couples-absurd-fights.html","urlToImage":"https://www.manrepeller.com/wp-content/uploads/2019/04/Final_rediculousl_fights_sq.jpg","publishedAt":"2019-04-23T16:00:29Z","content":"I am hyper-planned out; in fact, Ive never met a plan I didnt want to keep. I like knowing what Im doing, who Im doing it with, and what kind of vibe it will entail — long before it all takes place. Early in our relationship, my long-distance boyfriend didnt … [+9150 chars]"},{"source":{"id":null,"name":"Scotusblog.com"},"author":"Mark Walsh","title":"A “view” from the courtroom: Counting to five","description":"Today is the oral argument in one of the term’s biggest cases, Department of Commerce v. New York, about the Trump administration’s efforts to add a citizenship question to the 2020 census. It is also a rare day for afternoon arguments, and rarer still becaus…","url":"https://www.scotusblog.com/2019/04/a-view-from-the-courtroom-counting-to-five/","urlToImage":"https://www.scotusblog.com/wp-content/uploads/2019/04/bSC190423wide_Francisco.jpg","publishedAt":"2019-04-23T22:43:34Z","content":"Today is the oral argument in one of the terms biggest cases, Department of Commerce v. New York, about the Trump administrations efforts to add a citizenship question to the 2020 census. It is also a rare day for afternoon arguments, and rarer still because … [+8412 chars]"},{"source":{"id":null,"name":"Longreads.com"},"author":"Matt Jones","title":"No Heart, No Moon","description":"How humanity eats the future to feed the present.","url":"https://longreads.com/2019/04/23/no-heart-no-moon/","urlToImage":"https://longreadsblog.files.wordpress.com/2019/04/ap_880929021.jpg?w=1200","publishedAt":"2019-04-23T10:00:33Z","content":"Matt Jones | The Southern Review| Summer 2018 | 22 minutes (4,337 words)\r\nThe space race killed the sparrow.\r\nOf course, there were other factors.\r\nThere was the decision in 46 by the Brevard Mosquito Control District to slather the Merritt Island salt marshe… [+27308 chars]"},{"source":{"id":null,"name":"Democracynow.org"},"author":"mail@democracynow.org (Democracy Now!)","title":"Right Wing Vigilantes Hold Migrants Hostage on U.S. Border. Did Border Patrol Give Tacit Approval?","description":"The FBI has arrested the head of an armed vigilante group that has repeatedly filmed itself detaining migrant border crossers at gunpoint. Sixty-nine-year-old Larry Mitchell Hopkins is the leader of the far-right, pro-Trump group calling itself United Constit…","url":"https://www.democracynow.org/2019/4/23/right_wing_vigilantes_hold_migrants_hostage","urlToImage":"https://www.democracynow.org/images/story/42/47142/full_hd/h4-aclu-fascist-militia-migrants-us-mexico-border.jpg","publishedAt":"2019-04-23T12:12:51Z","content":"This is viewer supported news. Please do your part today.\r\nDonate\r\nThe FBI has arrested the head of an armed vigilante group that has repeatedly filmed itself detaining migrant border crossers at gunpoint. Sixty-nine-year-old Larry Mitchell Hopkins is the lea… [+467 chars]"},{"source":{"id":null,"name":"Eonline.com"},"author":"Natalie Finn","title":"24 Things About Gigi Hadid You Shouldn't Forget","description":"If you had asked an 18-year-old Gigi Hadid where she saw herself in five years, even her wildest-dreams scenario would've resembled where she ended up. The reality most likely...","url":"https://www.eonline.com/news/1034779/24-things-about-gigi-hadid-you-shouldn-t-forget","urlToImage":"https://akns-images.eonline.com/eol_images/Entire_Site/20181111/rs_600x600-181211121340-1080-Gigi-Hadid-GettyImages-1071834964.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90","publishedAt":"2019-04-23T10:00:00Z","content":"Instagram\r\nHappy Birth Day\r\nShe was born Jelena Noura Hadid on April 23, 1995, to Dutch model mom Yolanda Hadid and Palestinian-born real estate developer Mohamed Hadid.\r\n\"I feel very proud and very lucky to be of dual heritage,\" Gigi told Vogue in 2017.\r\nAnd… [+10034 chars]"},{"source":{"id":null,"name":"Longreads.com"},"author":"Bridey Heing","title":"‘Midwesterners Have Seen Themselves As Being in the Center of Everything.’","description":"In \"The Heartland,\" Kristin L. Hoganson says America's Midwest has been more connected to global events than popular history allows — especially popular history as told in the Midwest.","url":"https://longreads.com/2019/04/23/midwesterners-have-seen-themselves-as-being-in-the-center-of-everything/","urlToImage":"https://longreadsblog.files.wordpress.com/2019/04/gettyimages-109858873-3.jpg?w=1200","publishedAt":"2019-04-23T11:00:35Z","content":"Bridey Heing | Longreads | April 2019 | 10 minutes (2,589 words)\r\nThe American Midwest is hard to define. Even which states can be considered Midwestern depends on who you ask; is it what lies between Ohio and Iowa? Or does the Midwest stretch further west ac… [+14411 chars]"},{"source":{"id":null,"name":"Propublica.org"},"author":"by ProPublica","title":"ProPublica “Zero Tolerance” Series Wins First-Ever Peabody Catalyst Award","description":"by ProPublica The ProPublica series “ Zero Tolerance ” on the Trump administration’s family separation policy was awarded on Tuesday the first-ever Peabody Catalyst Award for bringing immediate change to the practice. “No fake news here,” said Jeffrey Jones, …","url":"https://www.propublica.org/atpropublica/propublica-zero-tolerance-series-wins-first-ever-peabody-catalyst-award","urlToImage":"https://assets.propublica.org/2017-pp-open-graph-1200x630.jpg","publishedAt":"2019-04-23T19:11:19Z","content":"The ProPublica series Zero Tolerance on the Trump administrations family separation policy was awarded on Tuesday the first-ever Peabody Catalyst Award for bringing immediate change to the practice.\r\nNo fake news here, said Jeffrey Jones, executive director o… [+5977 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Cristian Gnaticov","title":"Mercedes-Benz GLB Will Be Made In Mexico And China","description":"The Mercedes GLB crossover will go on sale before the end of the year.","url":"https://www.carscoops.com/2019/04/mercedes-benz-glb-will-be-made-in-mexico-and-china/","urlToImage":"https://images.carscoops.com/2019/04/dcff475e-2019-mercedes-benz-glb-concept-0.jpg","publishedAt":"2019-04-23T12:03:05Z","content":"In a blog post on the Daimler website, Mercedes has revealed the official production sites for the upcoming GLB: Aguascalientes, Mexico, and Peking, China.\r\nThe two facilities will be in charge of putting together the mini G-Wagen and assembly should commence… [+1624 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Brad Anderson","title":"Donate To Hydropower In Vietnam, Feel Better About Your Porsche’s U.S. Emissions","description":"Porsche will enable its owners to offset their carbon emissions by supporting various \"green\" projects.","url":"https://www.carscoops.com/2019/04/donate-to-hydropower-in-vietnam-feel-better-about-your-porsches-u-s-emissions/","urlToImage":"https://images.carscoops.com/2019/04/55614dbf-porsche-carbon-offset-.jpg","publishedAt":"2019-04-23T22:32:44Z","content":"Porsche Cars North America has announced that its fleet vehicles will be carbon neutral thanks to its new carbon-offset program.\r\nThe automakers North American fleet, which consists of 425 vehicles including the cars at the Porsche Experience Centers in Atlan… [+1520 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/anna-giaritelli","title":"'Mother of all caravans' heads north: 10K migrants due in Mexico City any day - Washington Examiner","description":"'Mother of all caravans' heads north: 10K migrants due in Mexico City any day Washington Examiner Trump suggests Mexican soldiers disarmed National Guard troops as cover for drug smuggling | TheHill The Hill Militia Defiant in New Mexico: ‘It's My God-Given R…","url":"https://www.washingtonexaminer.com/news/mother-of-all-caravans-heads-north-10k-migrants-due-in-mexico-city-any-day","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/83902c2/2147483647/strip/true/crop/1060x557+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Ff3%2F91%2Ff958e2ad4570a8a66ba9224ab020%2Fap-19112767541115.jpg","publishedAt":"2019-04-23T21:14:00Z","content":"A massive caravan of approximately 10,000 migrants traveling through Mexico in hopes of reaching the United States is expected to arrive in Mexico City this week, according to local media reports on the group's movements.\r\nThe group has been described by Mexi… [+2034 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/jamie-mcintyre","title":"North Korea's Kim arrives in Vladivostok for summit with Putin - Washington Examiner","description":"North Korea's Kim arrives in Vladivostok for summit with Putin Washington Examiner Kim-Putin: North Korean and Russian leaders to meet for first time BBC News North Korea's Kim to meet Putin at crucial diplomatic moment Fox News Putin's summit with Kim Jong U…","url":"https://www.washingtonexaminer.com/policy/defense-national-security/north-koreas-kim-arrives-in-vladivostok-for-summit-with-putin","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/47214b5/2147483647/strip/true/crop/1060x557+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F2b%2F6a%2Fc134f32d4fb28d429c8b1cd2c56b%2Fdod-default-1060x600.png","publishedAt":"2019-04-23T11:48:00Z","content":"KIM TO MEET PUTIN: North Korean leader Kim Jong Un has arrived by train in Vladivostok in far eastern Russia to meet with President Vladimir Putin. The summit was announced only yesterday by KCNA, North Koreas state-run news agency, in a two-sentence statemen… [+20031 chars]"},{"source":{"id":null,"name":"Theblaze.com"},"author":"Jordan Schachtel","title":"VIDEO: Heavily armed gunmen escort migrants across US southern border","description":"A shocking new video released by U.S. Customs and Border Protection Tuesday afternoon shows an armed group of men escorting a mother and her school-age son into the United States across the U.S.-Mexico border. In the video, four or five men are \"in full tacti…","url":"https://www.theblaze.com/news/armed-gunmen-escort-migrants-across-us-border","urlToImage":"https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19413820%2F1200x600.jpg/2000%2C2000/7gO3CLqthXpN3zLS/img.jpg","publishedAt":"2019-04-23T21:50:09Z","content":"A shocking new video released by U.S. Customs and Border Protection Tuesday afternoon shows an armed group of men escorting a mother and her school-age son into the United States across the U.S.-Mexico border.\r\nIn the video, four or five men are \"in full tact… [+2013 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By samantha.allen@thedailybeast.com (Samantha Allen)","title":"Nevada National Guard Joins California and New Mexico To Defy Trump's Trans Troops Ban","description":"Photo Illustration by The Daily Beast / Photo Getty The Nevada National Guard will continue to allow transgender people to serve. Even as the Trump administration’s transgender troop ban enters its second full week of being in effect, two states— California a…","url":"https://www.thedailybeast.com/nevada-national-guard-joins-california-and-new-mexico-to-defy-trumps-trans-troops-ban","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1350,w_2400,x_300,y_168/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1556035041/190422-allen-national-guard-tease_jmvzzu","publishedAt":"2019-04-23T16:18:15Z","content":"The Nevada National Guard will continue to allow transgender people to serve.\r\nEven as the Trump administrations transgender troop ban enters its second full week of being in effect, two statesCalifornia and New Mexicohave said that transgender people will co… [+5106 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"Helix Energy Solutions Group, Inc. (HLX) CEO Owen Kratz on Q1 2019 Results - Earnings Call Transcript","description":"Helix Energy Solutions Group, Inc. (NYSE:HLX) Q1 2019 Earnings Conference Call April 23, 2019, 10:00 ET Company Participants Erik Staffeldt - EVP &amp; CFO Alis","url":"https://seekingalpha.com/article/4256018-helix-energy-solutions-group-inc-hlx-ceo-owen-kratz-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-23T18:34:06Z","content":"Helix Energy Solutions Group, Inc. (NYSE:HLX) Q1 2019 Earnings Conference Call April 23, 2019 10:00 AM ET\r\nCompany Participants\r\nErik Staffeldt - EVP &amp; CFO\r\nAlisa Johnson - EVP, General Counsel &amp; Corporate Secretary\r\nOwen Kratz - President, CEO &amp; … [+41926 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"Nucor Corporation (NUE) CEO John Ferriola on Q1 2019 Results - Earnings Call Transcript","description":"Nucor Corporation (NYSE:NUE) Q1 2019 Earnings Conference Call April 23, 2019 02:00 PM ET Company Participants John Ferriola - Chairman, President and CEO Jim Fr","url":"https://seekingalpha.com/article/4256108-nucor-corporation-nue-ceo-john-ferriola-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-23T23:25:08Z","content":"Nucor Corporation (NYSE:NUE) Q1 2019 Earnings Conference Call April 23, 2019 2:00 PM ET\r\nCompany Participants\r\nJohn Ferriola - Chairman, President and CEO\r\nJim Frias - Chief Financial Officer\r\nJoe Stratman - Chief Digital Officer\r\nCraig Feldman - Raw Material… [+39671 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"The Coca-Cola Company (KO) CEO James Quincey on Q1 2019 Results - Earnings Call Transcript","description":"The Coca-Cola Company (NYSE:KO) Q1 2019 Earnings Conference Call April 23, 2019 8:30 AM ET Company Participants Tim Leveridge - Vice President &amp; Investor Re","url":"https://seekingalpha.com/article/4256009-coca-cola-company-ko-ceo-james-quincey-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-23T18:24:06Z","content":"The Coca-Cola Company (NYSE:KO) Q1 2019 Earnings Conference Call April 23, 2019 8:30 AM ET\r\nCompany Participants\r\nTim Leveridge - Vice President &amp; Investor Relations Officer\r\nJames Quincey - Chief Executive Officer\r\nJohn Murphy - Chief Financial Officer\r\n… [+49480 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"Watsco, Inc. (WSO) CEO Albert Nahmad on Q1 2019 Results - Earnings Call Transcript","description":"Watsco, Inc. (NYSE:WSO) Q1 2019 Earnings Conference Call April 23, 2019 10:00 AM ET Company Participants Albert Nahmad - CEO A.J. Nahmad - President Paul Johnst","url":"https://seekingalpha.com/article/4256036-watsco-inc-wso-ceo-albert-nahmad-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-23T19:17:08Z","content":"Watsco, Inc. (NYSE:WSO) Q1 2019 Earnings Conference Call April 23, 2019 10:00 AM ET\r\nCompany Participants\r\nAlbert Nahmad - CEO\r\nA.J. Nahmad - President\r\nPaul Johnston - EVP\r\nBarry Logan - SVP\r\nConference Call Participants\r\nStephen Volkmann - Jefferies\r\nJeff H… [+32848 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"Whirlpool Corporation (WHR) CEO Marc Bitzer on Q1 2019 Results - Earnings Call Transcript","description":"Whirlpool Corporation (NYSE:WHR) Q1 2019 Earnings Conference Call April 23, 2019 08:00 AM ET Company Participants Max Tunnicliff - Senior Director of Investor R","url":"https://seekingalpha.com/article/4255991-whirlpool-corporation-whr-ceo-marc-bitzer-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-23T17:49:04Z","content":"Whirlpool Corporation (NYSE:WHR) Q1 2019 Earnings Conference Call April 23, 2019 8:00 AM ET\r\nCompany Participants\r\nMax Tunnicliff - Senior Director of Investor Relations\r\nMarc Bitzer - Chairman and Chief Executive Officer\r\nJames Peters - Chief Financial Offic… [+42854 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"Ingenico Group - GCS (INGIY) CEO Nicolas Huss on Q1 2019 Results - Earnings Call Transcript","description":"Ingenico Group - GCS (OTCPK:INGIY) Q1 2019 Earnings Conference Call April 23, 2019 12:00 PM ET Company Participants Nicolas Huss - Chief Executive Officer Miche","url":"https://seekingalpha.com/article/4256097-ingenico-group-gcs-ingiy-ceo-nicolas-huss-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-23T22:07:04Z","content":"Ingenico Group - GCS (OTCPK:INGIY) Q1 2019 Earnings Conference Call April 23, 2019 12:00 PM ET\r\nCompany Participants\r\nNicolas Huss - Chief Executive Officer\r\nMichel-Alain Proch - Chief Financial Officer\r\nJohan Tjärnberg - Executive Vice President, Retail Busi… [+33319 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Emily Green, Michael Learmonth","title":"Trump's new asylum policy is leaving people desperate, sick, and stuck in Mexico","description":"Migrants sent back to Mexico to apply for asylum face long waits, bungled paperwork, and kidnapping.","url":"https://news.vice.com/en_us/article/vb9ega/trumps-new-asylum-policy-is-leaving-people-desperate-sick-and-stuck-in-mexico","urlToImage":"https://video-images.vice.com/articles/5cbf15998506eb0007cd3231/lede/1556026936643-remain-in-mexico.jpeg?crop=1xw:0.84375xh;center,center","publishedAt":"2019-04-23T14:54:21Z","content":"EL PASO, Texas Defendant #5 was sleeping in his fathers arms when his name was called. \r\n Three-year-old Josué couldnt be roused from his slumber to take note of Judge Nathan Herbert. Hes currently taking a nap, Herbert noted from the bench. \r\n Instead, Josué… [+8287 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Tess Owen, VICE News","title":"Border militia leader has been on FBI radar since 2017 for allegedly plotting assassinations","description":"The leader of the United Constitutional Patriots claimed he was training his group to assassinate Obama and Clinton","url":"https://news.vice.com/en_us/article/597bpq/border-militia-leader-has-been-on-fbi-radar-since-2017-for-allegedly-plotting-assassinations","urlToImage":"https://video-images.vice.com/articles/5cbf1c38bcd917000902225a/lede/1556032316527-AP_18005859368676.jpeg?crop=1xw:0.84375xh;center,center","publishedAt":"2019-04-23T15:21:05Z","content":"The leader of an armed militia thats been detaining migrants at the border was just arrested over the weekend, but hes been on the FBIs radar since at least October 2017 for allegedly plotting assassinations, according to federal documents unsealed Monday. \r\n… [+4787 chars]"},{"source":{"id":null,"name":"Juxtapoz.com"},"author":"Editor@juxtapoz.com (Editor -- Evan)","title":"CDMX Group Show: Visiones Femeninas, an all female show @ de Kooning Studio, NYC","description":"Curated by Varenka Ruiz, the CDMX Group Show debuted at the Juxtapoz Club House during Art Week Miami – as a heterogeneous, powerful and intimate project without precedent. The event was conceived as a platform to exhibit and sell works of 15 Mexican artists …","url":"https://www.juxtapoz.com/news/installation/cdmx-group-show-visiones-femeninas-an-all-female-show-de-kooning-studio-nyc/","urlToImage":"https://www.juxtapoz.com/media/k2/items/cache/af2ca9f8e0513e0d50b157cef264913f_L.jpg?t=1556048328","publishedAt":"2019-04-23T18:55:00Z","content":"Curated by Varenka Ruiz, the CDMX Group Show debuted at the Juxtapoz Club House during Art Week Miami as a heterogeneous, powerful and intimate project without precedent. The event was conceived as a platform to exhibit and sell works of 15 Mexican artists fr… [+2160 chars]"},{"source":{"id":null,"name":"Voxeu.org"},"author":"Fetzer, Schwarz","title":"Tariffs and politics","description":"Tariff retaliation is believed to be politically motivated. This column argues that retaliation against the Trump administration's tariff hikes seems to be systematically targeted against the Republican voter base. It finds that China was able to achieve a hi…","url":"https://voxeu.org/article/tariffs-and-politics","urlToImage":"https://voxeu.org/sites/default/files/image/FromMay2014/AdobeStock_203101029.jpeg","publishedAt":"2019-04-23T00:00:00Z","content":"Tariff retaliation is believed to be politically motivated. This column argues that retaliation against the Trump administration's tariff hikes seems to be systematically targeted against the Republican voter base. It finds that China was able to achieve a hi… [+10945 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Minnesota to play W. Illinois in '22, 3rd FCS foe in 4 years","description":"Minnesota to play Western Illinois in 2022, putting 3rd FCS foe on slate over next 4 years","url":"https://www.foxsports.com/college-football/story/minnesota-to-play-w-illinois-in-22-3rd-fcs-foe-in-4-years-042319","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-23T21:11:25Z","content":"MINNEAPOLIS (AP) — Minnesota will play Western Illinois in 2022, putting a third FCS opponent on the schedule over the next four years.\r\nThe Gophers announced Tuesday they’ve added the Leathernecks for Sept. 10, 2022, giving them five straight home games to s… [+484 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Jen Yamato","title":"The anti-‘Avengers’: In indie gem ‘Fast Color,’ a powerful new superhero story is born","description":"In the age of Marvel and DC domination, “Fast Color” is a very different and long overdue kind of superhero movie. Just released in theaters ahead of the impending “Avengers: Endgame,” director Julia Hart’s indie darling is a revolutionary take on superpowere…","url":"https://www.latimes.com/entertainment/movies/la-ca-mn-fast-color-superhero-gugu-mbatha-raw-julia-hart-20190423-story.html","urlToImage":"https://www.latimes.com/resizer/TKWd-sCW1tGrfeWX6IUghOdABqA=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/7HE3IC7L6FEVRIQ5WJM7TPPPXU.jpg","publishedAt":"2019-04-23T22:35:00Z","content":"In the age of Marvel and DC domination, Fast Color is a very different and long overdue kind of superhero movie. Just released in theaters ahead of the impending Avengers: Endgame, director Julia Harts indie darling is a revolutionary take on superpowered bei… [+8295 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Molly O'Toole","title":"In a shift, Trump targets foreign travelers who overstay their U.S. visas","description":"The White House says it plans to crack down on the hundreds of thousands of foreign visitors who overstay their U.S. visas, a vast challenge that has largely escaped notice as the Trump administration has focused chiefly on blocking migrants on the southern b…","url":"https://www.latimes.com/politics/la-na-pol-trump-border-visa-overstays-20190422-story.html","urlToImage":"https://www.latimes.com/resizer/3cJRo0ykGJ2rYgASo-tSI3X3WzE=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/4P72B2M7FBFKNAZ4S525WGQXVI.jpg","publishedAt":"2019-04-23T22:50:00Z","content":"The White House says it plans to crack down on the hundreds of thousands of foreign visitors who overstay their U.S. visas, a vast challenge that has largely escaped notice as the Trump administration has focused chiefly on blocking migrants on the southern b… [+5597 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Don Lee","title":"Why Trump’s tariffs are one of the last big obstacles in U.S.-China trade talks","description":"The United States and China are in the final stretch of talks to resolve a conflict over American complaints about China’s unfair trading and economic practices. Senior U.S. officials say they have reached agreement on enforcement and other key elements of th…","url":"https://www.latimes.com/business/la-na-pol-trump-tariffs-china-trade-qa-20190423-story.html","urlToImage":"https://www.latimes.com/resizer/RsEHg15_5iNRwVnd0eC5RNQraVs=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/HIRXSDKMVRFFJMKCB6K6ZUARJQ.jpg","publishedAt":"2019-04-23T11:00:00Z","content":"The United States and China are in the final stretch of talks to resolve a conflict over American complaints about Chinas unfair trading and economic practices.\r\nBut at least one big sticking point remains: what to do with all the tariffs that the two sides s… [+7788 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Snow Patrol's 25 years on the road","description":"The band speak to BBC News NI about a new access-all-areas documentary to mark the milestone.","url":"https://www.bbc.co.uk/news/uk-northern-ireland-48030470","urlToImage":"https://ichef.bbci.co.uk/images/ic/1024x576/p07775cl.jpg","publishedAt":"2019-04-23T17:18:49Z","content":"Media captionSnow Patrol's music milestone\r\n\"When's the next time we have a day off?\" \r\n\"2022, I think.\"\r\nBeing in one of the world's best-known rock bands means fame and adulation but it also means hard work.\r\nThat is apparent in Snow Patrol: 25 Years on the… [+4313 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.dailymail.co.uk/home/search.html?s=&authornamef=Jennifer+Newton+for+MailOnline","title":"Traveller sets up bizarre Instagram account Stefdies that shows her 'dying' at tourist hotspots","description":"Stephanie Leigh, originally from the U.S, has 'died' at instantly recognisable sights including Buckingham Palace, the Golden Gate Bridge, the Eiffel Tower and San Diego Zoo.","url":"https://www.dailymail.co.uk/travel/travel_news/article-6940197/Traveller-sets-bizarre-Instagram-account-Stefdies-shows-dying-tourist-hotspots.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/23/13/12611504-0-image-a-6_1556021812635.jpg","publishedAt":"2019-04-23T12:16:55Z","content":"It's a dead weird way of amassing a following on Instagram.\r\nAn artist has garnered over 18,000 followers on the social media site by posting snaps that show her playing dead in tourist hotspots around the world, while bemused tourists and locals look on. \r\nS… [+5467 chars]"},{"source":{"id":null,"name":"Theeverygirl.com"},"author":"Natalya Grabavoy","title":"7 Must-Do Activities in New Orleans","description":"The gorgeous “Big Easy” in southeastern Louisiana is often commonly thought of for its Mardi Gras festivities and epic, Girls The post 7 Must-Do Activities in New Orleans appeared first on The Everygirl.","url":"http://theeverygirl.com/must-do-activities-in-new-orleans/","urlToImage":"http://cdn.theeverygirl.com/wp-content/uploads/2019/04/new-orleans-the-everygirl-s.jpg","publishedAt":"2019-04-23T08:10:11Z","content":"The gorgeous Big Easy in southeastern Louisiana is often commonly thought of for its Mardi Gras festivities and epic, Girls Trip-style bachelorette and bachelor parties. But what about the rest of the year? New Orleans is constantly buzzing with activity, as … [+2950 chars]"},{"source":{"id":null,"name":"Dailytoreador.com"},"author":"Max Hengst  Staff Writer","title":"No. 18 Tech Baseball hosts New Mexico Tuesday | Sports - The Daily Toreador","description":"No. 18 Tech Baseball hosts New Mexico Tuesday | Sports The Daily Toreador The No. 18 Texas Tech baseball team will play New Mexico at 6:30 p.m. Tuesday at Dan Law Field at Rip Griffin Park for the third time this season. The.","url":"http://www.dailytoreador.com/sports/no-tech-baseball-hosts-new-mexico-tuesday/article_c71e48ec-65d5-11e9-b285-cf5ed06faa68.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/dailytoreador.com/content/tncms/assets/v3/editorial/0/07/007b2464-6330-11e9-82ec-cbf1f82f8326/5cbab2cee08b2.image.jpg?resize=945%2C630","publishedAt":"2019-04-23T14:40:00Z","content":"The No. 18 Texas Tech baseball team will play New Mexico at 6:30 p.m. Tuesday at Dan Law Field at Rip Griffin Park for the third time this season. The last time the Red Raiders and Lobos met, they split the two-game series 1-1. \r\nNew Mexico currently posts an… [+3272 chars]"},{"source":{"id":null,"name":"Americasquarterly.org"},"author":null,"title":"Is Latin America Prepared for China's Booming Tech Investments? - Americas Quarterly","description":"Is Latin America Prepared for China's Booming Tech Investments? Americas Quarterly This article is adapted from AQ's latest issue on China and Latin America. While the U.S. and allies distance themselves from Chinese tech companies such as...","url":"https://www.americasquarterly.org/content/chinese-companies-are-betting-latin-american-tech-players","urlToImage":"https://www.americasquarterly.org/sites/default/files/munoz_top.jpg","publishedAt":"2019-04-23T11:59:24Z","content":"This article is adapted from AQs latest issue on China and Latin America\r\nWhile the U.S. and allies distance themselves from Chinese tech companies such as Huawei, China has become Latin America's top investor of its booming technological sector. Tencent inve… [+4610 chars]"},{"source":{"id":null,"name":"100layercake.com"},"author":"100layercake","title":"A Filipino wedding at Coqui Coqui Valladolid in Mexico","description":"Paulina + Clark met at a college birthday party, when a group of their friends set out on a mission to get them two to meet. (So cute!) When it came to their wedding in Mexico, they wanted to reflect their Filipino heritage while honoring the Yucatán location…","url":"http://www.100layercake.com/blog/2019/04/23/a-filipino-wedding-at-coqui-coqui-valladolid-in-mexico/","urlToImage":null,"publishedAt":"2019-04-23T12:00:13Z","content":"Apr23A Filipino wedding at Coqui Coqui Valladolid in Mexico\r\nPaulina + Clark met at a college birthday party, when a group of their friends set out on a mission to get them two to meet. (So cute!) When it came to their wedding in Mexico, they wanted to reflec… [+3842 chars]"},{"source":{"id":null,"name":"Queerty.com"},"author":"Malcolm Rhodes","title":"This super popular YouTube star just came out by introducing the world to his boyfriend","description":"Mikey Bustos has over 880K YouTube subscribers and almost 150 million video views.","url":"https://www.queerty.com/super-popular-youtube-star-just-came-introducing-world-boyfriend-20190423","urlToImage":"https://queerty-prodweb.s3.amazonaws.com/2019/04/mikey-bustos.png","publishedAt":"2019-04-23T17:30:21Z","content":"Mikey Bustos is an insanely popular social media influencer with over 880K YouTube subscribers and almost 150 million video views plus over 125K Instagram followers and another 100K on Twitter.\r\nIn an Instagram post this week, the 37-year-old Filipino-Canadia… [+4133 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Gophers to play Western Illinois in 2022","description":"The Gophers will play Western Illinois in 2022, adding a third FCS opponent to their schedule over the next four years","url":"https://www.foxsports.com/north/story/minnesota-gophers-football-western-illinois-2022-schedule-042319","urlToImage":"https://b.fssta.com/uploads/2017/09/pi-fsn-gophers-goldie-gopher-helmet-football-091317.vresize.1200.630.high.88.jpg","publishedAt":"2019-04-23T21:27:33Z","content":"MINNEAPOLIS Minnesota will play Western Illinois in 2022, putting a third FCS opponent on the schedule over the next four years.\r\nThe Gophers announced Tuesday they’ve added the Leathernecks for Sept. 10, 2022, giving them five straight home games to start th… [+477 chars]"}]}