{"status":"ok","totalResults":1720,"articles":[{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"SIOBHAN BURKE","title":"Pole Dancing Without Nudity or G-Strings. Just Express Yourself.","description":"The curious hybrid of art, sport, exotic dance and fitness craze has developed a mainstream following but “it’s still a little naughty.”","url":"https://www.nytimes.com/2019/04/19/arts/dance/pole-dancing-championship.html","urlToImage":"https://static01.nyt.com/images/2019/04/20/arts/19poledance-tweet/merlin_153500274_97fc40b7-abb7-4f65-ba03-3be745cf42f4-facebookJumbo.jpg","publishedAt":"2019-04-20T02:14:11Z","content":"Backstage before the two-round pro competition, Joscelyn Perez, from Miami, explained that for her, musicality was paramount. I want to focus on interpreting the music through my body, evoking the mood of the song, she said. Sara Joel, from Long Island, said … [+1048 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MAUREEN DOWD","title":"with …: Tom Ford, Fragrant Vegan Vampire","description":"How a designer known for sex and excess became a devoted family man — and C.F.D.A. chief!","url":"https://www.nytimes.com/2019/04/20/style/tom-ford-maureen-dowd.html","urlToImage":"https://static01.nyt.com/images/2019/04/21/fashion/20tomford1/20tomford1-facebookJumbo.jpg","publishedAt":"2019-04-20T10:00:04Z","content":"But then he thought about his son. I love L.A., he said, but I do want Jack to know how to put on a jacket, go to a restaurant, go to a museum, walk on the street, go to a play.\r\nMr. Ford first visited his new house in the heyday of Studio 54, which is where,… [+1793 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"ROSS DOUTHAT","title":"The Mueller Exposé","description":"The book \"Fire and Fury: Inside the Trump White House\" by Michael Wolff.","url":"https://www.nytimes.com/2019/04/20/opinion/sunday/mueller-report-trump.html","urlToImage":"https://static01.nyt.com/images/2019/04/21/opinion/sunday/21Douthat1/merlin_132818576_c78c4c16-94c2-44fb-b922-236920046534-facebookJumbo.jpg","publishedAt":"2019-04-20T18:44:22Z","content":"Steve Bannon, Wolffs most voluble source, came across as the smartest character in Fire and Fury. In the Mueller report a similar role is played by the former White House counsel Donald McGahn, who spoke at great length with investigators and ended up portray… [+2381 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Olivia Oran","title":"JPMorgan just handed its CFO a new role; Goldman Sachs sees a major growth area in cemeteries","description":"Dear Readers, I hope everyone is having a great holiday weekend. I wanted a highlight a massive project across the Business Insider newsroom that just went live this past week: The 100 People Transforming the World of Business. It was the work of dozens of re…","url":"https://www.businessinsider.com/wall-street-insider-today-april-20-2019","urlToImage":"https://amp.businessinsider.com/images/5cb79372d1a2f80445172375-2732-1366.jpg","publishedAt":"2019-04-20T11:58:00Z","content":"Dear Readers, \r\n I hope everyone is having a great holiday weekend. \r\n I wanted a highlight a massive project across the Business Insider newsroom that just went live this past week: The 100 People Transforming the World of Business. It was the work of dozens… [+5651 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Nicole Einbinder","title":"Seagram's liquor heiress Clare Bronfman pleads guilty in Nxivm sex-cult case","description":"Clare Bronfman, daughter of former Seagram Chairman Edgar Bronfman, pleaded guilty on Friday to two criminal counts in connection with the NXIVM sex cult scandal. She admitted to conspiring to conceal and harbor an undocumented immigrant and to fradulent use …","url":"https://www.thisisinsider.com/nxivm-sex-cult-clare-bronfman-seagrams-liquor-heiress-pleads-guilty-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbb3aecd2ce7811e1171fc6-1920-960.jpg","publishedAt":"2019-04-20T15:29:24Z","content":"Clare Bronfman, the Seagram liquor heiress, pleaded guilty in a New York federal court on Friday to conspiring to conceal and harbor an undocumented immigrant and to fraudulent use of identification in connection with the NXIVM sex cult case. She told the cou… [+2436 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ellen Cranley","title":"Trump has been married 3 times — here's what we know about his prenups","description":"President Donald Trump has been married three times. After two of those marriages ended in divorce, the details of Trump's prenuptial agreements became public. The agreements encompass piles of money, houses, and apartments that were modified based on Trump's…","url":"https://www.businessinsider.com/donald-trump-prenup-melania-everything-we-know-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cacd3a8c6cc50110e607b85-1920-960.jpg","publishedAt":"2019-04-20T13:25:40Z","content":"President Donald Trump frequently touts his career spent making billions of dollars in real-estate deals, but he has a well-documented track record of cutting deals with his wives as well. \r\n With three marriages and two divorces under his belt, Trump is no s… [+731 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Will Martin","title":"The internet is betting on what the royal baby's name will be — here are the top predictions","description":"With Prince Harry and Meghan Markle's first child due to be born any day now, bookmakers in the UK are offering bets on everything from the name, to the gender, to the weight of the royal child. British bookmaker William Hill expects to receive bets worth aro…","url":"https://www.thisisinsider.com/royal-baby-name-prince-harry-and-meghan-markle-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbb2fe62730ca10d4650768-1136-568.jpg","publishedAt":"2019-04-20T14:42:23Z","content":"With Prince Harry and Meghan Markle's first child due to be born any day now, the internet is whipping itself into a frenzy of speculation of when it will be born, what gender it will be, and, of course, the baby's name. \r\n In the UK, gambling on such outcome… [+3273 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Ellen Cranley","title":"The #FreeBritney conspiracy theory says Britney Spears is being held against her will, and her mom appears to support it","description":"After it was reported that Britney Spears had checked herself into a mental health facility in early April, a mysterious voicemail aired on a Spears-centric podcast that has fans concerned about the singer's well-being. An anonymous former member of Spears' l…","url":"https://www.thisisinsider.com/free-britney-britney-spears-conspiracy-theory-held-against-her-will-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbb6c5f2730ca10d4650781-1920-960.jpg","publishedAt":"2019-04-20T18:59:57Z","content":"TMZ reported on April 3 that after months of concerns over her father's health, Britney Spears checked herself into a mental health facility. \r\n Despite sources quoted in multiple reports about the move saying that this was a positive move and nothing else wa… [+3650 chars]"},{"source":{"id":null,"name":"Torontosun.com"},"author":null,"title":"Ex-TTC boss Byford's trials and tribulations in the Big Apple - Toronto Sun","description":"Ex-TTC boss Byford's trials and tribulations in the Big Apple Toronto Sun Subway chief Andy Byford wants Cuomo to let him do his job New York Post Subway Chief May Quit Over Tensions With Cuomo, Colleagues Fear The New York Times View full coverage on Google …","url":"https://torontosun.com/news/world/ex-ttc-boss-byfords-trials-and-tribulations-in-the-big-apple","urlToImage":"https://postmediatorontosun.files.wordpress.com/2017/12/levy-byford1-e1514071484430.jpg","publishedAt":"2019-04-20T18:46:00Z","content":"Former TTC kingpin Andy Byford’s Big Apple adventure appears to be coming off the rails.\r\nAccording to published reports in the New York Times and the New York Post, Byford has grown increasingly frustrated by the micromanaging of New York Governor Andrew Cuo… [+2010 chars]"},{"source":{"id":null,"name":"Bbc.com"},"author":"https://www.facebook.com/bbcnews","title":"Bees living on Notre-Dame cathedral roof survive blaze - BBC News","description":"Bees living on Notre-Dame cathedral roof survive blaze BBC News Good Friday procession held outside Notre Dame Cathedral CBS Evening News Notre Dame rector says 'computer glitch' likely started cathedral fire New York Post What France Has Money For The New Yo…","url":"https://www.bbc.com/news/world-europe-47995604","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/15A60/production/_106527688_gettyimages-1137692661-594x594.jpg","publishedAt":"2019-04-20T04:39:44Z","content":"Image copyrightGetty ImagesImage caption\r\n Cathedral beekeeper Nicolas Geant says the bees would have got \"drunk\" on smoke from the fire\r\nNotre-Dame's smallest residents have survived the devastating fire which destroyed most of the cathedral's roof and toppl… [+1277 chars]"},{"source":{"id":null,"name":"Huffingtonpost.ca"},"author":"Sima Shakeri","title":"Seagram Heiress Clare Bronfman Pleads Guilty In NXIVM Sex Cult Case - HuffPost Canada","description":"Seagram Heiress Clare Bronfman Pleads Guilty In NXIVM Sex Cult Case HuffPost Canada Bronfman heiress pleads guilty in NXIVM sex slave case CBC.ca Bronfman heiress pleads guilty in NXIVM sex cult case CTV News Twisted Nxivm doctor borrowed $60K from friends 't…","url":"https://www.huffingtonpost.ca/2019/04/20/seagram-heiress-clare-bronfman-pleads-guilty-in-nxivm-sex-cult-case_a_23714880/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2035x1069+0+244/resize/1200x630!/format/jpg/quality/85/https%3A%2F%2Fmedia-mbst-pub-ue1.s3.amazonaws.com%2Fcreatr-images%2F2019-04%2F467e39c0-63a2-11e9-86ed-60e017d8102f","publishedAt":"2019-04-20T20:05:00Z","content":"NEW YORK — An heiress pleaded guilty on Friday in a sensational case accusing a cult-like upstate New York group of creating a secret harem of sex slaves for the group's self-anointed spiritual leader.\r\nClare Bronfman admitted in her plea in federal court in … [+2041 chars]"},{"source":{"id":null,"name":"Globalnews.ca"},"author":null,"title":"How Trump’s legal team was able to battle the Mueller investigation - Global News","description":"How Trump’s legal team was able to battle the Mueller investigation Global News House committee issues subpoena for full Mueller report, some Democrats talk impeachment, Trump fires off tweets The Globe and Mail U.S. House subpoena for unredacted Mueller repo…","url":"https://globalnews.ca/news/5186660/donald-trump-legal-team-mueller-report/","urlToImage":"https://shawglobalnews.files.wordpress.com/2018/06/19169872.jpg?quality=70&strip=all&w=720&h=379&crop=1","publishedAt":"2019-04-20T14:19:00Z","content":"First they co-operated. Then they stonewalled. Their television interviews were scattershot and ridiculed, their client mercurial and unreliable.\r\nBut U.S. President Donald Trump’s legal team, through a combination of bluster, legal precedent and shifting tac… [+7459 chars]"},{"source":{"id":null,"name":"Bbc.com"},"author":"https://www.facebook.com/bbcnews","title":"Nxivm: Seagram heiress Clare Bronfman pleads guilty in 'sex cult' case - BBC News","description":"Nxivm: Seagram heiress Clare Bronfman pleads guilty in 'sex cult' case BBC News Heiress pleads guilty in NXIVM sex slave case Yahoo News Heiress Pleads Guilty In NXIVM Sex Cult Case CBS New York HBO documentary to take 'a deep, nuanced look' at Albany-based N…","url":"https://www.bbc.com/news/world-us-canada-47996207","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/D022/production/_106528235_02ec3f9b-460a-4f49-8aeb-003857d23834.jpg","publishedAt":"2019-04-20T06:54:42Z","content":"Image copyrightReutersImage caption\r\n Clare Bronfman said she was \"truly remorseful\" for her role\r\nUS heiress Clare Bronfman has pleaded guilty to her role in an alleged sex trafficking operation.\r\nBronfman, the 40-year-old heir to the Seagram alcohol fortune… [+2892 chars]"},{"source":{"id":null,"name":"Joebucsfan.com"},"author":null,"title":"More NFL Disrespect For Tampa - joebucsfan.com","description":"More NFL Disrespect For Tampa joebucsfan.com Tampa Bay Buccaneers horrid schedule is receiving national headlines Bucs Nation NFL exec admits league already screwed up schedules for Raiders, Bucs Yahoo Sports The Tampa Bay Buccaneers will go 49 days without p…","url":"https://www.joebucsfan.com/2019/04/more-nfl-disrespect-for-tampa/","urlToImage":"https://www.joebucsfan.com/wp-content/uploads/2016/12/IraDecember.png","publishedAt":"2019-04-20T07:05:26Z","content":"Ira is not happy. But he will be Thursday night at Buffalo Wild Wings in South Tampa for the JoeBucsFan NFL Draft party.\r\nBY IRA KAUFMAN\r\nThe Bucs are victims in this Schedule-Gate fiasco, but the organization isn’t blameless.\r\nThe 2019 regular-season slate i… [+3912 chars]"},{"source":{"id":null,"name":"Philly.com"},"author":"Lou Scheinfeld, For the Inquirer","title":"Former Flyers VP on Kate Smith: The PC police have struck again | Opinion - Philly.com","description":"Former Flyers VP on Kate Smith: The PC police have struck again | Opinion Philly.com Flyers cover statue of singer Smith amid racism allegations CityNews Why Was 'God Bless America' Banned by Yankees and Flyers? Inside Edition Philadelphia Flyers cover statue…","url":"https://www.philly.com/news/kate-smith-flyers-racist-spectrum-20190420.html","urlToImage":"https://www.philly.com/resizer/nrkwIJS5FGYUEuuavB05j7PJ2Yg=/1200x0/center/middle/www.philly.com/resizer/uGwrVkaofFB2zWmxUL7k5o13MJM=/1200x0/center/middle/arc-anglerfish-arc2-prod-pmn.s3.amazonaws.com/public/SVN3JSTTS5GN5F2EV74IURBFWU.jpg","publishedAt":"2019-04-20T16:14:03Z","content":"Wow, that was fast!\r\nOne day after the New York Yankees decided they were erring on the side of sensitivity and abruptly ended playing Kate Smiths God Bless America at their seventh-inning stretch, the Philadelphia Flyers literally sacked their longtime fan f… [+4467 chars]"},{"source":{"id":"cbc-news","name":"CBC News"},"author":null,"title":"'I'm not a superhero': Svechnikov says he didn't pick fight with Ovechkin - CBC.ca","description":"'I'm not a superhero': Svechnikov says he didn't pick fight with Ovechkin CBC.ca Oshie out indefinitely for Capitals, won't play Game 5 against Hurricanes NHL.com Hurricanes’ Svechnikov hopes to play in Game 6 after concussion Sportsnet.ca NHL takeaways: Foeg…","url":"https://www.cbc.ca/sports/hockey/nhl/svechnikov-concussion-recovery-fight-ovechkin-1.5105653","urlToImage":"https://i.cbc.ca/1.5105662.1555785947!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/svechnikov-andrei-190420-1180.jpg","publishedAt":"2019-04-20T18:48:00Z","content":"Carolina Hurricanes rookie Andrei Svechnikov hopes to play in Game 6 against the Washington Capitals on Monday after suffering a concussion in a fight with Alex Ovechkin a week earlier.\r\nSvechnikov took part in his first full team practice on Saturday during … [+2217 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Ruth Reader","title":"The Bauhaus of Blunts? Today’s most ambitious cannabis companies are high on design","description":"To stand out in the crowd, cannabis companies are getting creative with their lifestyle branding. Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in po…","url":"https://www.fastcompany.com/90324682/the-bauhaus-of-blunts-todays-most-ambitious-cannabis-companies-are-high-on-design?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/03/p-2-hero-in-the-weeds-FA0519CANN001.jpg","publishedAt":"2019-04-20T06:00:17Z","content":"Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in posh retail outlets, which stock dozens of different products, from medicinal-style vaporizers to TH… [+3389 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Christopher Zara","title":"Columbine 20 years later: This map shows every school shooting since","description":"A disturbing visual record of a uniquely American phenomenon. Twenty years ago on this day, two students opened fire at Columbine High School, killing 13 people and injuring 24 more. While the scourge of gun violence in U.S. schools didn’t begin with Columbin…","url":"https://www.fastcompany.com/90337901/columbine-20-years-later-this-map-shows-every-school-shooting-since?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-columbine-20-years-later-this-map-shows-ever-school-shooting-since.jpg","publishedAt":"2019-04-20T06:00:56Z","content":"Twenty years ago on this day, two students opened fire at Columbine High School, killing 13 people and injuring 24 more. While the scourge of gun violence in U.S. schools didn’t begin with Columbine, the massacre near Littleton, Colorado, reshaped debates on … [+1454 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Marcus Baram","title":"Welcome to the anti-Coachella: Luck Reunion is all about the music and almost impossible to get into","description":"This one-day concert every March in Texas outside Willie Nelson’s ranch features incredible musicians and a ticketing process that’s almost as mathematically difficult as the lottery. Believe it or not, the first Coachella was actually about the music. Twenty…","url":"https://www.fastcompany.com/90337801/welcome-to-the-anti-coachella-luck-reunion-is-all-about-the-music-and-almost-impossible-to-get-into?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-welcome-to-the-anti-coachella-luck-reunion-is-all-about-the-music-and-almost-impossible-to-get-into.jpg","publishedAt":"2019-04-20T09:00:11Z","content":"Believe it or not, the first Coachella was actually about the music. Twenty years later, it’s an excuse for teenagers to get drunk and wear flower crowns. Ariana Grande headlined the first weekend of the two-weekend 2019 festival, which ends April 21—and judg… [+6719 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Joe Berkowitz","title":"“The day innocence died”: How the media covered Columbine 20 years ago","description":"On the 20th anniversary of the Columbine massacre, we look back at how media responded to the tragedy compared with school shootings today. First come the hashtags. Read Full Story","url":"https://www.fastcompany.com/90334177/the-day-innocence-died-how-the-media-covered-columbine-20-years-ago?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-the-day-innocence-died-how-the-media-covered-columbine-20-years-ago-1.jpg","publishedAt":"2019-04-20T06:00:36Z","content":"First come the hashtags.\r\nA location trending on Twitter might just refer to a college basketball team’s victory, but it also might mean the unthinkable has happened again–although by now, high school shootings are firmly rooted in the realm of the thinkable.… [+8582 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Embiid calls Dudley 'a nobody' after Butler fracas","description":"Jimmy Butler and Jared Dudley were ejected from Game 4 after Dudley's shove of Joel Embiid led to a fracas between the Sixers and the Nets.","url":"http://www.espn.com/nba/story/_/id/26567955/embiid-calls-dudley-butler-fracas","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0420%2Fr531869_1296x729_16%2D9.jpg","publishedAt":"2019-04-20T21:51:37Z","content":"NEW YORK -- Jimmy Butler and Jared Dudley were both ejected from the Philadelphia 76ers' 112-108 Game 4 victory over the Brooklyn Nets on Saturday after Dudley shoved Joel Embiid and officials had to separate players from the two teams.\r\nDudley rushed at Embi… [+4470 chars]"},{"source":{"id":null,"name":"Slate.com"},"author":"Daniel Politi","title":"White House Releases Photo of Trump, Limbaugh Golfing as President Tweets Mueller Frustrations","description":"Trump has focused much of his ire on the news media, calling the New York Times and Washington Post the \"enemy of the people.\"","url":"https://slate.com/news-and-politics/2019/04/white-house-trump-limbaugh-golf-mueller-tweets.html","urlToImage":"https://compote.slate.com/images/4d20d2e5-a317-4f3c-8098-dea775a838ef.png?width=780&height=520&rect=1664x1109&offset=85x138","publishedAt":"2019-04-20T20:16:41Z","content":"Rush Limbaugh and President Donald Trump play golf on April 19, 2019.\r\nFox News Shepard Smith Delivered the Best Burn I Heard All Day\r\nThe Mueller Report Is a Portrait of an Egomaniac Whom Nobody Likes\r\nSo Is Impeachment Plausible, Necessary, or Stupid?\r\nThe … [+4405 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Benjamin Siegel","title":"Many House Democrats wary of trying to impeach Trump after Mueller report","description":"Special counsel Robert Mueller's report has prompted new consideration of impeachment by House Democrats.","url":"https://abcnews.go.com/Politics/house-democrats-wary-impeach-trump-mueller-report/story?id=62508263","urlToImage":"https://s.abcnews.com/images/Politics/pelosi-gty-ps-190418_hpMain_16x9_992.jpg","publishedAt":"2019-04-20T20:06:54Z","content":"Democrats renewed consideration of impeaching President Donald Trump after the release of special counsel Robert Muellers report, with leading progressives and some presidential candidates calling for swift action -- as Democratic leaders cautioned restraint.… [+6497 chars]"},{"source":{"id":null,"name":"Northjersey.com"},"author":"NorthJersey.com Digital Desk, NorthJersey.com Digital Desk","title":"New York Yankees lose Aaron Judge in sixth inning with oblique injury; MRI up next","description":"New York Yankees outfielder Aaron Judge left Saturday's game against the Kansas City Royals in the sixth inning with an apparent injury.","url":"https://www.northjersey.com/story/sports/mlb/yankees/2019/04/20/new-york-yankees-aaron-judge-leaves-game-apparent-injury/3529662002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PNJM/07a5cac1-6bc5-49ca-8ed7-9f5d559b9e10-20190418_gma_bm3_185.jpg?crop=3482,1959,x0,y229&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T21:39:58Z","content":"Yankees manager Aaron Boone reacts to learning that slugger Aaron Judge sustained a left oblique injury vs. Kansas City on Saturday, April 20, 2019.\r\n Greg Tartaglia, Staff Writer, @NJTags13\r\nThe Yankees' injured list won't stop growing. \r\nAnd it appears Aaro… [+2259 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Alonso, Cano deliver, Mets hold off Cardinals 5-4","description":"Rookie Pete Alonso hit his seventh home run, Robinson Cano added three hits and the New York Mets held off the St. Louis Cardinals 5-4","url":"https://www.usatoday.com/story/sports/mlb/2019/04/20/alonso-cano-deliver-mets-hold-off-cardinals-5-4/39369445/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/3ad5e65ebc4329b9b2e1f4a7c52a2646112d0743/c=0-286-2324-1593/local/-/media/2019/04/20/USATODAY/usatsports/c10ccde7c1c3457f8073dd208da60145.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T04:15:55Z","content":"ST. LOUIS (AP) Rookie Pete Alonso hit his seventh home run, Robinson Cano added three hits and the New York Mets held off the St. Louis Cardinals 5-4 on Friday night.\r\nMets closer Edwin Diaz retired Yadier Molina on a flyball with runners at the corners for t… [+2653 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Kevin Allen, USA TODAY","title":"Upstart teams like Columbus, Islanders, Avalanche shaking up NHL power structure","description":"Playoff series wins by the Colorado Avalanche, Columbus Blue Jackets and New York Islanders suggest a changing of the guard in the NHL.","url":"https://www.usatoday.com/story/sports/nhl/columnist/kevinallen/2019/04/20/nhl-playoffs-stanley-cup-up-grabs-first-round-upsets/3531240002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/20/USAT/ec5a614e-2749-489a-bc4e-870786894db0-USATSI_12561790.jpg?crop=3354,1886,x111,y26&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T22:48:04Z","content":"SportsPulse: The Tampa Bay Lighting just completed one of the worst collapses in sports history. USA TODAY's Trysta Krick puts the collapse into perspective by looking at the worst in other sports.\r\n USA TODAY\r\nThe Dallas Stars missed the playoffs eight of th… [+3474 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Judge hurts oblique, likely to injured list; Yankees top KC","description":"All-Star slugger Aaron Judge hurt his left oblique while taking a swing and likely was headed to the injured list as the already banged-up New York Yankees beat the Kansas City Royals 9-2","url":"https://www.usatoday.com/story/sports/mlb/2019/04/20/judge-hurts-oblique-likely-to-injured-list-yankees-top-kc/39370943/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/aadb5f60d2668de5c3727ab94eb948a2e1ba924c/c=0-208-4002-2459/local/-/media/2019/04/20/USATODAY/usatsports/60dba310e2394ca1a4bf8e6a6eedcd8b.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T20:39:39Z","content":"NEW YORK (AP) All-Star slugger Aaron Judge hurt his left oblique while taking a swing and likely was headed to the injured list as the already banged-up New York Yankees beat the Kansas City Royals 9-2 Saturday.\r\nJudge homered early, but hurt himself in the s… [+4404 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Nathan Bomey, USA TODAY","title":"What's a 'frunk'? Electric cars like Rivian, Tesla, Jaguar offer unique storage spaces","description":"Rivian, Tesla, Jaguar and other electric cars often offer a new form of storage space called a \"frunk.\" It's a trunk under the hood.","url":"https://www.usatoday.com/story/money/cars/2019/04/20/electric-car-frunks-tesla-rivian-jaguar/3520597002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/a2df0951-a178-43b5-bf8a-4d8af1f51725-XXX_NY_auto_show_326.JPG?crop=5567,3131,x0,y24&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T09:00:03Z","content":"Last SlideNext Slide\r\nWhat's a frunk?\r\nIt's a trunk ... under the hood. And several automakers are beginning to offer them in electric cars.\r\nThe concept is not unheard of. The Volkswagen Beetle, for example, had storage space in the front. (RIP, Beetle.)\r\nBu… [+1593 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Butler, Dudley tossed after Embiid's foul in 76ers-Nets game","description":"Jimmy Butler, Jared Dudley ejected in 3rd quarter of Game 4 between Philadelphia and Brooklyn after scuffle that spilled into stands","url":"https://www.usatoday.com/story/sports/nba/2019/04/20/butler-dudley-tossed-after-embiids-foul-in-76ers-nets-game/39370951/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-20T20:46:00Z","content":"NEW YORK (AP) Jimmy Butler and Jared Dudley were ejected Saturday in the third quarter of Game 4 between Philadelphia and Brooklyn after a scuffle that spilled into the stands.\r\nDudley reacted to Joel Embiid's hard foul on Jarrett Allen, bumping the 76ers' Al… [+550 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Ferreira, Gonzalez help FC Dallas beat Atlanta United 2-0","description":"Jesús Ferreira scored for the third time in four games and Jesse Gonzalez had seven saves in FC Dallas' 2-0 victory over Atlanta United 2-0","url":"https://www.usatoday.com/story/sports/mls/2019/04/20/ferreira-gonzalez-help-fc-dallas-beat-atlanta-united-2-0/39371277/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-20T22:43:18Z","content":"ATLANTA (AP) Jesús Ferreira scored for the third time in four games and Jesse Gonzalez had seven saves in FC Dallas' 2-0 victory over Atlanta United 2-0 on Saturday.\r\nFerreira, an 18-year-old homegrown, opened the scoring in the sixth minute. Michael Barrios … [+877 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Red Sox's Nathan Eovaldi on injured list with elbow injury","description":"Red Sox right-hander Nathan Eovaldi goes on 10-day injured list with elbow injury","url":"https://www.usatoday.com/story/sports/mlb/2019/04/20/red-soxs-nathan-eovaldi-on-injured-list-with-elbow-injury/39370571/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-20T18:02:23Z","content":"ST. PETERSBURG, Fla. (AP) Boston Red Sox right-hander Nathan Eovaldi has gone on the 10-day injured list because of an elbow injury.\r\nThe team said Saturday the pitcher has a loose body in his right elbow. He has had two Tommy John operations and also had sur… [+738 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Segura, Kingery, Arano put on IL by Phillies","description":"Shortstops Jean Segura and Scott Kingery and reliever Victor Arano were placed on the 10-day injured list by the Philadelphia Phillies","url":"https://www.usatoday.com/story/sports/mlb/2019/04/20/segura-kingery-arano-put-on-il-by-phillies/39371345/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/75260c62e1484efdcd3aa791ee6b79304d133b49/c=0-192-3833-2348/local/-/media/2019/04/20/USATODAY/usatsports/1a4f03b7dee84dd4af7f10e2e6ee2c29.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T23:16:58Z","content":"DENVER (AP) Shortstops Jean Segura and Scott Kingery and reliever Victor Arano were placed on the 10-day injured list Saturday by the Philadelphia Phillies.\r\nRight-handers Drew Anderson, Lefty Austin Davis and infielder Mitch Walding were recalled from Triple… [+871 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Joey Garrison, USA TODAY","title":"KKK leader's wife admits to killing her husband","description":"The wife of a Ku Klux Klan leader in Missouri admitted Friday to the 2017 murder of her husband after initially saying that her son was the murderer.","url":"https://www.usatoday.com/story/news/nation/2019/04/20/kkk-leader-wife-admits-killing-husband-missouri/3528837002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/20/USAT/9fcfda3a-3c86-470e-923e-670d109e994d-AP_KKK_Leader_Killed.JPG?crop=1965,1139,x0,y269&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T19:05:39Z","content":"This photo provided by the St. Francois County Sheriff's Department in Farmington, Mo., shows Malissa Ancona, Ancona has admitted fatally shooting her husband, an imperial wizard in the Ku Klux Klan. The St. Louis Post-Dispatch reports that Ancona pleaded gui… [+4887 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Canes' Svechnikov hopes to play in Game 6 after concussion","description":"Carolina Hurricanes rookie Andrei Svechnikov hopes to play in Game 6 against Washington Capitals after suffering concussion in fight with Alex Ovechkin a week earlier","url":"https://www.usatoday.com/story/sports/nhl/2019/04/20/canes-svechnikov-hopes-to-play-in-game-6-after-concussion/39370565/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/75d309f1c4cd227b1adec0c82caa3547b4f181a2/c=0-158-3336-2034/local/-/media/2019/04/20/USATODAY/usatsports/ebb85ecc3abb46ddbebd8d4e0b845741.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T18:05:00Z","content":"WASHINGTON (AP) Carolina Hurricanes rookie Andrei Svechnikov hopes to play in Game 6 against the Washington Capitals on Monday after suffering a concussion in a fight with Alex Ovechkin a week earlier.\r\nSvechnikov took part in his first full team practice on … [+2160 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Brad Heath, USA TODAY","title":"Did Trump encourage Michael Cohen to lie?... And other mysteries the Mueller report didn't resolve","description":"The Mueller's report was brimming with details about Donald Trump's  White House but it left some of the probe's most perplexing questions unanswered.","url":"https://www.usatoday.com/story/news/politics/2019/04/20/mueller-report-left-some-perplexing-trump-russia-questions-unanswered/3521806002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/08/USAT/fb7a2265-ac31-4668-b05d-ba65ee43d735-XXX_AP_17081559560118.JPG?crop=3752,2100,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T11:00:06Z","content":"The redacted version of the Mueller report is now available from the attorney general. Here are the key takeaways from it.\r\n USA TODAY\r\nWASHINGTON How did WikiLeaks, the anti-secrecy group used as a conduit by Russian intelligence to distribute hacked emails,… [+9361 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Tom Vanden Brook and Michael Collins, USA TODAY","title":"'Time is short': Why experts warn Russian meddling detailed in Mueller report could happen again","description":"The cyberattacks and other methods the Russians used to meddle in U.S. elections are the latest weapons in their years-long campaign to sow discord.","url":"https://www.usatoday.com/story/news/politics/2019/04/20/elections-experts-warn-russian-meddling-could-happen-again/3522760002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/15/USAT/303911e9-0087-4c4f-88a4-b0f592ae7e59-542128372_82836788.JPG?crop=3859,2161,x0,y153&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T17:00:10Z","content":"The redacted version of the Mueller report is now available from the attorney general. Here are the key takeaways from it.\r\n USA TODAY\r\nWASHINGTON  On page after page, special counsel Robert Mueller detailed an elaborate, sophisticated Russian operation to so… [+10058 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"James Rogers","title":"Titanic victim’s long-lost letter surfaces, describes near miss as doomed ship set out on its maiden voyage","description":"A letter written by one of Titanic’s crew to his wife just days before the doomed liner sank in the icy waters of the North Atlantic is up for auction in the U.K.","url":"https://www.foxnews.com/science/titanic-victims-letter-surfaces-describes-near-miss-as-doomed-ship-set-out-on-its-maiden-voyage","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/TitanicNewYorkGetty1912.jpg","publishedAt":"2019-04-20T11:00:10Z","content":"A letter written by one of Titanic’s crew to his wife just days before the doomed liner sank in the icy waters of the North Atlantic is up for auction in the U.K.\r\nTitanic steward Richard Geddes wrote the letter to his wife, Sarah (Sal), the day after the fam… [+3073 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"David A. Graham","title":"What If Everything Mueller Told Us Had Been New?","description":"Trump’s critics expected much more from the special counsel’s report. But it would be foolish to shrug off what was already known.","url":"https://www.theatlantic.com/ideas/archive/2019/04/what-if-everything-mueller-told-us-was-new/587590/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/AP_19108556126018/facebook.jpg?1555702100","publishedAt":"2019-04-20T10:00:00Z","content":"Special Counsel Robert Mueller’s report gave a damning overall portrait of the president, and yet that portrait surprised no one. Because the public has been treated to so much evidence of Donald Trump’s dishonesty and hectic leadership, the shock has worn of… [+5216 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Ann Hulbert","title":"A Gilded Cage","description":"A daughter explores the dark secrets of a family legacy.","url":"https://www.theatlantic.com/magazine/archive/2019/05/janny-scott-the-beneficiary/586030/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/2019/04/CULT_C2C_Beneficiary/facebook.jpg?1554214173","publishedAt":"2019-04-20T13:00:00Z","content":"Janny Scott, a former New York Times reporter, has staked her claim to an unusual beat: exploring secret family legacies. She roamed widely in pursuit of “the untold story of Barack Obama’s mother,” the subtitle of A Singular Woman, about Stanley Ann Dunham. … [+1300 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Mara Wilson","title":"What Atlantic Readers Thought About Marijuana in the ’90s","description":"In 1994, Eric Schlosser made the case for decriminalizing marijuana and eliminating mandatory minimum sentencing. Readers had a wide array of responses.","url":"https://www.theatlantic.com/letters/archive/2019/04/marijuana-decriminalization-1990s-reefer-madness/587617/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_85625036/facebook.jpg?1555702044","publishedAt":"2019-04-20T15:30:00Z","content":"In 1994, Eric Schlosser was eating breakfast at home when he received a phone call from the Editor-in-Chief of The Atlantic, Bill Whitworth. “Eric,” Schlosser recalls Whitworth asking, “is there anyone in prison right now for marijuana?” The call came as a su… [+12697 chars]"},{"source":{"id":null,"name":"Medium.com"},"author":"Meghan Daum","title":"Neuroscientist Larry Cahill on the ‘neurosexism’ debate","description":"In a major policy change implemented in early 2016, the National Institutes of Health made clear its expectation that researchers seeking grants “consider sex as a biological variable in all stages…","url":"https://medium.com/s/meghan-daum/male-and-female-brains-are-different-should-it-matter-6db82ead5e20","urlToImage":"https://cdn-images-1.medium.com/focal/1200/632/52/49/1*BK3kO3GC3EwuhvXOf5_kfA.jpeg","publishedAt":"2019-04-20T17:19:13Z","content":"In a major policy change implemented in early 2016, the National Institutes of Health made clear its expectation that researchers seeking grants consider sex as a biological variable in all stages of research. The reason was simpleif overdue. Past studies oft… [+10250 chars]"},{"source":{"id":null,"name":"Resumeskills.us"},"author":null,"title":"We Don't Have a Talent Shortage. We Have a Sucker Shortage","description":"There Is No Talent Shortage. The Job Market Is Broken.","url":"https://resumeskills.us/talent/shortage","urlToImage":null,"publishedAt":"2019-04-20T16:56:04Z","content":"I just started the second real \"motivated\" job search in my 22 years. The first doesn't really count, since\r\nit was during the depths of the 2009 recession (when everyone was out of work) and I've been continuously employed outside of that.\r\nLike any other bu… [+7227 chars]"},{"source":{"id":null,"name":"Buzzfeednews.com"},"author":"Katherine Miller","title":"Inside The Plastic Heart Of Congress","description":"A new book from the authors of Politico Playbook promises an inside glimpse at our congressional leadership during the time of Trump. View Entire Post ›","url":"https://www.buzzfeednews.com/article/katherinemiller/playbook-axios-congress-hill-die-on","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2019-04/20/10/tmp/buzzfeed-prod-web-01/tmp-name-2-11974-1555771030-0_dblbig.jpg","publishedAt":"2019-04-20T14:40:49Z","content":"Washington is not like New York or Los Angeles, the nations other two primary power centers. Money, for the most part, is a secondary currency in DC, declares the fourth page of The Hill To Die On, the new book from the authors of Playbook, Politicos twice da… [+10842 chars]"},{"source":{"id":null,"name":"Swiss-miss.com"},"author":"swissmiss","title":"Friday Link Pack","description":"Music by Lucius. – “Tell me about yourself.” The only icebreaker you’ll ever need. – Overlooked: Since 1851, obituaries in The New York Times have been dominated by white men. Now, they’re adding the stories of other remarkable people. – Nothing Fails Like Su…","url":"https://www.swiss-miss.com/2019/04/friday-link-pack-320.html","urlToImage":"https://s0.wp.com/i/blank.jpg","publishedAt":"2019-04-20T02:51:54Z","content":"Music by Lucius. \r\n– Tell me about yourself. The only icebreaker you’ll ever need. \r\n– Overlooked: Since 1851, obituaries in The New York Times have been dominated by white men. Now, theyre adding the stories of other remarkable people.\r\n– Nothing Fails Like … [+2165 chars]"},{"source":{"id":null,"name":"Thekitchn.com"},"author":"Kelli Foster","title":"A Week of 30-Minute Meals for 2","description":"These taste even better at the end of a long day. READ MORE...","url":"https://www.thekitchn.com/30-minute-meals-for-two-268606","urlToImage":"https://cdn.apartmenttherapy.info/image/fetch/f_auto,q_auto:eco,w_1500,c_fill,g_auto/https://storage.googleapis.com/gen-atmedia/3/2019/04/b34b7f48b7af216b2ed24d5229a86fddca0d973f.jpeg","publishedAt":"2019-04-20T16:00:00Z","content":"Welcome to Next Weeks Meal Plan! Im sharing how I plan and cook for my growing New York-based family of two soon to be three! for the week ahead. \r\nThen Ill turn it around on you, the readers, and ask: What type of meal plans would you like to see? Maybe your… [+2786 chars]"},{"source":{"id":null,"name":"Deadspin.com"},"author":"Gabe Fernandez","title":"Aaron Judge Becomes Another Name On A Long List Of Injured Yankees","description":"Aaron Judge became the latest player to get added onto the Yankees’ long, long list of injured players on Saturday. The team announced that Judge had injured his left oblique and that he was headed to the hospital for an MRI and further evaluation. Read more.…","url":"https://deadspin.com/aaron-judge-becomes-another-name-on-a-long-list-of-inju-1834191815","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--odJ_vNAQ--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zjvmygwnm3vizzyvr3na.jpg","publishedAt":"2019-04-20T21:30:00Z","content":"Aaron Judge became the latest player to get added onto the Yankees long, long list of injured players on Saturday. The team announced that Judge had injured his left oblique and that he was headed to the hospital for an MRI and further evaluation.\r\nThe injury… [+932 chars]"},{"source":{"id":null,"name":"Deadspin.com"},"author":"Gabe Fernandez","title":"The Mets Scrapped Jacob deGrom's MRI On His \"Barking\" Elbow Because He Felt Fine After Playing Catch","description":"The sky was briefly falling faster than it normally does for Mets fans on Friday when it was announced that Jacob deGrom would be getting an MRI on his elbow. Last year’s National League Cy Young winner said that he felt like it was “barking” after throwing t…","url":"https://deadspin.com/the-mets-scrapped-jacob-degroms-mri-on-his-barking-el-1834190653","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--r186Kbyx--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ibrqqr24qyc08zd4vnfd.jpg","publishedAt":"2019-04-20T19:36:00Z","content":"The sky was briefly falling faster than it normally does for Mets fans on Friday when it was announced that Jacob deGrom would be getting an MRI on his elbow. Last years National League Cy Young winner said that he felt like it was barking after throwing the … [+2218 chars]"},{"source":{"id":null,"name":"Dpreview.com"},"author":"jeffcarlson","title":"Secrets of a professional photographer's workflow: Brian Ach","description":"Brian Ach is an editorial and commercial photographer. As photographers, most of our focus is on capturing images—finding good material and getting shots with all the gear we’ve spent so much time and money accumulating—but what happens next? For a lot of us,…","url":"https://www.dpreview.com/articles/3321963167/a-professional-s-workflow-brian-ach","urlToImage":"https://2.img-dpreview.com/files/p/E~TS940x788~articles/3321963167/brian-ach-bio-photo.jpeg","publishedAt":"2019-04-20T12:00:00Z","content":"As photographers, most of our focus is on capturing imagesfinding good material and getting shots with all the gear weve spent so much time and money accumulatingbut what happens next? For a lot of us, we download the images to a computer and edit a handful t… [+6037 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Rebecca Fishbein","title":"Brooklyn Judge Tosses Anti-Vaxxer Parents' Lawsuit Against NYC's Health Department","description":"A Brooklyn judge has tossed a lawsuit alleging New York City’s health department violated anti-vaxxer parents’ civil rights by mandating vaccinations in the wake of a massive measles outbreak. The suit was filed on Monday, and was dimissed by Thursday. Read m…","url":"https://jezebel.com/brooklyn-judge-tosses-anti-vaxxer-parents-lawsuit-again-1834189917","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--u-EIkOL3--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ghslveoclbdmqdno65wr.jpg","publishedAt":"2019-04-20T18:25:00Z","content":"A Brooklyn judge has tossed a lawsuit alleging New York Citys health department violated anti-vaxxer parents civil rights by mandating vaccinations in the wake of a massive measles outbreak. The suit was filed on Monday, and was dimissed by Thursday.\r\nThe Bro… [+2795 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Rebecca Fishbein","title":"I'm Sorry to Report That Adele and Michelle Williams Are Both Single Now","description":"This is a dark day for heartwarming celebrity relationships. Read more...","url":"https://jezebel.com/im-sorry-to-report-that-adele-and-michelle-williams-are-1834187773","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--VAHZzHLt--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vpzw5es2lwasjp8zxe60.jpg","publishedAt":"2019-04-20T15:05:00Z","content":"This is a dark day for heartwarming celebrity relationships. \r\nAccording to People, Michelle Williams has split with Phil Elverum, of The Microphones and Mount Eerie. Williams and Elverum wed in a secret ceremony over the summer, news my mother found so lovel… [+1874 chars]"},{"source":{"id":null,"name":"Gamespot.com"},"author":null,"title":"Capcom Is Killing It Right Now","description":"So far, 2019 has been an especially good year for Capcom. Just in the first quarter, the publisher has released new Devil May Cry and Resident Evil games, and both titles have gone on to find tremendous commercial and critical success. These recent entries re…","url":"https://www.gamespot.com/articles/capcom-is-killing-it-right-now/1100-6466380/","urlToImage":null,"publishedAt":"2019-04-20T16:00:00Z","content":null},{"source":{"id":null,"name":"Avclub.com"},"author":"William Hughes on News, shared by William Hughes to The A.V. Club","title":"Happy 40th birthday to Dawn Of The Dead, the first great zombie satire flick","description":"Today is April 20, one of those dates that seems to come weirdly pre-loaded with cultural significance—whether you’re talking about weed, 20th century dictators, or the state of school safety in good old 2019. (And, hey: Shout-out to everyone going absolutely…","url":"https://news.avclub.com/happy-40th-birthday-to-dawn-of-the-dead-the-first-grea-1834192399","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--apOWusNK--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ds9hfnzsg42gae6a4ixv.jpg","publishedAt":"2019-04-20T22:31:00Z","content":"Today is April 20, one of those dates that seems to come weirdly pre-loaded with cultural significancewhether youre talking about weed, 20th century dictators, or the state of school safety in good old 2019. (And, hey: Shout-out to everyone going absolutely b… [+2526 chars]"},{"source":{"id":null,"name":"Ritholtz.com"},"author":"Barry Ritholtz","title":"10 Weekend Reads","description":"The weekend is here! Pour yourself a mug of Danish Blend coffee, grab a seat in the sun, and get ready for our longer form weekend reads: • The Invention of the ‘Salvator Mundi’ Or, How to Turn a $1,000 Art-Auction Pickup Into a $450 Million Masterpiece. (Vul…","url":"https://ritholtz.com/2019/04/weekend-reads-365/","urlToImage":"https://ritholtz.com/wp-content/uploads/2019/04/profitmarginpeak-1.png","publishedAt":"2019-04-20T11:30:24Z","content":"The weekend is here! Pour yourself a mug of Danish Blend coffee, grab a seat in the sun, and get ready for our longer form weekend reads:\r\n The Invention of the Salvator Mundi Or, How to Turn a $1,000 Art-Auction Pickup Into a $450 Million Masterpiece. (Vultu… [+1583 chars]"},{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"'Game of Thrones' Writer Unveils Mystery Behind White Walkers' Symbol","description":"After breaking records as HBO's highest telecast with 17.4 million viewers tuning into Sunday's season premiere, Game of Thrones continues to keep fans guessing around what the rest of the series holds. Dave Hill, writer of the \"Winterfell\" episode, reveals t…","url":"https://hypebeast.com/2019/4/game-of-thrones-meaning-white-walkers-spiral-symbol","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F04%2Fgame-of-thrones-white-walker-symbols-social.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2019-04-20T16:09:50Z","content":"After breaking records as HBO‘s highest telecast with 17.4 million viewers tuning into Sunday’s season premiere, Game of Thrones continues to keep fans guessing around what the rest of the series holds. Dave Hill, writer of the “Winterfell” episode, reveals t… [+1031 chars]"},{"source":{"id":null,"name":"Androidauthority.com"},"author":"Williams Pelegrin","title":"The Game Boy helped me become who I am today, even if I never had one","description":"Even if I never previously owned one, the original Nintendo Game Boy helped shape my future.","url":"https://www.androidauthority.com/nintendo-game-boy-anniversary-976557/","urlToImage":"https://cdn57.androidauthority.net/wp-content/uploads/2019/04/Nintendo-Game-Boy-1-920x470.jpg","publishedAt":"2019-04-20T15:00:06Z","content":"My life has had its ups and downs, particularly when I was a kid. Because my folks couldn’t afford much when they immigrated here, we lived in very sketchy and unsafe parts of New York City. We received government benefits that helped take some pressure off m… [+8011 chars]"},{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"BAPE Drops an Exclusive NYC-Themed Collection","description":"BAPE has unveiled a limited collection of accessories and streetwear staples inspired by New York City. Referencing an iconic landmark, the graphics depict the APE head embodying the Statue of Liberty and her symbolic crown of seven spikes. Featuring BAPE CAM…","url":"https://hypebeast.com/2019/4/bape-nyc-collection","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F04%2Fbape-ny-exclusive-social.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2019-04-20T14:25:37Z","content":"BAPE has unveiled a limited collection of accessories and streetwear staples inspired by New York City. Referencing an iconic landmark, the graphics depict the APE head embodying the Statue of Liberty and her symbolic crown of seven spikes. Featuring BAPE CAM… [+554 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Chris Evangelista","title":"‘John Wick 3’ Featurette Invites You to Check Into the Continental","description":"I know we’re all hyped for Avengers: Endgame this month, but that’s only the tip of the summer movie iceberg. Next month will bring us John Wick: Chapter 3 – Parabellum, the latest stylish action flick starring Keanu Reeves and a bunch of bullets. A new John …","url":"https://www.slashfilm.com/john-wick-3-featurette/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/john-wick-3-featurette.jpg","publishedAt":"2019-04-20T19:00:13Z","content":"I know we’re all hyped for Avengers: Endgame this month, but that’s only the tip of the summer movie iceberg. Next month will bring us John Wick: Chapter 3 Parabellum, the latest stylish action flick starring Keanu Reeves and a bunch of bullets. A new John Wi… [+2034 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Constance Grady","title":"Following the Notre Dame fire, The Hunchback of Notre-Dame tops best-seller lists in France","description":"And the rest of the week’s best writing on books and related subjects.","url":"https://www.vox.com/culture/2019/4/20/18507707/notre-dame-fire-hunchback-victor-hugo-best-seller","urlToImage":"https://cdn.vox-cdn.com/thumbor/V6-YeSwePE7jkk8u7ih_dEYf51g=/0x367:5116x3046/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16177833/1137677495.jpg.jpg","publishedAt":"2019-04-20T13:00:00Z","content":"And the rest of the week’s best writing on books and related subjects. Welcome to Vox’s weekly book link roundup, a curated selection of the internet’s best writing on books and related subjects. Here’s the best the web has to offer for the week of April 14, … [+6439 chars]"},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"As some militant groups find ways to maintain a social media presence despite bans, Facebook, YouTube, and Twitter struggle to enforce rules toward the groups (New York Times)","description":"New York Times : As some militant groups find ways to maintain a social media presence despite bans, Facebook, YouTube, and Twitter struggle to enforce rules toward the groups — SAN FRANCISCO — In July 2013, a broadcaster affiliated with the Islamist group He…","url":"https://www.techmeme.com/190420/p1","urlToImage":"http://static01.nyt.com/images/2019/04/19/business/19terrorsocial/00terrorsocial-facebookJumbo.jpg","publishedAt":"2019-04-20T05:35:02Z","content":"About This Page\r\nThis is a Techmeme archive page.\r\nIt shows how the site appeared at 1:35 AM ET, April 20, 2019.\r\nThe most current version of the site as always is available at our home page.\r\nTo view an earlier snapshot click here\r\nand then modify the date i… [+97 chars]"},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"Ethics can provide blueprints for good tech, but it can't implement them; ethics boards should raise awareness and drive self-criticism, not just be moral cover (Daniel Susser/Slate)","description":"Daniel Susser / Slate : Ethics can provide blueprints for good tech, but it can't implement them; ethics boards should raise awareness and drive self-criticism, not just be moral cover — Ethics can provide blueprints for good tech, but it can't implement them…","url":"http://www.techmeme.com/190420/p3#a190420p3","urlToImage":null,"publishedAt":"2019-04-20T11:05:03Z","content":null},{"source":{"id":"politico","name":"Politico"},"author":"daniel@politico.com (Daniel Lippman)","title":"POLITICO Playbook: Trump team’s newest scapegoat: Don McGahn … Biden starts taking 2020 cash","description":null,"url":"https://www.politico.com/newsletters/playbook/2019/04/20/trump-teams-newest-scapegoat-don-mcgahn-biden-starts-taking-2020-cash-426840","urlToImage":"https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg","publishedAt":"2019-04-20T14:16:17Z","content":"Former White House counsel Don McGahn cooperated extensively with special counsel Robert Mueller's team of federal prosecutors. | Melina Mara-Pool/Getty Images\r\nDRIVING THE DAY\r\nTHE LATEST MUELLER FALLOUT DONALD VS. DON -- Giuliani Attacks McGahns Account to … [+25797 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joseph Zucker","title":"Yankees News: Aaron Judge Exits vs. Royals with Apparent Injury After Swing","description":"The injury-plagued  New York Yankees  may have taken another significant hit Saturday, as outfielder  Aaron Judge  left the game with an undisclosed injury...","url":"https://bleacherreport.com/articles/2819894-yankees-news-aaron-judge-exits-vs-royals-with-apparent-injury-after-swing","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/800/217/hi-res-ee1635a57d17a83dbcc3c6c5b873a082_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T19:35:10Z","content":"Jim McIsaac/Getty Images\r\nThe injury-plagued New York Yankees may have taken another significant hit Saturday, as outfielder Aaron Judge left the game with an undisclosed injury.\r\nMarc Carig of The Athletic detailed the situation, which saw Judge leave the ga… [+1908 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Tim Daniels","title":"Jets 2019 NFL Draft Rumors: NY 'Determined' to Trade Down from 3rd Overall Pick","description":"The  New York Jets  are reportedly \"determined\" to trade the No. 3 overall selection in the 2019  NFL  draft in order to acquire more picks...","url":"https://bleacherreport.com/articles/2832213-jets-2019-nfl-draft-rumors-ny-determined-to-trade-down-from-3rd-overall-pick","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/837/hi-res-149d14392be272f4c6af997310cd88d2_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T00:07:58Z","content":"Michael Hickey/Getty Images\r\nThe New York Jets are reportedly \"determined\" to trade the No. 3 overall selection in the 2019 NFL draft in order to acquire more picks.\r\nOn Friday, Ralph Vacchiano of SNY reported Jets general manager Mike Maccagnan is focused on… [+388 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Yaron Weitzman","title":"Philadelphia 76ers' Larger-Than-Life Center Proving He's More Than Novelty","description":"NEW YORK — Boban Marjanovic's lowered his 7'3\", 290-pound body onto a chair in front of his locker, draped the branches that he calls arms down toward the floor and, with his ...","url":"https://bleacherreport.com/articles/2832083-philadelphia-76ers-larger-than-life-center-proving-hes-more-than-novelty","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/710/hi-res-8a31f77cc32e12fc2beccf820ad4d708_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T12:55:40Z","content":"Mitchell Leff/Getty Images\r\nNEW YORK Boban Marjanovic's lowered his 7'3\", 290-pound body onto a chair in front of his locker, draped the branches that he calls arms down toward the floor and, with his pencil-length fingers, begun pulling on the laces weaved t… [+8986 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Steve Silverman","title":"2019 NFL Mock Draft: 1st-Round Projections and Latest Buzz on Top Prospects","description":"Christmas,  NFL  style, is just around the corner for Roger Goodell's 32 teams.    The NFL draft starts Thursday night when the first round commences in Nashville, Tennessee...","url":"https://bleacherreport.com/articles/2832153-2019-nfl-mock-draft-1st-round-projections-and-latest-buzz-on-top-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/857/hi-res-53a30be483bc0e6324b6a059acd634a5_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T13:06:08Z","content":"Kyler Murray appears to be on track to become the top pick in the NFL Draft.Wilfredo Lee/Associated Press\r\nChristmas, NFL style, is just around the corner for Roger Goodell's 32 teams.\r\nThe NFL draft starts Thursday night when the first round commences in Nas… [+7949 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Rob Goldberg","title":"Jean Segura Placed on 10-Day IL by Phillies Because of Hamstring Injury","description":"The  Philadelphia Phillies   announced Saturday  shortstop  Jean Segura  has been placed on the 10-day injured list because of a left hamstring strain...","url":"https://bleacherreport.com/articles/2832327-jean-segura-placed-on-10-day-il-by-phillies-because-of-hamstring-injury","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/962/hi-res-ccbf40b12a37dc73866d8a780d16c267_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T21:51:19Z","content":"Matt Slocum/Associated Press\r\nThe Philadelphia Philliesannounced Saturday shortstop Jean Segura has been placed on the 10-day injured list because of a left hamstring strain.\r\nThe move is retroactive to Wednesday as Segura last appeared in a game Tuesday agai… [+1155 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Chris Roling","title":"NFL Draft 2019: Latest Mock Draft and Shifts on Stock Market as Event Nears","description":"The prospect stock market ahead of the 2019  NFL  draft continues to shift, even this late in the process...","url":"https://bleacherreport.com/articles/2832251-nfl-draft-2019-latest-mock-draft-and-shifts-on-stock-market-as-event-nears","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/871/hi-res-b12f154e26f0889af2a5c5cc7d01e9ff_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T18:09:41Z","content":"Darron Cummings/Associated Press\r\nThe prospect stock market ahead of the 2019 NFL draft continues to shift, even this late in the process. \r\nMost NFL teams have likely cemented boards even if the work continues, and some of the stock shifts fans hear about no… [+7954 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joseph Zucker","title":"Jalen Lecque to Forgo Playing at NC State, Enter 2019 NBA Draft","description":"Highly touted combo guard Jalen Lecque announced in a Twitter video Saturday he will forgo a college basketball career and instead enter the 2019 NBA draft pool:         Lecque is the No...","url":"https://bleacherreport.com/articles/2776121-jalen-lecque-to-forgo-playing-at-nc-state-enter-2019-nba-draft","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/765/574/hi-res-7e5190ad542d85ee5feb79ee87435dbe_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T20:53:15Z","content":"Elsa/Getty Images\r\nHighly touted combo guard Jalen Lecque announced in a Twitter video Saturday he will forgo a college basketball career and instead enter the 2019 NBA draft pool:\r\nJalen Lecque@jalenlecque10Thanks to everyone @TheSkillFactory https://t.co/E4… [+2879 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Brad Gagnon","title":"Could the Green Bay Packers Really Draft a Quarterback in Round 1?","description":"They wouldn't, would they?    I mean, they did it in 2005. That's when the Green Bay Packers used a first-round draft pick on a quarterback, despite the fact that they had one coming off a 4,000-yard, 30-touchdown season...","url":"https://bleacherreport.com/articles/2832110-could-the-green-bay-packers-really-draft-a-quarterback-in-round-1","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/814/hi-res-f45c470b7470461037ded275c4e6e425_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T12:55:40Z","content":"Brian Gutekunst has reportedly been looking at first-round-caliber quarterbacks.Associated Press\r\nThey wouldn't, would they? \r\nI mean, they did it in 2005. That's when the Green Bay Packers used a first-round draft pick on a quarterback, despite the fact that… [+6149 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"NELL McSHANE WULFHART","title":"carry on: What Andrew Bolton Can’t Travel Without","description":"The curator oversees the fashion exhibits that influence the annual Met Gala. He often travels internationally for research, and always carries a Moleskine notebook to jot down ideas.","url":"https://www.nytimes.com/2019/04/20/travel/andrew-bolton-met-gala.html","urlToImage":"https://static01.nyt.com/images/2019/04/21/travel/21carryon-bolton-A/21carryon-bolton-A-facebookJumbo-v2.jpg","publishedAt":"2019-04-20T09:00:06Z","content":"Andrew Bolton, as the Wendy Yu Curator at the Metropolitan Museum of Art, oversees the spring exhibitions of The Costume Institute, the Mets fashion department. The collection he pulls together each year is celebrated at the Met Gala, the annual benefit in Ne… [+785 chars]"},{"source":{"id":null,"name":"Theoutline.com"},"author":"Nathan Smith","title":"Dale Earnhardt Sr Was A True Rebel","description":"Nearly 20 years after his death, the NASCAR driver still inspires as a model of doing everything your own way.","url":"https://theoutline.com/post/7328/dale-earnhardt-sr-very-intriguing-person","urlToImage":"https://outline-prod.imgix.net/20190419-d0Fiu00uwS602dtzMYEH?auto=format&q=60&w=1280&s=ccb652ee74caa4e72fff0892c3675b84","publishedAt":"2019-04-20T15:14:13Z","content":"I grew up in the South, where the legacy of the late Dale Earnhardt Sr. hangs around like a shadow, even if you werent the type to book it to the speedway after Sunday service. My childhood home is only a few minutes from the Texas World Speedway, one of the … [+12593 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Anne Thompson","title":"The Academy Prepares for the Netflix-Spielberg Showdown, and a $10,000 Streaming App","description":"The upcoming rules meeting at the Academy should be a doozy.","url":"https://www.indiewire.com/2019/04/the-academy-prepares-for-the-netflix-spielberg-showdown-and-a-10000-streaming-app-1202060453/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2018/02/shutterstock_9354169ba.jpg","publishedAt":"2019-04-20T00:11:16Z","content":"On April 23, when the Academy holds the next meeting for its Board of Governors, it will confront the future: What about the streamers?  The Academy tabled the long-debated question at last month’s meeting, but now it’s expected to determine if Oscar rule cha… [+4808 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MATTHEW HAAG","title":"How Luxury Developers Use a Loophole to Build Soaring Towers for the Ultrarich in N.Y.","description":"About one-fourth of the 88 floors at 432 Park Avenue, one of the world’s tallest residential building, have no homes. Instead, they are reserved for structural and mechanical equipment.","url":"https://www.nytimes.com/2019/04/20/nyregion/tallest-buildings-manhattan-loophole.html","urlToImage":"https://static01.nyt.com/images/2019/04/09/nyregion/00nybuildings1/merlin_152306919_aae484de-99cf-4e41-a28e-de64b5f5f26e-facebookJumbo.jpg","publishedAt":"2019-04-20T07:00:00Z","content":"There is no question that they have become this lightning rod because they are not just luxury housing but uber-luxury housing, said Elizabeth Goldstein, president of the Municipal Art Society, a nonprofit group that seeks to preserve the citys architecture a… [+1320 chars]"},{"source":{"id":null,"name":"Designboom.com"},"author":"philip stevens I designboom","title":"frida escobedo references brooklyn brownstones in design of aesop park slope store","description":"the store's intricately 'woven' brickwork recalls the textile artworks of anni albers. The post frida escobedo references brooklyn brownstones in design of aesop park slope store appeared first on designboom | architecture & design magazine.","url":"https://www.designboom.com/architecture/aesop-park-slope-frida-escobedo-brooklyn-new-york-04-20-2019/","urlToImage":"https://www.designboom.com/wp-content/uploads/2019/04/aesop-park-slope-frida-escobedo-brooklyn-new-york-designboom-Fb.jpg","publishedAt":"2019-04-20T21:30:03Z","content":"mexican architect frida escobedo, who designed the 2018 serpentine pavilion in london, has completed her fifth project with skin care brand aesop. for the company’s third store in brooklyn, new york, escobedo was inspired by the park slope neighborhood’s mid-… [+1456 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Olivia Goldhill","title":"A psychology experiment unexpectedly discovered a man who can’t cooperate because of brain damage","description":"One person with \"a big black hole where their DPC is supposed to be\" cooperated zero times: “They were completely selfish.”","url":"https://qz.com/1599365/scientists-found-a-man-who-cant-cooperate-because-of-brain-damage/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/RTR3BV8P.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-20T09:30:08Z","content":"When someones especially cooperative, dont thank their easy-going nature, but give credit to their brain. A team of New York University psychologists hypothesized that cooperation depends on the dorsolateral prefrontal cortex (DPC), an area of the brain in th… [+2612 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Justin Rohrlich, Dan Kopf","title":"Republicans have spent at least $4.7 million at Trump properties since he took office","description":"The Trump Organization takes in cash every time someone books a room at its hotels, pays for a meal, or buys a bottle of the president’s own brand of bottled water.","url":"https://qz.com/1597139/republicans-have-spent-at-least-4-7-million-at-trump-properties-since-he-took-office/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/trump-hotel-e1555543358728.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-20T11:30:28Z","content":"The Republican National Committee, pro-Trump super PACs, and Republican political candidates spent almost $100,000 at the Trump International Hotel in Washington, DC during the first quarter of 2019, according to Quartzs review of new Federal Elections Commis… [+3136 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Chris Danforth","title":"Beyoncé Rumored to Have Inked $60 Million Netflix Deal","description":"Netflix is rumored to have inked a three-project deal with Beyonce worth $60 million. Reported by Variety. With this new deal, the very first of the three specials is actually “Homecoming,” the behind-the-scenes look at Queen Bey’s 2018 Coachella performance,…","url":"https://www.highsnobiety.com/p/beyonce-netflix-deal/","urlToImage":"https://static.highsnobiety.com/thumbor/mKIGn4soAEaRr8ENAli2-323DH8=/fit-in/960x576/smart/static.highsnobiety.com/wp-content/uploads/2019/04/20111923/beyonce-netflix-deal-00.jpg","publishedAt":"2019-04-20T09:42:18Z","content":"Netflix is rumored to have inked a three-project deal with Beyonce worth $60 million.\r\nReported by Variety. With this new deal, the very first of the three specials is actually Homecoming, the behind-the-scenes look at Queen Bey’s 2018 Coachella performance, … [+907 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Anthony Joshua v Jarrell Miller: American's promoter claims drug reaction is racist","description":"Jarrell Miller is being \"nailed to the cross\" over a failed drug test \"because he is an African-American fighter\", his promoter claims.","url":"https://www.bbc.co.uk/sport/boxing/47998043","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/09C7/production/_106530520_fina_getty.jpg","publishedAt":"2019-04-20T14:03:07Z","content":"Jarrell Miller was denied a licence to fight Anthony Joshua after an \"adverse finding\" from a sample taken on 20 March.\r\nJarrell Miller is being \"nailed to the cross\" over a failed drug test \"because he is an African-American fighter\", his promoter has claime… [+1908 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Casey Quinlan","title":"Washington state passes law extending statute of limitations for victims of sexual violence","description":"Washington Gov. Jay Inslee (D) signed into law on Friday an extension of the statute of limitations for some cases of sexual assault and removes the statute of limitation for serious sex crimes against children. Without this law, it would have been more diffi…","url":"https://thinkprogress.org/washington-state-passes-law-extending-statute-of-limitations-for-victims-of-sexual-violence-49d88db6a08e/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1143635036.jpg?w=1024&h=680&crop=1","publishedAt":"2019-04-20T18:44:00Z","content":"Washington Gov. Jay Inslee (D) signed into law on Friday an extension of the statute of limitations for some cases of sexual assault and removes the statute of limitation for serious sex crimes against children.\r\nWithout this law, it would have been more diff… [+4272 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Casey Quinlan","title":"A man was arrested after making threatening phone calls. All of them mentioned Ilhan Omar.","description":"A man has been arrested after making threatening phone calls, in which he referred to the first Muslim members of Congress Reps. Ilhan Omar (D-MN) and Rashida Tlaib (D-MI), federal prosecutors said on Friday. It’s another in a series of threats against Omar. …","url":"https://thinkprogress.org/a-man-was-arrested-after-making-threatening-phone-calls-all-of-them-mentioned-ilhan-omar-51d078fdbd1f/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/02/GettyImages-1094946878.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-20T14:36:01Z","content":"A man has been arrested after making threatening phone calls, in which he referred to the first Muslim members of Congress Reps. Ilhan Omar (D-MN) and Rashida Tlaib (D-MI), federal prosecutors said on Friday.\r\nIt’s another in a series of threats against Omar.… [+3905 chars]"},{"source":{"id":null,"name":"Adafruit.com"},"author":"Jessie Mae","title":"These Phones Become Ultrasound Scanners","description":"Butterfly IQ aims to make ultrasound imaging as symple and ubiquitous as blood-pressure and temperature reading, Via New York TimesBUSHORO, Uganda — Lying on a church pew with his arm over his head, 6-year-old Gordon Andindagaye whimpered a bit — in fear, not…","url":"https://blog.adafruit.com/2019/04/20/these-phones-become-ultrasound-scanners/","urlToImage":"https://cdn-blog.adafruit.com/uploads/2019/04/I00ULTRASOUND1-jumbo.jpg","publishedAt":"2019-04-20T06:00:56Z","content":"Butterfly IQ aims to make ultrasound imaging as symple and ubiquitous as blood-pressure and temperature reading, Via New York TimesBUSHORO, Uganda — Lying on a church pew with his arm over his head, 6-year-old Gordon Andindagaye whimpered a bit — in fear, not… [+1626 chars]"},{"source":{"id":null,"name":"Businessoffashion.com"},"author":"The New York Times","title":"Tom Ford: American Fashion Must ‘Become Global’","description":"How a designer known for sex and excess became CFDA chief and what he plans to do next.","url":"https://www.businessoffashion.com/articles/news-analysis/tom-ford-american-fashion-must-become-global","urlToImage":"https://images.businessoffashion.com/site/uploads/2016/01/Tom-Ford-BoF-500-Cover.jpg?auto=format%2Ccompress&crop=faces%2Centropy&fit=crop&max-h=512&w=1024","publishedAt":"2019-04-20T12:01:25Z","content":"HOLLYWOOD, United StatesTom Ford has come early to rearrange the furniture.\r\nHe thinks that the already stylish room in the hottest new private club in town, the San Vicente Bungalows, could be even more captivating. So a team of eight club staffers gets busy… [+21086 chars]"},{"source":{"id":null,"name":"Variety.com"},"author":"chrislwillman","title":"A 4/20 Special: Sour Matt on Bringing Cannabis, Hip-Hop and Branding Together","description":"Sour Matt might be one of the most mysterious yet well-respected figures in the cannabis industry, as well as a growing force in the music business with which it intersects. With more than 100,000 followers on Instagram alone, he describes himself as “someone…","url":"https://variety.com/2019/music/news/sour-matt-interview-cannabis-music-marketing-1203192896/","urlToImage":"https://pmcvariety.files.wordpress.com/2019/04/luekingphotos-21-e1555776422176.jpg?w=700&h=393&crop=1","publishedAt":"2019-04-20T16:25:33Z","content":"Sour Matt might be one of the most mysterious yet well-respected figures in the cannabis industry, as well as a growing force in the music business with which it intersects. With more than 100,000 followers on Instagram alone, he describes himself as “someone… [+12163 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"David Bauder","title":"Fake news? Mueller isn't buying it...","description":"Fake news? Mueller isn't buying it... (Top headline, 5th story, link ) Related stories: REUTERS POLL: TRUMP APPROVAL FALLS TO 37%... ELIZABETH WARREN CALLS FOR IMPEACHMENT... Pelosi Pressured... ROMNEY: I Am Sickened... NAPOLITANO: Report Might Be Enough to P…","url":"https://www.apnews.com/06c88719c3634e66a15adbbc658978b0","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:e858c1eee0f24febaf5970d7e07fb81d/3000.jpeg","publishedAt":"2019-04-20T16:25:36Z","content":"NEW YORK (AP) President Donald Trump and his team love to deride unfavorable stories as fake news, but its clear from Robert Muellers report that the special counsel isnt buying it.\r\nWhile there are a few exceptions, Muellers investigation repeatedly supports… [+5132 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Meg Kinnard","title":"2020 campaign trail runs through churches in SCarolina...","description":"2020 campaign trail runs through churches in SCarolina... (Second column, 6th story, link ) Related stories: BIDEN FINALLY READY? Announcement in days... NYT: Should White Man Be Face of Dem Party? Advertise here","url":"https://www.apnews.com/e3cd6d9a08c94ca59a1a427e6517cfd2","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:4ecfdeae0aa041e48f36ab2d164d723b/2477.jpeg","publishedAt":"2019-04-20T14:22:38Z","content":"NORTH CHARLESTON, S.C. (AP) By now, most Democratic presidential candidates have polished their stump speeches. But when theyre in South Carolina, they may need to add in a sermon.\r\nIn a large and diverse primary field, White House hopefuls are angling to dev… [+4157 chars]"},{"source":{"id":null,"name":"Geek.com"},"author":"Genevieve Scarano","title":"‘God of War’ Documentary ‘Raising Kratos’ Explores 2018’s Top Video Game","description":"God of War, last year’s mega-hit video game, was introduced on April 20, 2018. Following the video game’s success, a documentary called Raising Kratos is coming out for fans and it will give a […] The post ‘God of War’ Documentary ‘Raising Kratos’ Explores 20…","url":"https://www.geek.com/games/god-of-war-documentary-raising-kratos-explores-2018s-top-video-game-1783881/","urlToImage":"https://www.geek.com/wp-content/uploads/2019/04/Raising-Kratos-God-of-War-Doc-42019.jpg","publishedAt":"2019-04-20T21:01:05Z","content":"God of War, last year’s mega-hit video game, was introduced on April 20, 2018. Following the video game’s success, a documentary called Raising Kratos is coming out for fans and it will give a behind-the-scenes look at the creation of the PlayStation 4 exclus… [+1728 chars]"},{"source":{"id":null,"name":"Geek.com"},"author":"Jordan Minor","title":"The Best Food Apps for a Festive 4/20","description":"Weeeeeeeeeeeeeeeeeeeeeed! The post The Best Food Apps for a Festive 4/20 appeared first on Geek.com.","url":"https://www.geek.com/tech/the-best-food-apps-for-a-festive-420-1696605/","urlToImage":"https://www.geek.com/wp-content/uploads/2017/04/blazing-mac-tonight.png","publishedAt":"2019-04-20T13:00:54Z","content":"Lets not beat around the kush. Recreational marijuana is legal in parts of the United States, not to mention the entire world. So were going to stop speaking in euphemisms. This April 20th, as is tradition, a lot of folks are going to get high. Theyre going t… [+3065 chars]"},{"source":{"id":null,"name":"Eurogamer.net"},"author":"Wesley Yin-Poole","title":"Spider-Man PS4 dev reveals cool Easter egg no-one noticed","description":"Spider-Man has plenty of Easter eggs. Some revolve around other Marvel characters, such as Daredevil and Iron Fist. Others are nods to characters from the comics you wouldn't immediately think of. You'd think, given the tremendous popularity of Insomniac's fu…","url":"https://www.eurogamer.net/articles/2019-04-20-spider-man-ps4-dev-reveals-cool-easter-egg-no-one-noticed","urlToImage":"https://cdn.gamer-network.net/2019/articles/2019-04-20-17-33/spider-man-ps4-dev-reveals-cool-easter-egg-no-one-noticed-1555778032992.jpg","publishedAt":"2019-04-20T16:31:00Z","content":"Spider-Man has plenty of Easter eggs. Some revolve around other Marvel characters, such as Daredevil and Iron Fist. Others are nods to characters from the comics you wouldn't immediately think of. You'd think, given the tremendous popularity of Insomniac's fu… [+1073 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Keith Speights)","title":"4 Marijuana Stocks to Especially Like on 4/20","description":"Each of these stocks is poised for tremendous success in the U.S. cannabis market.","url":"https://www.fool.com/investing/2019/04/20/4-marijuana-stocks-to-especially-like-on-420-day.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519387/marijuana-leaf-getty.jpg","publishedAt":"2019-04-20T16:00:00Z","content":"I thought about listing 420 marijuana stocks to like on 4/20 -- April 20th, the day that marijuana proponents celebrate cannabis culture each year. There was one major problem with that idea, though: There aren't 420 marijuana stocks to like. \r\nSo instead, I … [+5946 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Billy Duberstein)","title":"Why MedMen Could Be the Best Pot Stock in the U.S… or the Worst","description":"This cannabis retailer is spending big in hopes of making an even larger impact.","url":"https://www.fool.com/investing/2019/04/20/why-medmen-could-be-the-best-pot-stock-in-the-us-o.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519406/forget-stoner-page-2018.jpg","publishedAt":"2019-04-20T10:30:00Z","content":"With Canada's legalization of marijuana in late 2018, much of the attention has been on companies that sell into the country's fully legal market, but now that Canada has gone ahead, many think full U.S. decriminalization could be around the corner.\r\nEven wit… [+7868 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Maxx Chatsko)","title":"Will a Slowing Economy Derail This Fast-Growing Infrastructure Stock?","description":"U.S. Concrete says the construction cycle hasn't reached its peak. Do economic forecasts suggest otherwise?","url":"https://www.fool.com/investing/2019/04/20/will-a-slowing-economy-derail-this-fast-growing-in.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519102/197-urban-construction.jpg","publishedAt":"2019-04-20T16:19:00Z","content":"Investors don't have much to complain about when dissecting the recent operational performance of U.S. Concrete(NASDAQ:USCR). Management's acquisition-heavy strategy that focuses on high-growth metropolitan areas such as San Francisco and New York has worked … [+4811 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Ex-NFL running back Reggie Cobb dies at 50","description":"Running back Reggie Cobb, who starred at the University of Tennessee and playing in the NFL for the Bucs, Packers, Jaguars and Jets over seven seasons, has died at the age of 50.","url":"http://www.espn.com/nfl/story/_/id/26568213/ex-nfl-running-back-reggie-cobb-dies-50","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F0903%2Fnfl_g_football1x_1296x729_r6001_1296x729_16%2D9.jpg","publishedAt":"2019-04-20T22:06:40Z","content":"Former NFL running back and Tennessee Volunteers star Reggie Cobb has died at 50, the San Francisco 49ers announced Saturday.\r\nCobb scouted for the 49ers for the last 10 years, as well as for other clubs before them.\r\nDetails of his death were not disclosed.\r… [+1153 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"Atul Aneja","title":"Foreign Secretary Vijay Gokhale to have ‘bilateral consultations’ in Beijing","description":"Mr Gokhale, who is set to meet Foreign Minister Wang Yi, arrives amid signs that China may be reviewing its position on lifting its “technical hold” on listing Masood Azhar as an international terrorist","url":"https://www.thehindu.com/news/national/foreign-secretary-vijay-gokhale-to-have-bilateral-consultations-in-beijing/article26898095.ece","urlToImage":"https://www.thehindu.com/news/international/article22845554.ece/ALTERNATES/LANDSCAPE_615/24INTHVLRCHINAGOKHALE","publishedAt":"2019-04-20T12:15:00Z","content":"Foreign Secretary Vijay Gokhale will arrive in Beijing on Sunday for bilateral consultations, amid signs that China may be reviewing its position on lifting its technical hold on listing Masood Azhar as an international terrorist.\r\nMr. Gokhale is arriving ahe… [+3629 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Kathy Kiely, Laurel Leff","title":"Journalism’s Assange problem","description":"These days, anybody with an internet connection can be a publisher. That doesn't make everybody a journalist.","url":"https://www.salon.com/2019/04/20/journalisms-assange-problem_partner/","urlToImage":"https://media.salon.com/2019/04/julian-assange5.jpg","publishedAt":"2019-04-20T07:29:55Z","content":"These days, anybody with an internet connection can be a publisher.\r\nThat doesn’t make everybody a journalist.\r\nThis distinction has become more important than ever in light of two recent events.\r\nOne was the arrest of WikiLeaks founder Julian Assange. The ot… [+6040 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Erin Keane","title":"\"That is the David Carr way\": Erin Lee Carr on writing fearlessly on grief, addiction and her father","description":"\"Am I going to be as honest with myself as I need for my subjects to be?\" the filmmaker and memoirist tells Salon","url":"https://www.salon.com/2019/04/20/that-is-the-david-carr-way-erin-lee-carr-on-writing-fearlessly-on-grief-addiction-and-her-father/","urlToImage":"https://media.salon.com/2019/04/erin-lee-carr.jpg","publishedAt":"2019-04-20T19:30:03Z","content":"Documentary filmmaker Erin Lee Carr is known for her incisive portraits of complicated, dark subjects: \"Mommy Dead and Dearest,\" the HBO documentary that led the current media avalanche of attention on Munchausen syndrome by proxy victim Gypsy Rose Blanchard'… [+22879 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Mary Elizabeth Williams","title":"\"I'll never understand what happened at Columbine\": The 1999 school shooting that changed us","description":"A look back at how Salon covered the mass shooting in 1999, and what we've learned since","url":"https://www.salon.com/2019/04/20/ill-never-understand-what-happened-at-columbine-the-1999-school-shooting-that-changed-us/","urlToImage":"https://media.salon.com/2019/04/columbine-memorial.jpg","publishedAt":"2019-04-20T11:00:34Z","content":"I didn't know it yet on the day, but I was carrying my first child. I did know that I was full of hope at the possibility that I could be. In New York anyway, it was a beautiful spring afternoon.\r\nIt began at 11:19 am, Mountain Time. It was all over less than… [+5505 chars]"},{"source":{"id":null,"name":"Newrepublic.com"},"author":"Gunar Olsen","title":"Add Trump’s Yemen Veto to Obama’s Legacy","description":"Donald Trump loves to present himself as the anti-Obama. But this week, when he handily vetoed a congressional resolution directing him to end U.S. military support for the Saudi-led coalition war in Yemen, he leaned heavily upon his predecessor’s policies—an…","url":"https://newrepublic.com/article/153639/add-trumps-yemen-veto-obamas-legacy","urlToImage":"https://images.newrepublic.com/73ab85cb52f630c548dd1e30a7dd4fde4509fe24.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg","publishedAt":"2019-04-20T13:43:50Z","content":"Trumps\r\nability to claim the U.S. is not engaged in hostilities in Yemen is based on an\r\ninterpretation of hostilities taken directly from the Obama administration.\r\nThe working\r\ntheory within the executive branch for what constitutes hostilities for\r\npurpose… [+2611 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"Heiress pleads guilty in sex slave case","description":"Clare Bronfman admitted in her plea in federal court in Brooklyn that she harboured someone who was living in the US illegally for unpaid \"labor and services\" and that she committed credit card fraud on behalf of Keith Raniere, the lead of a group called NXIV…","url":"https://indianexpress.com/article/world/heiress-pleads-guilty-in-sex-slave-case-5685345/","urlToImage":"https://images.indianexpress.com/2019/04/clare-bronfman.jpg?w=759","publishedAt":"2019-04-20T02:41:24Z","content":"Clare Bronfman, left, arrives at Federal court with her attorney Mark Geragos in the Brooklyn borough of New York, Friday. Bronfman has pleaded guilty to charges implicating her in a sex-trafficking conspiracy case against an upstate New York self-help group.… [+2539 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"New York Times","title":"A love letter to creamy cauliflower pasta","description":"There’s creamy richness, but there’s also salty crunch. There’s deep savoury flavour from lightly caramelized shallot, but also a light breeze from lemon zest and chopped chives.","url":"https://indianexpress.com/article/lifestyle/food-wine/love-letter-to-creamy-cauliflower-pasta-recipe-5685950/","urlToImage":"https://images.indianexpress.com/2019/04/cauliflower-pasta-759.jpg?w=759","publishedAt":"2019-04-20T12:26:13Z","content":"This pasta does not compromise. Its comfort food, but also mostly vegetables. Its complex but quick. Styled by Kalen Kaminski. (Source: The New York Times)\r\nWhile I consider nearly every meal I make an opportunity for recipe development, sometimes the food I … [+4211 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Suanshu Khurana","title":"How India came to have a problem with azadi","description":"Jostling for space among many slogans in this election is the promise of azadi — from hunger, from the enemy at the border, from joblessness and fear. But how has this idea changed over the years, through music and song and poetry? We count the ways.","url":"https://indianexpress.com/article/express-sunday-eye/freedom-is-a-revolution-5682988/","urlToImage":"https://images.indianexpress.com/2019/04/kanhaiya-kumar-1.jpg?w=759","publishedAt":"2019-04-20T23:30:51Z","content":"Born to be free: Kanhaiya Kumar delivering his speech in JNU in February 2016. (Express archive)\r\nYeh daagh daagh ujaalaa, yeh shab gazidaa seherWoh intezaar tha jiska, yeh woh seher toh nahinYeh woh seher toh nahin, jis ki aarzoo lekarChale the yaar ki mil j… [+14929 chars]"}]}