{"status":"ok","totalResults":1544,"articles":[{"source":{"id":null,"name":"Gizmodo.com"},"author":"Tom McKay","title":"PayPal, GoFundMe Yank Accounts for Far-Right Militia Rounding Up Migrants at Border","description":"PayPal and GoFundMe have banned a far-right group, the United Constitutional Patriots (UCP), that was recently reported to be posing as law enforcement to round up migrant families at gunpoint at the U.S. border with Mexico before handing them over to Border …","url":"https://gizmodo.com/paypal-gofundme-yank-accounts-for-far-right-militia-ro-1834193555","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--Da6dgO8_--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rfeb7oqtudko4xbg0mps.jpg","publishedAt":"2019-04-21T01:10:00Z","content":"PayPal and GoFundMe have banned a far-right group, the United Constitutional Patriots (UCP), that was recently reported to be posing as law enforcement to round up migrant families at gunpoint at the U.S. border with Mexico before handing them over to Border … [+3401 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Tom McKay","title":"Sri Lanka Blocks Facebook, WhatsApp After Easter Bombings Leave Hundreds Dead","description":"After at least 207 people were killed and over four hundred more were reported wounded after a series of bombs went off at Easter services in Sri Lanka, the Sri Lankan government has moved to block access to Facebook, TechCrunch reported on Sunday. Read more.…","url":"https://gizmodo.com/sri-lanka-blocks-facebook-whatsapp-after-easter-bombin-1834199629","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--lce--cRi--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/qu7mp06uawwawgdmocj1.jpg","publishedAt":"2019-04-21T17:55:00Z","content":"After at least 207 people were killed and over four hundred more were reported wounded after a series of bombs went off at Easter services in Sri Lanka, the Sri Lankan government has moved to block access to Facebook, TechCrunch reported on Sunday.\r\nIn a brie… [+5024 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Morgan Sung","title":"After an Easter terror attack, Sri Lanka cut access to social media","description":"Sri Lanka restricted access to social media following a terror attack that left more than 200 people dead and at least 450 injured. Eight bombs exploded in three churches and three luxury hotels on Easter Sunday. According to The New York Times, restricted si…","url":"https://mashable.com/article/sri-lanka-terror-attack-cut-access-to-social-media/","urlToImage":"https://mondrian.mashable.com/2019%252F04%252F21%252Fa9%252F3f3fadd914e24011a7feb6806c540516.55c16.jpg%252F1200x630.jpg?signature=TGAMH-t_mA8FmSpmzXtCVj5pTPs=","publishedAt":"2019-04-21T22:03:19Z","content":"Sri Lanka restricted access to social media following a terror attack that left more than 200 people dead and at least 450 injured. Eight bombs exploded in three churches and three luxury hotels on Easter Sunday. \r\nAccording to The New York Times, restricted … [+1002 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"SCOTT ENMAN","title":"Sunday Routine: How Bette Smith, Soul Singer, Spends Her Sundays","description":"Born and bred in Bedford-Stuyvesant and now living in Park Slope, the performer likes to slow down the pace on the weekends with yoga, meditation and time with her dog, Jeremiah.","url":"https://www.nytimes.com/2019/04/19/nyregion/bette-smith-soul-singer-sunday-routine.html","urlToImage":"https://static01.nyt.com/images/2019/04/21/nyregion/21ROUTINE1/21ROUTINE1-facebookJumbo.jpg","publishedAt":"2019-04-21T04:13:39Z","content":"On a recent Saturday night at the performance space Littlefield in Gowanus, Brooklyn, the singer Bette Smith moved effortlessly across the stage wearing a tight holographic vinyl dress and five-inch-heeled thigh-high boots, strutting like Tina Turner. Since h… [+828 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"'Retire now' - Bunce's message to defeated Khan","description":"BBC Radio 5 Live boxing pundit Steve Bunce says Amir Khan \"should retire\" after being pulled out of New York fight with Terence Crawford.","url":"https://www.bbc.co.uk/sport/boxing/48002995","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/D5E1/production/_106535745_khan_reuters.jpg","publishedAt":"2019-04-21T19:18:23Z","content":"Khan (left) has lost five of his 38 bouts as a professional\r\nAmir Khan \"should retire now\" after being pulled out of his fight with Terence Crawford, says Steve Bunce.\r\nBriton Khan, 32, took a low blow from American WBO world welterweight champion Crawford in… [+3088 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"This will not be my last fight, says beaten Khan","description":"Britain's Amir Khan says he will still \"get the world title fights\" despite being accused of quitting in defeat by Terence Crawford.","url":"https://www.bbc.co.uk/sport/boxing/48001228","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/CD49/production/_106535525_amir_khan_reuters.jpg","publishedAt":"2019-04-21T07:44:54Z","content":"Amir Khan (left) has won 33 and lost five of his 38 bouts as a professional\r\nBritain's Amir Khan says he will still \"get the world title fights\" despite being accused of quitting by WBO world welterweight champion Terence Crawford.\r\nKhan's corner pulled him o… [+2137 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Jonathan M. Gitlin","title":"Mazda brings a new diesel CX-5 SUV to the US—but why?","description":"Mazda worked with US regulators to ensure this one complies with the rules.","url":"https://arstechnica.com/cars/2019/04/mazda-brings-a-new-diesel-cx-5-suv-to-the-us-but-why/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2019/04/MY19_CX5_Brochure_Exterior_DIGITAL_new_red_badge-760x380.jpg","publishedAt":"2019-04-21T14:15:58Z","content":"Enlarge/ You'd have to look carefully at the CX-5's badges to tell whether it was one of the new diesel-powered versions.\r\n0 with 0 posters participating\r\nWhen Mazda invited us to a roundtable discussion about powertrain technology at this year's New York aut… [+5271 chars]"},{"source":{"id":null,"name":"Cnet.com"},"author":"Jessica Dolcourt","title":"Galaxy Fold's screen woes and more: How my foldable review unit is doing so far - CNET","description":"Our Galaxy Fold screen is in good shape, and the ongoing review continues.","url":"https://www.cnet.com/news/galaxy-folds-screen-woes-and-more-how-my-foldable-review-unit-is-doing-so-far/","urlToImage":"https://cnet4.cbsistatic.com/img/uOPg_0E0B147qsrUZPqX6qqGznA=/756x567/2019/04/15/5b70f1ab-efbe-4484-b6cc-9bb7b3c7c8e9/306-galaxy-fold.jpg","publishedAt":"2019-04-21T22:03:02Z","content":"Days after the first reports of bulging, flickering and malfunctioning Galaxy Fold screens surfaced, my review unit is still intact, and life with Samsung's first foldable phone continues to hum along. As I type this, the Fold is recovering from an overnight … [+25532 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Mary Hanbury","title":"Gap's new minimalist menswear brand is unlike anything we've seen from the company before (GPS)","description":"Gap launched its new menswear athletic brand, Hill City, in October. Described as stylish high-performance wear, Hill City's clothing ranges from water-repellant everyday pants that cost $128 to insulated puffer jackets for $168. Noah Palmer, who heads up the…","url":"https://www.businessinsider.com/gap-new-athletic-brand-hill-city-is-new-look-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb5fc2caefeef3954437fd8-750-375.jpg","publishedAt":"2019-04-21T13:55:00Z","content":"Gap is channeling a trendy, Scandinavian minimalist aesthetic in its new menswear brand. \r\n Launched in October, Hill City promises to offer a mix of stylish high-performance wear for men. With an average price point that sits at around $80, the clothing rang… [+5175 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Julia Naftulin","title":"World leaders including Pope Francis, Donald Trump, and Barack Obama offered their support after Easter Sunday bombings in Sri Lanka claimed hundreds of lives","description":"On Easter Sunday, a series of at least eight bomb attacks went off across Sri Lanka and the main targets were churches and hotels. The attacks reportedly killed at least 207 people. Here's how world leaders responded to the attacks. On Easter Sunday, eight bo…","url":"https://www.businessinsider.com/sri-lanka-bomb-attacks-reactions-pope-francis-donald-trump-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbc89049dd2f355c56ba023-1920-960.jpg","publishedAt":"2019-04-21T15:16:00Z","content":"On Easter Sunday, eight bombs went off across Sri Lanka, killing at least 207 people including 35 foreigners. The attacks targeted churches and luxury hotels. \r\n People attending Easter services in churches in Kochchikade, Negombo, and Batticaloa were targete… [+742 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Michelle Mark","title":"The FBI arrested the leader of a militia that has been detaining migrant families at the border","description":"The FBI has arrested the leader of a militia group that recently sparked backlash for detaining migrants at the US-Mexico border at gunpoint. Larry Mitchell Hopkins, 69, a leader of the United Constitutional Patriots, was arrested on charges of being a felon …","url":"https://www.thisisinsider.com/fbi-arrests-leader-of-militia-detaining-migrant-families-at-the-border-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbbd433d2ce7811e1172006-750.jpg","publishedAt":"2019-04-21T02:23:05Z","content":"The FBI has arrested the leader of a militia group that was recently seen on videos detaining migrant families at the US-Mexico border, the agency announced Saturday. \r\n Larry Mitchell Hopkins, 69, a leader of the United Constitutional Patriots, was arrested … [+2706 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Andy Kiersz","title":"Here are the fastest growing and shrinking counties in America","description":"The Census Bureau recently released estimates on how the populations of each of the 3,142 counties in the US changed between 2017 and 2018. Suburban counties around big southern metropolitan areas grew quickly, while northeastern and Midwestern counties had m…","url":"https://www.businessinsider.com/fastest-growing-and-shrinking-counties-in-america-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbcc5c4b8342c56c6156e56-1536-768.png","publishedAt":"2019-04-21T19:56:52Z","content":"The Census Bureau recently released its annual estimates for how the populations of each of the 3,142 counties and county-equivalents in the US changed in the year between July 1, 2017 and July 1, 2018. \r\n The above map shows the percent change in population … [+1144 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Andy Kiersz","title":"'I never plan to fly on it': Workers reportedly recount poor practices at a Boeing factory in South Carolina that could spell trouble for Dreamliner plane","description":"After two tragic crashes that led to the widespread grounding of Boeing's 737 MAX airplanes, The New York Times reports that issues at a South Carolina factory could mean problems for the company's 787 Dreamliner plane as well. The Times report includes sever…","url":"https://www.businessinsider.com/boeing-787-dreamliner-south-carolina-factory-production-problems-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbc7ca012ece25684030303-1920-960.jpg","publishedAt":"2019-04-21T14:34:17Z","content":"In the wake of two tragic crashes that led to the widespread grounding of Boeing's 737 MAX airplanes, The New York Times reports that poor practices at a South Carolina factory could raise questions about the safety of the company's 787 Dreamliner plane as we… [+2125 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Erin Mayer","title":"The best leave-in treatments for curly hair","description":"Insider Pic ks writes about products and services to help you navigate when shopping online. Insider Inc. receives a commission from our affiliate partners when you buy through our links, but our reporting and recommendations are always independent and object…","url":"https://www.businessinsider.com/best-leave-in-treatment-curly-hair","urlToImage":"https://amp.businessinsider.com/images/5c9d1f978629133bfb276b0c-750-375.jpg","publishedAt":"2019-04-21T14:00:00Z","content":"Why you'll love it: Get hold minus the crunch with the DevaCurl Light Defining Gel, a flexible, nourishing styling product. \r\n Gels used to remind me of the tight, hard styles I wore for dance recitals growing up. Armed with AquaNet hairspray and globs of gel… [+1179 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Becky Peterson","title":"This map shows which states in the US are competing to top California-based Uber's $15.7 billion in equity funding","description":"With $15.7 billion in equity funding, Uber is the most highly-funded tech startup in the United States. This map by CB Insights shows that there's plenty of money to go around. Florida's Magic Leap, an augmented reality has raised $2.4 billion in funding, whi…","url":"https://www.businessinsider.com/map-top-funded-tech-startups-us-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba232416c65a440d1b22d4-2732-1366.jpg","publishedAt":"2019-04-21T14:00:00Z","content":"With $15.7 billion in equity funding in its pocket, the San Francisco, California-based ride-hailing company Uber has raised more money than any other tech startup in the country. But California isn't the only state in the union harboring highly-funded tech s… [+3249 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/emily-larsen","title":"Impeach or pivot: Democratic presidential candidates grapple with Mueller report strategy - Washington Examiner","description":"Impeach or pivot: Democratic presidential candidates grapple with Mueller report strategy Washington Examiner Catching Up on the Mueller Report: What’s Next? The New York Times Trump expresses anger after release of Mueller report CBS News The Mueller report …","url":"https://www.washingtonexaminer.com/news/impeach-or-pivot-democratic-presidential-candidates-grapple-with-mueller-report-strategy","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/0b95752/2147483647/strip/true/crop/1143x600+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F8e%2F08%2Fdbba5dd640888769af51612cd8d2%2Fdownloadfjfjm.jpg","publishedAt":"2019-04-21T04:00:00Z","content":"Democratic presidential candidates face a choice between trying to use the Mueller report against President Trump or sticking to issues that appeal to a broader range of voters, such as healthcare and income inequality. \r\nSen. Elizabeth Warren, D-Mass., on Fr… [+3656 chars]"},{"source":{"id":null,"name":"Sportsnet.ca"},"author":"Sportsnet Staff","title":"Coach’s Corner: Why the Flames came up short in the playoffs - Sportsnet.ca","description":"Coach’s Corner: Why the Flames came up short in the playoffs Sportsnet.ca What's Next For The Surprising New York Islanders? MyNHLTradeRumors.com Avalanche eliminate Flames from playoffs in five games TSN Avalanche eliminate No. 1 West seed Flames with Game 5…","url":"https://www.sportsnet.ca/hockey/nhl/coachs-corner-flames-came-short-playoffs/","urlToImage":"https://assets1.sportsnet.ca/wp-content/uploads/2019/04/1704050871_6028374602001_6028374895001-vs.jpg","publishedAt":"2019-04-21T00:30:00Z","content":"Don Cherry knows a thing or two about heartbreak.\r\nIn both the 1976-77 and 1977-78 NHL seasons the Boston Bruins teams he was head coach of lost consecutively in the Stanley Cup Final.\r\nAs such, after seeing the Calgary Flames get eliminated in five games at … [+1081 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Paulina Dedaj","title":"Washington state lawmaker riles nurses by saying that some spend 'considerable' time playing cards - Fox News","description":"Washington state lawmaker riles nurses by saying that some spend 'considerable' time playing cards Fox News Washington state senator slammed for saying nurses 'play cards' for 'considerable amount of the day' CNN Sen. Maureen Walsh says nurses spend 'consider…","url":"https://www.foxnews.com/politics/washington-state-lawmaker-riles-nurses-by-saying-that-some-spend-considerable-time-playing-cards","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/walsh.jpg","publishedAt":"2019-04-21T01:15:19Z","content":"A Washington state lawmaker has provoked the ire of nursing professionals after saying that some nurses “play cards” for a “considerable” portion of their shifts.\r\nState Sen. Maureen Walsh, R-Walla Walla, was debating a bill on Tuesday that would require unin… [+1771 chars]"},{"source":{"id":null,"name":"Cheatsheet.com"},"author":"becca-bleznak","title":"Get to Know Lizzo, the Music Superstar Who Has Been Rising Up the Charts - The Cheat Sheet","description":"Get to Know Lizzo, the Music Superstar Who Has Been Rising Up the Charts The Cheat Sheet Lizzo Kills Coachella Weekend Two Despite Second Round of Sound Issues Variety View full coverage on Google News","url":"https://www.cheatsheet.com/entertainment/lizzo-music-new-album-coachella-tour.html/","urlToImage":"https://www.cheatsheet.com/wp-content/uploads/2019/04/lizzo-1024x683.jpg","publishedAt":"2019-04-21T20:20:36Z","content":"Every now and then, theres an artist who manages to check off so many boxes that their appeal is almost universal. Right now, thats Lizzo, a musical superstar who is literally everywhere this year. Shes unlike anyone else out there, and her music transcends i… [+2763 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":null,"title":"What Mayock's past rankings mean for Raiders' draft plans - NBCSports.com","description":"What Mayock's past rankings mean for Raiders' draft plans NBCSports.com Welcome To The Jon Gruden Show Deadspin A Q&A with Kolton Miller: The Raiders' 2018 top pick has bulked up, healed up and is getting a house built in... The Athletic Report: Raiders likel…","url":"https://www.nbcsports.com/bayarea/raiders/what-mike-mayocks-past-nfl-draft-rankings-can-tell-us-about-raiders","urlToImage":"https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2019/04/21/mayockrealusatsi.jpg","publishedAt":"2019-04-21T22:05:30Z","content":"The Raiders could certainly trade down from one of their three first-round picks to pick up extra selections later in the 2019 NFL Draft.\r\nAn early trade would net a strong return that could add Day 2 picks to their cache, something general manager Mike Mayoc… [+4486 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"A secret Finnish subculture of women and girls who ride hobbyhorses has come out of the shadows","description":"A once-underground movement of Finnish girls who conduct elaborate dressage routines with toy hobbyhorses has gone mainstream, with coaches, competitions and trainers, and is spreading abroad. The subculture came together through quiet internet message boards…","url":"https://boingboing.net/2019/04/21/hobbyhorse-revolution.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/animation-4.gif","publishedAt":"2019-04-21T17:34:28Z","content":"A once-underground movement of Finnish girls who conduct elaborate dressage routines with toy hobbyhorses has gone mainstream, with coaches, competitions and trainers, and is spreading abroad.\r\nThe subculture came together through quiet internet message board… [+3446 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Crawford wins by TKO when Khan can't continue","description":"Terence Crawford retained his WBO welterweight title Saturday night after Amir Khan's corner determined he could not continue after being hit by an accidental low blow in Round 6.","url":"http://www.espn.com/boxing/story/_/id/26570794/crawford-wins-tko-khan-continue","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0421%2Fr532123_1296x729_16%2D9.jpg","publishedAt":"2019-04-21T04:50:51Z","content":"NEW YORK -- The argument over who is the best pound-for-pound fighter in the world has been largely a two-man discussion between unified lightweight champion Vasiliy Lomachenko and welterweight titlist Terence Crawford, who have had a chance to make their lat… [+2516 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Mary Papenfuss","title":"FBI Arrests Leader Of Right-Wing Anti-Immigrant Militia In New Mexico","description":"“This is a dangerous felon who should not have weapons around children and families,” New Mexico's attorney general said after the arrest of Larry Mitchell Hopkins.","url":"https://www.huffpost.com/entry/larry-mitchell-hopkins-fbi-new-mexico-militia_n_5cbb93c4e4b06605e3ef5d81","urlToImage":"https://img.huffingtonpost.com/asset/5cbba5652a0000aa0c4f9341.jpeg?cache=Iv301Scju6&ops=1200_630","publishedAt":"2019-04-21T00:14:28Z","content":"FBI agents arrested a leader of a heavily armed right-wing militia on Saturday in New Mexico just days after the vigilantes posted a video of members “detaining” hundreds of immigrants, many of them children.\r\nLarry Mitchell Hopkins, 69, of the United Constit… [+2973 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Igor Bobic","title":"Rudy Giuliani: ‘There’s Nothing Wrong With Taking Information From Russians’","description":"The president's lawyer also called Mitt Romney a \"hypocrite\" and said the Utah senator should \"stop this pious act.\"","url":"https://www.huffpost.com/entry/rudi-giuliani-russia-mueller_n_5cbc723be4b068d795cd9b4c","urlToImage":"https://img.huffingtonpost.com/asset/5cbc729f2300008903ea236b.jpeg?cache=LaiVW4fJZL&ops=1200_630","publishedAt":"2019-04-21T15:33:40Z","content":"Rudy Giuliani, who as President Donald Trump’s attorney has stoutly defended his client’s actions throughout every twist and turn as Russian interference in the 2016 presidential campaign was investigated, insisted on Sunday “there’s nothing wrong” with a Whi… [+2855 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Julia Jacobo","title":"Transit worker stabbed on subway platform following random altercation","description":"A New York City transit worker is recovering after he was stabbed on a subway platform.","url":"https://abcnews.go.com/US/transit-worker-stabbed-subway-platform-york-city-random/story?id=62539995","urlToImage":"https://s.abcnews.com/images/US/subway-ht-er-190421_hpMain_16x9_992.jpg","publishedAt":"2019-04-21T20:06:37Z","content":"A New York City transit worker is recovering after he was stabbed on a subway platform on Easter Sunday following an altercation.\r\nThe Metropolitan Transportation Authority conductor was sitting on a bench at the southbound platform for No. 2, 4 and 5 trains … [+1146 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"By MARK SHERMAN Associated Press","title":"Accuracy at core of Supreme Court case over census question","description":"The accuracy of the once-a-decade population count is at the heart of the Supreme Court case over the Trump administration's effort to add a citizenship question to the 2020 census.","url":"https://abcnews.go.com/Politics/wireStory/accuracy-core-supreme-court-case-census-question-62535314","urlToImage":"https://s.abcnews.com/images/Politics/WireAP_7cd77d8a1b2f441abf5d90049d2153b0_16x9_992.jpg","publishedAt":"2019-04-21T16:21:43Z","content":"Justice Elena Kagans father was 3 years old when the census taker came to the familys apartment on Ocean Parkway in Brooklyn, New York, on April 10, 1930.\r\nRobert Kagan was initially wrongly listed as an alien, though he was a native-born New Yorker. The entr… [+5166 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Lamoriello, Trotz orchestrate Islanders' big turnaround","description":"Lou Lamoriello and Barry Trotz didn't know exactly what to expect from the New York Islanders this season","url":"https://www.usatoday.com/story/sports/nhl/2019/04/21/lamoriello-trotz-orchestrate-islanders-big-turnaround/39374113/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/2b0481b791713aac1a00dbeb48baa51232039164/c=0-496-1794-1505/local/-/media/2019/04/21/USATODAY/usatsports/3636bb1e142a4731a0b7d11792bf101f.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T14:18:13Z","content":"NEW YORK (AP) Lou Lamoriello and Barry Trotz say they didn't know exactly what to expect from the New York Islanders this season.\r\nThere were plenty of questions after the Islanders gave up 293 goals the most in the NHL since 2006-07 while missing the playoff… [+5559 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Martin Rogers, USA TODAY","title":"Live analysis: Amir Khan vs. Terence Crawford fight round-by-round breakdown","description":"Round-by-round analysis of the world welterweight championship bout between Amir Khan and Terence Crawford at Madison Square Garden in New York.","url":"https://www.usatoday.com/story/sports/boxing/2019/04/20/amir-khan-terence-crawford-fight-live-round-analysis/3528864002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/20/USAT/4cdf0a16-393a-41fb-8038-7193dd3e4594-GTY_1143794714.JPG?crop=2839,1597,x147,y275&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T01:36:20Z","content":"There is so much on the line Saturday at Madison Square Garden when Amir Khan faces Terence Crawford in a world welterweight title bout. \r\nSome consider Crawford to be the best pound-for-pound fighter in the game today. Others say Crawford has avoided the big… [+678 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Tom Schad, USA TODAY","title":"Kate Smith family members 'heartbroken' after teams distance themselves from singer","description":"The Philadelphia Flyers and New York Yankees have taken steps to distance themselves from the late \"God Bless America\" singer Kate Smith.","url":"https://www.usatoday.com/story/sports/2019/04/20/kate-smith-singer-family-saddened-decisions-yankees-flyers/3531100002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/21/USAT/7746780f-51dd-4d62-b598-aa2f57e52bf7-AP_Kate_Smith_Flyers.JPG?crop=2599,1462,x0,y147&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T00:30:12Z","content":"Flyers fan Ken Giusini of Philadelphia reacts after the Flyers covered the statue of Kate Smith after recordings of the singer containing offensive lyrics have come to light.\r\n Chris LaChall/Staff Photographer\r\nThe Philadelphia Flyers and New York Yankees hav… [+3976 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Judge has 'pretty significant strain,' will be out awhile","description":"Aaron Judge has a \"pretty significant strain\" of his left oblique, according to Yankees manager Aaron Boone, and it will be several weeks before New York can even estimate when the slugger will return","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/judge-has-pretty-significant-strain-will-be-out-awhile/39374311/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/63d75c2c10133f41998185253ec64359c954b421/c=0-202-3870-2379/local/-/media/2019/04/21/USATODAY/usatsports/15c066b868e34bde94483ca2fb87ee6a.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T15:14:24Z","content":"NEW YORK (AP) Aaron Judge has a \"pretty significant strain\" of his left oblique, according to Yankees manager Aaron Boone, and it will be several weeks before New York can even estimate when the slugger will return.\r\nBoone said Sunday that Judge will need to … [+1200 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Syndergaard battered despite gift homer, Cards top Mets 6-4","description":"Paul Goldschmidt drove in two runs and Noah Syndergaard had better luck at the plate than on the mound, hitting a homer with Dexter Fowler's help as the St. Louis Cardinals beat the New York Mets 6-4","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/syndergaard-battered-despite-gift-homer-cards-top-mets-6-4/39375753/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/110ee4ac34cd70db97b22433153bb7fce242555f/c=0-340-5470-3417/local/-/media/2019/04/21/USATODAY/usatsports/c3f5a21fbc14451cb682fdf6f6a209de.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T21:56:40Z","content":"ST. LOUIS (AP) Paul Goldschmidt drove in two runs and Noah Syndergaard had better luck at the plate than on the mound, hitting a homer with Dexter Fowler's help as the St. Louis Cardinals beat the New York Mets 6-4 on Sunday.\r\nSyndergaard (1-2) allowed six ru… [+2874 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Romine, Yankees shake bullpen meltdown, top Royals 7-6 in 10","description":"Austin Romine drove in the winning run in the 10th inning with his third RBI single, and the New York Yankees overcame a bullpen collapse that followed another scoreless start by James Paxton to beat the Kansas City Royals 7-6","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/romine-yankees-shake-bullpen-meltdown-top-royals-7-6-in-10/39375613/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/6c0a0ebcbd0f9f1f95932132b3372504b3f37746/c=0-214-4108-2525/local/-/media/2019/04/21/USATODAY/usatsports/94512a988fb64f88a97595025e126fdf.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T21:10:46Z","content":"NEW YORK (AP) Austin Romine drove in the winning run in the 10th inning with his third RBI single, and the New York Yankees overcame a bullpen collapse that followed another scoreless start by James Paxton to beat the Kansas City Royals 7-6 Sunday.\r\nAfter add… [+4999 chars]"},{"source":{"id":null,"name":"Northjersey.com"},"author":"North Jersey Record, Sean Farrell, North Jersey Record","title":"Yankees outfielder Aaron Judge sent to IL with 'pretty significant' oblique strain","description":"The Yankees' All-Star outfielder suffered a \"pretty significant strain\" in his left oblique and could miss a significant period of time.","url":"https://www.northjersey.com/story/sports/mlb/yankees/2019/04/21/yankee-aaron-judge-sent-il-pretty-significant-oblique-strain/3519658002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PNJM/07a5cac1-6bc5-49ca-8ed7-9f5d559b9e10-20190418_gma_bm3_185.jpg?crop=3482,1959,x0,y229&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T17:03:51Z","content":"NEW YORK — The Yankees were dealt another injury blow Sunday, and this one is catastrophic.\r\nOutfielder Aaron Judge suffered a \"pretty significant strain\" in his left oblique and could miss a significant period of time, manager Aaron Boone said.\r\nBoone didn't… [+2161 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Sonja Haller, USA TODAY","title":"Andy Cohen's mom trolls his throwback Speedo pic with a few funny, priceless words","description":"\"Watch What Happens Live\" host Andy Cohen posted a vintage photo of himself in a Speedo with his flowing locks in a ponytail. Mom didn't approve.","url":"https://www.usatoday.com/story/life/allthemoms/2019/04/21/andy-cohen-mom-hilariously-trolls-his-vintage-speedo-photo/3533916002/?utm_source=google&utm_medium=amp&utm_campaign=speakabl","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/21/USAT/048d192e-1a5d-4927-b145-f70afa0af35f-Andy_Cohen.jpg?crop=1023,576,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T17:00:01Z","content":"Andy Cohen, the \"Watch What Happens Live\" host, shared a throw-back photo of himself in a Speedo.\r\n (Photo: ANGELA WEISS, AFP/Getty Images)\r\nAndy Cohen has slapped down trolls. \r\nThe new dad has learned that parents love to tell other moms and dads exactly wh… [+1413 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Capitals' T.J. Oshie out of playoffs with broken clavicle","description":"Washington Capitals winger T.J. Oshie is expected to miss the rest of the playoffs after undergoing surgery to repair a broken right clavicle","url":"https://www.usatoday.com/story/sports/nhl/2019/04/21/capitals-tj-oshie-out-of-playoffs-with-broken-clavicle/39374519/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/0859695bc2daf97421be63f65fef995e8c70be43/c=0-174-2976-1848/local/-/media/2019/04/21/USATODAY/usatsports/2d48069019354912856edd10370e2dc7.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T16:58:36Z","content":"ARLINGTON, Va. (AP) Washington Capitals winger T.J. Oshie is expected to miss the rest of the playoffs after undergoing surgery to repair a broken right clavicle.\r\nThe team announced Oshie's surgery Sunday afternoon. Coach Todd Reirden had already called Oshi… [+957 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Bucks beat Pistons 119-103 to take 3-0 series lead","description":"Khris Middleton had 20 points and nine rebounds and the Milwaukee Bucks beat the Detroit Pistons 119-103 to take a 3-0 lead in the first-round series","url":"https://www.usatoday.com/story/sports/nba/2019/04/20/bucks-beat-pistons-119-103-to-take-3-0-series-lead/39372075/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/82b680dce86ada2a4347465403bd33409124ba5b/c=0-76-3612-2108/local/-/media/2019/04/20/USATODAY/usatsports/e967809c25734f25951eb3ae16c05bb0.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T02:50:13Z","content":"DETROIT (AP) Khris Middleton had 20 points and nine rebounds and the Milwaukee Bucks beat the Detroit Pistons 119-103 on Saturday night to take a 3-0 lead in the first-round series.\r\nThe Bucks can finish off the Eastern Conference series Monday night in Detro… [+2255 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Lopez gets another KO, Stevenson wins again at MSG","description":"Teofimo Lopez scored another knockout and Shakur Stevenson also won as the 2016 Olympians remained unbeaten on the undercard of Terence Crawford's title fight against Amir Khan","url":"https://www.usatoday.com/story/sports/boxing/2019/04/20/lopez-gets-another-ko-stevenson-wins-again-at-msg/39372299/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/805dd0926a424b96d43d1d718e86bd0d837569bf/c=0-828-3044-2540/local/-/media/2019/04/20/USATODAY/usatsports/42aa3bf00c4c4d17af21772727982929.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T03:53:51Z","content":"NEW YORK (AP) Teofimo Lopez scored another knockout and Shakur Stevenson also won Saturday night as the 2016 Olympians remained unbeaten on the undercard of Terence Crawford's title fight against Amir Khan.\r\nLopez (13-0, 11 KOs) knocked out Edis Tatli of Finl… [+2125 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Doyle Rice and Elizabeth Weise, USA TODAY","title":"Earth Day 2019: High temperatures, rising waters, wild weather — who is to blame? We are.","description":"Climate change is real and increasingly a part of our daily lives. Here are the latest scientific facts on this human-caused shift to weather systems.","url":"https://www.usatoday.com/story/news/nation/2019/04/21/earth-day-2019-climate-change-humans-global-warming-weather-rising-water/3507125002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2018/12/24/USAT/d3d1c89e-47f7-4419-8104-1a1b5c0d9435-AFP_fire.JPG?crop=4927,2754,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T13:13:01Z","content":"Climate change is real and it's already impacting humans.\r\n Mike Berardino, IndyStar\r\nClimate change is real and increasingly a part of our daily lives. New research and studies out in just the past six months highlight the latest facts about the human-caused… [+5307 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Crawford wins by TKO when Khan doesn't go on after low blow","description":"Terence Crawford retained his welterweight title by technical knockout when Amir Khan wasn't able to continue after being hit with a low blow in the sixth round","url":"https://www.usatoday.com/story/sports/boxing/2019/04/21/crawford-wins-by-tko-when-khan-doesnt-go-on-after-low-blow/39372623/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/2c0a7b4458b5484794990e78434c1878f9cd3ecf/c=0-198-3336-2074/local/-/media/2019/04/21/USATODAY/usatsports/30776d22478843d2a347e3f86b6195bd.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T04:55:22Z","content":"NEW YORK (AP) Terence Crawford retained his welterweight title by technical knockout Saturday night when Amir Khan wasn't able to continue after being hit with a low blow in the sixth round.\r\nCrawford threw a left hand that hit Khan on his right hip and Khan … [+2178 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"For The Win, Henry McKenna, For The Win","title":"Amir Khan said he was left 'peeing blood' after low-blow, TKO to Terence Crawford","description":"Amir Khan said Terence Crawford's  low blow left him \"peeing blood.\" He also suggested that his trainer called the fight for him.","url":"https://ftw.usatoday.com/2019/04/amir-khan-terence-crawford-low-blow?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/df2b14170e6bb9c8c383b6c007bc4418aa5956af/c=0-258-4960-3048/local/-/media/2019/04/21/USATODAY/usatsports/usatsi_12566921.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T17:18:12Z","content":"A low blow brought a confusing end to Crawford vs. Khan on Saturday night. As a result, Terence Crawford (35-0, 26 KOs) retained his welterweight title. But the fight isn't coming without controversy.\r\nDuring the sixth round, Crawford delivered a left uppercu… [+2070 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Alan Gomez, USA TODAY","title":"Where are the non-citizens? The Trump administration wants to know down to the block level","description":"The Trump administration wants a citizenship question on the 2020 decennial census but critics say it could hurt minority communities like Doral, Fla.","url":"https://www.usatoday.com/story/news/politics/2019/04/21/2020-census-citizenship-question-flaw-decennial-count-wilbur-ross-trump/3477112002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/16/USAT/a6c5d94b-e7c9-47e9-a490-9b483837c1bb-IMG_2845.jpg?crop=4031,2267,x1,y551&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T10:00:03Z","content":"The chairman of a House oversight panel questioned whether Commerce Secretary Wilbur Ross was \"truthful\" when testifying last year about his decision to add a citizenship question to the 2020 census. (March 14)\r\n AP\r\nDORAL, Florida  In the heart of this South… [+7880 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"LEADING OFF: Yanks star Judge hurt, Cubs ace Lester close","description":"LEADING OFF: Yankees expected to put star Judge on injured list after hurting oblique, Cubs ace Lester close to returning, young pitchers highlight Braves-Indians in prime time","url":"https://www.usatoday.com/story/sports/mlb/2019/04/20/leading-off-yanks-star-judge-hurt-cubs-ace-lester-close/39372003/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/63d75c2c10133f41998185253ec64359c954b421/c=0-202-3870-2379/local/-/media/2019/04/20/USATODAY/usatsports/15c066b868e34bde94483ca2fb87ee6a.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T02:14:13Z","content":"A look at what's happening around the majors Sunday:\r\nA BENCH FOR THIS JUDGE\r\nThe New York Yankees are expected to put All-Star slugger Aaron Judge on the injured list, a day after he hurt his left oblique taking a swing against Kansas City.\r\nThe Yankees alre… [+2482 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Gray, Rockies beat Phillies 4-1 for 6th win in 7 games","description":"Jon Gray pitched six scoreless innings, Tony Wolters had a two-run double and the Colorado Rockies beat the Philadelphia Phillies 4-1 for their sixth win in seven games","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/gray-rockies-beat-phillies-4-1-for-6th-win-in-7-games/39376253/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/72ea179e357439843c8c55433dcea893ca9a0a47/c=0-621-4182-2973/local/-/media/2019/04/21/USATODAY/usatsports/62d2da812b954b4caab1663870d52f93.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T23:03:17Z","content":"DENVER (AP) Jon Gray pitched six scoreless innings, Tony Wolters had a two-run double and the Colorado Rockies beat the Philadelphia Phillies 4-1 Sunday for their sixth win in seven games.\r\nTrevor Story and Ian Desmond also had RBI singles for the Rockies, wh… [+2682 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Special to USA TODAY, Ken Fisher, Special to USA TODAY","title":"Why fines against Google, Nike are a good thing for company stocks","description":"What do Nike and Google have in common? Both faced European Union (EU) antitrust fines in March — $14 million for Nike, $1.7 billion for Google.","url":"https://www.usatoday.com/story/money/columnist/2019/04/21/google-nike-got-fined-eu-its-good-thing-stocks/3481970002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/c4979e7795ba3716d6f299a98529640a8afc5937/c=0-65-1280-785/local/-/media/2019/04/08/USATODAY/usatsports/patrick-reed-shoes.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T11:01:03Z","content":"John Bogle, who founded the Vanguard Group in 1974 and later was dubbed the \"father of index investing,\" has died at 89.\r\n USA TODAY\r\nWhat do Nike and Google have in common? Both faced European Union (EU) antitrust fines in March $14 million for Nike, $1.7 bi… [+4378 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Eliza Collins, USA TODAY","title":"Mueller report revives Trump impeachment talk, even as Democratic leaders try to tamp it down","description":"“Damning” details found in Robert Mueller’s probe into Russian interference in the 2016 election have sparked impeachment talk again.","url":"https://www.usatoday.com/story/news/politics/elections/2019/04/21/mueller-report-democrats-struggle-impeachment-president-donald-trump/3518879002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/733efd55-4e3b-452d-8176-253accb0d585-GTY_1143605890.JPG?crop=2999,1686,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T11:00:01Z","content":"WASHINGTON With just a year and a half to go until the presidential election, Democratic leaders have been saying President Donald Trump should be voted out of office, not depart through impeachment.\r\nBut damning details found in Special Counsel Robert Muelle… [+8093 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Phillies get HRs from Harper, McCutchen to beat Rockies 8-5","description":"Bryce Harper hit a three-run homer, Andrew McCutchen also connected and the Philadelphia Phillies beat the Colorado Rockies 8-5","url":"https://www.usatoday.com/story/sports/mlb/2019/04/21/phillies-get-hrs-from-harper-mccutchen-to-beat-rockies-8-5/39372581/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/6e7c573f5c2c0d158ae2d4d7c241fd6de1cc4baa/c=0-534-5236-3479/local/-/media/2019/04/21/USATODAY/usatsports/5433a39fd55c42eca4a08b20f4622a40.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T05:15:09Z","content":"DENVER (AP) Phil Gosselin grew up winning imaginary games for the Philadelphia Phillies. When his chance came as a major leaguer, the hometown kid came through.\r\nGosselin hit a three-run double that put Philadelphia ahead for good, and the Phillies got homers… [+4487 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Maureen Groppe, USA TODAY","title":"The 'weird parallels' between Vice President Mike Pence and presidential hopeful Pete Buttigieg","description":"While Vice President Mike Pence and presidential hopeful Pete Buttigieg are at odds on many issues, they also have many things in common.","url":"https://www.usatoday.com/story/news/politics/elections/2019/04/21/how-mike-pence-and-pete-buttigieg-more-alike-than-you-think/3451334002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/17/USAT/a81d3b44-ccb4-4769-8243-b09aace43107-Buttigieg_and_Pence.JPG?crop=3599,2008,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-21T12:00:03Z","content":"Presidential candidate Pete Buttigieg responds to anti-gay hecklers at a rally in Iowa.\r\n USA TODAY\r\nWASHINGTON There are more similarities between Vice President Mike Pence and presidential hopeful Pete Buttigieg than you might think.\r\nAnd its not just that … [+10374 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Garrett Epps","title":"A Supreme Court Case That Will Affect Every Aspect of National Life","description":"Can the federal census form ask whether each member of a household is a U.S. citizen?","url":"https://www.theatlantic.com/ideas/archive/2019/04/can-census-ask-about-citizenship/587503/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/RTX6S2UC/facebook.jpg?1555603018","publishedAt":"2019-04-21T10:00:00Z","content":"The outcome in New York v. Department of Commerce, which the Supreme Court will hear on April 23, will affect virtually every aspect of our national life, from the right to vote to the balance of power in Congress and the Electoral College to the scope of fed… [+11729 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Ciara Torres-Spelliscy","title":"Luckily for the Trump Team, Campaign-Finance Laws Are Hard to Break","description":"There’s a reason Mueller shied away from prosecuting Jared Kushner and Donald Trump Jr.","url":"https://www.theatlantic.com/ideas/archive/2019/04/campaign-finance-loopholes-helped-trump-team/587671/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/RTX3B18M/facebook.jpg?1555786828","publishedAt":"2019-04-21T10:00:00Z","content":"Campaign-finance law may be one of the few areas of the law where ignorance is bliss. In Special Counsel Robert Mueller’s February 2018 indictment of Russian operatives, he stated that Russians talked to unwitting individuals associated with the Trump campaig… [+5853 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Peter Beinart","title":"U.S. Trade Hawks Exaggerate China’s Threat","description":"Democrats and Republicans echo Trump’s anti-Beijing rhetoric, but escalating tensions could leave Americans far worse off.","url":"https://www.theatlantic.com/ideas/archive/2019/04/us-trade-hawks-exaggerate-chinas-threat/587536/?utm_source=feed","urlToImage":null,"publishedAt":"2019-04-21T10:00:00Z","content":"N ews reports suggest that in the coming weeks, the United States and China will sign an agreement that repeals the tariffs the two nations have been levying on each other’s goods for the past nine months. If past behavior is any guide, Donald Trump will call… [+17229 chars]"},{"source":{"id":null,"name":"Lite.cnn.io"},"author":null,"title":"Japan's Ainu will finally be recognized as indigenous people","description":"View the latest news and breaking news today for U.S., world, weather, entertainment, politics and health at CNN.com.","url":"http://lite.cnn.io/en/article/h_db08b33213d74c0d498afe6dc04c579c","urlToImage":null,"publishedAt":"2019-04-21T12:23:15Z","content":"Hong Kong (CNN) - Growing up in Japan, musician Oki Kano never knew he was part of a \"vanishing people.\"\r\nHis Japanese mother was divorced and never told Kano that his birth father was an indigenous Ainu man. Kano was 20 years old when he found out. \r\nFor dec… [+7405 chars]"},{"source":{"id":null,"name":"Hbr.org"},"author":null,"title":"Andy Grove's Paranoia: Universal Lessons (1996) [pdf]","description":"Universal lessons every manager can learn from Andy Grove’s paranoia.","url":"https://hbr.org/1996/11/inside-intel","urlToImage":"https://hbr.org/resources/images/hbr_opengraph_940x490.png","publishedAt":"2019-04-21T18:19:32Z","content":"Only the Paranoid Survive: How to Exploit the Crisis Points That Challenge Every Company and Career, Andrew S. Grove (New York: Currency/Doubleday, 1996).\r\nIn 1965, Gordon Moore, chairman of Intel, put forth a law of technology: The number of transistors on a… [+21479 chars]"},{"source":{"id":null,"name":"Buzzfeednews.com"},"author":"Gabriel H. Sanchez","title":"These Rare Color Pictures Show How People Dressed For Easter In The ’50s","description":"“Being able to witness the ’30s, ’40s, and ’50s in color blows me away every time... It’s just a magical feeling.” View Entire Post ›","url":"https://www.buzzfeednews.com/article/gabrielsanchez/these-rare-color-pictures-show-easter-1950s","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2019-04/21/9/campaign_images/buzzfeed-prod-web-04/these-rare-color-pictures-show-how-people-dressed-2-18922-1555853674-4_dblbig.jpg","publishedAt":"2019-04-21T13:38:09Z","content":"In the 1950s, the phrase Sundays best meant something quite different than it does today. On Easter Sunday, families from all walks of life would dust off their best and most extravagant dresses, hats, and suits in celebration of the holiday and in New York C… [+2902 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"PHOTOS: Bonnets, costumes on display in New York City's Easter Parade","description":"The fancy hats and finery were out and on display for New York City's annual Easter extravaganza. Participants in the annual Easter Parade made their way along Manhattan's Fifth Avenue on Sunday in a procession of the wild and whimsical. The annual event is a…","url":"https://news.yahoo.com/photos-bonnets-costumes-on-display-in-new-york-citys-easter-parade-211932201.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/7UY2PLzsIBJfmfGvexzdDQ--~B/aD0xMDAwO3c9MTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cbcde36230000b603ea238a.jpeg","publishedAt":"2019-04-21T21:19:32Z","content":"The fancy hats and finery were out and on display for New York City's annual Easter extravaganza.\r\nParticipants in the annual Easter Parade made their way along Manhattans Fifth Avenue on Sunday in a procession of the wild and whimsical.\r\nThe annual event is … [+5833 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Cardi B rejects plea deal in strip club brawl case, facing up to one year in jail","description":"Cardi B rejected a deal to plead guilty to one misdemeanor count in strip club brawl, even though it would keep her out of jail.","url":"https://news.yahoo.com/cardi-b-rejects-plea-deal-190814153.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/4DSaPaFxhvQmWyro9ZJuJQ--~B/aD0yNjE4O3c9MzkyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/usa_today_life_698/a6015efaea1a082587383ed79045f0f7","publishedAt":"2019-04-21T17:51:17Z","content":"Cardi B, charged with multiple counts of assault and reckless endangerment in connection with a brawl in a Queens strip club last summer, appeared in court in New York on Friday and rejected a plea deal that would have kept her out of jail. \r\nThe Queens Distr… [+1471 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Is Sri Lanka Easter Massacre a Bid to Revive Global Holy War?","description":"STR/GettyNEW YORK—“It’s really a shame it had to come to this,” said an NYPD counterterrorism officer who was posted Sunday morning outside a Catholic church on Manhattan’s Upper East Side. Inside, the pews were filled with the faithful at Easter mass.I asked…","url":"https://news.yahoo.com/sri-lanka-easter-massacre-bid-210931167.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Gru_jVje9tXwnr8AOM1ruQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/08196b01e4101d0923212a33801d23a1","publishedAt":"2019-04-21T21:09:31Z","content":"NEW YORKIts really a shame it had to come to this, said an NYPD counterterrorism officer who was posted Sunday morning outside a Catholic church on Manhattans Upper East Side. Inside, the pews were filled with the faithful at Easter mass.\r\nI asked her if she … [+5575 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Ilhan Omar: Somali Americans vow to stand up to Trump attacks","description":"After being accused of endangering one of the city’s US representatives, the president visited Minneapolis. Activists were there to meet himProtesters support Minnesota representative Ilhan Omar, outside an event attended by Donald Trump this week. Photograph…","url":"https://news.yahoo.com/ilhan-omar-somali-americans-vow-050043656.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/UvoEAh8fm8re7Kvt1ozTow--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/742a8c275fe5ef5cccb136bd40804707","publishedAt":"2019-04-21T05:00:43Z","content":"As she stood in a crowd of protesters, helping hold a long Stand with Ilhan sign outside the trucking company in Burnsville where Donald Trump was about to speak, Habon Abdulle could not help but be swept up in the contradictory emotions of the moment.\r\nRelat… [+7124 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Schiff Says Democrats Will Debate Impeachment Amid Left Pressure","description":"(Bloomberg) -- House Intelligence Committee Chairman Adam Schiff said Sunday that the Democrats will discuss whether to begin impeachment hearings of President Donald Trump after progressives ratcheted up the pressure on a reluctant party leadership.","url":"https://news.yahoo.com/schiff-says-democrats-debate-impeachment-151531933.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/G1.ONymIkudZ947Z9DuIOQ--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/bloomberg_politics_602/0e217fd441a038b665c193f0d23a32f1","publishedAt":"2019-04-21T15:15:31Z","content":"(Bloomberg) -- House Intelligence Committee Chairman Adam Schiff said Sunday that the Democrats will discuss whether to begin impeachment hearings of President Donald Trump after progressives ratcheted up the pressure on a reluctant party leadership.\r\nWere go… [+4804 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump lawyer Giuliani says 'there's nothing wrong with taking information from Russians'","description":"Defending President Trump’s campaign for its willingness to accept help from Russia in the 2016 presidential election, Trump’s lawyer Rudy Giuliani said there was “nothing wrong” with a campaign taking information from foreign sources.","url":"https://news.yahoo.com/trump-lawyer-giuliani-says-theres-nothing-wrong-with-taking-information-from-russians-160341148.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/U_vBJ5sB7JJGwaZBuLSQ1A--~B/aD0zMDAwO3c9NDQ5NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cbc88fc230000b603ea2372.jpeg","publishedAt":"2019-04-21T16:03:41Z","content":"Defending President Trumps campaign for its willingness to accept help from Russia in the 2016 presidential election, Trumps lawyer Rudy Giuliani said there was nothing wrong with a campaign taking information from foreign sources.Any candidate in the whole w… [+4003 chars]"},{"source":{"id":null,"name":"Deadspin.com"},"author":"Gabe Fernandez","title":"Report: Michael Avenatti Paid For A Jet With $2.5M He Embezzled From A Settlement Hassan Whiteside Paid To His Ex-Girlfriend","description":"The federal indictment against Michael Avenatti that accused the lawyer of stealing millions of dollars from his clients referred to the victims of his alleged financial crimes with numerical monikers (Client 1, 2, etc.). But thanks to a report from the Los A…","url":"https://deadspin.com/report-michael-avenatti-paid-for-a-jet-with-2-5m-he-e-1834199999","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--KGa8gJ_4--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/cbpona1gdhumiadgawnq.jpg","publishedAt":"2019-04-21T19:13:00Z","content":"The federal indictment against Michael Avenatti that accused the lawyer of stealing millions of dollars from his clients referred to the victims of his alleged financial crimes with numerical monikers (Client 1, 2, etc.). But thanks to a report from the Los A… [+1968 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Virginia Gewin","title":"Why some anti-bias training misses the mark","description":"Short online sessions that aim to change biased workplace behaviour have a limited effect, find US researchers.","url":"https://www.nature.com/articles/d41586-019-01301-8?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01301-8/d41586-019-01301-8_16628864.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"Workplace diversity training might not be effective for all participants.Credit: Hinterhaus/Getty\r\nOnline diversity-training programmes aimed at countering gender or racial bias among employees do little to change workplace behaviour, particularly among men, … [+4148 chars]"},{"source":{"id":null,"name":"Ritholtz.com"},"author":"Barry Ritholtz","title":"Transcript: Bill Bernstein","description":"The transcript from this week’s MIB: William J. Bernstein, Efficient Frontier is below. You can stream/download the full conversation, including the podcast extras on iTunes, Bloomberg, Overcast, and Stitcher. Our earlier podcasts can all be found at iTunes, …","url":"https://ritholtz.com/2019/04/transcript-bill-bernstein/","urlToImage":"https://ritholtz.com/wp-content/uploads/2019/04/MIB-1-2.png","publishedAt":"2019-04-21T16:00:18Z","content":"The transcript from this weeks MIB: William J. Bernstein, Efficient Frontier is below.\r\nYou can stream/download the full conversation, including the podcast extras on  iTunes, Bloomberg, Overcast, and Stitcher. Our earlier podcasts can all be found at iTunes,… [+88407 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Virginia Gewin","title":"Why some anti-bias training misses the mark","description":"Short online sessions that aim to change biased workplace behaviour have a limited effect, find US researchers.","url":"https://www.nature.com/articles/d41586-019-01301-8","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01301-8/d41586-019-01301-8_16628864.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"Workplace diversity training might not be effective for all participants.Credit: Hinterhaus/Getty\r\nOnline diversity-training programmes aimed at countering gender or racial bias among employees do little to change workplace behaviour, particularly among men, … [+4148 chars]"},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Noah Yoo","title":"Woodstock 50 Ticket Sales Delayed as Organizers Lack Required Permit","description":"Although tickets won’t go on sale April 22, as planned, organizers state the fest will not be canceled","url":"https://pitchfork.com/news/woodstock-50-ticket-sales-delayed-as-organizers-lack-required-permit/","urlToImage":"https://media.pitchfork.com/photos/5cbc8d206b4f552db4d68c40/2:1/w_790/Woodstock.png","publishedAt":"2019-04-21T15:38:08Z","content":"Woodstock 50, a new event to celebrate the 50th anniversary of the historic 1969 music festival, is slated to take place August 16-18 at the Watkins Glen International speedway in upstate New York. Tickets were due to go on sale April 22, but as Billboard and… [+1933 chars]"},{"source":{"id":null,"name":"Thetakeout.com"},"author":"Kevin Pang on The Takeout, shared by Laura M. Browning to The A.V. Club","title":"The Instant Pot was made to cook Indian butter chicken","description":"I’m no Luddite, but I counted myself among the skeptics when the Instant Pot first saw rise. I’ve seen too many fad appliances arrive in a blaze of glory, only to fizzle out and end up in a box to the Goodwill. Even as fervent fans made the Instant Pot out to…","url":"https://thetakeout.com/instant-pot-indian-butter-chicken-recipe-1834199355","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--aCBfr8TW--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xmfstaxg6sen6t3i1dzx.jpg","publishedAt":"2019-04-21T22:37:00Z","content":"Im no Luddite, but I counted myself among the skeptics when the Instant Pot first saw rise. Ive seen too many fad appliances arrive in a blaze of glory, only to fizzle out and end up in a box to the Goodwill. Even as fervent fans made the Instant Pot out to b… [+5157 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Erica Palan","title":"11 Surprising Facts About Prince","description":"You might love his music, but there are probably a few things you don't know about the artist formerly known as The Artist Formerly Known as Prince.","url":"http://mentalfloss.com/article/19185/10-surprising-facts-about-prince","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_360,w_640,x_0,y_0/v1555324505/shape/mentalfloss/princehed_2.jpg?itok=Q_frcE-7","publishedAt":"2019-04-21T14:00:00Z","content":"Before she was a global sensation, Aretha Louise Franklin was a young girl with a big voice. She was born in a tiny home in Memphis, Tennessee in 1942 to C.L. and Barbara Franklin. Her parents, a well-known Baptist minister and a talented singer and musician,… [+14314 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Ben Pearson","title":"Ryan Murphy is Bringing ‘The Boys in the Band’ to Netflix, Starring Jim Parsons, Zachary Quinto, and More","description":"Ryan Murphy, the prolific writer/producer/director of Glee and American Horror Story who signed one of the biggest production deals in television history with Netflix last year, has lined up another project for the streaming service. He’ll produce a film adap…","url":"https://www.slashfilm.com/ryan-murphy-is-bringing-the-boys-in-the-band-to-netflix-starring-jim-parsons-zachary-quinto-and-more/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Boys-in-the-Band.jpg","publishedAt":"2019-04-21T17:00:24Z","content":"Ryan Murphy, the prolific writer/producer/director of Glee and American Horror Story who signed one of the biggest production deals in television history with Netflix last year, has lined up another project for the streaming service.\r\nHe’ll produce a film ada… [+2241 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Khushbu Shah","title":"Sri Lanka Easter Sunday attacks: what we know","description":"More than 200 people have been killed in coordinated attacks on churches and hotels.","url":"https://www.vox.com/2019/4/21/18509739/sri-lanka-easter-sunday-attacks-what-we-know","urlToImage":"https://cdn.vox-cdn.com/thumbor/ChHD6cRBw8D7Pt0SFJXYhaVwG50=/0x225:4671x2671/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16180340/GettyImages_1138339369.jpg","publishedAt":"2019-04-21T14:21:38Z","content":"More than 200 people were killed and at least 450 others were injured in eight coordinated attacks on churches and hotels in Sri Lanka on Easter Sunday. The death toll continues to rise, with at least 207 people dead, according to police.\r\nThe attacks marks s… [+6073 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"asnider@politico.com (Annie Snider)","title":"Interior’s Bernhardt worked closely on matters he promised to avoid","description":"New disclosures of the secretary's schedule add to questions surrounding his ties to past lobbying clients, including a California water district.","url":"https://www.politico.com/story/2019/04/21/david-bernhardt-water-law-interior-department-1370107","urlToImage":"https://static.politico.com/2b/8b/f7dc91674e849b600ef4eec370fd/19419-david-bernhardt-gty-773.jpg","publishedAt":"2019-04-21T10:57:53Z","content":"Interior Secretary David Bernhardt shaped the department'sresponse to a key portion of awater infrastructurelaw he hadhelped pass as a lobbyist for California farmers. | Zach Gibson/Getty Images\r\nInterior Secretary David Bernhardtbegan working on policies tha… [+10755 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"qforgey@politico.com (Quint Forgey)","title":"Conway doesn’t contradict McGahn’s testimony but still casts some doubt","description":"She suggests McGahn would have quit if Trump really ordered him to do inappropriate things.","url":"https://www.politico.com/story/2019/04/21/conway-declines-to-deny-mcgahns-testimony-to-mueller-1284141","urlToImage":"https://static.politico.com/49/7a/a692fc7148ed86399a9e5d2e37fa/190421-kellyanne-conway2-ap-773.jpg","publishedAt":"2019-04-21T14:42:52Z","content":"If he were being asked to obstruct justice or violate the Constitution or commit a crime help to commit a crime by the president of the United States he wouldnt have stayed, Kellyanne Conway said. I certainly wouldnt stay. | Andrew Harnik/AP Photo\r\nWhite Hous… [+1521 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"daniel@politico.com (Daniel Lippman)","title":"Rudy to Tapper on taking oppo from foreign sources: ‘Who says it’s even illegal’","description":null,"url":"https://www.politico.com/newsletters/playbook/2019/04/21/rudy-to-tapper-on-taking-oppo-from-foreign-sources-who-says-its-even-illegal-426841","urlToImage":"https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg","publishedAt":"2019-04-21T14:30:17Z","content":"DRIVING THE DAY\r\nBREAKING -- Explosions kill at least 207 in Sri Lanka on Easter Sunday, by APs Bharatha Mallawarachi and Krishan Francis in Colombo, Sri Lanka: At least 207 people were killed and hundreds more injured in eight blasts that rocked churches and… [+24419 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"Elliot Carter","title":"When the Washington Easter Egg Roll Was Chaos","description":"The president now hosts the annual event because Congress literally kicked the kids off their lawn. Here’s why.","url":"https://www.politico.com/magazine/story/2019/04/21/when-the-washington-easter-egg-roll-was-chaos-226669","urlToImage":"https://static.politico.com/00/79/8a46597d4d33871256a632b9a18f/eastern-roll-eggs-in-the-white-house-in-1929.jpg","publishedAt":"2019-04-21T11:02:24Z","content":"Elliot Carter is a writer and researcher in Washington, D.C.\r\nThe White House Easter Egg Roll is upon us again, with its usual light-hearted fanfare and wholesome traditions. There will be bunny costumes, live music performances and senior government official… [+6852 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Scott Polacek","title":"Giants GM Dave Gettleman Responds to Critics: 'I Like My Resume So Far'","description":"The  New York Giants  have been to the playoffs once in the past seven years and don't look promising on paper entering the 2019 campaign, but general manager Dave Gettleman believes in his resume over any outside criticism...","url":"https://bleacherreport.com/articles/2832449-giants-gm-dave-gettleman-responds-to-critics-i-like-my-resume-so-far","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/099/hi-res-a5aea4e845e0e7b869cdeac1533af42d_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T22:21:39Z","content":"Michael Conroy/Associated Press\r\nThe New York Giants have been to the playoffs once in the past seven years and don't look promising on paper entering the 2019 campaign, but general manager Dave Gettleman believes in his resume over any outside criticism.\r\n\"I… [+563 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Zach Buckley","title":"2019 NFL Mock Draft: Predictions for Where 1st-Round Prospects Will End Up","description":"It's finally the week of the 2019  NFL  draft.   Do you know which prospect your team will soon select?   The further you move down the draft board, the more variables that enter the equation...","url":"https://bleacherreport.com/articles/2832307-2019-nfl-mock-draft-predictions-for-where-1st-round-prospects-will-end-up","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/959/hi-res-b19b37066aa212c9dafed41355814235_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T11:09:40Z","content":"Michael Reaves/Getty Images\r\nIt's finally the week of the 2019 NFL draft.\r\nDo you know which prospect your team will soon select?\r\nThe further you move down the draft board, the more variables that enter the equation. But in a class like this, the question ma… [+4795 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Gianni Verschueren","title":"Amir Khan Says He Didn't Quit Against Terence Crawford After Low Blow","description":"Amir Khan  has said he didn't quit in his TKO loss against Terence Crawford for the WBO welterweight title on Saturday, despite  his corner  prematurely telling the referee he could not continue after a low blow...","url":"https://bleacherreport.com/articles/2832373-amir-khan-says-he-didnt-quit-against-terence-crawford-after-low-blow","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/019/hi-res-b79a62a97f8f7b8a426602f3e8e4f8b7_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T11:09:40Z","content":"Frank Franklin II/Associated Press\r\nAmir Khan has said he didn't quit in his TKO loss against Terence Crawford for the WBO welterweight title on Saturday, despite his corner prematurely telling the referee he could not continue after a low blow.\r\nKhan was hit… [+3164 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Chris Roling","title":"NFL Mock Draft 2019: Projections for Round 1, Analysis for Underrated Prospects","description":"It isn't hard for some high-quality prospects to fall into the underrated realm as the build for the 2019  NFL  draft concludes.    The usual suspects dominate the conversation and shove these prospects to the side...","url":"https://bleacherreport.com/articles/2832387-nfl-mock-draft-2019-projections-for-round-1-analysis-for-underrated-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/035/hi-res-3b7239373cb4889305918d455d267ed8_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T18:09:52Z","content":"Michael Conroy/Associated Press\r\nIt isn't hard for some high-quality prospects to fall into the underrated realm as the build for the 2019 NFL draft concludes. \r\nThe usual suspects dominate the conversation and shove these prospects to the side. Kyler Murray … [+6804 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Tyler Conway","title":"Cavs Rumors: 'Zero Truth' Rick Pitino Is Being Considered for Head Coach","description":"The  Cleveland Cavaliers  said there is \"zero truth\" to the team being interested in hiring  Rick Pitino  as their next coach.    “We are, respectfully, not interested in him at all...","url":"https://bleacherreport.com/articles/2832412-cavs-rumors-zero-truth-rick-pitino-is-being-considered-for-head-coach","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/065/hi-res-9b15157cd2b3416808cc979c169e9671_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T17:55:11Z","content":"Petros Giannakouris/Associated Press\r\nThe Cleveland Cavaliers said there is \"zero truth\" to the team being interested in hiring Rick Pitino as their next coach.\r\nWe are, respectfully, not interested in him at all. No conversations with him by Dan (Gilbert) or… [+1523 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Megan Armstrong","title":"Cole Anthony, James Wiseman Win Co-MVP; White Wins 2019 Jordan Brand Classic","description":"College basketball's next wave of talent took the floor for the 18th annual Jordan Brand Classic on Saturday night at T-Mobile Arena in Las Vegas with Team White edging Team Black 132-125 in the showcase...","url":"https://bleacherreport.com/articles/2832315-cole-anthony-james-wiseman-win-co-mvp-white-wins-2019-jordan-brand-classic","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/000/hi-res-3ad52e5f2010844b78f694809fa2db59_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T02:35:05Z","content":"Steven Ryan/Getty Images\r\nCollege basketball's next wave of talent took the floor for the 18th annual Jordan Brand Classic on Saturday night at T-Mobile Arena in Las Vegas with Team White edging Team Black 132-125 in the showcase.\r\nThe first half was dominate… [+3864 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Jake Rill","title":"NBA Playoff Schedule 2019: TV Guide, Live Stream Schedule for Sunday Games","description":"Saturday brought a full slate of  NBA  playoff action with the road teams dominating, winning all four matchups. There will be four more games Sunday, and it wouldn't be surprising to see more success for the visitors...","url":"https://bleacherreport.com/articles/2832369-nba-playoff-schedule-2019-tv-guide-live-stream-schedule-for-sunday-games","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/014/hi-res-afd4dc65aa37a42c54ea022dcabe03b5_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-21T12:11:05Z","content":"Darron Cummings/Associated Press\r\nSaturday brought a full slate of NBA playoff action with the road teams dominating, winning all four matchups. There will be four more games Sunday, and it wouldn't be surprising to see more success for the visitors.\r\nThe fir… [+3410 chars]"},{"source":{"id":null,"name":"Archdaily.com"},"author":"Vladimir Belogolovsky","title":"“We Want to Enjoy the Work, Enjoy the Fight”: In Conversation with Qing Fei and Frank Fu of Renhe Architecture","description":"Last year I was invited to teach design studio for the first time by Tsinghua University in Beijing, home to the top architecture school in China and one of the strongest in the world, according to the latest international ratings. There, I met husband-and-wi…","url":"https://www.archdaily.com/915475/we-want-to-enjoy-the-work-enjoy-the-fight-in-conversation-with-qing-fei-and-frank-fu-of-renhe-architecture","urlToImage":"https://images.adsttc.com/media/images/5cb9/fa70/284d/d1c1/b000/0046/large_jpg/Renhe_Architecture_Quake_Projects_Minle_Houses_Mianzhu_02.jpg?1555692139","publishedAt":"2019-04-21T10:00:00Z","content":"Quake Projects, Minle Houses, Mianzh. Image © Renhe Architecture\r\nLast year I was invited to teach design studio for the first time by Tsinghua University in Beijing, home to the top architecture school in China and one of the strongest in the world, accordin… [+13620 chars]"},{"source":{"id":null,"name":"Thehustle.co"},"author":null,"title":"The Yodeler Who Sued Yahoo","description":"Twenty years ago, Yahoo decided to roll out a new national advertising campaign. Unfortunately, it didn't reveal this plan to its star yodeler.","url":"https://thehustle.co/the-yodeler-who-sued-yahoo/","urlToImage":"https://thehustle.co/wp-content/uploads/2019/04/share-1.jpg","publishedAt":"2019-04-21T21:52:26Z","content":"In the late 90s, the Yahoo Yodel was inescapable.\r\nFor a time, the 3-note audio clip  Ya-hooooooooo-oooo! defined the young tech company: It came preloaded in Yahoo-branded bottle-openers, doorbells, and plush toys. It chimed through computer speakers. It mad… [+8823 chars]"},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"How two towns in Kansas soured on educational software from Summit Learning, funded by Chan Zuckerberg Initiative; Summit CEO says protests are about nostalgia (Nellie Bowles/New York Times)","description":"Nellie Bowles / New York Times : How two towns in Kansas soured on educational software from Summit Learning, funded by Chan Zuckerberg Initiative; Summit CEO says protests are about nostalgia — WELLINGTON, Kan. — The seed of rebellion was planted in classroo…","url":"https://www.techmeme.com/190421/p8","urlToImage":"http://static01.nyt.com/images/2019/04/21/business/21summit-p1/00summit-new2-facebookJumbo.jpg","publishedAt":"2019-04-21T15:15:02Z","content":null},{"source":{"id":null,"name":"Rollingstone.com"},"author":"ilanamichellekaplan","title":"Woodstock 50 Ticket On-Sale Postponed","description":"Organizers deny cancellation rumors","url":"https://www.rollingstone.com/music/music-news/woodstock-50-ticket-on-sale-postponed-825171/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/shutterstock_10160758v.jpg","publishedAt":"2019-04-21T17:37:24Z","content":"The ticket on-sale for Woodstock 50, a commemorative event celebrating the 50th anniversary of the 1969 Woodstock music festival, has been pushed back.\r\nOn Friday, agents received an email regarding the change to the festival slated for August 16-18 at the Wa… [+1636 chars]"},{"source":{"id":null,"name":"Thepointsguy.com"},"author":"J. Scott Clark","title":"TSA Sets New Records for Number of Passengers Screened in a Single Day","description":"To say TSA screeners had a busy week would be an understatement. Granted it was going into a holiday weekend, screeners in two New York City airports set new passenger records. On Thursday, TSA agents at New York’s La Guardia (LGA) airport screened a record-s…","url":"http://thepointsguy.com/news/tsa-record-setting-week/","urlToImage":"https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/01/GettyImages-1091857738.jpg?fit=1024%2C683px&ssl=1","publishedAt":"2019-04-21T21:00:08Z","content":"To say TSA screeners had a busy week would be an understatement. Granted it was going into a holiday weekend, screeners in two New York City airports set new passenger records.\r\nOn Thursday, TSA agents at New York’s La Guardia (LGA) airport screened a record-… [+3519 chars]"},{"source":{"id":null,"name":"Thepointsguy.com"},"author":"Max Prosperi","title":"French Pilot Strike Could Disrupt Travelers’ Plans Next Month","description":"Travelers flying on French airlines in early May could experience significant travel disruptions as a result of a possible pilot strike. The New York Times is reporting that the main union representing France’s commercial pilots, Syndicat National des Pilotes…","url":"http://thepointsguy.com/news/france-pilot-strike-flight-disruptions/","urlToImage":"https://i0.wp.com/thepointsguy.com/wp-content/uploads/2018/08/300_6179.jpg?fit=1400%2C527px&ssl=1","publishedAt":"2019-04-21T21:30:23Z","content":"Travelers flying on French airlines in early May could experience significant travel disruptions as a result of a possible pilot strike. The New York Times is reporting that the main union representing France’s commercial pilots, Syndicat National des Pilotes… [+3726 chars]"},{"source":{"id":null,"name":"Thepointsguy.com"},"author":"Max Prosperi","title":"Deal Alert: US Cities to Scandinavia From $306+ Round-Trip","description":"Want to see the latest flight deals as soon as they’re published? Follow The Points Guy on Facebook and Twitter, and subscribe to text message alerts from our deals feed, @tpg_alerts. Airfare deals are typically only available on limited dates. We recommend y…","url":"http://thepointsguy.com/deals/deal-alert-us-cities-to-scandinavia-from-306-round-trip/","urlToImage":"https://i1.wp.com/thepointsguy.com/wp-content/uploads/2016/11/downtownoslo.jpg?fit=830%2C533px&ssl=1","publishedAt":"2019-04-21T20:00:15Z","content":"Want to see the latest flight deals as soon as theyre published? Follow The Points Guy on Facebook and Twitter, and subscribe to text message alerts from our deals feed, @tpg_alerts.\r\nAirfare deals are typically only available on limited dates. We recommend y… [+4941 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Tom Brueggemann","title":"Andrew Garfield’s ‘Under the Silver Lake’ Tops Shaky Specialty Box Office","description":"\"Amazing Grace\" is kicking ass this Easter weekend, as the specialty market continues its 2019 decline.","url":"https://www.indiewire.com/2019/04/box-office-under-the-silver-lake-andrew-garfield-specialized-limited-1202126398/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-20-at-5-27-32-pm.png","publishedAt":"2019-04-21T18:17:52Z","content":"In a rickety specialty market, A24’s Cannes 2018 film noir “Under the Silver Lake,” starring Andrew Garfield, delivered the best opener, beating out “Red Joan” (IFC), the latest from reliable Judi Dench, which opened far below her usual results. Several other… [+9497 chars]"},{"source":{"id":null,"name":"Designboom.com"},"author":"sofia lekka angelopoulou I designboom","title":"büro koray duman to extend new york’s noguchi museum with art + archive building","description":"noguchi’s original 1959 studio building will also be restored and open to the public for the first time. The post büro koray duman to extend new york’s noguchi museum with art + archive building appeared first on designboom | architecture & design magazine.","url":"https://www.designboom.com/architecture/buro-koray-duman-noguchi-museum-art-archive-building-04-21-2019/","urlToImage":"https://www.designboom.com/wp-content/uploads/2019/04/noguchi-museum-art-archive-building-buro-koray-duman-designboom-1200.jpg","publishedAt":"2019-04-21T02:15:39Z","content":"the isamu noguchi foundation and garden museum (the noguchi museum) has announced plans to expand its campus with a new structure that will house its collection and archive, as well as noguchis original 1959 studio building, which will be restored and open to… [+2904 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Gary Gramling","title":"The NFL Mock Draft for The People","description":"A realistic look at Thursday's first round: Everyone wants to trade down.","url":"https://www.si.com/nfl/2019/04/20/mock-draft-trade-down-giants-kyler-murray","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/21/nfl-mock-draft-trades-2.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-21T04:43:13Z","content":"Lets get the hell out of here!\r\nThats the famous line, spoken by a ruggedly handsome veteran lead actor in a motion picture. If I remember correctly, he was the leader, and he and others were trying to overcome an obstacle of some kind. Aliens? Or a shark? Wa… [+18824 chars]"},{"source":{"id":null,"name":"Refinery29.com"},"author":"You, written by You","title":"A Week In Brooklyn, NY On A $73,185 Salary","description":"Welcome to Money Diaries, where we're tackling what might be the last taboo facing modern working women: money. We're asking millennials how they spend their hard-earned money during a seven-day period — and we're tracking every last dollar. Calling all entre…","url":"https://www.refinery29.com/en-us/research-analyst-brooklyn-salary-money-diary","urlToImage":"https://s3.r29static.com//bin/entry/5f3/0,0,2000,1050/x,80/2156379/a-week-in-brooklyn-ny-2156379.jpg","publishedAt":"2019-04-21T16:00:00Z","content":"Skip navigation!We noticed you're in Canada, would you like to see your local site? Click on the flag above to switch.\r\nNow ReadingA Week In Brooklyn, NY On A $73,185 Salary\r\nWelcome toMoney Diaries, where we're tackling what might be the last taboo facing mo… [+17765 chars]"},{"source":{"id":null,"name":"Slickdeals.net"},"author":"Butcherboy","title":"The Life-Changing Magic of Tidying Up (Kindle eBook) $3","description":"Amazon has The Life-Changing Magic of Tidying Up: The Japanese Art of Decluttering and Organizing (Kindle eBook) on sale for $2.99. Thanks Butcherboy and MACKINGITDAILY\r\n\r\nGoogle Play also has The ...","url":"https://slickdeals.net/f/13030600-the-life-changing-magic-of-tidying-up-kindle-ebook-3","urlToImage":"https://static.slickdealscdn.com/attachment/1/8/6/7/1/1/4/8026102.attach","publishedAt":"2019-04-21T18:33:10Z","content":"https://www.amazon.com/dp/B00KK0P...38R0Z\r\nH9C3HBooks on Google Playhttps://books.google.co\r\nm/books?id...Orga\r\nnizing\r\nPreviously Front Page 2 times @ $2.99\r\nhttps://slickdeals.net/f/12551971-the-life-changing-magic-of-tidying-up-dark-matter-a-novel-ready-pl… [+1223 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Ephrat Livni","title":"Books are cool precisely because we don’t need them anymore","description":"Printed texts are the new hot accessory for off-duty models, luxury lovers, and literati.","url":"https://qz.com/quartzy/1600647/world-book-day-print-is-the-future-of-luxury/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/bookish.jpeg?quality=75&strip=all&w=1400","publishedAt":"2019-04-21T13:57:23Z","content":"Luxury is the ability to indulge in the unnecessary, to enjoy extras, to relish that which isnt strictly imperative to survival but gives us pleasure nonetheless. That makes printed books the ultimate luxury item, available to the masses yet needed by few, a … [+3589 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Annaliese Griffin","title":"A dozen delicious ways to eat boiled eggs","description":"Don't let your leftover Easter eggs go to waste.","url":"https://qz.com/quartzy/1596716/12-delicious-recipes-for-your-leftover-easter-eggs/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/hardboiled-eggs-e1555509619225.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-21T06:00:29Z","content":"Chicken eggs are an everyday wonder. With a carton in the fridge, youre never more than a few minutes away from a satisfying meal. Add greens, cheese, hearty bread or potatoes, and youre most of the way to a simple but wonderful dinner. Theyre inexpensiveeven… [+6401 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Alice Speri","title":"Baltimore Police Tried to Kill Keith Davis Jr. Prosecutors Have Been Trying to Convict Him of Murder Ever Since.","description":"Four years after Bal The post Baltimore Police Tried to Kill Keith Davis Jr. Prosecutors Have Been Trying to Convict Him of Murder Ever Since. appeared first on The Intercept.","url":"https://theintercept.com/2019/04/21/baltimore-police-keith-davis-jr-prosecution/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/keith-davis-jr-1-1555713279-e1555713398248.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-21T12:30:25Z","content":"Keith Davis Jr.\r\n was supposed to die. He had been on the phone with his girlfriend when four police officers cornered him into a dimly lit garage in West Baltimore. They had mistaken him for a robbery suspect, and they mistook his phone for a gun. After yell… [+26625 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Chris Danforth","title":"Supreme Posts Throwback Photos for 25th Anniversary of Lafayette Store","description":"April 1994 was the first month Supreme founder James Jebbia rented out a small storefront on Lafayette Street in New York City. 2019 marks the 25th anniversary of the opening of that location. Jebbia told Interview Magazine in 2009, “It cost me, like, $12,000…","url":"https://www.highsnobiety.com/p/supreme-lafayette-25th-anniversary/","urlToImage":"https://static.highsnobiety.com/thumbor/5gU_lITJJSQ-5FQVjez2yJvR_3w=/fit-in/960x576/smart/static.highsnobiety.com/wp-content/uploads/2019/04/21135602/supreme-Lafayette-25th-anniversary-feat.jpg","publishedAt":"2019-04-21T13:12:08Z","content":"April 1994 was the first month Supreme founder James Jebbia rented out a small storefront on Lafayette Street in New York City.\r\n2019 marks the 25th anniversary of the opening of that location. Jebbia told Interview Magazine in 2009, “It cost me, like, $12,00… [+1397 chars]"},{"source":{"id":null,"name":"R29.com"},"author":"You, written by You","title":"A Week In Brooklyn, NY On A $73,185 Salary","description":"Welcome to Money Diaries, where we're tackling what might be the last taboo facing modern working women: money. We're asking millennials how they spend their hard-earned money during a seven-day period — and we're tracking every last dollar. Calling all entre…","url":"https://www.r29.com/en-us/research-analyst-brooklyn-salary-money-diary?utm_source=feed&utm_medium=rss","urlToImage":null,"publishedAt":"2019-04-21T16:00:00Z","content":null},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"D. Parvaz","title":"Presidential candidates offer condolences following deadly Sri Lanka attacks","description":"Several 2020 presidential candidates expressed condolences Sunday following a series of horrific attacks on churches, hotels, and other tourist sites in Sri Lanka. “The Apostle Paul wrote, ‘Rejoice with those who rejoice, weep with those who weep,'” Sen. Cory…","url":"https://thinkprogress.org/presidential-candidates-offer-condolences-following-deadly-sri-lanka-attacks-d9f8552d2bc7/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1138512823.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-21T19:04:31Z","content":"Several 2020 presidential candidates expressed condolences Sunday following a series of horrific attacks on churches, hotels, and other tourist sites in Sri Lanka.\r\n“The Apostle Paul wrote, ‘Rejoice with those who rejoice, weep with those who weep,'” Sen. Cor… [+5390 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Football gossip: Pogba, Coutinho, Hazard, Phelan, Carrick, Perez","description":"Manchester United midfielder's demands may deter Real, Chelsea look to Barca for new playmaker, Perez hints at Newcastle exit, plus more.","url":"https://www.bbc.co.uk/sport/48007219","urlToImage":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/EF28/production/_106542216_paul_pogba1_pa.jpg","publishedAt":"2019-04-21T22:42:55Z","content":"Manchester United midfielder Paul Pogba's salary demands could prove a stumbling block in the 26-year-old France international's move to Real Madrid. (AS)\r\nChelsea are considering Barcelona's Brazilian playmaker Philippe Coutinho, 26, as a replacement for Bel… [+1493 chars]"},{"source":{"id":null,"name":"Skysports.com"},"author":null,"title":"Red Bulls set to appoint Henry","description":"New York Red Bulls are set to appoint Thierry Henry as their new manager next week, according to Sky sources.","url":"https://www.skysports.com/football/news/12096/11699810/new-york-red-bulls-set-to-appoint-thierry-henry-as-new-manager","urlToImage":"https://e2.365dm.com/19/01/150x150/skysports-thierry-henry-monaco_4555459.jpg","publishedAt":"2019-04-21T09:09:00Z","content":"New York Red Bulls are set to appoint Thierry Henry as their new manager next week, according to Sky sources.\r\nSky Sports News revealed earlier this week that the MLS side were in talks with the former Arsenal striker over their managerial position.\r\nHenry sp… [+715 chars]"},{"source":{"id":null,"name":"Skysports.com"},"author":null,"title":"MLS: Timbers end losing streak","description":"First-half goals from Larrys Mabiala and Jeremy Ebobisse helped the Portland Timbers end a five-game losing streak with a 3-1 win at Columbus Crew.","url":"https://www.skysports.com/football/news/12096/11699770/mls-round-up-portland-timbers-end-five-game-losing-streak","urlToImage":"https://e2.365dm.com/19/04/150x150/skysports-mls-cristian-penilla_4646264.jpg","publishedAt":"2019-04-21T07:45:00Z","content":"First-half goals from Larrys Mabiala and Jeremy Ebobisse helped the Portland Timbers end a five-game losing streak with a 3-1 win at Columbus Crew.\r\nMabiala headed home Diego Valeri's free-kick to open the scoring in the 31st minute before Ebobisse doubled Po… [+1380 chars]"}]}