{"status":"ok","totalResults":1388,"articles":[{"source":{"id":null,"name":"Lifehacker.com"},"author":"Josh Ocampo","title":"Why the 2020 U.S. Census Could Change Everything, According to an Expert","description":"Today, the Supreme Court heard arguments in support of and against a crucial citizenship question being added to the 2020 U.S. census—a question President Trump couldn’t help but chime in about earlier this month. Read more...","url":"https://lifehacker.com/why-the-2020-u-s-census-could-change-everything-accor-1834246379","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--I151wLUl--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xamhjojjbsy3ad2msz4h.jpg","publishedAt":"2019-04-23T20:15:00Z","content":"Today, the Supreme Court heard arguments in support of and against a crucial citizenship question being added to the 2020 U.S. censusa question President Trump couldnt help but chime in about earlier this month.\r\nCan you believe that the Radical Left Democrat… [+4514 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Ron Miller","title":"Oracle turns to innovation hubs to drive cultural and business shift to cloud","description":"Oracle was founded in 1977. While it’s not exactly IBM or GE, both of which date back to the late 19th and early 20th centuries respectively, it is old enough to be experiencing a fair bit of disruption in its own right. For a good part of its existence, it s…","url":"http://techcrunch.com/2019/04/23/oracle-turns-to-innovation-hubs-to-drive-cultural-and-business-shift-to-cloud/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/04/GettyImages-128282939.jpg?w=581","publishedAt":"2019-04-23T15:27:43Z","content":"Oracle was founded in 1977. While it’s not exactly IBM or GE, both of which date back to the late 19th and early 20th centuries respectively, it is old enough to be experiencing a fair bit of disruption in its own right. For a good part of its existence, it s… [+10316 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MICHAEL WINES","title":"Should Noncitizens Be Counted in America’s Political Maps?","description":"The Supreme Court is reviewing whether 2020 census respondents should say whether they are citizens. Their answer could affect political maps for generations to come.","url":"https://www.nytimes.com/2019/04/23/us/noncitizens-census-political-maps.html","urlToImage":"https://static01.nyt.com/images/2019/04/23/us/politics/noncitizen-pop-us-1555983395740/noncitizen-pop-us-1555983395740-facebookJumbo.png","publishedAt":"2019-04-23T09:00:26Z","content":"In Houston, redrawing maps without noncitizens could amount to a political sea change. Removing noncitizens from redistricting calculations would force immigrant-rich districts like Houstons 29th to expand their borders to make up for the loss of population. … [+2375 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MIHIR ZAVERI","title":"Texas Couple Get 7 Years in Prison for Enslaving Guinean Girl for 16 Years","description":"A federal jury found the couple guilty in January. Prosecutors said the girl was forced to cook, clean and care for the couple’s children.","url":"https://www.nytimes.com/2019/04/23/us/dallas-couple-enslaves-girl.html","urlToImage":"https://static01.nyt.com/images/2019/04/22/us/22xp-enslaved1/22xp-enslaved1-facebookJumbo.jpg","publishedAt":"2019-04-23T09:00:09Z","content":"It took tremendous courage for this young woman to share her story at trial, Erin Nealy Cox, the United States attorney for the Northern District of Texas, said in a statement on Monday. She was brought to this country at a young age, pressured to stay quiet,… [+1023 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Joshua A. Douglas","title":"Supreme Court case could help pick 2024 election winners","description":"Joshua A. Douglas writes that if the Supreme Court agrees to the Trump administration's request to add a citizenship question to the 2020 census, it would result in an undercount in states -- directly impacting the Electoral College and congressional represen…","url":"https://www.cnn.com/2019/04/22/opinions/citizenship-question-2024-elections-douglas/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190403130708-census-2020-super-tease.jpg","publishedAt":"2019-04-23T03:36:30Z","content":"Joshua A. Douglas is a law professor at the University of Kentucky College of Law who specializes in election law, voting rights, and constitutional law. He is the author of Vote for US: How to Take Back Our Elections and Change the Future of Voting. Find him… [+6239 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Tomo Uetake","title":"Asian shares steady after Easter weekend; oil hits 2019 highs","description":"Asian shares were little changed on Tuesday, hovering not far from nine-month peaks hit last week, with concerns China may slow the pace of policy easing curbing the market's enthusiasm.","url":"https://www.reuters.com/article/us-global-markets-idUSKCN1RZ02C","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20190423&t=2&i=1379667807&w=1200&r=LYNXNPEF3M00X","publishedAt":"2019-04-23T01:13:20Z","content":"TOKYO (Reuters) - Asian shares were little changed on Tuesday, hovering not far from nine-month peaks hit last week, with concerns China may slow the pace of policy easing curbing the market’s enthusiasm. \r\nMSCI’s broadest index of Asia-Pacific shares outside… [+2438 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Danielle Kurtzleben","title":"Democrats Consider: Is A White, Straight Man The Safe Bet Against Trump?","description":"Six months after electing a diverse wave of women to Congress, \"electability\"-minded Democrats fear the country isn't ready for a woman, person of color or LGBTQ presidential candidate.","url":"https://www.npr.org/2019/04/23/715967411/democrats-consider-is-a-white-straight-man-the-safe-bet-against-trump","urlToImage":"https://media.npr.org/assets/img/2019/04/22/gettyimages-1137904875_wide-db46fe5c9dc6e536341055ae37b403b026552857.jpg?s=1400","publishedAt":"2019-04-23T16:06:44Z","content":"Former Vice President Joe Biden leaves after addressing striking workers at the Stop &amp; Shop in the Dorchester neighborhood of Boston on April 18. He's expected to launch a presidential campaign within days.\r\nBoston Globe/Boston Globe via Getty Images\r\nTal… [+7599 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Jonathan Garber","title":"10 things you need to know before the opening bell (SPY, SPX, QQQ, DIA, SNAP, TSLA)","description":"Here is what you need to know. Oil hit a 6-month high. West Texas Intermediate crude oil gained as much as 0.74% Tuesday morning, hitting a high of $66.19 a barrel. Herman Cain withdraws from Fed consideration because of the money. \"Without getting too specif…","url":"https://www.businessinsider.com/stock-market-news-opening-bell-april-23-2019-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbeefaa4a167511741dff94-2732-1366.jpg","publishedAt":"2019-04-23T10:58:00Z","content":"Here is what you need to know. \r\n Oil hit a 6-month high. West Texas Intermediate crude oil gained as much as 0.74% Tuesday morning, hitting a high of $66.19 a barrel. \r\n Herman Cain withdraws from Fed consideration because of the money. \"Without getting too … [+1977 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Gili Malinsky","title":"Senator Elizabeth Warren called for massive student debt relief. Here’s the average student loan debt in every state.","description":"Senator Elizabeth Warren, a Democratic presidential candidate, proposed canceling up to $50,000 in student-loan debt for 42 million Americans. Overall, her plan would account for canceling as much as $640 billion in student debt. According to the Department o…","url":"https://www.businessinsider.com/student-loan-debt-per-state-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf21d0b14bf419f81267e5-2732-1366.jpg","publishedAt":"2019-04-23T14:36:32Z","content":null},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Susanna Heller","title":"A maid of honor says that she had to care for 90 goldfish that were purchased as wedding favors — here's why experts warn against using animals as gifts","description":"In a now-viral Reddit post in r/Bridezillas, a woman claims she was the maid of honor at a wedding where goldfish were the centerpiece, and were intended to be party favors, despite the couple not providing the proper vessels to take the fish home. She said o…","url":"https://www.thisisinsider.com/experts-respond-to-reddit-post-goldfish-wedding-party-favors-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf66f7d2ce78380c6344f0-2732-1366.jpg","publishedAt":"2019-04-23T19:25:45Z","content":"From a woman who asked that everyone at her wedding eat vegan to a wedding planner who sent out a shocking list of wedding day \"rules and regulations,\" Reddit has no shortage of wedding stories that are outlandish, startling, and ridiculous. \r\n In a post that… [+3910 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Mark Frauenfelder","title":"Tire chalking by parking enforcement is unconstitutional, rules federal court","description":"Parking enforcement officers who mark car tires with chalk are guilty of violating the 4th Amendment, according to a new ruling by a federal appeals court. The three-judge panel likened the practice to that of police attaching a GPS device to a car without th…","url":"https://boingboing.net/2019/04/23/tire-chalking-by-parking-enfor.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/shutterstock_1145834270.jpg","publishedAt":"2019-04-23T16:23:51Z","content":"I own a DJI Spark. It’s not the most expense drone out there, but it’s a good one. I love its ability to take video and photos from angles that I could never manage from the ground. I do not, however, love the fact that law enforcement officials in the United… [+1601 chars]"},{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Rachel Kaser","title":"Mortal Kombat 11 sneaks in some jabs at President Trump","description":"Of all the things I expected to see and hear when playing the newest entry in the Mortal Kombat series — and, given this series’ reputation, I was expecting the most — sly digs at American president #45 were pretty low on the list. But developer Netherrealm S…","url":"https://thenextweb.com/?p=1201394","urlToImage":"https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F04%2FMK-MAGA-hat.jpg&signature=316dcda17887555a04a1007b0fb2b779","publishedAt":"2019-04-23T22:38:39Z","content":"Of all the things I expected to see and hear when playing the newest entry in the Mortal Kombat series and, given this series reputation, I was expecting the most sly digs at American president #45 were pretty low on the list. But developer Netherrealm Studio… [+3451 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"KC Ifeanyi","title":"Feeling anxious about that stack of books you haven’t read? This video wants to help you","description":"Just in time for World Book Day, filmmaker Max Joseph delivers a visual essay that will soothe your reading FOMO. A recent study found that we spend more than a quarter of the day engaging with digital content. That means, on average, 8.8 hours a day are spen…","url":"https://www.fastcompany.com/90338659/feeling-anxious-about-that-stack-of-books-you-havent-read-this-video-wants-to-help-you?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-max-joseph-world-book-day.jpg","publishedAt":"2019-04-23T12:25:03Z","content":"A recent study found that we spend more than a quarter of the day engaging with digital content. That means, on average, 8.8 hours a day are spent on social media, watching videos, listening to podcasts, etc. And that number only increases with younger genera… [+3342 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Gwen Moran","title":"The cost of childcare is ridiculous. Here’s how some parents are making it work","description":"When 26% of parents go into debt to pay for childcare and it can even cost more than rent, there’s clearly something wrong. The first time I walked into Kim Perrelli’s office in Ocean Township, New Jersey, it was hard not to notice the babies. Perrelli is exe…","url":"https://www.fastcompany.com/90333589/the-cost-of-childcare-is-ridiculous-heres-how-some-parents-are-making-it-work?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-2-the-cost-of-childcare-is-ridiculous-heres-how-some-parents-are-making-it-work.jpg","publishedAt":"2019-04-23T08:00:31Z","content":"The first time I walked into Kim Perrelli’s office in Ocean Township, New Jersey, it was hard not to notice the babies. Perrelli is executive director of Child Care Resources of Monmouth County, a nonprofit that helps people access affordable childcare. While… [+5779 chars]"},{"source":{"id":null,"name":"Hackaday.com"},"author":"Ted Yapo","title":"Component Shelf Life: How To Use All That Old Junk","description":"There are two types of Hackaday readers: those that have a huge stock of parts they’ve collected over the years (in other words, an enormous pile of junk) and those that will have one a couple of decades from now. It’s easy to end up with a lot of stuff, …rea…","url":"https://hackaday.com/2019/04/23/component-shelf-life-how-to-use-all-that-old-junk/","urlToImage":"https://hackaday.com/wp-content/uploads/2019/04/ComponentShelfLife.jpg","publishedAt":"2019-04-23T17:01:22Z","content":"There are two types of Hackaday readers: those that have a huge stock of parts they’ve collected over the years (in other words, an enormous pile of junk) and those that will have one a couple of decades from now. It’s easy to end up with a lot of stuff, espe… [+11020 chars]"},{"source":{"id":"time","name":"Time"},"author":"Cedar Attanasio / AP","title":"Leader of Border Militia Claimed to Be Training to Assassinate Clinton, Obama and Soros, FBI Says","description":"The leader of an armed group that detained asylum-seekers near the border said he was training supporters to kill Obama, Clinton and Soros","url":"http://time.com/5575949/armed-group-migrant-mexico-assassination/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/u.s.-mexico-border-fence-militia.jpg?quality=85","publishedAt":"2019-04-23T03:33:13Z","content":"(LAS CRUCES, N.M.) — The leader of an armed group that has been detaining asylum-seeking families from Central America near the Mexican border said two years ago that he was training supporters to assassinate Hillary Clinton, Barack Obama and billionaire Demo… [+3225 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Militants blamed in Sri Lanka attacks had incendiary leader","description":"COLOMBO, Sri Lanka (AP) — The purported leader of an Islamic extremist group blamed for an Easter attack in Sri Lanka that killed over 320 people began posting videos online three years ago calling for non-Muslims to be \"eliminated,\" faith leaders said Tuesda…","url":"https://news.yahoo.com/militants-blamed-sri-lanka-attacks-had-incendiary-leader-070108421.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Y06I9VNwqbdtWet7taI0Yg--~B/aD0xMTYyO3c9MjMxMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/9f7dd745a7064f099ad74213f3ad7ed1.jpg","publishedAt":"2019-04-23T15:55:12Z","content":"COLOMBO, Sri Lanka (AP) The purported leader of an Islamic extremist group blamed for an Easter attack in Sri Lanka that killed over 320 people began posting videos online three years ago calling for non-Muslims to be \"eliminated,\" faith leaders said Tuesday.… [+3787 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Igor Bobic","title":"Beto O’Rourke’s Non-Media Strategy","description":"The Texas Democrat is betting that interacting with voters face-to-face rather than via television can propel him to the Democratic presidential nomination.","url":"https://www.huffpost.com/entry/beto-orourke-2020-media_n_5cbf1bd1e4b0f7a84a753b99","urlToImage":"https://img.huffingtonpost.com/asset/5cbf26911f0000c6007f2260.jpeg?cache=qB4tXBpQfF&ops=1200_630","publishedAt":"2019-04-23T18:20:36Z","content":"More than seven weeks after announcing his campaign for president in 2020, former Texas congressman Beto O’Rourke has visited 12 states and the District of Columbia, held 103 events in 81 cities, and answered 594 questions from voters, per his campaign.\r\nBut … [+3732 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Max Golembo","title":"Southern Plains brace for more severe weather, flooding","description":"Texas is expecting heavy rain the next several days.","url":"https://abcnews.go.com/US/southern-plains-brace-severe-weather-flooding/story?id=62570090","urlToImage":"https://s.abcnews.com/images/US/weather-ap-190422_hpMain_16x9_992.jpg","publishedAt":"2019-04-23T10:24:52Z","content":"Severe storms moved through western Texas and parts of the Midwest overnight, delivering hail, damaging winds, flooding and at least two reported tornadoes.\r\nInterested in Weather?\r\nAdd Weather as an interest to stay up to date on the latest Weather news, vid… [+610 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP, AP","title":"Town reflects on dragging death before execution","description":"A Texas town and family is still haunted by a gruesome hate crime in which a black man was dragged behind a pickup truck and killed by three white men nearly 21 years ago. The ringleader behind that murder is scheduled for execution this week. (April 23)","url":"https://www.usatoday.com/videos/news/nation/2019/04/23/town-reflects-dragging-death-before-execution/3550534002/","urlToImage":"https://mp4media.gannett-cdn.com/28911775001/28911775001_6029115721001_6029110314001-vs.jpg?pubId=28911775001","publishedAt":"2019-04-23T17:25:37Z","content":null},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"SMU basketball signs 3 transfers to join program next season","description":"Transfer players Isiah Jasey, Tyson Jolly and Darius McNeill have signed with SMU and will join the program next season","url":"https://www.usatoday.com/story/sports/ncaab/2019/04/22/smu-basketball-signs-3-transfers-to-join-program-next-season/39381039/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-23T00:41:24Z","content":"DALLAS (AP) Transfer players Isiah Jasey, Tyson Jolly and Darius McNeill have signed with SMU and will join the program next season.\r\nCoach Tim Jankovich announced the signings Monday.\r\nJolly is a 6-foot-4 guard who played 20 games at Baylor as a freshman in … [+843 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"New LSU AD Woodward initially supportive of embattled Wade","description":"New LSU athletic director Scott Woodward began his tenure at his alma mater by asserting he would throw \"100 percent support\" behind recently reinstated men's basketball coach Will Wade","url":"https://www.usatoday.com/story/sports/ncaab/2019/04/23/new-lsu-ad-woodward-initially-supportive-of-embattled-wade/39386207/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/3d118c2af7e8050c49bf4965df2c1108805d6323/c=0-586-3746-2693/local/-/media/2019/04/23/USATODAY/usatsports/2dbe1f8ff9144702a146f1c54425298f.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-23T23:41:27Z","content":"BATON ROUGE, La. (AP) New LSU athletic director Scott Woodward began his tenure at his alma mater by asserting he would throw \"100 percent support\" behind recently reinstated basketball coach Will Wade unless he's presented with new information that forces hi… [+3434 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Pirates place Nick Burdi on IL with biceps, elbow pain","description":"Reliever Nick Burdi has been placed on the 10-day injured list by the Pittsburgh Pirates with pain in his right biceps and elbow","url":"https://www.usatoday.com/story/sports/mlb/2019/04/23/pirates-place-nick-burdi-on-il-with-biceps-elbow-pain/39384947/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/06da9d358c3184cee8bd7f9534487b582cc7f4be/c=0-166-2000-1291/local/-/media/2019/04/23/USATODAY/usatsports/ecc06426a4c14b658341d211564ce50e.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-23T20:17:14Z","content":"PITTSBURGH (AP) Reliever Nick Burdi has been placed on the 10-day injured list by the Pittsburgh Pirates with pain in his right biceps and elbow.\r\nBurdi grabbed his arm in pain after a pitch in the seventh inning of Pittsburgh's 12-4 loss to Arizona on Monday… [+564 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"Iconic Batman Comic Book Covers Are Becoming Limited Edition Posters","description":"Framing a comic book and putting it on the wall may look good, but certain issues deserve to be showcased in a bigger and better way. Especially iconic covers from throughout history, and Mondo is doing just that. Read more...","url":"https://io9.gizmodo.com/iconic-batman-comic-book-covers-are-becoming-limited-ed-1834247370","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--womeL9qz--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ylpu0nyghxzycmigafv4.jpg","publishedAt":"2019-04-23T19:25:00Z","content":"Framing a comic book and putting it on the wall may look good, but certain issues deserve to be showcased in a bigger and better way. Especially iconic covers from throughout history, and Mondo is doing just that.\r\nTo celebrate the 80th anniversary of Batman,… [+1193 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Whitney Pirtle","title":"The Other Segregation","description":"The public focuses its attention on divides between schools, while tracking has created separate and unequal education systems within single schools.","url":"https://www.theatlantic.com/education/archive/2019/04/gifted-and-talented-programs-separate-students-race/587614/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_828598778/facebook.jpg?1555698129","publishedAt":"2019-04-23T16:06:13Z","content":"The segregation of America’s public schools is a perpetual newsmaker. The fact that not even 1 percent of the incoming freshman class identifies as black at New York City’s elite Stuyvesant High School made national headlines last month. And New York isn’t un… [+8052 chars]"},{"source":{"id":null,"name":"Buzzfeednews.com"},"author":"Lissandra Villa","title":"Julián Castro Says Democrats Should Be Able To “Press The Case For Impeachment” And Run For President","description":"Castro also suggested he'll be able to outlast other 2020 Democratic candidates in an interview with BuzzFeed News's AM to DM Tuesday. View Entire Post ›","url":"https://www.buzzfeednews.com/article/lissandravilla/julian-castro-impeachment-trump-2020-primary","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2019-04/23/12/campaign_images/buzzfeed-prod-web-06/julian-castro-says-democrats-should-be-able-to-pr-2-22113-1556035633-0_dblbig.jpg","publishedAt":"2019-04-23T16:07:55Z","content":"WASHINGTON Julián Castro, the former secretary of Housing and Urban Development and a 2020 presidential candidate, doubled down on his support for impeaching President Donald Trump Tuesday, arguing Democrats should be able to walk and chew gum at the same tim… [+2546 chars]"},{"source":{"id":null,"name":"Popsci.com"},"author":"Nicole Wetsman, Nicole Wetsman","title":"Doctors can ignore your DNR order if you're pregnant","description":"Health Laws around the country restrict treatment decisions for incapacitated women who are also pregnant. An analysis, published today in the Journal of the American Medical Association, identified laws around the country that restrict treatment decisions fo…","url":"https://www.popsci.com/pregnant-women-advance-directive","urlToImage":"https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/04/pregnant_woman.jpg?itok=3JrcrFJG","publishedAt":"2019-04-23T22:00:00Z","content":"In 2014, a Texas hospital refused to remove a woman who was declared brain-dead after suffering a blood clot from life supporteven though, according to her family and husband, she had made it clear that she didnt want to remain on a ventilator. The hospital r… [+5238 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Silvia Ascarelli, Catey Hill","title":"Here’s exactly where you should retire — based on what’s important to you","description":"Tell MarketWatch what you want in retirement, and we’ll tell you where to live.","url":"https://www.marketwatch.com/story/heres-exactly-where-you-should-retire-based-on-whats-important-to-you-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HE982_sunset_ZG_20190304133917.jpg","publishedAt":"2019-04-23T10:00:12Z","content":"You finally get to choose where you want to live. Not somewhere because of work. Not because of the kids and school. Its time to retire and pick a place to enjoy for a few decades.\r\nNow you need to find the metro area that will make you happy.\r\nWe know this i… [+2826 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Aaron Hankin","title":"Currencies: Rising oil prices can’t mask tepid growth ahead of Bank of Canada meeting","description":"The Bank of Canada is widely tipped to leave interest rates unchanged on Wednesday when policy makers convene for the April central bank meeting.","url":"https://www.marketwatch.com/story/rising-oil-prices-cant-mask-tepid-growth-ahead-of-bank-of-canada-meeting-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI042_canada_ZG_20190422133450.jpg","publishedAt":"2019-04-23T12:57:30Z","content":"The Bank of Canada is widely expected to leave interest rates unchanged on Wednesday when policy makers convene for the April central bank meeting. \r\nThe BOC is one of a handful of G-10 central banks to have raised rates over the past two years lifting its po… [+2703 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Sunny Oh","title":"Market Extra: Oil’s rally challenges bond investors’ dim global economic outlook, says strategist","description":"If the steady climb in oil prices reflects increased global demand, bond-market bulls could be in for a nasty surprise.","url":"https://www.marketwatch.com/story/oils-rally-challenges-bond-investors-dim-global-economic-outlook-says-strategist-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI097_oilref_ZG_20190423112241.jpg","publishedAt":"2019-04-23T22:40:13Z","content":"What is a steady rise in crude-oil prices telling investors about the health of the global economy? That is the question some bond investors are assessing, amid a recent rally in crude futures.\r\nArnim Holzer, a global macro strategist at EAB Investment Group,… [+3233 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"William Watts","title":"Market Extra: Strait of Hormuz: Oil ‘choke point’ in focus as U.S. ends Iran oil waivers","description":"Geography could matter for investors around the world if Tehran moves to close or at least hinder the world’s busiest waterway for global oil shipments in retaliation for the U.S. decision to demand that all Iran oil buyers halt purchases by May 1.","url":"https://www.marketwatch.com/story/strait-of-hormuz-oil-choke-point-in-focus-as-us-ends-iran-oil-waivers-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI109_hormuz_ZG_20190423131039.jpg","publishedAt":"2019-04-23T19:49:20Z","content":"Geography could matter for investors around the world if Tehran moves to close or at least hinder the worlds busiest waterway for global oil shipments in retaliation for the U.S. decision Monday to demand that all Iran oil buyers halt purchases by May 1.\r\nRea… [+3544 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"MJ Hegar launches 2020 Senate run against Texas' John Cornyn","description":"AUSTIN, Texas (AP) — Democrat MJ Hegar, an Air Force veteran whose viral campaign ads nearly helped her get elected in one of Texas' most Republican-friendly congressional districts last year, set her sights higher on Tuesday and launched a run for U.S. Senat…","url":"https://news.yahoo.com/mj-hegar-launches-2020-senate-run-against-texas-134516993--election.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/ohC7lgNtySjVelKevIhXaA--~B/aD0yMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/991eb2499ccc4b498c6762ec0c5c52ab.jpg","publishedAt":"2019-04-23T17:14:01Z","content":"AUSTIN, Texas (AP) Democrat MJ Hegar, an Air Force veteran whose viral campaign ads nearly helped her get elected in one of Texas' most Republican-friendly congressional districts last year, set her sights higher on Tuesday and launched a run for U.S. Senate … [+2844 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Two more defendants agree to plead guilty in college admissions bribery case","description":"A former women's soccer assistant coach at USC and another parent have agreed to plead guilty in the nation's college admissions bribery case.","url":"https://news.yahoo.com/two-more-defendants-agree-plead-162534373.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/AZnV6aaHlihpEFTtX1h0xw--~B/aD0zMDgyO3c9NDA4OTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/usa_today_news_641/dcc1dccd3236d7245d2e05b62e5e55dc","publishedAt":"2019-04-23T17:15:28Z","content":"BOSTON Two more defendants  a former women's soccer assistant coach at the University of Southern California and a parent have agreed to plead guilty in the nation's college admissions cheating and bribery case. \r\nLaura Janke, former USC coach, and Toby MacFa… [+3702 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Myra P. Saefong, Rachel Koning Beals","title":"Futures Movers: Oil extends push to multimonth highs as Iran waiver move raises supply uncertainty","description":"Oil prices remained elevated in Tuesday action, marking another fresh high for the year, as markets extend their reaction to tougher action against Iran from the U.S.","url":"https://www.marketwatch.com/story/oil-extends-push-to-multimonth-highs-as-iran-waiver-move-raises-supply-uncertainty-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI064_iran_o_ZG_20190423055325.jpg","publishedAt":"2019-04-23T10:43:18Z","content":"Oil prices remained elevated in Tuesday action, marking another fresh high for the year, as markets extend their reaction to tougher action against Iran from the U.S.\r\nHigher oil prices were knocking U.S. stock futures\r\nYMM9, -0.07%\r\n  and other risk-on marke… [+4639 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Barbara Kollmeyer","title":"Need to Know: Forget spring, here’s a summer stock survival strategy from Deutsche","description":"Earnings obsessed? Our call of the day urges investors to move past what will likely be an uninspiring quarter or two of corporate results, and start thinking about how to preserve their investment gains in a market that has already risen strongly this year.","url":"https://www.marketwatch.com/story/forget-spring-heres-a-summer-stock-survival-strategy-from-deutsche-2019-04-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI065_summer_ZG_20190423065457.jpg","publishedAt":"2019-04-23T11:29:47Z","content":"If this equity market rally is going to keep grinding higher, then it needs a boost from one crucial category of stocks. Right?\r\nWell see if there is any truth to that this week when tech stocks start rolling out Twitter results (see below) just kicked that o… [+7013 chars]"},{"source":{"id":null,"name":"Theregister.co.uk"},"author":"Max Smolaks","title":"Whose cloud is it anyway? Apple sinks $30m a month into rival Amazon's AWS – report","description":"iPhone maker set to feed competitor even more dollars over the next five years Apple has been identified as the largest customer of Amazon Web Services, splashing tens of millions of dollars each month on public cloud infrastructure supplied by its rival.…","url":"https://www.theregister.co.uk/2019/04/23/apple_huge_aws_customer/","urlToImage":"https://regmedia.co.uk/2015/08/14/apple_836435.jpg","publishedAt":"2019-04-23T12:12:23Z","content":"Apple has been identified as the largest customer of Amazon Web Services, splashing tens of millions of dollars each month on public cloud infrastructure supplied by its rival.\r\nAmazon competes with Apple in the mobile device market with its Kindle Fire table… [+2622 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"A viper’s tooth in ancient human poo hints at snake-eating rituals","description":"Prehistoric feces found in Texas includes scales, bones and a fang.","url":"https://www.nature.com/articles/d41586-019-01281-9?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01281-9/d41586-019-01281-9_16665130.jpg","publishedAt":"2019-04-24T00:00:00Z","content":"Some 23 million girls worldwide were never born because of the use of sex-selective abortions during the past half-century.\r\nChina and India account for the vast majority of these missing girls, with 11.9 million and 10.6 million, respectively.\r\nFengqing Chao… [+832 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Tilli Tansey","title":"Plague in San Francisco: rats, racism and reform","description":"Tilli Tansey extols a history of California’s chaotic early-twentieth-century epidemic.","url":"https://www.nature.com/articles/d41586-019-01239-x?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01239-x/d41586-019-01239-x_16656448.jpg","publishedAt":"2019-04-24T00:00:00Z","content":"Mass autopsies of rats were crucial to ending San Franciscos bubonic-plague epidemic.Credit: The National Library of Medicine/Centers for Disease Control\r\nBlack Death at the Golden Gate: The Race to Save America from the Bubonic PlagueDavid K. Randall W. W. N… [+7588 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Yuya Ashida, Kazuya Arashiba, Kazunari Nakajima, Yoshiaki Nishibayashi","title":"Molybdenum-catalysed ammonia production with samarium diiodide and alcohols or water","description":"The molybdenum-catalysed reduction of nitrogen to ammonia is achieved under ambient conditions, using samarium(ii) diiodide in combination with either simple alcohols or water as the proton source.","url":"https://www.nature.com/articles/s41586-019-1134-2?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-019-1134-2/MediaObjects/41586_2019_1134_Fig1_HTML.png","publishedAt":"2019-04-24T00:00:00Z","content":"1.Liu, H. Ammonia Synthesis Catalysts: Innovation and Practice (World Scientific, Beijing, 2013).\r\n2.Yandulov, D. V. &amp; Schrock, R. R. Catalytic reduction of dinitrogen to ammonia at a single molybdenum center. Science301, 7678 (2003).\r\n3.Nishibayashi, Y. … [+6758 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":null,"title":"A viper’s tooth in ancient human poo hints at snake-eating rituals","description":"Prehistoric feces found in Texas includes scales, bones and a fang.","url":"https://www.nature.com/articles/d41586-019-01281-9","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01281-9/d41586-019-01281-9_16665130.jpg","publishedAt":"2019-04-24T00:00:00Z","content":"Some 23 million girls worldwide were never born because of the use of sex-selective abortions during the past half-century.\r\nChina and India account for the vast majority of these missing girls, with 11.9 million and 10.6 million, respectively.\r\nFengqing Chao… [+832 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Yuya Ashida, Kazuya Arashiba, Kazunari Nakajima, Yoshiaki Nishibayashi","title":"Molybdenum-catalysed ammonia production with samarium diiodide and alcohols or water","description":"The molybdenum-catalysed reduction of nitrogen to ammonia is achieved under ambient conditions, using samarium(ii) diiodide in combination with either simple alcohols or water as the proton source.","url":"https://www.nature.com/articles/s41586-019-1134-2","urlToImage":"https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-019-1134-2/MediaObjects/41586_2019_1134_Fig1_HTML.png","publishedAt":"2019-04-24T00:00:00Z","content":"1.Liu, H. Ammonia Synthesis Catalysts: Innovation and Practice (World Scientific, Beijing, 2013).\r\n2.Yandulov, D. V. &amp; Schrock, R. R. Catalytic reduction of dinitrogen to ammonia at a single molybdenum center. Science301, 7678 (2003).\r\n3.Nishibayashi, Y. … [+6758 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Tilli Tansey","title":"Plague in San Francisco: rats, racism and reform","description":"Tilli Tansey extols a history of California’s chaotic early-twentieth-century epidemic.","url":"https://www.nature.com/articles/d41586-019-01239-x","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01239-x/d41586-019-01239-x_16656448.jpg","publishedAt":"2019-04-24T00:00:00Z","content":"Mass autopsies of rats were crucial to ending San Franciscos bubonic-plague epidemic.Credit: The National Library of Medicine/Centers for Disease Control\r\nBlack Death at the Golden Gate: The Race to Save America from the Bubonic PlagueDavid K. Randall W. W. N… [+7588 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Kelly Faircloth","title":"America's Favorite Mall Jewelry Company Has Allegedly Treated Women Like Dirt for Decades","description":"The New York Times Magazine has published a lengthy expose into the corporate culture of Sterling Jewelers Inc, a corporation which dominates the mall jewelry business with brands like Jared and Kay. It is not pretty. Read more...","url":"https://jezebel.com/americas-favorite-mall-jewelry-company-has-allegedly-tr-1834241143","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--OrTQx-94--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/nxgoin7khnof79dtjm6j.jpg","publishedAt":"2019-04-23T17:30:00Z","content":"The New York Times Magazine has published a lengthy expose into the corporate culture of Sterling Jewelers Inc, a corporation which dominates the mall jewelry business with brands like Jared and Kay. It is not pretty. \r\nThe Washington Post initially broke the… [+3566 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Raphael Orlove","title":"Trump Is Still Screwing With Harley-Davidson","description":"Tesla’s got the chips, Uber is getting beaten by an Estonian startup, and Porsche is leaning in on tech from China. All that and so much more for The Morning Shift of Tuesday, April 23, 2019. Read more...","url":"https://jalopnik.com/trump-is-still-screwing-with-harley-davidson-1834238415","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--MoHSnDqI--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/uhpocahupjqkzzwfvbpd.jpg","publishedAt":"2019-04-23T14:12:00Z","content":"Teslas got the chips, Uber is getting beaten by an Estonian startup, and Porsche is leaning in on tech from China. All that and so much more for The Morning Shift of Tuesday, April 23, 2019.\r\n1st Gear: Trump Tries To Claim Hes On Harleys Side After Trashing I… [+8446 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"LISA FRIEDMAN","title":"Interior Department Launches Investigation of Potential Ethics Violations Among Staff","description":"The new probe of midlevel Interior Department staff follows an earlier investigation to examine some of the practices of Interior Secretary David Bernhardt, shown above testifying before the Senate.","url":"https://www.nytimes.com/2019/04/23/climate/interior-department-ethics-investigation.html","urlToImage":"https://static01.nyt.com/images/2019/04/23/science/23cli-interior/23cli-interior-facebookJumbo.jpg","publishedAt":"2019-04-23T18:41:30Z","content":"Ms. Vander Voort also declined a request for individual comments from the staff members named in the Campaign Legal Centers complaint, saying, As a general rule, we do not comment on specific personnel matters.\r\nCorey Goldstone, a spokesman for the Campaign L… [+1082 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Ben Pearson","title":"Mondo to Celebrate Batman’s 80th Birthday with a New Bat-Centric Gallery Show","description":"Holy octogenarian, Batman! The Caped Crusader first debuted in the pages of Detective Comics back in 1939, which makes him 80 years old this year. To celebrate the anniversary, Mondo Gallery in Austin, Texas is hosting a brand new show called 80 Years of Batm…","url":"https://www.slashfilm.com/mondo-batman/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Mondo-Batman-art-show.jpg","publishedAt":"2019-04-23T19:30:57Z","content":"Holy octogenarian, Batman! The Caped Crusader first debuted in the pages of Detective Comics back in 1939, which makes him 80 years old this year. To celebrate the anniversary, Mondo Gallery in Austin, Texas is hosting a brand new show called 80 Years of Batm… [+1835 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Lexie Schapitl","title":"Vox’s guide to where 2020 Democrats stand on policy","description":"Keep up with the latest proposals from Bernie Sanders, Joe Biden, Elizabeth Warren, and the rest of the field.","url":"https://www.vox.com/policy-and-politics/2019/4/23/18304657/vox-guide-2020-democratic-policy-primary","urlToImage":"https://cdn.vox-cdn.com/thumbor/_UdocoUhGtIZBs0nlXh3Lggrxgg=/97x0:2160x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13729163/PRIMARIES_lead_jan31.jpg","publishedAt":"2019-04-23T13:52:00Z","content":"Keep up with the policy debates that will shape the Democratic 2020 primary. The 2020 primary season is well underway, and Democratic veterans and newcomers alike are lining up to challenge President Donald Trump. Sens. Bernie Sanders, Elizabeth Warren, and K… [+908 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"jarkin@politico.com (James Arkin)","title":"Hegar launches Texas Senate bid against Cornyn","description":"The Air Force veteran is the first major Democratic candidate to enter the race.","url":"https://www.politico.com/story/2019/04/23/mj-hegar-texas-senate-cornyn-1375117","urlToImage":"https://static.politico.com/0f/59/a169262243e8b9243803841ee18c/190423-mj-hegar-gty-773.jpg","publishedAt":"2019-04-23T13:53:01Z","content":"MJ Hegar could be part of a crowded primary against Sen. John Cornyn, which some Democrats fear could hurt their chances of defeating the Senator. | Suzanne Cordeiro/Getty Images\r\nDemocrat MJ Hegar, an Air Force veteran, launched her campaign against Sen. Joh… [+2993 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"mchoi@politico.com (Matthew Choi)","title":"Trump's Monday night retweeting blitz","description":"The president is known for an almost stream of consciousness on his Twitter, but Monday's rapid-fire retweets stood out.<br />","url":"https://www.politico.com/story/2019/04/22/trumps-monday-night-retweeting-blitz-1287204","urlToImage":"https://static.politico.com/92/28/c54768154c2a88fb168c8e269afa/190422-donald-trump-phone-gty-773.jpg","publishedAt":"2019-04-23T02:06:16Z","content":"President Donald Trump retweeted a litany of tweets on a vast array of topics, one going back as far as last year. | Win McNamee/Getty Images\r\nPresident Donald Trump undertook a retweeting blitz on Monday night, surfacing 24 posts in about 30 minutes that wen… [+2411 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"dsiders@politico.com (David Siders)","title":"Biden, Beto falter in new progressive straw poll","description":"The poll reveals Sanders is comfortably in the lead among progressive activists.","url":"https://www.politico.com/story/2019/04/23/biden-beto-falter-in-progressive-straw-poll-1287105","urlToImage":"https://static.politico.com/ea/43/19043ed9498882e36200deb0b37e/190422-beto-orourke-ap-773.jpg","publishedAt":"2019-04-23T04:01:18Z","content":"Beto O'Rourke and Joe Biden's support among progressive activists at Democracy for America has fallen steeply, according to a poll. | Jose Luis Magana/AP Photo\r\nBernie Sanders has solidified his front-runner standing among members of the progressive political… [+3144 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"eokun@politico.com (Eli Okun)","title":"POLITICO Playbook PM: Pence’s trip to tout trade","description":"And Jared Kushner says the Russia investigation was more harmful to the U.S. than election interference.","url":"https://www.politico.com/newsletters/playbook-pm/2019/04/23/pences-trip-to-tout-trade-427809","urlToImage":"https://static.politico.com/a1/a3/81df4a064869a3f7c5aa645edd7b/190423-pence-ap-773.jpg","publishedAt":"2019-04-23T17:05:14Z","content":"Vice President Mike Pence gives a thumbs up at a Wounded Warrior Project Soldier Ride event on Thursday, April 18. | Pablo Martinez Monsivais/AP Photo\r\nNEW TRACKING TRADE, THE PRESIDENTS TOP LEGISLATIVE PRIORITY VP MIKE PENCE is embarking Wednesday on the adm… [+14347 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Megan Armstrong","title":"4-Star G Anthony Harris Commits to UNC Hours After 5-Star G Cole Anthony","description":"The North Carolina Tar Heels are having a good day as two of the nation's top boys basketball prospects committed to play under Roy Williams within hours of each other...","url":"https://bleacherreport.com/articles/2832785-4-star-g-anthony-harris-commits-to-unc-hours-after-5-star-g-cole-anthony","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/470/a7e990c726051e106d647b15098ad7bf_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-23T23:26:39Z","content":"Source: 247Sports\r\nThe North Carolina Tar Heels are having a good day as two of the nation's top boys basketball prospects committed to play for Roy Williams within hours of each other. \r\nFollowing 5-star guard Cole Anthony's announcement Tuesday morning on E… [+697 chars]"},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Al Jazeera","title":"US: Couple get 7 years in prison each for enslaving Guinean girl","description":"The couple forced the girl to work without pay as a housekeeper, cook and nanny until she fled and alerted authorities.","url":"https://www.aljazeera.com/news/2019/04/couple-7-years-prison-enslaving-guinean-girl-190423194644817.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/4/23/18224e0d037542958e05fab98aeef34a_18.jpg","publishedAt":"2019-04-23T21:26:17Z","content":"A suburban Fort Worth couple has been sentenced to seven years in federal prison each for enslaving a Guinean girl for 16 years.\r\nA federal judge in Fort Worth, Texas, sentenced Mohamed Toure and Denise Cros-Toure each to two seven-year terms and one five-yea… [+1575 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Sarah Grant","title":"Texas Dem MJ Hegar Launches Campaign Against Sen. John Cornyn","description":"Former Democratic congressional candidate and Purple Heart veteran enters 2020 Senate race","url":"https://www.rollingstone.com/politics/politics-news/mj-hegar-texas-senate-2020-825908/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/mj-hegar-announces-senate-run.jpg","publishedAt":"2019-04-23T19:12:06Z","content":"MJ Hegar said during her 2018 House race that she relishes “insurmountable odds.” This morning, she lived up to her word by becoming the first Democrat to enter the 2020 Senate race in Texas against 20-year incumbent Sen. John Cornyn. The former Republican wh… [+2835 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Joseph Hudak","title":"Flashback: Hear Roy Orbison’s Rare Alternate Take of ‘Blue Bayou’","description":"Orbison would have turned 83 on Tuesday","url":"https://www.rollingstone.com/music/music-country/roy-orbison-blue-bayou-826287/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/shutterstock_1807031c.jpg","publishedAt":"2019-04-23T20:49:18Z","content":"Eighty-three years ago today, Roy Orbison was born in the North Texas town of Vernon. The singer with the darkly operatic voice would shine among the early architects of rock &amp; roll, emphasizing a gift for bold balladry in tunes such as “Running Scared,” … [+2308 chars]"},{"source":{"id":null,"name":"Thepointsguy.com"},"author":"Caroline Schagrin","title":"Talking Points Episode 19: American Airlines VP of Planning, Vasu Raja","description":"Vasu Raja, the Vice President of Planning at America Airlines is responsible for planning and scheduling the airline’s 6,500 daily flights. He joined us for one of the most AvGeek episodes yet. Raja shares details about growing Dallas/Fort Worth International…","url":"http://thepointsguy.com/news/talking-points-episode-19-american-airlines-vp-of-planning-vasu-raja/","urlToImage":"https://i2.wp.com/thepointsguy.com/wp-content/uploads/2019/04/20190422_AA-Photo-2.jpg?fit=2048%2C1536px&ssl=1","publishedAt":"2019-04-23T16:15:53Z","content":"Vasu Raja, the Vice President of Planning at America Airlines is responsible for planning and scheduling the airline’s 6,500 daily flights. He joined us for one of the most AvGeek episodes yet.\r\nRaja shares details about growing Dallas/Fort Worth Internationa… [+32386 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Michael Shapiro","title":"Report: Redskins QB Colt McCoy Recovering From Leg Procedure After Accelerated In-Season Rehab","description":"McCoy broke his fibula against the Eagles in Week 12 and missed the remainder of the regular season.","url":"https://www.si.com/nfl/2019/04/23/colt-mccoy-leg-procedure-redskins-quarterback-jay-gruden-accelerated-rehab","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/23/colt-mccoy-redskins-injury.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T19:04:21Z","content":"Redskins quarterback Colt McCoy is recovering from a third procedure on his left leg following a season-ending injury in December, according to NBC Sports Washington's JP Finlay. \r\nMcCoy fractured his fibula in a Week 12 loss to the Eagles in December 2018. H… [+996 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"90Min","title":"Yasser Corona hace campeones a los Xolos sub-17 de torneo en Estados Unidos","description":"News from around the web.","url":"https://www.si.com/soccer/2019/04/23/yasser-corona-hace-campeones-los-xolos-sub-17-de-torneo-en-estados-unidos","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/tijuana-v-leon-playoffs-torneo-apertura-2016-liga-mx-5cbecf33192ab386ec000001.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T13:30:01Z","content":"Los juveniles sub-17 de los Xolos se coronaron campeones del torneo Generation Adidas Cup en la división Premier celebrado en Estados Unidos, organizada por la MLS y con sede en Frisco, Texas. \r\nEl cuadro fronterizo terminó en primero del grupo A con 12 punto… [+1279 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Dan Gartland","title":"Tuesday’s Hot Clicks: Barry Zito Led an Awesome Energy-Efficient National Anthem for Earth Day","description":"It was eerily beautiful.","url":"https://www.si.com/extra-mustard/2019/04/23/tuesday-hot-clicks-barry-zito-oakland-athletics-national-anthem-earth-day-video","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/23/tuesday-hot-clicks-barry-zito-oakland-athletics-national-anthem-earth-day-video.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T12:08:34Z","content":"The undisputed best way to hear the national anthem at a sporting event is when its sung by all the fans. Usually that happens when theres some kind of mishap with the microphone, but the As did it on purpose last night before last nights game against the Ran… [+3818 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Joan Niesen","title":"Spring Football Risers: Who's Building Momentum for a Breakthrough 2019?","description":"Spring football is a time for new faces and surprise standouts. Which key players have boosted their 2019 expectations?","url":"https://www.si.com/college-football/2019/04/23/spring-practice-markese-stepp-sean-clifford","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/23/college-football-spring-risers-sean-clifford-kelly-bryant.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T16:33:29Z","content":"The school year is winding down at many colleges, and the last wave of spring games (with Washington, Virginia and a few more left to go in the final weekend of April) has given us a final glimpse of college football before the long wait until August. And alt… [+6428 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Jeremy Woo","title":"NBA Draft Big Board 6.0: Sizing Up the Top 100 Prospects Post Early-Entry Deadline","description":"With the early-entry deadline passed and the college basketball season long gone, it's time to take stock of the players remaining in the NBA draft. The Crossover extends its list of prospects to the top 100 in an effort to do so.","url":"https://www.si.com/nba/2019/04/23/nba-draft-2019-big-board-zion-williamson-ja-morant-rj-barrett","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/22/big_board_6.0._.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-23T13:24:09Z","content":"The NBAs early-entry deadline passed as Sunday turned into Monday, and with the official list of draft-eligible underclassmen finalized and college basketball season at an end, weve expanded The Crossovers Big Board from 80 to include 100 prospects. From here… [+76128 chars]"},{"source":{"id":null,"name":"R29.com"},"author":"Ludmila Leiva, written by Ludmila Leiva","title":"7 Millennials Share How Their Lives Would Change If Their Student Loans Were Forgiven","description":"On April 22, Sen. Elizabeth Warren announced a plan that has the power to dramatically alter the futures of countless Americans: student loan debt forgiveness. Sen. Warren's latest proposal would cancel $50,000 in student loan debt for those with household in…","url":"https://www.amate.r29.com/en-us/2019/04/230509/student-loan-forgiveness-debt-cancelled-millennials-reactions?utm_source=feed&utm_medium=rss","urlToImage":null,"publishedAt":"2019-04-23T16:55:27Z","content":null},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"TARIRO MZEZEWA","title":"United Airlines Employee Charged With Using Racial Slurs Toward Customer","description":"After a United Airlines employee was charged with disorderly conduct for allegedly using racial slurs, the company said it had “zero tolerance for discrimination of any kind.”","url":"https://www.nytimes.com/2019/04/22/travel/united-airlines-racism-black-woman.html","urlToImage":"https://static01.nyt.com/images/2019/04/22/travel/22united-travel/merlin_136961544_04187aed-67d0-44c5-a95d-681e7c3690c8-facebookJumbo.jpg","publishedAt":"2019-04-23T03:49:18Z","content":"A United Airlines employee accused of directing racial slurs at a customer has been charged in Texas with disorderly conduct, according to court documents. \r\nThe charge, a misdemeanor, was filed in Municipal Court for Houston in March, a month after the Houst… [+789 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Ryan Grim","title":"Beto O’Rourke Was Threatening to Run a New Kind of Campaign. Not Anymore.","description":"By parting ways with 2016 Bernie Sanders campaign alumni, O’Rourke took another step toward reshaping himself as a more mainstream candidate. The post Beto O’Rourke Was Threatening to Run a New Kind of Campaign. Not Anymore. appeared first on The Intercept.","url":"https://theintercept.com/2019/04/23/beto-orourke-campaign-advisers-bernie-sanders/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/AP_19107631886296-beto-1556045722-e1556045786468.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-23T20:40:36Z","content":"Beto ORourke started\r\n his presidential run with a nearly unprecedented asset: a trained and functioning ground operation, staffed and ready to deploy at the flick of a switch. When he lit it up on March 30, his campaign generated tens of thousands of text me… [+9709 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Ryan Devereaux","title":"The Bloody History of Border Militias Runs Deep — And Law Enforcement Is Part of It","description":"The Border Patrol appeared unconcerned when a border militia carrying AR-15s decorated with Punisher skulls captured hundreds of immigrants. The post The Bloody History of Border Militias Runs Deep — And Law Enforcement Is Part of It appeared first on The Int…","url":"https://theintercept.com/2019/04/23/border-militia-migrants/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/GettyImages-1132815926-1556035666-e1556035839344.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-23T17:24:41Z","content":"Customs and Border Protection, the agency that oversees the Border Patrol, provided The Intercept and several other news organizations with same statement when asked about the militias operations:\r\nU.S. Customs and Border Protection does not endorse private g… [+22628 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Robert Mackey","title":"Benjamin Netanyahu Plans to Honor Donald Trump By Putting His Name on Something Awful","description":"Israel’s prime minister has never shied away from intervening in American politics and seems eager to play a role in Donald Trump’s re-election campaign. The post Benjamin Netanyahu Plans to Honor Donald Trump By Putting His Name on Something Awful appeared f…","url":"https://theintercept.com/2019/04/23/netanyahu-trump-golan-heights-illegal-settlement/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/042319_trump-1556039621.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-23T18:51:45Z","content":"Israel’s prime minister\r\n, Benjamin Netanyahu, announced on Tuesday that he plans to name a new illegal settlement in the occupied Golan Heights in honor of Donald Trump, to thank the American president for agreeing to overlook the unlawful nature of Israel’s… [+4383 chars]"},{"source":{"id":null,"name":"Refinery29.com"},"author":"Ludmila Leiva, written by Ludmila Leiva","title":"7 Millennials Share How Their Lives Would Change If Their Student Loans Were Forgiven","description":"On April 22, Sen. Elizabeth Warren announced a plan that has the power to dramatically alter the futures of countless Americans: student loan debt forgiveness. Sen. Warren's latest proposal would cancel $50,000 in student loan debt for those with household in…","url":"https://www.refinery29.com/en-us/2019/04/230509/student-loan-forgiveness-debt-cancelled-millennials-reactions","urlToImage":"https://s1.r29static.com//bin/entry/8f8/0,675,2000,1050/x,80/2167125/7-millennials-share-how-their-2167125.jpg","publishedAt":"2019-04-23T16:55:27Z","content":"Skip navigation!We noticed you're in Canada, would you like to see your local site? Click on the flag above to switch.\r\nNow ReadingHow Debt Forgiveness Would Impact Millennials\r\nSen. Warren's latest proposal would cancel $50,000 in student loan debt for those… [+10318 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Adam Peck","title":"2020 Democrats are split on whether or not Congress should impeach Donald Trump","description":"Last week, the public finally learned the findings of special counsel Robert Mueller’s two-year investigation into the Trump campaign’s dealings with Russia and its efforts to obstruct the investigation itself. The details of the report were as damning as the…","url":"https://thinkprogress.org/2020-democrats-congress-impeach-trump-88666bde5393/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/2020_dems_impeach-02.png?w=1920&h=1080&crop=1","publishedAt":"2019-04-23T21:52:15Z","content":"Last week, the public finally learned the findings of special counsel Robert Mueller’s two-year investigation into the Trump campaign’s dealings with Russia and its efforts to obstruct the investigation itself.\r\nThe details of the report were as damning as th… [+7702 chars]"},{"source":{"id":"bloomberg","name":"Bloomberg"},"author":null,"title":"Texas Instruments' Forecast Stokes Optimism for a Chip Revival","description":null,"url":"https://www.bloomberg.com/tosv2.html?vid=&uuid=35fa6820-660a-11e9-a8e3-238e3801907c&url=L25ld3MvYXJ0aWNsZXMvMjAxOS0wNC0yMy90ZXhhcy1pbnN0cnVtZW50cy1mb3JlY2FzdC1zdG9rZXMtb3B0aW1pc20tZm9yLWNoaXAtcmV2aXZhbA==","urlToImage":null,"publishedAt":"2019-04-23T20:11:57Z","content":null},{"source":{"id":null,"name":"Webmd.com"},"author":"HealthDay","title":"U.S. Set to Break Measles Cases Record","description":"Just a few months into the year, the United States is set to break an annual record for the number of measles cases.","url":"https://www.webmd.com/children/news/20190423/us-set-to-break-measles-case-record","urlToImage":"https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/video/basics_measles_video/650x350_basics_measles_video.jpg","publishedAt":"2019-04-23T14:09:20Z","content":"April 23, 2019 -- Just a few months into the year, the United States is set to break an annual record for the number of measles cases.\r\nThe number of measles cases rose by 71 in the last week and now stands at 626 since Jan. 1, the Centers for Disease Control… [+1308 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/anna-giaritelli","title":"Rules under review...","description":"A senior defense official says the Pentagon is reviewing how U.S. soldiers responded during an incident this month in which a Mexican troops detained and disarmed Americans on Texas soil.","url":"https://www.washingtonexaminer.com/news/us-military-rules-under-review-after-soldiers-surrendered-pistol-to-mexican-troops-on-american-soil","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/8588e8e/2147483647/strip/true/crop/1060x557+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F43%2F27%2Fdf42e35b4547877e198dacf18db1%2Fap-18320806280628.jpg","publishedAt":"2019-04-23T02:04:37Z","content":"A senior defense official says the Pentagon is reviewing how U.S. soldiers responded during an incident this month in which a Mexican troops detained and disarmed Americans on Texas soil.\r\nThe standoff between two U.S. soldiers and as many as six Mexican mili… [+2879 chars]"},{"source":{"id":null,"name":"Conservativereview.com"},"author":"Daniel Horowitz","title":"UPDATE: Mexican soldiers detain American soldiers on U.S. soil...","description":"UPDATE: Mexican soldiers detain American soldiers on U.S. soil... (Third column, 3rd story, link ) Related stories: Leader of armed group stopping illegals at border to face federal charges... 'NOT BREAKING ANY LAWS'... 'Deep concern'... Advertise here","url":"https://www.conservativereview.com/news/mexican-soldiers-detain-american-soldiers-u-s-soil-government-response/","urlToImage":"https://www.conservativereview.com/wp-content/uploads/US-mexican-flags-on-pavement-sized.jpg","publishedAt":"2019-04-23T01:37:40Z","content":"The Mexican government is powerless to control the cartels at our border. But somehow when it comes to belligerently confronting our own soldiers on our own soil, the Mexicans seem to muster the personnel and temerity to defend their side of the border. Moreo… [+6782 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcription)","title":"Texas Instruments Inc (TXN) Q1 2019 Earnings Call Transcript","description":"TXN earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/investing/2019/04/23/texas-instruments-inc-txn-q1-2019-earnings-call-tr.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520281/featured-transcript-logo.png","publishedAt":"2019-04-23T23:14:21Z","content":"Image source: The Motley Fool.\r\nTexas Instruments Inc  (NASDAQ:TXN)Q1 2019 Earnings CallApril 23, 2019, 4:30 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day and welcome to the Texas Instrum… [+34985 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribing)","title":"Independent Bank Group (IBTX) Q1 2019 Earnings Call Transcript","description":"IBTX earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/independent-bank-group-ibtx-q1-2019-earnings-call.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520298/featured-transcript-logo.png","publishedAt":"2019-04-23T23:45:13Z","content":"Image source: The Motley Fool.\r\nIndependent Bank Group(NASDAQ:IBTX)Q1 2019 Earnings CallApril 23, 2019 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, ladies and gentlemen, and welcom… [+32852 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"PulteGroup Inc (PHM) Q1 2019 Earnings Call Transcript","description":"PHM earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/pultegroup-inc-phm-q1-2019-earnings-call-transcrip.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520240/featured-transcript-logo.png","publishedAt":"2019-04-23T20:28:28Z","content":"Image source: The Motley Fool.\r\nPulteGroup Inc  (NYSE:PHM)Q1 2019 Earnings CallApril 23, 2019, 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning. My name is Jack and I will be your c… [+54183 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribing)","title":"Zions Bancorporation (ZION) Q1 2019 Earnings Call Transcript","description":"ZION earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/22/zions-bancorporation-zion-q1-2019-earnings-call-tr.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520052/featured-transcript-logo.png","publishedAt":"2019-04-23T03:21:10Z","content":"Image source: The Motley Fool.\r\nZions Bancorporation(NASDAQ:ZION)Q1 2019 Earnings CallApril 22, 2019 5:30 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, ladies and gentlemen, and thank yo… [+65621 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Steel Dynamics Inc (STLD) Q1 2019 Earnings Call Transcript","description":"STLD earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/steel-dynamics-inc-stld-q1-2019-earnings-call-tran.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520072/featured-transcript-logo.png","publishedAt":"2019-04-23T10:05:13Z","content":"Image source: The Motley Fool.\r\nSteel Dynamics Inc  (NASDAQ:STLD)Q1 2019 Earnings CallApril 22, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, and welcome to the Steel Dynamic… [+64449 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"American Campus Communities Inc (ACC) Q1 2019 Earnings Call Transcript","description":"ACC earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/american-campus-communities-inc-acc-q1-2019-earnin.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520247/featured-transcript-logo.png","publishedAt":"2019-04-23T21:06:45Z","content":"Image source: The Motley Fool.\r\nAmerican Campus Communities Inc  (NYSE:ACC)Q1 2019 Earnings CallApril 23, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day and welcome to the Amer… [+59504 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Agree Realty Corp (ADC) Q1 2019 Earnings Call Transcript","description":"ADC earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/agree-realty-corp-adc-q1-2019-earnings-call-transc.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520121/featured-transcript-logo.png","publishedAt":"2019-04-23T16:30:27Z","content":"Image source: The Motley Fool.\r\nAgree Realty Corp  (NYSE:ADC)Q1 2019 Earnings CallApril 23, 2019, 9:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning and welcome to the Agree Realty Fi… [+36974 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Veritex Holdings Inc (VBTX) Q1 2019 Earnings Call Transcript","description":"VBTX earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/veritex-holdings-inc-vbtx-q1-2019-earnings-call-tr.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520178/featured-transcript-logo.png","publishedAt":"2019-04-23T18:59:08Z","content":"Image source: The Motley Fool.\r\nVeritex Holdings Inc  (NASDAQ:VBTX)Q1 2019 Earnings CallApril 23, 2019, 9:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, and welcome to the Veritex Hold… [+39735 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Celanese Corp (CE) Q1 2019 Earnings Call Transcript","description":"CE earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/celanese-corp-ce-q1-2019-earnings-call-transcript.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520249/featured-transcript-logo.png","publishedAt":"2019-04-23T21:05:46Z","content":"Image source: The Motley Fool.\r\nCelanese Corp  (NYSE:CE)Q1 2019 Earnings CallApril 23, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGreetings, and welcome to Celanese First Quarter 20… [+58740 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Centene Corp (CNC) Q1 2019 Earnings Conference Call Transcript","description":"CNC earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/centene-corp-cnc-q1-2019-earnings-conference-call.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520243/featured-transcript-logo.png","publishedAt":"2019-04-23T20:40:59Z","content":"Image source: The Motley Fool.\r\nCentene Corp  (NYSE:CNC)Q1 2019 Earnings Conference CallApril 23, 2019, 8:30 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, and welcome to the Centene Corp… [+72796 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Brown & Brown Inc (BRO) Q1 2019 Earnings Call Transcript","description":"BRO earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/brown-brown-inc-bro-q1-2019-earnings-call-transcri.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520127/featured-transcript-logo.png","publishedAt":"2019-04-23T16:49:02Z","content":"Image source: The Motley Fool.\r\nBrown &amp; Brown Inc  (NYSE:BRO)Q1 2019 Earnings CallApril 23, 2019, 8:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning and welcome to the Brown &amp;… [+57985 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Graphic Packaging Holding Co (GPK) Q1 2019 Earnings Call Transcript","description":"GPK earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/graphic-packaging-holding-co-gpk-q1-2019-earnings.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520205/featured-transcript-logo.png","publishedAt":"2019-04-23T19:28:41Z","content":"Image source: The Motley Fool.\r\nGraphic Packaging Holding Co  (NYSE:GPK)Q1 2019 Earnings CallApril 23, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning. My name is Kyle and I… [+64904 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Fifth Third Bancorp (FITB) Q1 2019 Earnings Call Transcript","description":"FITB earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/23/fifth-third-bancorp-fitb-q1-2019-earnings-call-tra.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/520271/featured-transcript-logo.png","publishedAt":"2019-04-23T22:26:06Z","content":"Image source: The Motley Fool.\r\nFifth Third Bancorp  (NASDAQ:FITB)Q1 2019 Earnings CallApril 23, 2019, 9:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, ladies and gentlemen. This is yo… [+68949 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"peterdeadline","title":"Ex-Washington Wizards & LA Lakers Star Caron Butler To Produce ‘The Green Dream’; Doc Explores Racial Inequality Within Cannabis Industry","description":"EXCLUSIVE: Former NBA star Caron Butler has teamed up with Desert Dancer co-producer Parisa Dunn to produce a documentary about racial inequality within the billion dollar cannabis industry. Butler, who played for the Washington Wizards, Miami Heat and LA Lak…","url":"https://deadline.com/2019/04/caron-butler-the-green-dream-1202600339/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/rexfeatures_6197237ai.jpg?w=1024","publishedAt":"2019-04-23T13:23:24Z","content":"EXCLUSIVE: Former NBA star Caron Butler has teamed up with Desert Dancer co-producer Parisa Dunn to produce a documentary about racial inequality within the billion dollar cannabis industry. Butler, who played for the Washington Wizards, Miami Heat and LA Lak… [+1664 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Patrick Hipes","title":"Peabody Awards: ProPublica, ‘Frontline’, ESPN, New York Times Among News/Radio Podcast Winners","description":"The Peabody Awards on Tuesday revealed its winners in the News and Radio/Podcast categories, rounding out the organization’s honors for 2018’s most powerful, enlightening and invigorating stories in TV, radio and digital media. Winners of the 78th annual awar…","url":"https://deadline.com/2019/04/peabody-awards-2018-winners-news-radio-podcasts-list-1202600115/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/cambridge-analytica-e1556030873345.jpg?w=1024","publishedAt":"2019-04-23T18:00:19Z","content":"The Peabody Awards on Tuesday revealed its winners in the News and Radio/Podcast categories, rounding out the organization’s honors for 2018’s most powerful, enlightening and invigorating stories in TV, radio and digital media. Winners of the 78th annual awar… [+9574 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Inside the 2019 NFL draft class: 50 facts you didn't know","description":"The relative of Nat King Cole? Film buff turned linebacker? A boxing champ's son? A track-and-field record-holder? Get to know this year's NFL draft class.","url":"http://www.espn.com/nfl/draft2019/story/_/id/26553152/inside-2019-nfl-draft-class-50-facts-know","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1006%2Fr443065_1296x729_16%2D9.jpg","publishedAt":"2019-04-23T12:37:47Z","content":"Two hundred fifty-four names will be called on the stage in Nashville, Tennessee, over the course of three days this week. And many of those 2019 NFL draft class prospects come with fascinating backgrounds, pro connections and interests.\r\nThe relative of a ja… [+13248 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Yep, the 1999 NFL draft was just as crazy as you thought","description":"Trades, busts, deception, future Hall of Famers and a prayer about going to the Bengals ... the 1999 NFL draft had a little bit of everything. And that was just the first seven picks.","url":"http://www.espn.com/nfl/story/_/id/26581511/yep-1999-nfl-draft-was-just-crazy-thought","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0419%2Fr531414_1296x729_16%2D9.jpg","publishedAt":"2019-04-23T13:22:48Z","content":"JUST BEFORE NOON on April 17, 1999, NFL commissioner Paul Tagliabue stepped to the podium inside Madison Square Garden to begin what would be the wildest 90 minutes in NFL draft history.\r\nThe epic, chaotic 1999 NFL draft had it all: Quarterback busts galore. … [+23051 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"David Masciotra","title":"Trump's authoritarianism can never be treated like business as usual","description":"A multicultural democracy cannot peacefully coexist with white nationalism, which Trump continues to court","url":"https://www.salon.com/2019/04/23/trumps-authoritarianism-can-never-be-treated-like-business-as-usual/","urlToImage":"https://media.salon.com/2019/04/trump-constitution3.jpg","publishedAt":"2019-04-23T07:00:15Z","content":"American society is failing at the most essential covenant of any civilization; that is, the identification and elimination of movements that threaten the very essence of civilization. It is a challenge to any journalist, no matter how committed and observant… [+5920 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Mary Elizabeth Williams","title":"Don't sweat, Ivy Leaguers: Elizabeth Warren's college plan can't hurt you","description":"A plan to cancel student debt and make college free should be a no-brainer. So what's the problem?","url":"https://www.salon.com/2019/04/23/dont-sweat-ivy-leaguers-elizabeth-warrens-college-plan-cant-hurt-you/","urlToImage":"https://media.salon.com/2019/04/elizabeth-warren20.jpg","publishedAt":"2019-04-23T17:14:01Z","content":"This must be a very difficult time for Americans who've invested a lot of their self esteem in their — and their children's — prestige university educations. I mean, yikes, watching the darkness and corruption of our higher ed system coming to light lately? W… [+8351 chars]"},{"source":{"id":null,"name":"Gothamist.com"},"author":"Scott Lynch","title":"Mothership Meat Company Smoking Up Terrific Texas-Style BBQ In Queens","description":"The owner and pitmaster is Josh Bowen, who also operates John Brown's Smokehouse.","url":"http://gothamist.com/2019/04/23/mothership_meat_lic.php","urlToImage":"http://gothamist.com/assets_c/2019/04/mothershipmeat-16-thumb-640xauto-1028905.jpg","publishedAt":"2019-04-23T18:36:58Z","content":"Our latest installment of Quick Bites brings us to LIC for some BBQ.\r\nTHE VIBE The owner and chef/pitmaster of this brand new Long Island City Texas barbecue spot is Josh Bowen, who first became known around these parts for his other LIC barbecue restaurant, … [+3727 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Amanda N'Duka","title":"Elliott Lester To Direct Peter Dinklage In ‘The Thicket’","description":"Elliott Lester has signed on to direct The Thicket, a dark and twisted thriller which has Peter Dinklage attached to star. The pic is based on the novel of the same name by Joe Lansdale and was adapted by playwright Chris Kelley. Set in west Texas, the film f…","url":"https://deadline.com/2019/04/elliott-lester-peter-dinklage-the-thicket-1202600492/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/elliott-lester-2019.jpeg?w=640","publishedAt":"2019-04-23T17:07:44Z","content":"Elliott Lester has signed on to direct The Thicket, a dark and twisted thriller which has Peter Dinklage attached to star. The pic is based on the novel of the same name by Joe Lansdale and was adapted by playwright Chris Kelley.\r\nSet in west Texas, the film … [+1031 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Amanda N'Duka","title":"Marin Ireland, Michael Abbott Jr., Xander Berkeley To Star In ‘The Dark & The Wicked’ From Bryan Bertino","description":"EXCLUSIVE: Marin Ireland, Michael Abbott Jr., and Xander Berkeley have been tapped as the leads in The Dark & The Wicked, a horror film written and directed by Bryan Bertino. It follows two siblings who are summoned back to the family farm to await the inevit…","url":"https://deadline.com/2019/04/marin-ireland-michael-abbott-jr-xander-berkeley-dark-the-wicked-bryan-bertino-1202600644/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/malin-akerman-michael-abbot-jr-xander-berkeley-e1556046566563.jpg?w=1000","publishedAt":"2019-04-23T19:26:56Z","content":"EXCLUSIVE: Marin Ireland, Michael Abbott Jr., and Xander Berkeley have been tapped as the leads in The Dark &amp; The Wicked, a horror film written and directed by Bryan Bertino. It follows two siblings who are summoned back to the family farm to await the in… [+1704 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Sunny Verma","title":"Robust plan in place for adequate supply of crude oil: Dharmendra Pradhan","description":"With oil imports from Iran likely to come to a halt, the government expects volumes to go up from other countries.","url":"https://indianexpress.com/article/business/robust-plan-in-place-for-adequate-supply-of-crude-oil-dharmendra-pradhan-us-sanctions-iran-5691261/","urlToImage":"https://images.indianexpress.com/2019/04/dharmendra-pradhan.jpg?w=759","publishedAt":"2019-04-23T18:40:07Z","content":"Union Minister Dharmendra Pradhan\r\nWith the US government ending sanction waivers for importing oil from Iran, India is planning to step up supplies from countries including the US, Saudi Arabia, UAE, Mexico, Kuwait and Bahrain in order to minimize the impact… [+3263 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Chris Harris","title":"Texas Couple Held Girl as Slave for 16 Years, Called Her 'Dog' and 'Worthless'","description":"A Texas couple who held a young girl from West Africa as a slave for 16 years were each sentenced Monday to seven years in federal prison, PEOPLE confirms. A press release from federal prosecutors states Toure and Cros-Toure must pay $288,620.24 in restitutio…","url":"https://people.com/crime/texas-couple-held-girl-slave-for-16-years-called-her-dog-worthless/","urlToImage":"https://peopledotcom.files.wordpress.com/2018/04/toure.jpg?crop=0px%2C63px%2C2000px%2C1050px&resize=1200%2C630","publishedAt":"2019-04-23T15:34:33Z","content":"A Texas couple who held a young girl from West Africa as a slave for 16 years were each sentenced Monday to seven years in federal prison, PEOPLE confirms.\r\nA press release from federal prosecutors states Toure and Cros-Toure must pay $288,620.24 in restituti… [+3624 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Harriet Sokmensuer","title":"A Texas Mom Who 'Loves Her Baby' Failed to Pick Up Her Son, and Now She's Considered Missing","description":"The family of a 26-year-old woman who went missing last week is searching for answers. Prisma Denisse Peralta Reyes was reported missing from Mesquite, Texas, Wednesday after she failed to pick her son up from his babysitter, WFAA, ABC13 and Fox4 report. Duri…","url":"https://people.com/crime/prisma-denisse-peralta-reyes-missing-texas-mom/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/prisma-reyes.jpg?crop=0px%2C192px%2C2700px%2C1419px&resize=1200%2C630","publishedAt":"2019-04-23T16:58:51Z","content":"The family of a 26-year-old woman who went missing last week is searching for answers.\r\nPrisma Denisse Peralta Reyes was reported missing from Mesquite, Texas, Wednesday after she failed to pick her son up from his babysitter, WFAA,ABC13 and Fox4 report. Duri… [+1797 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Dave Quinn","title":"Olympic Gymnast Mary Lou Retton Cheers on Daughter at NCAA Women’s Gymnastics Championships","description":"Like mother, like daughter! Louisiana State University gymnast McKenna Kelley earned a near-perfect 10 for her floor routine on Saturday at the NCAA Women’s Gymnastics Championships, while her mother — Olympic gold medalist Mary Lou Retton — cheered her on fr…","url":"https://people.com/sports/olympic-gymnast-mary-lou-retton-cheers-on-daughter-at-ncaa-womens-gymnastics-championships/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/mckenna-kelley-1.jpg?crop=0px%2C61px%2C892px%2C468px&resize=1200%2C630","publishedAt":"2019-04-23T14:00:11Z","content":"Like mother, like daughter!\r\nLouisiana State University gymnast McKenna Kelley earned a near-perfect 10 for her floor routine on Saturday at the NCAA Women’s Gymnastics Championships, while her mother Olympic gold medalist Mary Lou Retton cheered her on from … [+2106 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Steve Helling","title":"House of Horrors Siblings Were Comforted by Dog While Facing Down Parents in Court","description":"Several children abused for years by their parents in a California home that became known as the “ House of Horrors ” confronted them at their sentencing last Friday — and they had some four-legged moral support as they addressed the court. A yellow Labrador …","url":"https://people.com/crime/house-of-horrors-siblings-comforted-by-dog-in-court/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/raider-police-dog.jpg?crop=0px%2C554px%2C2696px%2C1417px&resize=1200%2C630","publishedAt":"2019-04-23T21:03:21Z","content":"Several children abused for years by their parents in a California home that became known as the “House of Horrors” confronted them at their sentencing last Friday — and they had some four-legged moral support as they addressed the court.\r\nA yellow Labrador n… [+2875 chars]"},{"source":{"id":null,"name":"Nba.com"},"author":"NBA.com","title":"Kentucky's Washington ready to show off complete package","description":"Kentucky coach John Calipari���s program has seen great players -- John Wall, Anthony Davis, Karl-Anthony Towns, etc. etc. -- come and go during his 10 years in Lexington, most logging the mandatory one season before moving on to the NBA.","url":"http://www.nba.com/article/2019/04/23/kentucky-washington-complete-package-after-staying-around","urlToImage":"https://cdn.nba.net/nba-drupal-prod/styles/landscape_1045w/s3/2019-04/USATSI_10290995.jpg?itok=_EwFVxN8","publishedAt":"2019-04-23T15:32:54Z","content":"Still, Washington wouldnt bite during a pregame press conference when he was asked multiple times whether hed play. I dont know yet, Washington said. I walked over here. Thats good. Im thinking of giving it a go. Its just up in the air.\r\nAs it turned out, Was… [+3118 chars]"}]}