{"status":"ok","totalResults":336,"articles":[{"source":{"id":"reuters","name":"Reuters"},"author":"Andrew Chung","title":"Supreme Court girds for fight over Trump census citizenship question","description":"Sitting on a working-class commercial strip in the shadows of an above-ground rail line, a group called Make the Road New York's busy street-level offices are easy to miss. But its mission to support and advocate for immigrants is front and center.","url":"https://www.reuters.com/article/us-usa-court-census-idUSKCN1RV0Q0","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378555533&w=1200&r=LYNXNPEF3I0GC","publishedAt":"2019-04-19T11:10:33Z","content":"NEW YORK (Reuters) - Sitting on a working-class commercial strip in the shadows of an above-ground rail line, a group called Make the Road New York’s busy street-level offices are easy to miss. But its mission to support and advocate for immigrants is front a… [+6302 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Scott Davis","title":"The Raiders sent their scouts home 6 days before the draft because the new GM reportedly 'does not know who he can trust with his draft secrets'","description":"The Oakland Raiders sent home their scouts one week before the NFL draft because GM Mike Mayock does not know who to trust, according to a report. Some in the NFL argued that this is normal for a team with a new GM, but others suggested the report is still ab…","url":"https://www.businessinsider.com/raiders-nfl-draft-scouts-sent-home-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba18d0ac92a13da52ca063-1334-667.jpg","publishedAt":"2019-04-19T19:25:48Z","content":"With the NFL draft one week away, the Oakland Raiders are shrinking the size of their inner-circle, according to NFL Network's Ian Rapoport. \r\n On Friday, Rapoport reported that the Raiders new GM Mike Mayock and head coach Jon Gruden sent home their scouts f… [+2506 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Nicole Raucheisen and Spencer Alben","title":"How Di Fara became a New York pizza institution","description":"With fans like Leonardo DiCaprio and the late Anthony Bourdain, Di Fara Pizza is considered one of the most legendary pizza shops in NYC. It opened in 1965 by Domenico \"Dom\" DeMarco, an Italian immigrant who still runs the shop today with the help of his chil…","url":"https://www.thisisinsider.com/how-di-fara-became-a-new-york-pizza-institution-2019-4","urlToImage":"https://static.businessinsider.com/image/5cb9ca7cd2ce78070f3196d8-750.jpg","publishedAt":"2019-04-19T13:11:33Z","content":"Following is a transcript of this video.\r\nNarrator: Ask anyone in New York City what their favorite pizza place is, and the results might overwhelm you. With thousands of options in this city, crowning the absolute best is highly subjective and nearly impossi… [+2622 chars]"},{"source":{"id":null,"name":"Greenentrepreneur.com"},"author":"Scott McGovern","title":"Pay Attention to These 6 Cannabis Industry Trends","description":"The weed businesses that thrived four years ago don't necessarily yield big profits today as new cannabis industry trends dictate the market.","url":"https://www.greenentrepreneur.com/article/332348","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190418180609-GettyImages-899527610-crop.jpeg","publishedAt":"2019-04-19T12:00:00Z","content":"April\r\n19, 2019\r\n7 min read\r\nOpinions expressed by Green Entrepreneur contributors are their own.\r\nCannabis industry trends evolve faster than most markets. Not only haven’t regulations been finalized, but methods of consumption, investment and the geography … [+7350 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter seven-round mock draft - NFL.com","description":"Chad Reuter seven-round mock draft NFL.com Devin Bush on cusp of NFL with a style all his own: 'You won't break' him Detroit Free Press 2019 NFL Mock Draft: Falcons' blockbuster move into top five headlines nine projected trades CBS Sports Which Positions Do …","url":"http://www.nfl.com/news/story/0ap3000001027100/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-1","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/04/18/0ap3000001027062_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+7602 chars]"},{"source":{"id":"time","name":"Time"},"author":"ALEX VEIGA / AP","title":"Corporate America Gears Up for ‘Weed Day’ Celebrations on April 20","description":"The counter-culture celebration on Apr. 20 was all about getting stoned, but is now so mainstream brands are starting to embrace it.","url":"http://time.com/5573878/420-april-20-weed-marijuana-cannabis-day-marketing-brands/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/gettyimages-949250036.jpg?quality=85","publishedAt":"2019-04-19T05:49:27Z","content":"LOS ANGELES — Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn’t yet have… [+5217 chars]"},{"source":{"id":"time","name":"Time"},"author":"Jeff Amy and Rogelio Solis / AP","title":"Storms Ravage the South, Killing Three People and Leaving Thousands Without Power","description":"The same system produced tornadoes and hail earlier in North Texas, the Texas Panhandle, Oklahoma and southeastern Kansas.","url":"http://time.com/5573904/storms-south-mississippi-alabama-weather-power/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/mississippi-storm-damage.jpg?quality=85","publishedAt":"2019-04-19T07:32:58Z","content":"(LEARNED, Miss.) — Strong storms again roared across the South on Thursday, killing two Mississippi drivers and a woman in Alabama while leaving more than 100,000 people without power across Alabama, Mississippi, Louisiana and Texas.\r\nNational Weather Service… [+4267 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"College football spring games: How to watch, what to expect","description":"Here are this weekend's spring games, featuring playoff hopefuls Georgia and Oregon, plus Washington State, UCLA, new-look Miami and more.","url":"http://www.espn.com/college-football/story/_/id/26559717/college-football-spring-games-how-watch-expect","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1128%2Fr470198_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T14:59:08Z","content":"The last big weekend of college football spring games is upon us, with playoff hopefuls such as Georgia and Oregon taking the field. We'll also get to see Mike Leach and Washington State, Chip Kelly and UCLA, plus new-look Miami under first-year coach Manny D… [+4015 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Max Golembo","title":"Severe weather outbreak hits East Coast just before long weekend","description":"Over the last two days, 18 tornadoes have been reported over five states.","url":"https://abcnews.go.com/US/severe-weather-outbreak-hits-east-coast-long-weekend/story?id=62503531","urlToImage":"https://s.abcnews.com/images/US/weather-2-ap-er-190414_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T10:29:55Z","content":"The major storm is moving east, leaving in its wake at least 18 tornadoes and more than 300 damaging storm reports over two days in five states, as the East Coast braces for severe weather.\r\nNine of those tornadoes, reported yesterday, were in Texas, Oklahoma… [+713 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Jeff Zillgitt, USA TODAY","title":"Russell Westbrook in playoff offensive slump since 2016","description":"Oklahoma City guard Russell Westbrook's playoff struggles against Portland are emblematic of his postseason issues going back to the 2016 playoffs.","url":"https://www.usatoday.com/story/sports/nba/playoffs/2019/04/19/thunder-guard-russell-westbrook-playoff-struggles-trailblazers/3506694002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/2a607acf3b89ec1b7b7f8219111fc1d7fd9bda35/c=0-209-4033-2478/local/-/media/2019/04/17/USATODAY/usatsports/usatsi_12545630.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T15:53:24Z","content":"SportsPulse: The Boston Celtics and Milwaukee Bucks are off and running and look like the top contenders in the East. USA TODAY's Jeff Zillgitt breaks it down.\r\n USA TODAY\r\nOklahoma City’s Russell Westbrook called his performance in Game 2 unacceptable. He sa… [+4159 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Frank Miles","title":"America’s first woman astronaut candidate dead at 88","description":"America’s first female astronaut candidate, pilot Jerrie Cobb, who pushed for equality in space but never reached its heights, has died.","url":"https://www.foxnews.com/science/americas-1st-woman-astronaut-candidate-dead-88","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Jerrie-Cobb-1.jpg","publishedAt":"2019-04-19T02:58:35Z","content":"America’s first female astronaut candidate who pushed for women in space but never reached its heights has died, reports said.\r\nPilot Jerrie Cobb died in Florida on March 18 following a brief illness. She was 88.\r\nNews of her death came Thursday from journali… [+2730 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Annika Neklason","title":"The Columbine Blueprint","description":"As the first school shooting to become a nationwide media spectacle, Columbine shaped a generation of mass-consumed tragedies.","url":"https://www.theatlantic.com/education/archive/2019/04/columbines-20th-anniversary-mass-media-shooting/587359/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/Columbine-1/facebook.jpg?1555691753","publishedAt":"2019-04-19T16:43:52Z","content":"On that day two decades ago, news spread from Columbine quickly, and widely. By the time the killers concluded their shooting spree by turning their guns on themselves, less than an hour after firing their first shots, the attack had already become a media ev… [+12561 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Clio Chang on The Slot, shared by Katie McDonough to Jezebel","title":"Elizabeth Warren Has a Plan","description":"In February, a little more than a week after she officially announced she was running for president, Elizabeth Warren rolled out  a sweeping proposal to make high-quality child care accessible to every family in the country by levying a tax on the ultra-rich.…","url":"https://theslot.jezebel.com/elizabeth-warren-has-a-plan-1834120275","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--c61krc2h--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vlvsmcjx9c2xcebhlwup.png","publishedAt":"2019-04-19T12:00:00Z","content":"In February, a little more than a week after she officially announced she was running for president, Elizabeth Warren rolled out a sweeping proposal to make high-quality child care accessible to every family in the country by levying a tax on the ultra-rich. … [+16312 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Meghan Bartels","title":"Jerrie Cobb, Record-Breaking Pilot and Advocate for Female Spaceflight, Has Died","description":"Jerrie Cobb, the first woman to pass all the same preflight tests as NASA's seven Mercury astronauts, has died.","url":"https://www.space.com/jerrie-cobb-died-mercury-13-women-in-space.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/V68LbaS2gJfxNTALqgtDq3-1200-80.jpg","publishedAt":"2019-04-19T11:00:02Z","content":"Jerrie Cobb, the first woman to pass all the same preflight tests as NASA's seven Mercury astronauts\r\n, has died.\r\nCobb, whose full first name was Geraldyn, was a record-setting pilot and an outspoken advocate for gender equality in spaceflight who dedicated … [+6056 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Megan Armstrong","title":"NFL Draft Rumors: Marquise 'Hollywood' Brown's Stock Not Impacted by Injuries","description":"The Oklahoma Sooners may be responsible for both the first quarterback and wide receiver taken off the board in the 2019  NFL  draft despite Oklahoma wide receiver Marquise \"Hollywood\" Brown recovering from a January Lisfranc surgery...","url":"https://bleacherreport.com/articles/2832174-nfl-draft-rumors-marquise-hollywood-browns-stock-not-impacted-by-injuries","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/785/hi-res-7688dabd9ef19bf4428ec976b6e0a778_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T19:52:36Z","content":"Cooper Neill/Associated Press\r\nThe Oklahoma Sooners may be responsible for both the first quarterback and wide receiver taken off the board in the 2019 NFL draft despite Oklahoma wide receiver Marquise \"Hollywood\" Brown recovering from a January Lisfranc surg… [+962 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Samantha Prevot","title":"B/R Countdown: Top 10 Plays from Russell Westbrook and Paul George","description":"Russell Westbrook  and  Paul George  have been a superstar tandem for the Oklahoma City Thunder this season. In this edition of B/R Countdown, we countdown Russ and PG's best plays of the 2018-19 season...","url":"https://bleacherreport.com/articles/2832132-br-countdown-top-10-plays-from-russell-westbrook-and-paul-george","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/740/219758700f0d5ad1e7fc0633ca678f97_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T15:39:54Z","content":"McCollum and the Blazers Snapped Postseason Losing Streak for \"Jennifer\"\r\nStars Invest in Plant-Based Food as Vegetarianism Sweeps NBA\r\nThe NBA Got Some Wild Techs This Season\r\nJarrett Allen Is One of the NBAs Hottest Rim Protectors\r\nWade's Jersey Swaps Creat… [+1499 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Jake Rill","title":"NBA Playoffs 2019: Updated Postseason Standings, Bracket Results and Highlights","description":"The first round of the  NBA  playoffs is still in its early stages, with no series having played more than three games. And in the three series that have played three games, no team has a 3-0 lead...","url":"https://bleacherreport.com/articles/2832088-nba-playoffs-2019-updated-postseason-standings-bracket-results-and-highlights","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/698/hi-res-47107a852e46998f851f3375cc7e2202_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T17:05:27Z","content":"Yong Teck Lim/Getty Images\r\nThe first round of the NBA playoffs is still in its early stages, with no series having played more than three games. And in the three series that have played three games, no team has a 3-0 lead.\r\nThat means there should still be p… [+3502 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Matt Miller","title":"Matt Miller's Scouting Notebook: Biggest Insider Rumors of the 2019 NFL Draft","description":"The week before the  NFL  draft kicks off is a madhouse. Every agent wants information on where their players will be drafted...","url":"https://bleacherreport.com/articles/2831952-matt-millers-scouting-notebook-biggest-insider-rumors-of-the-2019-nfl-draft","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/571/hi-res-721aabc9f766ac5b067c78b0492e19d5_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T12:42:54Z","content":"Jonathan Bachman/Getty Images\r\nThe week before the NFL draft kicks off is a madhouse. Every agent wants information on where their players will be drafted. Every team source you have wants to know what you're hearing other teams will dowhich is where informat… [+10596 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Grant Hughes","title":"NBA Power Rankings: James Harden, Houston Rockets Blasting Their Way to the Top","description":"For this edition of  NBA  power rankings, we'll be prisoners of the moment a bit more than we were during the regular season.   There's this idea that the playoffs are when teams' true quality is revealed...","url":"https://bleacherreport.com/articles/2831792-nba-power-rankings-james-harden-houston-rockets-blasting-their-way-to-the-top","urlToImage":"https://img.bleacherreport.net/img/slides/photos/004/344/822/bf3d90cddf1bcc2c93f8fdbe7c118183_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T11:10:36Z","content":"Layne Murdoch Jr./Getty Images\r\n25. Los Angeles Lakers (25)\r\nMarc Stein of the New York Times reports, \"In numerous rival organizations, there is both shock and relief that the Lakers haven't responded to events of the past week by chasing the likes of Golden… [+3678 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"The MMQB Staff","title":"Josh Jacobs Q&A: Former Alabama RB Takes an Unorthodox Path to the NFL Draft","description":"Josh Jacobs went from being lightly recruited coming out of high school to an all-purpose guy for Alabama to a top running back in this NFL draft class. Where will he fit in at the next level?","url":"https://www.si.com/nfl/2019/04/19/nfl-draft-2019-josh-jacobs-alabama-running-back","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/josh-jacobs-nfl-draft-running-backs.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T11:33:28Z","content":"Its wasnt until Josh Jacobs got to Alabama that he realized how far hed come. \r\nIn less than a year, hed gone from a Wildcat quarterback at a little-known high school in Tulsa, Okla. to earning significant playing time as a running back for the best college f… [+6559 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Chris Mannix","title":"Jeanie Buss and the Lakers Must Go Big Game Hunting in Front Office Search","description":"After Magic Johnson's shocking exit, Jeanie Buss must avoid past mistakes in front office search. So who is the best candidate to run the team? The Lakers job is a complicated one.","url":"https://www.si.com/nba/2019/04/19/lakers-jeanie-buss-rob-pelinka-lebron-james-magic-johnson-front-office-search","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/jeanie-buss-lakers-front-office.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T15:55:20Z","content":"Setting aside the absurdity of how Magic Johnson exited the Lakers last weekhow does one sit through a three-hour organizational meeting a day before announcing an intention to leave an organization? Johnsons decision to quit as president of basketball operat… [+3825 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Laken Litman","title":"Gauging the Success Rate of College Football Head Coaches Who Are Also Alumni","description":"College football programs that hire alumni set up their school legends for rousing second acts ... but it doesn't always go according to plan.","url":"https://www.si.com/college-football/2019/04/19/alumni-head-coaches-jim-harbaugh-pat-fitzgerald","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/college-football-coaches-alumni-jim-harbaugh-pat-fitzgerald.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T17:07:19Z","content":"When Jim Harbaugh came home to Michigan, he told stories of sitting in Bo Schembechlers office with his feet propped up on his desk. When Scott Frost came home to Nebraska, Cornhuskers fans broke the spring game attendance record. When Kirby Smart came home t… [+15717 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"The MMQB Staff","title":"2019 NFL Draft Position Rankings: Quarterbacks","description":"The four first-round candidates are followed by some interesting second-tier passers in the class of 2019.","url":"https://www.si.com/nfl/2019/04/17/draft-position-rankings-quarterbacks-kyler-murray-drew-lock-daniel-jones-dwayne-haskins","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/17/2019-nfl-draft-qb-rankings.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:02:12Z","content":"1. Kyler Murray, Oklahoma (Overall Rank: 9)Height: 5' 1018\" | Weight: 207 poundsMurray is an electrifying talent, breathtaking with the ball in his hands but also a strong-armed, cerebral passer who was able to negotiate throwing lanes within the pocket at th… [+7404 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Tim Rohan","title":"When the Canes Ruled the Draft: The Year Miami Had Six First-Rounders","description":"The story of Miami’s record six first-rounders in 2004 perfectly captures the unpredictability of the draft process.","url":"https://www.si.com/nfl/2019/04/19/miami-hurricanes-2004-nfl-draft-record-six-players-first-round","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/miami-2004-draft-class-pileup-big.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:42:09Z","content":"Toward the end of February 2004, the entire football world descended on the University of Miami for the Hurricanes pro day. Some estimate there were several hundred people in attendance, including coaches, executives, and scouts from every organization, it se… [+25631 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Erik Pedersen","title":"Adam Driver Stars in Terry Gilliam’s ‘The Man Who Killed Don Quixote’; ‘Hail Satan?’ Arrives On Good Friday: Specialty Preview","description":"Comedies, docs and a Bollywood title are among the Easter and Passover weekend’s packed roster of new specialty releases. The heavy number of limited openers comes just ahead of next weekend’s rollout of Avengers: Endgame, which will mark mostly a pause for n…","url":"https://deadline.com/2019/04/the-man-who-killed-don-quixote-adam-driver-terry-gilliam-hail-satan-specialty-box-office-preview-1202598675/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/the-man-who-killed-don-quixote.jpg?w=1000","publishedAt":"2019-04-19T00:18:15Z","content":"Comedies, docs and a Bollywood title are among the Easter and Passover weekend’s packed roster of new specialty releases. The heavy number of limited openers comes just ahead of next weekend’s rollout of Avengers: Endgame, which will mark mostly a pause for n… [+14417 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Rachel Handler","title":"Penny Lane Wants You to Hail Satan?","description":"Lane’s breakout film is about the misunderstood world of Satanism. In a Halloween store in New York, we discuss how the Satanic Temple got serious.","url":"http://www.vulture.com/2019/04/penny-lane-wants-you-to-hail-satan.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/18/18-penny-lane-2.w1200.h630.jpg","publishedAt":"2019-04-19T15:59:54Z","content":"Penny Lane and I are standing in the middle of Abracadabra, a Halloween store in New Yorks Flatiron District, watching a life-size animatronic zombie puke into a trash can. Moments earlier, wed both thought it was a real person and almost greeted it formally.… [+11747 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Dave Quinn","title":"A Clone of Oklahoma City 'Survivor Tree' Has Been Planted 24 Years After Bombing","description":"The famed 100-year-old “Survivor Tree” that remained standing after the deadly Oklahoma City bombing has been cloned, and a seed with its identical genetic makeup planted to assure the memory of those lost in the tragedy will live on forever. Civic leaders in…","url":"https://people.com/human-interest/oklahoma-city-bombing-survivor-tree-clone/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/survivor-tree.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-19T18:39:17Z","content":"The famed 100-year-old “Survivor Tree” that remained standing after the deadly Oklahoma City bombing has been cloned, and a seed with its identical genetic makeup planted to assure the memory of those lost in the tragedy will live on forever.\r\nCivic leaders i… [+1125 chars]"},{"source":{"id":null,"name":"People.com"},"author":"People Staff","title":"Remembering Lives Lost in the Oklahoma City Bombing, 24 Years Later","description":"Ed. Note: Friday marks the 24th anniversary of the bombing of the Alfred P. Murrah Federal Building in Oklahoma City, when a former American soldier and Gulf War veteran, Timothy McVeigh, parked a rented truck carrying a five-ton fertilizer bomb outside the b…","url":"https://people.com/crime/oklahoma-city-bombing-24-years-later-remembering-lives-lost/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/oklahoma-city-bombing-1.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-19T18:25:49Z","content":"Ed. Note: Friday marks the 24th anniversary of the bombing of the Alfred P. Murrah Federal Building in Oklahoma City, when a former American soldier and Gulf War veteran, Timothy McVeigh, parked a rented truck carrying a five-ton fertilizer bomb outside the b… [+5392 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Sources: Lakers want 2nd Lue, Williams meetings","description":"Ty Lue met with Lakers GM Rob Pelinka for about 90 minutes Friday, a prelude to what the Lakers hope to be more detailed discussions with top candidates Lue and Monty Williams as soon as next week, sources told ESPN.","url":"http://www.espn.com/nba/story/_/id/26560005/sources-lakers-want-2nd-lue-williams-meetings","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0412%2Fr406721_2_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T16:16:53Z","content":"Former Cleveland Cavaliers coach Ty Lue and Los Angeles Lakers general manager Rob Pelinka met on Friday for approximately 90 minutes to discuss the franchise's coaching vacancy, league sources told ESPN.\r\nThe conversation was described as relaxed and broad, … [+1795 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Mitchell vows to be more aggressive vs. Rockets","description":"Jazz guard Donovan Mitchell said his performance can only get better after losses in the first two games of Utah's series against the Rockets.","url":"http://www.espn.com/nba/story/_/id/26562090/mitchell-vows-more-aggressive-vs-rockets","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0201%2Fr496337_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T20:57:34Z","content":"SALT LAKE CITY -- Two days after declaring himself a no-show in the Houston Rockets' Game 2 rout, Utah Jazz guard Donovan Mitchell vowed to take a different, much more aggressive approach.\r\nMitchell has put much of the blame on his shoulders for the Rockets j… [+3333 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"'He showed everybody who Kevin Durant is'","description":"Coming out aggressive from the opening tip, the two-time Finals MVP reminded everyone why he's the best pure scorer in the NBA.","url":"http://www.espn.com/nba/story/_/id/26557720/he-showed-everybody-kevin-durant-is","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0419%2Fr531327_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T08:20:48Z","content":"LOS ANGELES -- When Kevin Durant first joined the Golden State Warriors nearly three years ago, he went through a bit of an adjustment period with his new teammates and coaches.\r\nThey'd go out of their way to make him feel comfortable in his new surroundings,… [+6083 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"He's Kevin Durant, and you're not","description":"Coming out aggressive from the opening tip, the two-time Finals MVP reminded everyone why he's the best pure scorer in the NBA.","url":"http://www.espn.com/nba/story/_/id/26557720/kevin-durant-not","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0419%2Fr531327_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T06:35:01Z","content":"LOS ANGELES -- When Kevin Durant first joined the Golden State Warriors nearly three years ago, he went through a bit of an adjustment period with his new teammates and coaches.They'd go out of their way to make him feel comfortable in his new surroundings, o… [+5586 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Yves Smith","title":"Making American Schools Less Great Again","description":"An on-the-ground report from a teacher in Beverton on how the war on schools' funding is leading teachers to strike.","url":"https://www.nakedcapitalism.com/2019/04/making-american-schools-less-great-again.html","urlToImage":"http://www.tomdispatch.com/images/managed/everybody_gologorsky.jpg","publishedAt":"2019-04-19T04:58:26Z","content":"Yves here. This is a personal vignette about setting up government for failure. A teacher describes how budget cuts to schools in her district produced predictable results: overcrowded classrooms, diminished attention to students, particularly ones who would … [+13446 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Nick Crain, Contributor, Nick Crain, Contributor https://www.forbes.com/sites/nicholascrain/","title":"The Oklahoma City Thunder's 3-point shooting is the source of their playoff struggles","description":"The Oklahoma City Thunder are currently down 0-2 in their first round playoff matchup with the Portland Trail Blazers. Their biggest issue to this point has been their abysmal 3-point shooting.","url":"https://www.forbes.com/sites/nicholascrain/2019/04/19/the-oklahoma-city-thunders-3-point-shooting-is-the-source-of-their-playoff-struggles/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1143193453%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T23:17:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nPORTLAND, OR - APRIL 16: Paul George #13 of the Oklahoma City Thunder watches from the bench as time winds down during the second half of Game Two of the Western Conference quarterfinals against the Port… [+7289 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Chadd Scott, Contributor, Chadd Scott, Contributor https://www.forbes.com/sites/chaddscott/","title":"Beautiful And Ugly Side Of America's Environmental Record On Display This Earth Day","description":"America in its early years may have paled artistically, architecturally and culturally when compared to Europe, but what this young country did possess was a natural beauty and a natural bounty second to none.","url":"https://www.forbes.com/sites/chaddscott/2019/04/19/beautiful-and-ugly-side-of-americas-environmental-record-on-display-this-earth-day/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fchaddscott%2Ffiles%2F2019%2F04%2Frsz_nat-029_gilcrease_hogue-full_jpg-1200x842.jpg","publishedAt":"2019-04-19T16:43:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAlexandre Hogue (American, 1898-1994). Crucified Land, 1939. Oil on canvas, framed: 47 1/8 &amp;times; 65 1/2 &amp;times; 2 1/16 in. (119.7 &amp;times; 166.4 &amp;times; 5.2 cm). GM 0127.2000.\r\nGilcrease… [+12527 chars]"},{"source":{"id":null,"name":"Al.com"},"author":"The Associated Press","title":"Storms kill 2 in Mississippi, 1 in Alabama - AL.com","description":"Storms kill 2 in Mississippi, 1 in Alabama AL.com Severe storms bear down on East threatening damaging wind, flooding and tornadoes AccuWeather.com Storms again roar across South, 1 confirmed dead in Alabama, 2 in Mississippi WHNT News 19 Storms batter South,…","url":"https://www.al.com/weather/2019/04/storms-kill-2-in-mississippi-1-in-alabama.html","urlToImage":"https://www.al.com/resizer/aQmpUvZdnN_4iIUmE-Upt6kiBMo=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/DSBDHJFCP5D3TBJ3IG7R6BD4XY.jpg","publishedAt":"2019-04-19T11:33:00Z","content":"Strong storms again roared across the South on Thursday, killing two Mississippi drivers and a woman in Alabama while leaving more than 100,000 people without power across Alabama, Mississippi, Louisiana and Texas.\r\nNational Weather Service forecasters said t… [+4665 chars]"},{"source":{"id":null,"name":"Ksl.com"},"author":"https://www.facebook.com/kslcom/","title":"How Utahns reacted to Columbine shooting 20 years ago and how it changed school safety - KSL.com","description":"How Utahns reacted to Columbine shooting 20 years ago and how it changed school safety KSL.com Bullies and black trench coats: The Columbine shooting’s most dangerous myths The Washington Post High School Was Different Before Columbine The Atlantic Columbine …","url":"https://www.ksl.com/article/46535045/how-utahns-reacted-to-columbine-shooting-20-years-ago-and-how-it-changed-school-safety","urlToImage":"https://img.ksl.com/slc/2723/272354/27235467.jpg?filter=ksl/responsive_story_lg","publishedAt":"2019-04-19T17:19:29Z","content":"Editor's note: This article is a part of a series reviewing Utah and U.S. history for KSL.com's Historic section.\r\nSALT LAKE CITY Twenty years ago Saturday, the seemingly unimaginable happened. Two students entered their high school and murdered 12 classmates… [+8802 chars]"},{"source":{"id":null,"name":"Redskins.com"},"author":null,"title":"Prospect Profiles: In Choosing Football Over Baseball, Kyler Murray Established Himself As A Potential No. 1 Pick - Redskins.com","description":"Prospect Profiles: In Choosing Football Over Baseball, Kyler Murray Established Himself As A Potential No. 1 Pick Redskins.com NFL Mock Draft 2019: Kyler Murray or Nick Bosa No. 1? Giants grab a QB; Stunning Jets-Dolphins deal; Cardinals trade Josh Rosen | 2-…","url":"https://www.redskins.com/news/prospect-profiles-in-choosing-football-over-baseball-kyler-murray-established-hi","urlToImage":"https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/redskins/c3wuwgk7uh8gvvujub5o","publishedAt":"2019-04-19T19:01:05Z","content":"Kyler Murray was supposed to play professional baseball. After serving as the Oklahoma quarterback this past fall, the Sooners' center fielder would report to spring training with the Oakland Athletics, who drafted him with the No. 9 pick in the 2018 MLB Draf… [+1004 chars]"},{"source":{"id":null,"name":"Dailythunder.com"},"author":"Weston Shepherd","title":"Good Friday Bolts: 4.19.19 - Daily Thunder","description":"Good Friday Bolts: 4.19.19 Daily Thunder Thunder vs. Blazers is SO stressful SB Nation Russell Westbrook, Paul George not feeling questions after Game 3 | 2019 NBA Playoffs ESPN Russell Westbrook Took It To Damian Lillard In Game 3 Bleacher Report Today's big…","url":"http://dailythunder.com/good-friday-bolts-4-19-19/","urlToImage":"http://dailythunder.com/wp-content/uploads/2018/03/Bolts-BIG-Featured-Image2-650x361.jpg","publishedAt":"2019-04-19T14:51:03Z","content":"Nick Gallo (okcthunder.com) previews tonight’s Game 3 in OKC: “On offense, the Thunder is getting the types of shots that it wants. Over the first two games it has hot 61.4 percent on 35.0 attempts in the restricted area and taken nearly as many corner three-… [+5805 chars]"},{"source":{"id":null,"name":"Dawgpounddaily.com"},"author":"Randy Gurzi","title":"Cleveland Browns: 7-Round NFL mock draft, the week before - FanSided","description":"Cleveland Browns: 7-Round NFL mock draft, the week before FanSided Trade option? Johnson has 'vital' role for Browns NFL.com Colin Cowherd dampens Browns expectations & breaks down easiest, hardest schedules | NFL | THE HERD The Herd with Colin Cowherd NFL sc…","url":"https://dawgpounddaily.com/2019/04/19/cleveland-browns-final-2019-7-round-mock-draft/","urlToImage":"https://imagesvc.timeincapp.com/v3/fan/image?url=https://dawgpounddaily.com/wp-content/uploads/getty-images/2017/07/1128642196-1.jpeg&","publishedAt":"2019-04-19T11:00:00Z","content":"ARLINGTON, TX APRIL 26: A video board displays the text ON THE CLOCK for the Cleveland Browns during the first round of the 2018 NFL Draft at AT\r\nThe 2019 NFL Draft is nearly here as the Cleveland Browns will begin making their draft moves in one week. There … [+1421 chars]"},{"source":{"id":null,"name":"Fantasypros.com"},"author":null,"title":"Overvalued 2019 NFL Draft Targets: WR (Fantasy Football) - FantasyPros","description":"Overvalued 2019 NFL Draft Targets: WR (Fantasy Football) FantasyPros Which Positions Do Teams Obsess Over (And Overlook) On Draft Day? FiveThirtyEight Dwayne Haskins and best fantasy football fits for 2019 NFL Draft prospects | #FantasyByThePeople Yahoo! Spor…","url":"https://www.fantasypros.com/2019/04/overvalued-2019-nfl-draft-targets-wr-fantasy-football/","urlToImage":"https://www.fantasypros.com//cdn.fantasypros.com/wp-content/uploads/full_193408.jpg","publishedAt":"2019-04-19T11:07:41Z","content":"Many offensive players come to the NFL Draft with a lot of hype. Some have speed, some are capable of big plays. Some have size, and some are equipped with a blend of speed and size that almost makes us forget about production. The players below have all gene… [+8783 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter 7-round mock draft: Round 2 - NFL.com","description":"Chad Reuter 7-round mock draft: Round 2 NFL.com Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Yahoo Sports' top 2019 NFL draft prospects, No. 9: Michigan LB Devin Bush Jr. Yahoo Sports Devin Bus…","url":"http://www.nfl.com/news/story/0ap3000001027103/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-2","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/03/25/0ap3000001024136_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+6616 chars]"},{"source":{"id":null,"name":"Brooklynvegan.com"},"author":"Bill Pearis","title":"The Flaming Lips' terrific 'King's Mouth' brings back 'The Soft Bulletin' spirit","description":"The new Flaming Lips album ’King's Mouth: Music and Songs’ feels like a spiritual sequel to ’Soft Bulletin’ and ’Yoshimi.’ Released as a Record Store Day exclusive, it'll be out officially in July. Continue reading…","url":"http://www.brooklynvegan.com/the-flaming-lips-terrific-kings-mouth-brings-back-the-soft-bulletin-spirit/","urlToImage":"http://www.brooklynvegan.com/files/2019/04/flaming-lips-kings-mouth.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89","publishedAt":"2019-04-19T15:55:13Z","content":"It’s been 20 years since The Flaming Lips released The Soft Bulletin, the instant classic that helped them make the transition from weirdo cult faves who made albums you needed four CD players to listen to, to being the confetti-shooting, giant-hamsterball-ri… [+3012 chars]"},{"source":{"id":null,"name":"Blazersedge.com"},"author":"Kyle Garcia","title":"Damian Lillard Embracing Defense in First Round Series vs. Thunder - Blazer's Edge","description":"Damian Lillard Embracing Defense in First Round Series vs. Thunder Blazer's Edge The Lillard-Westbrook Bad Blood Is Real, with Higher Stakes Than Ever Bleacher Report Thunder will dress Chesapeake Energy Arena in 'Sunset' for Game 3 OKC Thunder Wire The Favor…","url":"https://www.blazersedge.com/2019/4/19/18485619/damian-lillard-embracing-defense-first-round-nba-playoffs-thunder","urlToImage":"https://cdn.vox-cdn.com/thumbor/rAOyKIG5PPFgFwfXb742xNxg9HI=/0x215:3002x1787/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16162256/usa_today_12534371.jpg","publishedAt":"2019-04-19T21:09:00Z","content":"Portland Trail Blazers star Damian Lillard thrived in Game 2 of the Blazers first round series against the Oklahoma City Thunder, putting up 29 points, four rebounds and six assists. Besides his offensive contribution, his defense against Russell Westbrook wa… [+1242 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"https://facebook.com/WGR550","title":"CAPACCIO: 2019 Mock Draft No. 2 - WBEN","description":"CAPACCIO: 2019 Mock Draft No. 2 WBEN Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Cardinals Can't and Won't Pass on QB Kyler Murray at No. 1 in 2019 NFL Draft Bleacher Report NFL New York Giant…","url":"https://wgr550.radio.com/articles/opinion/capaccio-2019-mock-draft-no-2","urlToImage":"https://s3.amazonaws.com/s3.wgr550.com/Irv.jpg","publishedAt":"2019-04-19T04:05:39Z","content":"Let me be upfront and clear about this mock draft.  I changed the top pick for the sake of it possibly happening.  Even though I still beleieve, as of right now, that the Arizona Cardinals will take Oklahoma QB Kyler Murray first overall, that certainly isn't… [+4468 chars]"},{"source":{"id":null,"name":"Kcrg.com"},"author":"KCRG","title":"Brands roll with stoner 'holiday' as pot legalization grows - KCRG","description":"Brands roll with stoner 'holiday' as pot legalization grows KCRG Brands roll with stoner 'holiday' as pot legalization grows CNBC Brands roll with 4/20 as pot legalization grows The Associated Press US corporations embracing 420 as pot legalization grows WOOD…","url":"https://www.kcrg.com/content/news/Brands-roll-with-stoner-holiday-as-pot-legalization-grows-508795841.html","urlToImage":"https://media.graytvinc.com/images/marijuana3131.jpg","publishedAt":"2019-04-19T11:02:03Z","content":"LOS ANGELES (AP) Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn't yet h… [+5242 chars]"},{"source":{"id":null,"name":"Newsok.com"},"author":"Staff Reports","title":"Oklahoma business briefs for April 19 - NewsOK.com","description":"Former mayor named to IBC Bank board \n IBC Bank-Oklahoma on Thursday named former Oklahoma City Mayor Mick Cornett to its board. \n Cornett is president of Mick Cornett Inc. and hosts the television show The Verdict in Oklahoma City and Tulsa. He also is a dir…","url":"https://newsok.com/article/5629146/oklahoma-business-briefs-for-april-19","urlToImage":"https://s3.amazonaws.com/content.newsok.com/newsok/images/newsok_facebook.jpg","publishedAt":"2019-04-19T10:00:00Z","content":"Former mayor named to IBC Bank board\r\nIBC Bank-Oklahoma on Thursday named former Oklahoma City Mayor Mick Cornett to its board.\r\nCornett is president of Mick Cornett Inc. and hosts the television show The Verdict in Oklahoma City and Tulsa. He also is a direc… [+1084 chars]"},{"source":{"id":null,"name":"Ncaa.com"},"author":"Oklahoma Athletics","title":"College softball: No. 1 Oklahoma takes care of business vs. No. 11 Texas - NCAA.com","description":"College softball: No. 1 Oklahoma takes care of business vs. No. 11 Texas NCAA.com Behind a gem in the circle and clutch hitting, the No. 1 Oklahoma softball team took game one from No. 11 Texas 3-1 on Thursday Night at McCombs Field.","url":"https://www.ncaa.com/news/softball/article/2019-04-19/college-softball-no-1-oklahoma-takes-care-business-vs-no-11-texas","urlToImage":"https://www.ncaa.com/sites/default/files/public/styles/focal_point_large/public-s3/images/2019-04-19/Screen%20Shot%202019-04-19%20at%207.54.58%20AM.png?h=0ca70b8f&itok=xAqK0af1","publishedAt":"2019-04-19T13:35:36Z","content":"AUSTIN, Texas  Behind a gem in the circle and clutch hitting, the No. 1/1 Oklahoma softball team took game one from No. 11/10 Texas 3-1 on Thursday Night at McCombs Field.\r\nOklahoma has now won 29 consecutive games, matching the third-longest winning streak i… [+2442 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"","title":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up - CBS Sports","description":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up CBS Sports Five NFL General Managers Under the Most Pressure on Draft Day Sports Illustrated 2019 NFL Draft: late-round targets who are just as good as early-round prosp…","url":"https://www.cbssports.com/nfl/news/2019-nfl-draft-the-24-prospects-who-are-locks-for-the-first-round-plus-a-look-at-the-next-guys-up/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/19/dadb3583-ec12-4d9c-80bc-7dffe95d12a6/thumbnail/770x433/9dc26e1b036a62e0e201173f8b6f21cc/irv.jpg","publishedAt":"2019-04-19T14:15:00Z","content":"In most years, there are about 20-24 players in a draft who represent a safe bet to be first-round picks. The exact number can certainly vary by the year, but you can usually identify 75 percent of the players who will eventually comprise the top 32 picks.\r\nT… [+6291 chars]"},{"source":{"id":null,"name":"Fantasypros.com"},"author":null,"title":"NFL Mock Draft 2019 – First Round (2.0) - FantasyPros","description":"NFL Mock Draft 2019 – First Round (2.0) FantasyPros With the NFL Draft just days away I am excited to release my final mock draft of the season. There are quite a bit few changes from my first mock from back in... View full coverage on Google News","url":"https://www.fantasypros.com/2019/04/nfl-mock-draft-2019-first-round-2-0/","urlToImage":"https://www.fantasypros.com//cdn.fantasypros.com/wp-content/uploads/full_193666.jpg","publishedAt":"2019-04-19T13:20:50Z","content":"With the NFL Draft just days away I am excited to release my final mock draft of the season. There are quite a bit few changes from my first mock from back in February. The first wide receiver taken has changed. Numerous players have dropped out of the first … [+26088 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By kevin.fallon@thedailybeast.com (Kevin Fallon)","title":"Beyoncé’s ‘Homecoming’ Proves She’s the Greatest Entertainer Alive","description":"This week: Beyoncé Is So Damn Good It Hurts This week’s edition of The Daily Beast’s OBSESSED is coming to you from a higher plane of existence, from which I now reside after watching Beyoncé’s Homecoming documentary and concert special on Netflix. Read more …","url":"https://www.thedailybeast.com/beyonces-homecoming-proves-shes-the-greatest-entertainer-alive","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555672813/190418-Fallon-DB-Obsessed-embed-01_zhl1ta","publishedAt":"2019-04-19T14:09:28Z","content":"This week:\r\nStop everything and watch Homecoming.\r\nThe best part of the Game of Thrones premiere.\r\nReally? A modern-day Oklahoma!?\r\nThe Big Little Lies trailer arrived.\r\nVery important Antoni from Queer Eye news.\r\nBeyoncé Is So Damn Good It Hurts\r\nThis weeks … [+7427 chars]"},{"source":{"id":null,"name":"Snopes.com"},"author":"Associated Press","title":"US Corporations Embracing 420 as Pot Legalization Grows","description":"U.S. retail sales of cannabis products jumped to $10.5 billion last year, a threefold increase from 2017.","url":"https://www.snopes.com/ap/2019/04/19/us-corporations-embracing-420-as-pot-legalization-grows/","urlToImage":"https://www.snopes.com/tachyon/2019/04/AP19107811370541-e1555683860445.jpg?fit=1200,800","publishedAt":"2019-04-19T14:26:11Z","content":"LOS ANGELES (AP) Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesnt yet ha… [+5147 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Vikings will look to address O-line needs in draft","description":"With the offensive line still in flux, the Minnesota Vikings have a clear need to address yet again in NFL draft","url":"https://www.foxsports.com/north/story/minnesota-vikings-will-look-to-address-o-line-needs-through-draft-kirk-cousins-adam-thielen-stefon-diggs-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/274fe79e312543aa85d8914a36d0671f.vresize.1200.630.high.51.jpg","publishedAt":"2019-04-19T17:06:17Z","content":"MINNEAPOLIS The Minnesota Vikings will be constructing a new front five yet again this year.\r\nPerhaps this will be the spring they can finally plant a couple of seeds for stability.\r\nThe Vikings have consistently fielded one of the NFL’s best defenses since c… [+6106 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 of 14 Big Ten teams coming out of spring planning to continue quarterback auditions in preseason practices","url":"https://www.foxsports.com/college-football/story/7-big-ten-teams-will-extend-qb-competitions-into-preseason-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/c38cfc6b693c4045af601df963be3e3d.vresize.1200.630.high.90.jpg","publishedAt":"2019-04-19T15:16:09Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4876 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Blake Richardson","title":"They meet again: UCLA, Oklahoma are favorites in gymnastics championships","description":"As the UCLA gymnastics team practiced Thursday, a little more than 24 hours before the start of the NCAA championships, the Bruins behaved as they have all season. They danced between exercises and to each other’s floor routines, laughed while sporting shiny …","url":"https://www.latimes.com/sports/ucla/la-sp-ucla-gymnastics-ncaa-championships-20190418-story.html","urlToImage":"https://www.latimes.com/resizer/gX3uk8-Xpb1kWUPEJFZ0r0sKfBA=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/NRYI4ZIQF5EJDFKDC5HDRZHLEY.jpg","publishedAt":"2019-04-19T00:10:00Z","content":"As the UCLA gymnastics team practiced Thursday, a little more than 24 hours before the start of the NCAA championships, the Bruins behaved as they have all season.\r\nThey danced between exercises and to each others floor routines, laughed while sporting shiny … [+1782 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Lance Pugmire","title":"Terence Crawford is eager to prove he’s better than every other welterweight champion","description":"The game is set up so Terence Crawford can’t win, but to know Crawford is to understand he’ll never accept defeat. So he takes to the Madison Square Garden ring Saturday night against England’s Amir Khan, simultaneously defending his World Boxing Organization…","url":"https://www.latimes.com/sports/boxing/la-sp-terence-crawford-amir-khan-20190419-story.html","urlToImage":"https://www.latimes.com/resizer/uO2znTYgeD2pUqAsAfKilC4DsXY=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/EPPQX74PNVDETBZUFGLHODHNHU.jpg","publishedAt":"2019-04-19T20:50:00Z","content":"The game is set up so Terence Crawford cant win, but to know Crawford is to understand hell never accept defeat.\r\nSo he takes to the Madison Square Garden ring Saturday night against Englands Amir Khan, simultaneously defending his World Boxing Organization w… [+5717 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"John Cherwa","title":"The Sports Report: Natural order of things restored, Warriors beat Clippers","description":"Hello, one and all, my name is John Cherwa, and I’m guest-hosting this newsletter for a couple of weeks while Houston Mitchell decides which performance of “Avengers: Endgame” he’ll go to next weekend. Clippers We’ll admit it (and by we, I really mean me), we…","url":"https://www.latimes.com/sports/sportsnow/la-sp-sports-newsletter-20190418-story.html","urlToImage":"https://www.latimes.com/resizer/4IPqtiqD7YrzL-MGnDeH99pZthI=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/2UFMDCEOBRE3VKCC7E7VFIISDE.jpg","publishedAt":"2019-04-19T12:00:00Z","content":"Hello, one and all, my name is John Cherwa, and Im guest-hosting this newsletter for a couple of weeks while Houston Mitchell decides which performance of Avengers: Endgame hell go to next weekend.\r\nWell admit it (and by we, I really mean me), we got snookere… [+7772 chars]"},{"source":{"id":null,"name":"Outsideonline.com"},"author":"Outside Editors","title":"'The Bikes of Wrath' Trailer","description":"In the feature-length documentary The Bikes of Wrath, a group of novice Australian cyclists departs from Oklahoma to replicate the iconic journey taken by the Joad family in the American novel The Grapes of Wrath. They start out with $420, the same amount as …","url":"https://www.outsideonline.com/2393949/bikes-wrath-trailer","urlToImage":"https://www.outsideonline.com/sites/default/files/styles/full-page/public/2019/04/15/bikesofwrath_vth_h.jpg?itok=cDTbHwiq","publishedAt":"2019-04-19T18:00:02Z","content":null},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Associated Press","title":"Deadly storms tear across the South, killing at least 3","description":"Powerful spring storms on Thursday killed two Mississippi drivers and a woman in Alabama and knocked out poser to more than 100,000 people across Alabama, Mississippi, Louisiana and Texas.","url":"https://www.nbcnews.com/news/us-news/deadly-storms-tear-across-south-killing-least-3-n996236","urlToImage":"https://media4.s-nbcnews.com/j/newscms/2019_01/2705191/nbc-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.nbcnews-fp-1200-630.png","publishedAt":"2019-04-19T06:01:00Z","content":"Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\r\nSUBSCRIBE\r\nApril 19, 2019, 6:01 AM GMT\r\nLEARNED, Miss. Strong storms again roared across the South on Thursday, killing two Mississippi drivers and a … [+4347 chars]"},{"source":{"id":null,"name":"Kuathletics.com"},"author":"University of Kansas Athletics","title":"Kansas beats No. 12/15 Texas Tech - Kansas Jayhawks","description":"<strong>LUBBOCK, Texas</strong> – Kansas fought back a No. 12/15 Texas Tech rally attempt to earn its first victory over a ranked opponent since 2016, beating the Red Raiders 6-4 at Rocky Johnson Field. KU last defeated a ranked opponent April 2, 2016 against…","url":"https://kuathletics.com/news/2019/4/18/softball-kansas-beats-no-12-15-texas-tech.aspx","urlToImage":"https://kuathletics.com/images/2019/4/18/ramsey_sydnee.jpg?preset=large.socialmediaimage","publishedAt":"2019-04-19T02:40:04Z","content":null},{"source":{"id":null,"name":"Kusports.com"},"author":null,"title":"Kansas softball tops No. 12 Texas Tech - KUsports","description":"Kansas softball tops No. 12 Texas Tech KUsports The Kansas softball team fought back a No. 12 Texas Tech rally attempt to earn its first victory over a ranked opponent in three years, beating the Red Raiders by...","url":"http://www2.kusports.com/news/2019/apr/18/kansas-softball-tops-no-12-texas-tech/","urlToImage":"http://worldonline.media.clients.ellingtoncms.com/static/kusports.com/images/kusports-1200.jpg","publishedAt":"2019-04-19T03:03:53Z","content":"The Kansas softball team fought back a No. 12 Texas Tech rally attempt to earn its first victory over a ranked opponent in three years, beating the Red Raiders by a 6-4 margin at Rocky Johnson Field. \r\nKU last defeated a ranked opponent April 2, 2016 against … [+919 chars]"},{"source":{"id":null,"name":"Ramblinwreck.com"},"author":null,"title":"Georgia Tech #ProJackets Basketball – Men's Basketball — Georgia Tech Yellow Jackets - Georgia Tech Official Athletic Site","description":"Georgia Tech #ProJackets Basketball – Men's Basketball — Georgia Tech Yellow Jackets Georgia Tech Official Athletic Site Shumpert and the Rockets have a 2-0 lead in round one of the NBA playoffs.","url":"https://ramblinwreck.com/georgia-tech-projackets-basketball/","urlToImage":"https://ramblinwreck.com/amt-media/330459","publishedAt":"2019-04-19T04:33:51Z","content":"THE FLATS — Derrick Favors posted a double-double, Iman Shumpert and the Rockets to face the Jazz on Saturday at 10:30 p.m. in Utah,  That and more in this edition of the Georgia Tech #ProJackets Basketball Report.\r\nFavors scored 14 points and grabbed 12 rebo… [+9800 chars]"},{"source":{"id":null,"name":"Juancole.com"},"author":"Belle Chesler","title":"De-Funding the Great American School System for the 1%","description":"(Tomdispatch.com) - Three weeks ago, I sat in a cramped conference room in the large public high school where I teach in Beaverton, Oregon. I was listening to the principal deliver a scripted PowerPoint presentation on the $35 million budget deficit our distr…","url":"https://www.juancole.com/2019/04/funding-american-school.html","urlToImage":"https://www.juancole.com/images/2019/04/de-funding-the-great-american-sc.jpg","publishedAt":"2019-04-19T04:07:58Z","content":"(Tomdispatch.com) – Three weeks ago, I sat in a cramped conference room in the large public high school where I teach in Beaverton, Oregon. I was listening to the principal deliver a scripted PowerPoint presentation on the $35 million budget deficit our distr… [+13647 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Jason McIntyre thinks Russell Westbrook and Oklahoma City will bounce back against Portland in Game 3","description":"Despite struggling in Games 1 and 2, Jaosn McIntyre believes that Russell Westbrook and Oklahoma City will bounce back in Game 3 similar to how Kevin Durant and Golden State did.","url":"https://www.foxsports.com/watch/lock-it-in/video/1500006979703","urlToImage":"https://b.fssta.com/uploads/2019/04/JMAC000000-3.vresize.1200.630.high.50.jpg","publishedAt":"2019-04-19T20:47:30Z","content":null},{"source":{"id":null,"name":"Bleedingcool.com"},"author":"Rich Johnston","title":"Monster World Returns From American Gothic in July With Holli Interlandi For a Golden Age","description":"In 2015, American Gothic Press published Monster World by Philip Kim, Steve Niles and Piotr Kowalski. In 2019, it’s back... Read More The post Monster World Returns From American Gothic in July With Holli Interlandi For a Golden Age appeared first on Bleeding…","url":"https://www.bleedingcool.com/2019/04/19/monster-world-american-gothic-july-holli-interlandi-golden-age/","urlToImage":"https://mlpnk72yciwc.i.optimole.com/w:1024/h:536/q:auto/https://www.bleedingcool.com/wp-content/uploads/2019/04/stl121845.jpg","publishedAt":"2019-04-19T15:00:14Z","content":"In 2015, American Gothic Press published Monster World by Philip Kim, Steve Niles and Piotr Kowalski.\r\nIn 2019, its back with a new Golden Age, and Holli Interlandi, Editor of Famous Monsters, for American Gothic Press, and writer on Black Masks Last Song tak… [+688 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"CBS/AP","title":"Deadly storm system rips through South, heads north","description":"Brings tornadoes, heavy rain, and high winds to several states, and blamed for some deaths","url":"https://www.cbsnews.com/news/deadly-storm-system-rips-through-south-heads-north/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/19/ab0d69a3-d924-407e-bb6f-88011c760b53/thumbnail/1200x630/5d8fc68946e8ee05c00614f8463ccd37/ap-19109052251047.jpg","publishedAt":"2019-04-19T09:07:37Z","content":"Learned, Miss. -- Strong storms again roared across the South on Thursday, killing at least two people while leaving more than 100,000 people without power across Alabama, Mississippi, Louisiana and Texas.\r\nNational Weather Service forecasters said they belie… [+3195 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"CBS/AP","title":"Corporate America embraces 420 as pot legalization grows","description":"April 20 marijuana holiday now a mainstream marketing gimmick, from Lyft's $4.20 credits to Carl's Jr.'s CBD burgers","url":"https://www.cbsnews.com/news/420-day-corporate-america-embraces-420-as-pot-legalization-grows/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/01/23/2e9850a8-9020-4797-a9ef-03f3a946ae50/thumbnail/1200x630/603c8d5b6fcfbc449e3d869b55d6f873/0122-en-marijuana-strassmann-1764713-640x360.jpg","publishedAt":"2019-04-19T19:05:25Z","content":"Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn't yet have a card to mar… [+5301 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Ed Leefeldt","title":"Hail damage costs this year could hit new annual high in U.S.","description":"While baseball-sized hail stones are common, the biggest this year was the size of a grapefruit and weighed more than half a pound","url":"https://www.cbsnews.com/news/hail-damage-costs-this-year-could-hit-new-annual-high-in-u-s/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2018/08/07/73c1376c-840e-424e-8d87-4af0c87bead5/thumbnail/1200x630/edd74cad3d94d9609e06417525c40ff4/hail.png","publishedAt":"2019-04-19T09:00:05Z","content":"While 2017 was the worst year for hail damage, 2019 is already \"off and running,\" insurance experts say.\r\nHail now costs the U.S. as much as $22 billion a year in damage to homes, cars, crops, people and more.\r\nBaseball-sized hail stones are common, but the b… [+4523 chars]"},{"source":{"id":null,"name":"Airforcetimes.com"},"author":"Marcia Dunn, The Associated Press","title":"America's 1st female astronaut candidate, Jerrie Cobb, dies - AirForceTimes.com","description":"America's 1st female astronaut candidate, Jerrie Cobb, dies AirForceTimes.com Female space pioneer and member of the Mercury 13, Jerrie Cobb has died at 88 years old Houston Chronicle Jerrie Cobb, one of the most gifted female pilots in history, has died Ars …","url":"https://www.airforcetimes.com/news/your-air-force/2019/04/19/americas-1st-female-astronaut-candidate-jerrie-cobb-dies/","urlToImage":"https://www.armytimes.com/resizer/FkLBUK175zOjyA58qcrTMQQ5jR4=/1200x630/filters:quality(100)/arc-anglerfish-arc2-prod-mco.s3.amazonaws.com/public/HEK2SFBJD5CDVHKHUXM4KC2VZQ.jpg","publishedAt":"2019-04-19T00:40:00Z","content":"CAPE CANAVERAL, Fla. Americas first female astronaut candidate, pilot Jerrie Cobb, who pushed for equality in space but never reached its heights, has died.\r\n Cobb died in Florida at age 88 on March 18 following a brief illness. News of her death came Thursda… [+3915 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":null,"title":"NFL exec would 'love redo' on Raiders' tough road schedule - NBCSports.com","description":"NFL exec would 'love redo' on Raiders' tough road schedule NBCSports.com Report: Raiders Front Office Is Paranoid, Preparing To Clean House, Totally In Character Deadspin Jon Gruden's power play continues in his shutting out of Raiders scouts over trust issue…","url":"https://www.nbcsports.com/bayarea/raiders/nfl-executive-would-love-redo-raiders-tough-2019-schedule","urlToImage":"https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2019/04/19/grudencarr_ap.jpg","publishedAt":"2019-04-19T18:57:02Z","content":"With six days to go until the 2019 NFL Draft,  Jon Gruden and Mike Mayock reportedly closed their ranks, sending all of their lower-tier scouts home due to a lack of trust. \r\nIt makes sense for the Raiders to send people home for a few reasons, mainly the fac… [+4495 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"William Laws","title":"Tornado threat ramps up after storms turn deadly in Deep South - AOL","description":"Tornado threat ramps up after storms turn deadly in Deep South AOL Storm threat winds down ahead of pleasant Easter Sunday ABC News Tornado canceled in Maryland WBAL TV Baltimore Severe weather threat is over for central Va.; report damage to help the NWS sur…","url":"https://www.aol.com/article/weather/2019/04/19/tornado-threat-ramps-up-from-florida-to-virginia-after-storms-turn-deadly-in-deep-south/23714584/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/4434x2910+0+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2Fa4d218b0-62d1-11e9-b3db-ae7a401213fa","publishedAt":"2019-04-19T17:30:42Z","content":"A string of violent storms that spawned possible tornadoes on Friday capped a wild week of weather across the southern and eastern U.S. The dangerous storms will continue spreading up the East Coast into Friday night.\r\nThe storms turned deadly on Thursday aft… [+6485 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Once-counterculture 420 marijuana holiday goes mainstream","description":"Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.","url":"https://finance.yahoo.com/news/once-counterculture-420-marijuana-holiday-goes-mainstream-192054196.html","urlToImage":"https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png","publishedAt":"2019-04-19T19:20:54Z","content":"LOS ANGELES (AP) Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn't yet h… [+5254 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Brands roll with stoner 'holiday' as pot legalization grows","description":"LOS ANGELES (AP) — Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.","url":"https://news.yahoo.com/brands-roll-stoner-holiday-pot-legalization-grows-043424536--finance.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/c95ksHz8PC5jNpjKAsDcwA--~B/aD0xNjc1O3c9MjUxMjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/d944d1e39cfe4513a755ff1326744691.jpg","publishedAt":"2019-04-19T04:36:05Z","content":"LOS ANGELES (AP) Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn't yet h… [+5254 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Meredith Videos","title":"The Arizona Cardinals' Unprecedented Decision At #1 Overall","description":"After a disappointing rookie year from last year's top 10 pick Josh Rosen, the Arizona Cardinals hold the first overall pick in this year's draft and are contemplating selecting Heisman winning QB Kyler Murray of Oklahoma.","url":"https://sports.yahoo.com/arizona-cardinals-unprecedented-decision-1-221236939.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/4ev4WyaO0wT0L1AOQDEz6A--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/video/meredith_videos_131/b4e1b96573e70894eff489e9205e79a9","publishedAt":"2019-04-19T22:14:06Z","content":"After a disappointing rookie year from last year's top 10 pick Josh Rosen, the Arizona Cardinals hold the first overall pick in this year's draft and are contemplating selecting Heisman winning QB Kyler Murray of Oklahoma."},{"source":{"id":null,"name":"Arizonasports.com"},"author":"Arizona Sports","title":"Most recent Heisman Trophy winners selected No. 1 in the NFL Draft","description":"Less than a week remains until the Cardinals make the first pick of the 2019 NFL draft, and Oklahoma quarterback Kyler Murray remains the assumed favorite to go No. 1. Murray threw for 4,361 yards and 42 touchdowns while completing 69% of his passes this past…","url":"http://arizonasports.com/story/1913853/the-5-most-recent-heisman-trophy-winners-selected-no-1-in-the-nfl-draft/","urlToImage":"http://arizonasports.com/wp-content/uploads/2019/04/kylerheisman.jpg","publishedAt":"2019-04-19T22:01:00Z","content":"Less than a week remains until the Cardinals make the first pick of the 2019 NFL draft, and Oklahoma quarterback Kyler Murray remains the assumed favorite to go No. 1.\r\nMurray threw for 4,361 yards and 42 touchdowns while completing 69% of his passes this pas… [+3957 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Reuters","title":"NFL notebook: Rosen calls life in limbo 'annoying'","description":"The Cardinals hold the No. 1 pick in next week's NFL draft and speculation is rampant that the team, with new coach Kliff Kingsbury at the helm, will select former Oklahoma quarterback and Heisman Trophy winner Kyler Murray.  \"I definitely understand the situ…","url":"https://news.yahoo.com/nfl-notebook-rosen-calls-life-001653440.html","urlToImage":null,"publishedAt":"2019-04-19T00:16:53Z","content":"Arizona Cardinals quarterback Josh Rosen spoke publicly for the first time Thursday about the limbo he finds himself in with the team that drafted him last year, telling SI TV that it's \"annoying\" but that he \"definitely understands the situation.\"\r\nThe Cardi… [+3364 chars]"},{"source":{"id":null,"name":"Arizonasports.com"},"author":"Arizona Sports","title":"Most recent Heisman Trophy winners selected No. 1 in the NFL Draft","description":"Less than a week remains until the Cardinals make the first pick of the 2019 NFL draft, and Oklahoma quarterback Kyler Murray remains the assumed favorite to go No. 1. Murray threw for 4,361 yards and 42 touchdowns while completing 69% of his passes this past…","url":"https://arizonasports.com/story/1913853/the-5-most-recent-heisman-trophy-winners-selected-no-1-in-the-nfl-draft/","urlToImage":"https://arizonasports.com/wp-content/uploads/2019/04/kylerheisman.jpg","publishedAt":"2019-04-19T22:01:00Z","content":"Less than a week remains until the Cardinals make the first pick of the 2019 NFL draft, and Oklahoma quarterback Kyler Murray remains the assumed favorite to go No. 1.\r\nMurray threw for 4,361 yards and 42 touchdowns while completing 69% of his passes this pas… [+3957 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"WGR 550 SportsRadio","title":"CAPACCIO: 2019 Mock Draft No. 2","description":"Let me be upfront and clear about this mock draft. I changed the top pick for the sake of it possibly happening. Even though I still beleieve, as of right now, that the Arizona Cardinals will take Oklahoma QB Kyler Murray first overall, that certainly isn't a…","url":"https://wgr550.radio.com/articles/opinion/capaccio-2019-nfl-mock-draft-no-2","urlToImage":"https://s3.amazonaws.com/s3.wgr550.com/Irv.jpg","publishedAt":"2019-04-19T04:05:39Z","content":"Let me be upfront and clear about this mock draft. I changed the top pick for the sake of it possibly happening. Even though I still believe, as of right now, that the Arizona Cardinals will take Oklahoma quarterback Kyler Murray first overall, that certainly… [+4495 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Omnisport","title":"The O-Line bond behind two Heisman Trophies - Dru Samia & Ben Powers talk protecting Baker Mayfield & Kyler Murray","description":"Oklahoma's O-Line provided protection for two successive Heisman Trophy winners, and next week four of its members will head to the NFL.","url":"https://sports.yahoo.com/o-line-bond-behind-two-171923887.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/1KMI7V.Ow0J1UjDp416sQA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/omnisport.uk/809024e55870bf503621d01f40ff0770","publishedAt":"2019-04-19T17:19:23Z","content":"Producing successive Heisman Trophy-winning quarterbacks and likely consecutive number one NFL draft picks is no easy feat, but it helps if you have one of the best offensive lines around.\r\nIn 2017, Baker Mayfield played behind an Oklahoma Sooners O-Line that… [+7867 chars]"},{"source":{"id":null,"name":"Freep.com"},"author":"Detroit Free Press","title":"NFL mock draft 4.0: Detroit Lions get the trade down they desire","description":"Dave Birkett, Carlos Monarrez debate takeaways from Bob Quinn's predraft Q&A, guess which player Lions will draft at No. 8. Filmed April 18, 2019. Detroit Lions general manager Bob Quinn's desire to trade down in Round 1 is real, so I thought I'd try and inco…","url":"https://www.freep.com/story/sports/nfl/lions/2019/04/19/nfl-mock-draft-detroit-lions/3516601002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/0718e83113651d4c86a6bf8e49b0e1d5ed22dc11/c=0-412-4776-3098/local/-/media/2019/02/05/USATODAY/usatsports/usatsi_11966306.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T13:27:08Z","content":"Dave Birkett, Carlos Monarrez debate takeaways from Bob Quinn's predraft Q&amp;A, guess which player Lions will draft at No. 8. Filmed April 18, 2019.\r\n Dave Birkett and Carlos Monarrez, Detroit Free Press\r\nDetroit Lions general manager Bob Quinn’s desire to … [+7897 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Yahoo Sports","title":"Report: Tyreek Hill temporarily loses custody of son during battery investigation","description":"Tyreek Hill has reportedly lost custody of his 3-year-old son while he's involved in family court hearings.","url":"https://ca.sports.yahoo.com/news/report-tyreek-hill-temporarily-loses-custody-of-son-during-battery-investigation-012931741.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/lW951nCJkQMoDYZDVsKyig--~B/aD0yOTk5O3c9NDQ5OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cb9225a240000b900068284.jpeg","publishedAt":"2019-04-19T01:29:31Z","content":"Kansas City Chiefs wide receiver Tyreek Hill and his fiancée Crystal Espinal have temporarily lost custody of their 3-year-old son as officials investigate allegations of child abuse, KCTV5 reports.\r\nPolice have been investigating an alleged battery incident … [+2799 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Reuters","title":"NFL notebook: Rosen calls life in limbo 'annoying'","description":"Arizona Cardinals quarterback Josh Rosen spoke publicly for the first time Thursday about the limbo he finds himself in with the team that drafted him last year, telling SI TV that it's \"annoying\" but that he \"definitely understands the situation.\"  The Cardi…","url":"https://sports.yahoo.com/nfl-notebook-rosen-calls-life-limbo-annoying-003637884--nfl.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/BXTd2OKnVdb5_uxgsvGgtA--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2019-04-19T003637Z_1_LYNXNPEF3I00H_RTROPTP_2_FOOTBALL-NFL-TEN-JAC.JPG","publishedAt":"2019-04-19T00:36:37Z","content":"Arizona Cardinals quarterback Josh Rosen spoke publicly for the first time Thursday about the limbo he finds himself in with the team that drafted him last year, telling SI TV that it's \"annoying\" but that he \"definitely understands the situation.\"\r\nThe Cardi… [+3364 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Reuters","title":"NFL notebook: Rosen calls life in limbo 'annoying'","description":"Arizona Cardinals quarterback Josh Rosen spoke publicly for the first time Thursday about the limbo he finds himself in with the team that drafted him last year, telling SI TV that it's \"annoying\" but that he \"definitely understands the situation.\"  The Cardi…","url":"https://sports.yahoo.com/nfl-notebook-rosen-calls-life-limbo-annoying-003637788--nfl.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/AsrvE1pcTFB2LZ8MY04S8Q--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2019-04-19T003637Z_1_LYNXNPEF3I00H-OCASP_RTROPTP_2_CSPORTS-US-FOOTBALL-NFL-NOTEBOOK.JPG","publishedAt":"2019-04-19T00:36:37Z","content":"Arizona Cardinals quarterback Josh Rosen spoke publicly for the first time Thursday about the limbo he finds himself in with the team that drafted him last year, telling SI TV that it's \"annoying\" but that he \"definitely understands the situation.\"\r\nThe Cardi… [+3364 chars]"},{"source":{"id":null,"name":"Oregonlive.com"},"author":"OregonLive.com","title":"Breaking down Seattle Seahawks' 2019 schedule","description":"Earlier this week, the NFL released the full schedule for the 2019 season. Based on the winning percentage of last season's opponents, the Seattle Seahawks face the eighth-easiest schedule in the league. Combined, opponents on the schedule for this season won…","url":"https://www.oregonlive.com/sports/2019/04/breaking-down-seattle-seahawks-2019-schedule.html","urlToImage":"https://www.oregonlive.com/resizer/zgPG8-dFHW9T5ZZUD0JDRMH65H0=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/KFDMIWSL4FAIFFRCKD3VAT5AZI.jpg","publishedAt":"2019-04-19T23:10:35Z","content":"Earlier this week, the NFL released the full schedule for the 2019 season. Based on the winning percentage of last seasons opponents, the Seattle Seahawks face the eighth-easiest schedule in the league.\r\nCombined, opponents on the schedule for this season won… [+6032 chars]"},{"source":{"id":null,"name":"Oregonlive.com"},"author":"OregonLive.com","title":"Meet the officials for Trail Blazers-Thunder Game 3: Is this a good referee crew?","description":"The Portland Trail Blazers are up 2-0 on the Oklahoma City Thunder as their first round playoff series shifts to Oklahoma City for Games 3 and 4. Will the Blazers have the same success they found in the confines of Rip City, or will the officiating crew be a …","url":"https://www.oregonlive.com/blazers/2019/04/meet-the-officials-for-trail-blazers-thunder-game-3-is-this-a-good-referee-crew.html","urlToImage":"https://www.oregonlive.com/resizer/1HI9i5cGFGXUMJaTWioLkX7ykNk=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/TQZYTKM4PZEOFBSI4B5M5UVPII.jpg","publishedAt":"2019-04-19T23:29:03Z","content":"The Portland Trail Blazers are up 2-0 on the Oklahoma City Thunder as their first round playoff series shifts to Oklahoma City for Games 3 and 4. Will the Blazers have the same success they found in the confines of Rip City, or will the officiating crew be a … [+3650 chars]"},{"source":{"id":null,"name":"Nj.com"},"author":"NJ.com","title":"Portland Trail Blazers vs. Oklahoma City Thunder TV Schedule: What time, channel is Russell Westbrook vs. Damian Lillard?","description":"Watch Kobe Bryant break down playoff games on his show 'Detail' for free with a trial of ESPN+. Bet on the game or on the Thunder, Blazers to win the NBA Championship at DraftKings and get a free $20 bet when you sign up. Portland leads the series, 2-0, after…","url":"https://www.nj.com/sports/2019/04/portland-trail-blazers-vs-oklahoma-city-thunder-tv-schedule-what-time-channel-is-russell-westbrook-vs-damian-lillard-watch-nba-playoffs-online-41919.html","urlToImage":"https://www.nj.com/resizer/EsqeH9DTC7RvmndquDk9dlsuuW4=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/YJG33GAJHRC2VJZZW5QD4STWKU.jpg","publishedAt":"2019-04-19T09:47:26Z","content":"The Oklahoma City Thunder, led by guard Russell Westbrook, host the Portland Trail Blazers, led by guard Damian Lillard, in game three of their 2019 NBA Playoffs first round series at the Chesapeake Energy Center in Oklahoma City, Oklahoma on Friday, April 19… [+5157 chars]"},{"source":{"id":null,"name":"Jsonline.com"},"author":"Milwaukee Journal Sentinel","title":"Brewers play-by-play announcer Brian Anderson has been all over the NBA map this postseason","description":"Question: In which series can you hear Milwaukee Brewers play-by-play man Brian Anderson calling the NBA playoffs? The answer might wind up being \"all of them.\" Anderson and color commentator Kevin McHale called the third game of the battle between the Golden…","url":"https://www.jsonline.com/story/sports/mlb/brewers/2019/04/19/brewers-announcer-brian-anderson-has-called-three-nba-playoff-series/3521287002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/18/PMJS/dc9e5194-2405-4cff-811f-1c0f8b268d4e-MOY_1909.jpg?crop=2866,1612,x1351,y362&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T18:59:47Z","content":"Brewers TV analyst Brian Anderson\r\n (Photo: Fox Sports Wisconsin)\r\nQuestion: In which series can you hear Milwaukee Brewers play-by-play man Brian Anderson calling the NBA playoffs?\r\nThe answer might wind up being \"all of them.\"\r\nAnderson and color commentato… [+1668 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Rotoworld","title":"NBA DFS Plays: Friday 4/19","description":"Spencer Limbach finds the best NBA DFS Plays on Friday, April 19.","url":"https://sports.yahoo.com/nba-dfs-plays-friday-4-170544022.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/ozkAOfhzHXK6cYTKScHRlg--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/8d2f5a97b46b8095fda33d684597d6f1","publishedAt":"2019-04-19T17:05:44Z","content":"This article aims to highlight some of the best NBA DFS Plays at every position for your FanDuel and DraftKings lineups. Keep in mind that the following player write-ups were constructed earlier in the day, and sometimes injury/rest situations can alter the f… [+3217 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Omnisport","title":"76ers win without Embiid, Warriors bounce back in big way","description":"Even without Joel Embiid, the Philadelphia 76ers were too good for the Brooklyn Nets.","url":"https://sports.yahoo.com/76ers-win-without-embiid-warriors-053635095.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/K8H4ToAYR.mR79NJy0Vn1Q--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/omnisport.uk/d4900b3ed52e211bdf5e61ed1eca2fc1","publishedAt":"2019-04-19T05:36:35Z","content":"The Philadelphia 76ers managed to come away with a victory over the Brooklyn Nets despite not having one of their best players on Thursday.\r\nPhiladelphia took home a 131-115 win over the Nets in game three of their opening round playoff series at the Barclays… [+3166 chars]"},{"source":{"id":null,"name":"Sportingnews.com"},"author":"Sporting News","title":"NBA playoffs wrap 2019: 76ers win without Joel Embiid","description":"The 76ers managed to come away with a victory Thursday despite not having one of their best players. Philadelphia took home a 131-115 win over the Nets in Game 3 of their opening round playoff series at the Barclays Center. The team was without Joel Embiid, w…","url":"https://www.sportingnews.com/us/nba/news/nba-playoffs-wrap-2019-76ers-win-without-joel-embiid-updated-warriors-clippers/14f9mpxc9ud281fxvnmyayzy0g","urlToImage":"https://images.performgroup.com/di/library/omnisport/55/6c/simmons-ben-usnews-041819-ftr-getty_wypej2pc4m8y1fbh62ptuyx81.jpg?t=862642130&quality=100","publishedAt":"2019-04-19T03:44:05Z","content":"The 76ers managed to come away with a victory Thursday despite not having one of their best players.\r\nPhiladelphia took home a 131-115 win over the Nets in Game 3 of their opening round playoff series at the Barclays Center. The team was without Joel Embiid, … [+3032 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"RotoWire.com","title":"Yahoo DFS Basketball: Friday Picks","description":"The Thunder will need to rely heavily on Steven Adams in the middle if they are going to get back into their series with Portland.","url":"https://sports.yahoo.com/yahoo-dfs-basketball-friday-picks-074100372.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/I4LriSqRW6W96rk2AbdAGQ--~B/aD0zMDA7dz0yNDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/rotowire.com/351c4b906eb17f3e2e093d57ae3a1191","publishedAt":"2019-04-19T07:41:00Z","content":"Friday brings three Game 3s across the NBA with both the Celtics and Blazers trying to take commanding 3-0 series leads. The Raptors will also be trying to regain home court advantage by winning one on the road against the Magic. We have another opportunity t… [+4173 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Yahoo Canada Sports","title":"Raptors have point to prove in playoff road tests ahead","description":"The Toronto Raptors still have a demon or two to slay on the road in the playoffs against the Orlando Magic.","url":"https://sports.yahoo.com/raptors-have-point-to-prove-in-playoff-road-tests-ahead-154854762.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/x81UMUxTpjMGpmaVNwbxXg--~B/aD0xMjgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cb92e92240000c202044d03.jpeg","publishedAt":"2019-04-19T15:48:54Z","content":"Rise to the occasion.\r\nThats the challenge the Toronto Raptors will be faced with when they play their first playoff road game since getting swept out of last years playoffs by LeBron James and the Cleveland Cavaliers the moment that triggered a sequence of e… [+5835 chars]"},{"source":{"id":null,"name":"Sfchronicle.com"},"author":"SFChronicle.com","title":"Warriors, Rockets on collision course","description":"Christmas wouldn't work in August. Farmers don't harvest the crops until it's time. But when it comes to the NBA playoffs, it's not so distasteful to put the calendar on fast-forward. A Warriors-Houston series is nearly upon us — in the second round, of all t…","url":"https://www.sfchronicle.com/warriors/article/Warriors-Rockets-on-collision-course-13781420.php","urlToImage":"https://s.hdnux.com/photos/01/01/64/54/17255198/3/rawImage.jpg","publishedAt":"2019-04-19T21:20:11Z","content":"Christmas wouldn’t work in August. Farmers don’t harvest the crops until it’s time. But when it comes to the NBA playoffs, it’s not so distasteful to put the calendar on fast-forward.\r\nA Warriors-Houston series is nearly upon us — in the second round, of all … [+5832 chars]"},{"source":{"id":"time","name":"Time"},"author":"ALEX VEIGA / AP","title":"Corporate America Gears Up for ‘Weed Day’ Celebrations on April 20","description":"The counter-culture celebration on Apr. 20 was all about getting stoned, but is now so mainstream brands are starting to embrace it.","url":"http://time.com/5573878/420-april-20-weed-marijuana-cannabis-day-marketing-brands/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/gettyimages-949250036.jpg?quality=85","publishedAt":"2019-04-19T05:49:27Z","content":"LOS ANGELES — Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn’t yet have… [+5217 chars]"},{"source":{"id":null,"name":"Truthdig.com"},"author":"ALEX VEIGA / The Associated Press","title":"U.S. Corporations Embracing 420 as Pot Legalization Grows","description":"As the April 20 celebration of marijuana culture goes mainstream, brands get on board, even advocating criminal justice reform.","url":"https://www.truthdig.com/articles/u-s-corporations-embracing-420-as-pot-legalization-grows/","urlToImage":null,"publishedAt":"2019-04-19T16:13:23Z","content":"LOS ANGELESPotheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn’t yet have a … [+5181 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"Theo Lawson","title":"Washington State has a problem: too many good receivers. (Nobody said it was a bad one.)","description":"With seven receivers returning who played significant roles a year ago, the Cougars are left with a happy dilemma: what to do with the others. With the outside spots clogged up, Kassidy Woods got a trial run in the slot, vacated by departing senior Kyle Sweet.","url":"https://www.seattletimes.com/sports/wsu-cougar-football/washington-state-has-a-problem-too-many-good-receivers-nobody-said-it-was-a-bad-one/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/115615-1200x630.jpg","publishedAt":"2019-04-19T18:58:48Z","content":"PULLMAN Its a surplus the Cougars are thrilled to have, but one they have to figure out nonetheless.\r\nBarring any unforeseen transfers or unplanned departures between now and August, Washington State is counting on having seven of eight rotational wide receiv… [+5799 chars]"},{"source":{"id":null,"name":"Theaviationist.com"},"author":"David Cenciotti","title":"Three Weeks After Issues Were Identified With B-1’s Escape Systems, The U.S. Air Force “Lancer” Fleet Remains Grounded","description":"The “Bones” are still grounded as a consequence of a routing inspection of the B-1B drogue chute system. On Mar. 28, 2019, the Air Force Global Strike Command, that manages the U.S. bombers, ordered a [...]","url":"https://theaviationist.com/2019/04/19/three-weeks-after-issues-were-identified-with-b-1s-escape-systems-the-u-s-air-force-lancer-fleet-remains-grounded/","urlToImage":"https://i2.wp.com/theaviationist.com/wp-content/uploads/2019/04/B-1-bomber-in-flight.jpg?fit=1024%2C485&ssl=1","publishedAt":"2019-04-19T13:14:20Z","content":"File photo of a B-1 in flight. (Image credit: Boeing).\r\nOn Mar. 28, 2019, the Air Force Global Strike Command, that manages the U.S. bombers, ordered a “safety stand-down” of the Lancer fleet.\r\n“During a routine inspection of the B-1B drogue chute system, pot… [+3950 chars]"},{"source":{"id":null,"name":"Livejournal.com"},"author":"apathycollusion","title":"Bill Hader Doesn't Know What To Do With His Hands Plus Esquire Magazine Photoshoot & Interview","description":"-\"James asks Bill Hader about his tendency to look rather awkward in photos because he doesn't quite know what to do with his arms, and James has some photos to dissect.\" -\"James asks Bill Hader about his childhood growing up in Oklahoma and learns Bill was m…","url":"https://ohnotheydidnt.livejournal.com/114543071.html","urlToImage":"https://l-files.livejournal.net/og_image/3616053/447433?v=1555714237","publishedAt":"2019-04-19T22:50:34Z","content":"-\"James asks Bill Hader about his tendency to look rather awkward in photos because he doesn't quite know what to do with his arms, and James has some photos to dissect.\"\r\n-\"James asks Bill Hader about his childhood growing up in Oklahoma and learns Bill was … [+1732 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"CBS Sports Staff","title":"NBA Playoffs 2019: Thunder vs. Blazers odds, picks, Game 3 predictions from model on 77-62 roll","description":"SportsLine's advanced computer model simulated Friday's Thunder vs. Blazers game 10,000 times.","url":"https://www.cbssports.com/nba/news/nba-playoffs-2019-thunder-vs-blazers-odds-picks-game-3-predictions-from-model-on-77-62-roll/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/25/77cde1ab-15a8-4fba-8b4e-111515fc5c7d/thumbnail/770x433/ec18919e641844d671a15e58321e83b3/russell-westbrook-thunder.jpg","publishedAt":"2019-04-19T17:24:33Z","content":"The Oklahoma City Thunder dominated their regular-season matchups against the Portland Trail Blazers. But the clubs have reversed roles in the first round of the 2019 NBA Playoffs, as Portland takes a 2-0 lead into Game 3 on Friday night. Tipoff from Chesapea… [+3149 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"CBS Sports Staff","title":"NBA odds, picks, lines, predictions, Playoffs schedule, best bets for Apr. 19: This three-way parlay pays 6-1","description":"SportsLine's top experts are going big with an NBA parlay","url":"https://www.cbssports.com/nba/news/nba-odds-picks-lines-predictions-playoffs-schedule-best-bets-for-apr-19-this-three-way-parlay-pays-6-1/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/30/df6cc97b-e354-43e3-ae4d-1705663ff2ce/thumbnail/770x433/0dc6a5deed8721872bdc6da141352736/kyrie.jpg","publishedAt":"2019-04-19T02:23:37Z","content":"The 2019 NBA Playoffs resume on Friday night with three series shifting to new locations for Game 3. It all starts with the Toronto Raptors (-4.5) playing at the Orlando Magic in the first playoff game at the Amway Center in seven years. The Indiana Pacers (-… [+2477 chars]"}]}