{"status":"ok","totalResults":721,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Joanna Glasner","title":"From lab-grown meat to fermented fungus, here’s what corporate food VCs are serving up","description":"We put together a list of venture funds operated by some of the larger food and beverage producers, covering literally everything from soup to nuts (plus lunch meat and soda, too!).","url":"http://techcrunch.com/2019/04/20/from-lab-grown-meat-to-fermented-fungus-heres-what-corporate-food-vcs-are-serving-up/","urlToImage":"https://techcrunch.com/wp-content/uploads/2014/11/shutterstock_138061871.jpg?w=579","publishedAt":"2019-04-20T17:30:33Z","content":"More posts by this contributor\r\nIn a foodies ideal world, wed all eat healthy, minimally processed cuisine sourced from artisanal farmers, bakers and chefs.\r\nIn the real world, however, most of us derive the lions share of calories from edibles supplied by a … [+6625 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"PETER BAKER and NICHOLAS FANDOS","title":"Mueller Report Does Nothing to Narrow a Vast Partisan Divide","description":"As Democrats issued a subpoena demanding an unredacted copy of the report and condemned the president’s conduct, most Republican lawmakers remained silent on the findings.","url":"https://www.nytimes.com/2019/04/19/us/politics/mueller-report-democrats-republicans.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/us/politics/19dc-trump1/19dc-trump1-facebookJumbo.jpg","publishedAt":"2019-04-20T00:32:17Z","content":"In addition to Mr. Barrs testimony and an outstanding invitation for Mr. Mueller, Mr. Nadler said on Friday that he would hold additional hearings to get to the bottom of this and educate the country as to what went on.\r\nThe idea is not to decide whether to d… [+1612 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"CHRISTOPHER MELE","title":"Man Charged in Racist Threats Against Cory Booker, Rashida Tlaib and Eric Swalwell","description":"Representative Rashida Tlaib, a Michigan Democrat. A Florida man was charged on Friday with threatening her, Representative Eric Swalwell of California and Senator Cory Booker of New Jersey.","url":"https://www.nytimes.com/2019/04/19/us/threats-congress-john-kless.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/nyregion/19xp-kless2/merlin_151362459_6ce33b2f-edea-46ae-9380-66783e0944e4-facebookJumbo.jpg","publishedAt":"2019-04-20T01:25:03Z","content":"Dont you worry, you government officials will be in the graves where they belong, he said, according to court records.\r\nBased on the threatening nature of the calls and that Ms. Tlaib was scheduled to speak in Florida on April 20 and 21, law enforcement offic… [+1396 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MITCH SMITH","title":"What Happens When a Convicted Killer Moves to Town?","description":"Thomas Kokoraleis, a member of the “Ripper Crew” that once terrorized Illinois, was released from prison last month and moved to Aurora. The mayor and many residents want him gone.","url":"https://www.nytimes.com/2019/04/20/us/ripper-crew-aurora-illinois.html","urlToImage":"https://static01.nyt.com/images/2019/04/18/us/00rippercrew-03/00rippercrew-03-facebookJumbo.jpg","publishedAt":"2019-04-20T14:55:18Z","content":"In Aurora, Mayor Irvin issued a letter criticizing Wayside Cross. Living near Mr. Kokoraleis, he wrote, was a risk the people of Aurora shouldnt have to take. He described the episode as absolutely a betrayal to the city, to our community, to the citizens.\r\nL… [+1964 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MAURICE ISSERMAN","title":"America’s Original Socialist","description":"A century ago, Eugene V. Debs went to prison for his beliefs.","url":"https://www.nytimes.com/2019/04/20/opinion/americas-original-socialist.html","urlToImage":"https://static01.nyt.com/images/2019/04/20/opinion/20Isserman2/20Isserman2-facebookJumbo.jpg","publishedAt":"2019-04-20T15:00:04Z","content":"Instead he turned to industrial unionism, the strategy of organizing all workers in a given industry, regardless of skill, into a single organization. In 1893 he helped form and became president of the American Railway Union, which enjoyed a brief but phenome… [+2016 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Would you pay to drive this famous street?","description":"California officials say this famous quirky street is too crowded with tourists, and they may enact a toll to keep it under control.","url":"https://www.cnn.com/videos/travel/2019/04/20/lombard-street-toll-san-francisco-travel-orig.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190419112536-lombard-street-san-francisco-super-tease.jpg","publishedAt":"2019-04-20T13:45:29Z","content":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."},{"source":{"id":null,"name":"Cnet.com"},"author":"Erin Carson","title":"Pot robots, vape pens and Elon Musk: Spend your 420 with CNET's mellowest reads - CNET","description":"CNET's been on top of the evolution of weed in society. In honor of 420, we've rolled up some of our pot-centric reads for your enjoyment.","url":"https://www.cnet.com/news/pot-robots-vape-pens-and-elon-musk-spend-your-420-with-cnets-mellowest-reads/","urlToImage":"https://cnet1.cbsistatic.com/img/IZGqQ_ADXM6pIXMA_41nwVjkPUE=/756x567/2019/04/18/9738a0e6-7216-42bc-9c6e-a248a46c297b/pax-davinci-firefly2plus-promo-4.jpg","publishedAt":"2019-04-20T12:00:12Z","content":"Saturday is 420.\r\nGetty Images\r\nThere's something in the air this weekend.\r\nSaturday is April 20 -- usually rendered 420 by those in the know -- an annual, if unofficial, celebration of marijuana. If you already had plans to spark up, just consider the holida… [+2954 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Ashley Collman","title":"Consumer Reports investigation finds 'potentially dangerous' amounts of arsenic in 6 brands of bottled water, including one from Whole Foods","description":"Consumer Reports released the results of an investigation into arsenic levels in bottled water on Thursday. The federal limit for the levels of arsenic found in bottled water is 10 parts per billion (ppb), but CR noted that current research indicates that wat…","url":"https://www.thisisinsider.com/arsenic-in-bottled-water-consumer-reports-investigation-findings-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba7c5e2730ca0fd17b46e9-1920-960.jpg","publishedAt":"2019-04-20T01:56:00Z","content":"Whole Foods' bottled-water brand, Starkey Water, has arsenic levels in it high enough to cause damage if ingested regularly, according to a new investigation conducted by Consumer Reports. \r\n Arsenic is a naturally occurring element of the Earth's crust that … [+2398 chars]"},{"source":{"id":null,"name":"Greenentrepreneur.com"},"author":"Peter Gigante","title":"7 Stats to Know About Legal Cannabis and CBD This 4/20","description":"It's not the outlaw celebration it once was, but that was the goal all along, wasn't it?","url":"https://www.greenentrepreneur.com/article/332512","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190419162755-GettyImages-1036875812.jpeg","publishedAt":"2019-04-20T12:00:00Z","content":"April\r\n20, 2019\r\n4 min read\r\nOpinions expressed by Green Entrepreneur contributors are their own.\r\nWhile many Americans may think of April 20 or 4/20 as a “stoner” holiday, that kind of thinking is quickly becoming a thing of the past. Cannabis is available f… [+4301 chars]"},{"source":{"id":null,"name":"Greatlakesledger.com"},"author":"Stacy Richardson","title":"Earthquakes Hit Southern California at Every 3 Minutes, A New Study Reveals - Great Lakes Ledger","description":"Earthquakes Hit Southern California at Every 3 Minutes, A New Study Reveals Great Lakes Ledger California earthquake: TWO MILLION quakes rock South California in Caltech discovery Express.co.uk Almost two million previously 'hidden' earthquakes have been dete…","url":"https://greatlakesledger.com/2019/04/20/earthquakes-hit-southern-california-at-every-3-minutes-a-new-study-reveals/","urlToImage":"https://greatlakesledger.com/wp-content/uploads/2019/04/Earthquakes-Hit-Southern-California-at-Every-3-Minutes.jpg","publishedAt":"2019-04-20T06:41:55Z","content":"Southern California is shaken every day and the number of earthquakes per hour is more significant than seismologists have thought. Fortunately, a lot of them are so little that no one feels them. The seismologists have discovered that California is shaking u… [+2030 chars]"},{"source":{"id":null,"name":"Venturebeat.com"},"author":"Kyle Wiggers","title":"GM’s Cruise is preparing for a self-driving future in the cloud","description":"We spoke with Cruise' Adrian Macneil about training cars synthetically, why Cruise is targeting San Francisco, and how it fits into the overall landscape.","url":"https://venturebeat.com/2019/04/20/gms-cruise-is-preparing-for-a-self-driving-future-in-the-cloud/","urlToImage":"https://venturebeat.com/wp-content/uploads/2019/01/GMCruiseAVIR02_crop-1.jpg?w=1200&strip=all","publishedAt":"2019-04-20T17:25:42Z","content":"According to marketing firm ABI, as many as 8 million driverless cars will be added to the road in 2025. Meanwhile, Research and Markets is predicting that in the U.S. alone, there will be some 20 million autonomous cars in operation by 2030.\r\nHow realistic a… [+17078 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Ruth Reader","title":"The Bauhaus of Blunts? Today’s most ambitious cannabis companies are high on design","description":"To stand out in the crowd, cannabis companies are getting creative with their lifestyle branding. Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in po…","url":"https://www.fastcompany.com/90324682/the-bauhaus-of-blunts-todays-most-ambitious-cannabis-companies-are-high-on-design?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/03/p-2-hero-in-the-weeds-FA0519CANN001.jpg","publishedAt":"2019-04-20T06:00:17Z","content":"Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in posh retail outlets, which stock dozens of different products, from medicinal-style vaporizers to TH… [+3389 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"16-year-old Reynor quickly ascending ranks in StarCraft","description":"After winning a WCS Winter title, 16-year-old Riccardo \"Reynor\" Romiti has his sights set on more trophies -- and more Korean BBQ victory dinners.","url":"http://www.espn.com/esports/story/_/id/26567413/16-year-old-reynor-quickly-ascending-ranks-starcraft","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0411%2Fr527873_1296x729_16%2D9.jpg","publishedAt":"2019-04-20T20:18:33Z","content":"LOS ANGELES -- Fifteen minutes into one of his first Korean BBQ experiences, Riccardo \"Reynor\" Romiti -- the freshly minted StarCraft II World Championship Series Winter: Europe champion -- uttered a phrase he's rarely used, on or off the StarCraft stage.\r\n\"I… [+11286 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Philip Lewis","title":"Maryland’s Only Black-Owned Movie Theater Draws Crowds From Across The Country","description":"One couple drove an hour just to see “Us” at the NextAct Cinema, co-founder  Robert Wright said.","url":"https://www.huffpost.com/entry/next-act-cinema-black-owned-maryland_n_5cb24651e4b0ffefe3b13fd5","urlToImage":"https://img.huffingtonpost.com/asset/5cb5d52d240000b400c8966a.png?cache=vSBaB9dRwP&ops=1200_630","publishedAt":"2019-04-20T15:56:36Z","content":"When Anthony Fykes and Robert Wright met, they immediately connected through their love for movies. But the pair never imagined that a shared passion for cinema would lead them to open their own theater together.\r\nNextAct Cinema, the only black-owned movie th… [+4812 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Donald J. Mihalek","title":"Which presidential candidate gets Secret Service comes down to these factors","description":"This is how it's decided which presidential candidate gets Secret Service.","url":"https://abcnews.go.com/Politics/presidential-candidate-secret-service-protection-factors-analysis/story?id=62513154","urlToImage":"https://s.abcnews.com/images/Politics/secret-service-02-gty-jrl-180531_hpMain_2_16x9_992.jpg","publishedAt":"2019-04-20T12:49:49Z","content":"Then-Sen. Barack Obama announced his intention to run for the Democratic nomination for president in February 2007 on the grounds of the Old State Capitol in Springfield, Illinois where Abraham Lincoln delivered his \"house divided\" speech in 1858.\r\nIn additio… [+5477 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Benjamin Siegel","title":"Many House Democrats wary of trying to impeach Trump after Mueller report","description":"Special counsel Robert Mueller's report has prompted new consideration of impeachment by House Democrats.","url":"https://abcnews.go.com/Politics/house-democrats-wary-impeach-trump-mueller-report/story?id=62508263","urlToImage":"https://s.abcnews.com/images/Politics/pelosi-gty-ps-190418_hpMain_16x9_992.jpg","publishedAt":"2019-04-20T20:06:54Z","content":"Democrats renewed consideration of impeaching President Donald Trump after the release of special counsel Robert Muellers report, with leading progressives and some presidential candidates calling for swift action -- as Democratic leaders cautioned restraint.… [+6497 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Muzzin, Maple Leafs eye elimination of Bruins in Game 6","description":"The Maple Leafs are headed home for Game 6 of their first-round playoff series against Boston","url":"https://www.usatoday.com/story/sports/nhl/2019/04/20/muzzin-maple-leafs-eye-elimination-of-bruins-in-game-6/39370927/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/ff08101970c9b392424972bf0f5861a9adca4d8f/c=0-110-2122-1304/local/-/media/2019/04/20/USATODAY/usatsports/224df444dce6469ebdfde51a5e520ccb.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T20:36:10Z","content":"BOSTON (AP) Maple Leafs defenseman Jake Muzzin has extra motivation to beat Boston on Sunday and eliminate the Bruins in six games: It would mean some extra time to spend with his brand-new baby daughter.\r\nMuzzin's wife, Courtney, gave birth to a daughter, Lu… [+3987 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"NFL Draft: Top defensive players available by position","description":"NFL Draft: Top defensive players available by position","url":"https://www.usatoday.com/story/sports/ncaaf/2019/04/20/nfl-draft-top-defensive-players-available-by-position/39370459/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-20T17:01:00Z","content":"Some of the top defensive prospects, by position, available in the NFL draft (x-indicates early entrant to draft):\r\nDEFENSIVE END/EDGE RUSHER\r\nPosition outlook: This draft is stacked with defensive linemen of all types. The edge rushers and ends could dominat… [+8999 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"David A. Graham","title":"What If Everything Mueller Told Us Had Been New?","description":"Trump’s critics expected much more from the special counsel’s report. But it would be foolish to shrug off what was already known.","url":"https://www.theatlantic.com/ideas/archive/2019/04/what-if-everything-mueller-told-us-was-new/587590/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/AP_19108556126018/facebook.jpg?1555702100","publishedAt":"2019-04-20T10:00:00Z","content":"Special Counsel Robert Mueller’s report gave a damning overall portrait of the president, and yet that portrait surprised no one. Because the public has been treated to so much evidence of Donald Trump’s dishonesty and hectic leadership, the shock has worn of… [+5216 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Blind Japanese sailor completes non-stop Pacific voyage","description":"Mitsuhiro Iwamoto, 52, is said to be the first visually impaired person to make the 8,700-mile trip.","url":"https://www.bbc.co.uk/news/world-asia-47997727","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/CF6F/production/_106530135_053494096-1.jpg","publishedAt":"2019-04-20T11:44:03Z","content":"Image copyrightReutersImage caption\r\n Blind sailor Mitsuhiro Iwamoto (L) celebrates with his navigator Doug Smith\r\nA blind Japanese sailor has completed a non-stop Pacific crossing, reportedly making him the first visually impaired person to do so.\r\nMitsuhiro… [+1555 chars]"},{"source":{"id":null,"name":"Medium.com"},"author":"Meghan Daum","title":"Neuroscientist Larry Cahill on the ‘neurosexism’ debate","description":"In a major policy change implemented in early 2016, the National Institutes of Health made clear its expectation that researchers seeking grants “consider sex as a biological variable in all stages…","url":"https://medium.com/s/meghan-daum/male-and-female-brains-are-different-should-it-matter-6db82ead5e20","urlToImage":"https://cdn-images-1.medium.com/focal/1200/632/52/49/1*BK3kO3GC3EwuhvXOf5_kfA.jpeg","publishedAt":"2019-04-20T17:19:13Z","content":"In a major policy change implemented in early 2016, the National Institutes of Health made clear its expectation that researchers seeking grants consider sex as a biological variable in all stages of research. The reason was simpleif overdue. Past studies oft… [+10250 chars]"},{"source":{"id":null,"name":"Yankodesign.com"},"author":"Sarang Sheth","title":"Transforming toys that grow with your children!","description":"Transforming toys that grow with your children! Designed to guide your child through their formative years of physical development and acquiring of motor skills, the Luma Rock & Roller is a fun, innovative...","url":"https://www.yankodesign.com/2019/04/20/transforming-toys-that-grow-with-your-children/","urlToImage":null,"publishedAt":"2019-04-20T14:59:18Z","content":"Designed to guide your child through their formative years of physical development and acquiring of motor skills, the Luma Rock &amp; Roller is a fun, innovative toy that transforms from a rocker, to a walker, and then to a roller. At its base lies its ingeni… [+4008 chars]"},{"source":{"id":null,"name":"Sciencedaily.com"},"author":null,"title":"Sustainable way to increase seed oil yield in crops","description":"Scientists have developed a sustainable way to demonstrate a new genetic modification that can increase the yield of natural oil in seeds by up to 15% in laboratory conditions.","url":"https://www.sciencedaily.com/releases/2019/04/190420090534.htm","urlToImage":null,"publishedAt":"2019-04-20T13:05:34Z","content":"Nanyang Technological University, Singapore (NTU Singapore) scientists have developed a sustainable way to demonstrate a new genetic modification that can increase the yield of natural oil in seeds by up to 15 per cent in laboratory conditions.The new method … [+5233 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Emily Alford","title":"Jane Doe Accuser in Russell Simmons Case Will Not Have to Pay Him $10 Million","description":"Russell Simmons’s request that the woman who accused him of rape pay $10 million in sanctions has been denied by a judge and the lawsuit against Simmons will continue. Read more...","url":"https://jezebel.com/jane-doe-accuser-in-russell-simmons-case-will-not-have-1834157950","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--l19-ZeGd--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xlmtpl6wqx4kmknsmj4h.jpg","publishedAt":"2019-04-20T00:35:00Z","content":"Russell Simmonss request that the woman who accused him of rape pay $10 million in sanctions has been denied by a judge and the lawsuit against Simmons will continue.\r\nIn March 2018, a Jane Doe filed a lawsuit against Simmons, alleging he raped her after a co… [+1118 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Elizabeth Howell","title":"Mars 2020 Rover Assembled and Tested Ahead of Launch Next Year","description":"Technicians have assembled the capsule that will keep NASA's Mars 2020 rover secure for its wild ride to the Red Planet's surface.","url":"https://www.space.com/mars-2020-rover-preparing-for-launch.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/wqMkmB3QADwCZh533fFc5B-1200-80.jpg","publishedAt":"2019-04-20T11:18:56Z","content":"NASA's next Mars mission\r\n is slowly coming together in a \"clean room\" in California. Technicians at the agency's Jet Propulsion Laboratory assembled the capsule that will keep the Mars 2020 rover secure for its wild ride to the Red Planet's surface.\r\nAfter l… [+3410 chars]"},{"source":{"id":null,"name":"Torrentfreak.com"},"author":"Ernesto","title":"Omniverse Wants “Scandalous” Claims Removed From ACE’s Piracy Lawsuit","description":"Streaming TV provider Omniverse believes that any comparisons to 'pirate' streaming box vendor Dragon Box are scandalous. The company is asking the court to strike these from the copyright infringement complaint anti-piracy outfit ACE filed earlier this year.…","url":"https://torrentfreak.com/omniverse-wants-scandalous-claims-removed-from-aces-piracy-lawsuit-190420/","urlToImage":"https://torrentfreak.com/images/law-featured.jpg","publishedAt":"2019-04-20T18:05:24Z","content":"Streaming TV provider Omniverse believes that any comparisons to 'pirate' streaming box vendor Dragon Box are scandalous. The company is asking the court to strike these from the copyright infringement complaint anti-piracy outfit ACE filed earlier this year.… [+3774 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"daniel@politico.com (Daniel Lippman)","title":"POLITICO Playbook: Trump team’s newest scapegoat: Don McGahn … Biden starts taking 2020 cash","description":null,"url":"https://www.politico.com/newsletters/playbook/2019/04/20/trump-teams-newest-scapegoat-don-mcgahn-biden-starts-taking-2020-cash-426840","urlToImage":"https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg","publishedAt":"2019-04-20T14:16:17Z","content":"Former White House counsel Don McGahn cooperated extensively with special counsel Robert Mueller's team of federal prosecutors. | Melina Mara-Pool/Getty Images\r\nDRIVING THE DAY\r\nTHE LATEST MUELLER FALLOUT DONALD VS. DON -- Giuliani Attacks McGahns Account to … [+25797 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Brad Gagnon","title":"Could the Green Bay Packers Really Draft a Quarterback in Round 1?","description":"They wouldn't, would they?    I mean, they did it in 2005. That's when the Green Bay Packers used a first-round draft pick on a quarterback, despite the fact that they had one coming off a 4,000-yard, 30-touchdown season...","url":"https://bleacherreport.com/articles/2832110-could-the-green-bay-packers-really-draft-a-quarterback-in-round-1","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/814/hi-res-f45c470b7470461037ded275c4e6e425_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-20T12:55:40Z","content":"Brian Gutekunst has reportedly been looking at first-round-caliber quarterbacks.Associated Press\r\nThey wouldn't, would they? \r\nI mean, they did it in 2005. That's when the Green Bay Packers used a first-round draft pick on a quarterback, despite the fact that… [+6149 chars]"},{"source":{"id":null,"name":"Marieclaire.com"},"author":"Kayla Webley Adler","title":"Katelyn Ohashi Takes A Bow","description":"After years of physical and emotional suffering at the elite level, the gymnast finally found happiness—and stardom—in college. She plans to go out on top.","url":"https://www.marieclaire.com/culture/a27205924/katelyn-ohashi-gymnastics-interview/","urlToImage":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/katelyn-ohashi-shutterstock-editorial-10051785d-huge-color-1555682036.jpg?crop=1xw:0.889092912229159xh;center,top&resize=1200:*","publishedAt":"2019-04-20T19:40:59Z","content":"There’s a certain way someone stares at you when they think they know you from the internet. Katelyn Ohashi, the viral star of the University of California Los Angeles gymnastics team, knows the look well. “You can tell when someone recognizes you and they wa… [+17823 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Jon Freeman","title":"Lee Ann Womack Plays With Dolls, Stop-Motion Animation in New ‘Hollywood’ Video","description":"Inventive clip depicts two dolls living out the lyrics to track from 'The Lonely, The Lonesome & The Gone'","url":"https://www.rollingstone.com/music/music-country/lee-ann-womack-hollywood-video-824951/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/law-hollywood.jpg","publishedAt":"2019-04-20T14:45:15Z","content":"In Lee Ann Womack’s inventive and heartbreaking new video “Hollywood,” two plastic dolls in the stop-motion-animated clip play stand-ins for live actors, but the anguish of a faltering relationship is no less real as Womack sings, “Every time I ask you, you j… [+1333 chars]"},{"source":{"id":null,"name":"Designboom.com"},"author":"philip stevens I designboom","title":"coachella art installations create a vibrant ‘pop-up city’ for festival-goers","description":"an international roster of artists has created a collection of landmarks that helps attendees navigate the event. The post coachella art installations create a vibrant ‘pop-up city’ for festival-goers appeared first on designboom | architecture & design magaz…","url":"https://www.designboom.com/?p=586706","urlToImage":"https://www.designboom.com/wp-content/uploads/2019/04/coachella-festival-installations-designboom-Fb.jpg","publishedAt":"2019-04-20T05:15:19Z","content":"architect francis kéré and design studio NEWSUBSTANCE are among the creative talents who have created installations as part of coachella, the annual music and arts festival in indio, california. other multidisciplinary artists include new and returning multid… [+5930 chars]"},{"source":{"id":null,"name":"Refinery29.com"},"author":"Jenna Milliner-Waddell, written by Jenna Milliner-Waddell","title":"San Francisco Tourists May Soon Have To Pay To Drive Down This Famous Street","description":"San Francisco ’s Lombard Street is affectionately nicknamed Crooked Street, and for good reason. The winding road is flanked by beautiful landscaping and colorful homes, earning it a spot in many city guides and on many Instagram feeds (of course). While the …","url":"https://www.refinery29.com/en-us/2019/04/230441/san-francisco-lombard-street-tourists-pay-proposal","urlToImage":"https://s1.r29static.com//bin/entry/918/0,0,2000,1050/x,80/2166472/san-francisco-tourists-may-soon-2166472.jpg","publishedAt":"2019-04-20T20:45:53Z","content":null},{"source":{"id":null,"name":"Qz.com"},"author":"Daniel Wolfe","title":"Not all Easter eggs need dyeing—some are hatched blue","description":"Some chickens lay blue eggs, thanks to a retrovirus.","url":"https://qz.com/quartzy/1600689/not-all-easter-eggs-need-dyeing-some-are-hatched-blue/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/eggs-feature.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-20T20:21:53Z","content":"Some traditions never dye. This year, instead of painting your Easter eggs blue, why not get some that were simply created that way?\r\nThats what Im doing. Like more and more urban areas in the US, Oakland, California, where I live, allows for backyard chicken… [+1507 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Jenni Avins","title":"4/20 has completely lost its chill","description":"4/20 is true American holiday now: one that we can complain about being co-opted by capitalism.","url":"https://qz.com/quartzy/1599153/this-will-be-the-most-corporate-4-20-ever/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/SACKVILLE_LUNAKHODS_01-1-e1555713747680.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-20T09:00:00Z","content":"Subscribe to the Quartzy newsletter to receive this in your inbox each Friday.\r\nI distinctly remember hanging out on a friends front porch one spring evening when I was in high school. As the guys passed a cannabis-packed pipe, they kept saying Four-twenty, m… [+6121 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Jenni Avins","title":"These weed pens promise to make you feel as sexy, social, or sleepy as you like","description":"Cannabis companies are putting out a slew of high-design disposable vaporizers.","url":"https://qz.com/quartzy/1598585/dosist-sunday-goods-and-more-weed-pens-and-disposable-vaporizers/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/sunday-goods-vape-pen-final-e1555711047630.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-20T09:00:48Z","content":"Once upon a time, the only way to find out how a particular strain of marijuana would make you feel was to go ahead and smoke it.\r\nIn the age of legal cannabis, however, precision is a selling point. Amidst the green boom, cannabis companies are competing for… [+6346 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Jonathan Sawyer","title":"Pioneer Skate Brand DROORS Relaunches With ’90s-Inspired Collection","description":"After a pair of surprise pop-ups at Agenda 2017 and Paris Fashion Week 2019, ’90s skate brand DROORS is officially making a comeback. The Southern California outfit was founded by DC Shoes co-founders Damon Way and Ken Block in 1992, offering highly sought-af…","url":"https://www.highsnobiety.com/p/droors-relaunch-season-one/","urlToImage":"https://static.highsnobiety.com/thumbor/dIGYuPeFycGb3bPyv4yr-tUeNyg=/fit-in/800x480/smart/static.highsnobiety.com/wp-content/uploads/2019/04/12165307/droors-relaunch-season-one-feature.jpg","publishedAt":"2019-04-20T11:27:44Z","content":"After a pair of surprise pop-ups at Agenda 2017 and Paris Fashion Week 2019, ’90s skate brand DROORS is officially making a comeback. The Southern California outfit was founded by DC Shoes co-founders Damon Way and Ken Block in 1992, offering highly sought-af… [+1174 chars]"},{"source":{"id":null,"name":"R29.com"},"author":"Jenna Milliner-Waddell, written by Jenna Milliner-Waddell","title":"San Francisco Tourists May Soon Have To Pay To Drive Down This Famous Street","description":"San Francisco ’s Lombard Street is affectionately nicknamed Crooked Street, and for good reason. The winding road is flanked by beautiful landscaping and colorful homes, earning it a spot in many city guides and on many Instagram feeds (of course). While the …","url":"https://www.r29.com/en-us/2019/04/230441/san-francisco-lombard-street-tourists-pay-proposal?utm_source=feed&utm_medium=rss","urlToImage":null,"publishedAt":"2019-04-20T20:45:53Z","content":null},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Casey Quinlan","title":"Washington state passes law extending statute of limitations for victims of sexual violence","description":"Washington Gov. Jay Inslee (D) signed into law on Friday an extension of the statute of limitations for some cases of sexual assault and removes the statute of limitation for serious sex crimes against children. Without this law, it would have been more diffi…","url":"https://thinkprogress.org/washington-state-passes-law-extending-statute-of-limitations-for-victims-of-sexual-violence-49d88db6a08e/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1143635036.jpg?w=1024&h=680&crop=1","publishedAt":"2019-04-20T18:44:00Z","content":"Washington Gov. Jay Inslee (D) signed into law on Friday an extension of the statute of limitations for some cases of sexual assault and removes the statute of limitation for serious sex crimes against children.\r\nWithout this law, it would have been more diff… [+4272 chars]"},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Al Jazeera","title":"US man arrested for threatening Democratic politicians","description":"Police say the man threatened Ilhan Omar, Rashida Tlaib, Eric Swalwell and Cory Booker.","url":"https://www.aljazeera.com/news/2019/04/man-arrested-threatening-democratic-politicians-190419234316461.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/3/7/84ecc5a195a84542a220f670876f512a_18.jpg","publishedAt":"2019-04-20T00:18:12Z","content":"Police arrested a Florida man on Friday on suspicion of leaving racist, homophobic and Islamophobic messages filled with death threats on the voicemails of several Democratic members of Congress. \r\nJohn Kless, 49, of Broward County, is accused of leaving expl… [+2598 chars]"},{"source":{"id":null,"name":"Variety.com"},"author":"chrislwillman","title":"A 4/20 Special: Sour Matt on Bringing Cannabis, Hip-Hop and Branding Together","description":"Sour Matt might be one of the most mysterious yet well-respected figures in the cannabis industry, as well as a growing force in the music business with which it intersects. With more than 100,000 followers on Instagram alone, he describes himself as “someone…","url":"https://variety.com/2019/music/news/sour-matt-interview-cannabis-music-marketing-1203192896/","urlToImage":"https://pmcvariety.files.wordpress.com/2019/04/luekingphotos-21-e1555776422176.jpg?w=700&h=393&crop=1","publishedAt":"2019-04-20T16:25:33Z","content":"Sour Matt might be one of the most mysterious yet well-respected figures in the cannabis industry, as well as a growing force in the music business with which it intersects. With more than 100,000 followers on Instagram alone, he describes himself as “someone… [+12163 chars]"},{"source":{"id":null,"name":"Ted.com"},"author":"Brian Greene","title":"In Case You Missed It: Highlights from TED2019","description":"Twelve mainstage sessions, two rocking sessions of talks from TED Fellows, a special session of TED Unplugged, a live podcast recording and much more amounted to an unforgettable week at TED2019.","url":"http://blog.ted.com/in-case-you-missed-it-highlights-from-ted2019/","urlToImage":"https://tedconfblog.files.wordpress.com/2019/04/47566641542_dbcfbb22ef_o.jpg","publishedAt":"2019-04-20T18:42:51Z","content":"Twelve mainstage sessions, two rocking sessions of talks from TED Fellows, a special session of TED Unplugged, a live podcast recording and much more amounted to an unforgettable week at TED2019. (Photo: Marla Aufmuth / TED) If we learned anything at TED2019,… [+6073 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Science X staff","title":"Tesla wants to cut size of board from 11 directors to 7","description":"Tesla plans to cut its board of directors from 11 to seven in a move the electric-car maker says will allow the board to act more nimbly and efficiently.","url":"https://phys.org/news/2019-04-tesla-size-board-directors.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/teslawantsto.jpg","publishedAt":"2019-04-20T21:21:02Z","content":"Tesla plans to cut its board of directors from 11 to seven in a move the electric-car maker says will allow the board to act more nimbly and efficiently.\r\nTesla says the four directors who will depart aren't leaving because of any disagreement with the compan… [+2526 chars]"},{"source":{"id":null,"name":"Bloombergquint.com"},"author":"Craig Giammona","title":"Gen Z Will Be Ultimate Pot Consumers...","description":"Gen Z Will Be Ultimate Pot Consumers... (Third column, 13th story, link ) Related stories: Thailand marijuana festival has visitors on a high... Advertise here","url":"https://www.bloombergquint.com/onweb/gen-z-and-weed-the-u-s-generation-of-native-cannabis-consumers","urlToImage":"https://images.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2019-04-20T14:07:37Z","content":"(Bloomberg) -- Americas Generation Z is coming of age in a whole new world of weed.\r\nThis large cohort, which already has big-time spending power as the oldest age into high school and college, is formulating its consumption habits at a time when marijuana mu… [+7086 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Latin pop has US grooving more and more in Spanish...","description":"Just two years after the lilting mega-hit \"Despacito\" captivated the globe, Latin stars are cementing their place in the US mainstream, moving beyond scoring a one-off smash to headline festivals and permeate the charts.  An unprecedented number of Spanish-la…","url":"https://news.yahoo.com/latin-pop-us-grooving-more-more-spanish-010456904.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/h9vqnHcCKYAg0OdWr6Rq0w--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/a365e5fc1e18bfe2fd9097a74dec44c4c93a4734.jpg","publishedAt":"2019-04-20T12:55:37Z","content":"Indio (United States) (AFP) - Just two years after the lilting mega-hit \"Despacito\" captivated the globe, Latin stars are cementing their place in the US mainstream, moving beyond scoring a one-off smash to headline festivals and permeate the charts.\r\nAn unpr… [+4412 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Meg Kinnard","title":"2020 campaign trail runs through churches in SCarolina...","description":"2020 campaign trail runs through churches in SCarolina... (Second column, 6th story, link ) Related stories: BIDEN FINALLY READY? Announcement in days... NYT: Should White Man Be Face of Dem Party? Advertise here","url":"https://www.apnews.com/e3cd6d9a08c94ca59a1a427e6517cfd2","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:4ecfdeae0aa041e48f36ab2d164d723b/2477.jpeg","publishedAt":"2019-04-20T14:22:38Z","content":"NORTH CHARLESTON, S.C. (AP) By now, most Democratic presidential candidates have polished their stump speeches. But when theyre in South Carolina, they may need to add in a sermon.\r\nIn a large and diverse primary field, White House hopefuls are angling to dev… [+4157 chars]"},{"source":{"id":null,"name":"Toucharcade.com"},"author":"Jared Nelson","title":"TouchArcade Game of the Week: ‘The VideoKid’","description":"[appicon]The idea behind the TouchArcade Game of the Week is that every Friday afternoon we post the one game that came out this week that we think is worth giving a special nod to. Now, before anyone goes over-thinking this, it doesn't necessarily mean our G…","url":"https://toucharcade.com/2019/04/19/toucharcade-game-of-the-week-the-videokid/","urlToImage":"https://toucharcade.com/wp-content/uploads/2019/04/tvkfeat.png","publishedAt":"2019-04-20T02:09:03Z","content":"The idea behind the TouchArcade Game of the Week is that every Friday afternoon we post the one game that came out this week that we think is worth giving a special nod to. Now, before anyone goes over-thinking this, it doesn’t necessarily mean our Game of th… [+3691 chars]"},{"source":{"id":null,"name":"Geek.com"},"author":"Stephanie Valera","title":"Bobcat That Survived California Wildfire Gives Birth to Four Kittens","description":"A young bobcat that survived the massive wildfire that ravaged Southern California last November has given birth to four kittens, according to wildlife officials. The bobcat mother, cataloged as B-362, was fitted with a […] The post Bobcat That Survived Calif…","url":"https://www.geek.com/news/bobcat-that-survived-california-wildfire-gives-birth-to-four-kittens-1783853/","urlToImage":"https://www.geek.com/wp-content/uploads/2019/04/bobcatkittens2.jpg","publishedAt":"2019-04-20T19:05:55Z","content":"A young bobcat that survived the massive wildfire that ravaged Southern California last November has given birth to four kittens, according to wildlife officials.\r\nThe bobcat mother, cataloged as B-362, was fitted with a tracking collar on Nov. 7, the day bef… [+3499 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Keith Speights)","title":"4 Marijuana Stocks to Especially Like on 4/20","description":"Each of these stocks is poised for tremendous success in the U.S. cannabis market.","url":"https://www.fool.com/investing/2019/04/20/4-marijuana-stocks-to-especially-like-on-420-day.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519387/marijuana-leaf-getty.jpg","publishedAt":"2019-04-20T16:00:00Z","content":"I thought about listing 420 marijuana stocks to like on 4/20 -- April 20th, the day that marijuana proponents celebrate cannabis culture each year. There was one major problem with that idea, though: There aren't 420 marijuana stocks to like. \r\nSo instead, I … [+5946 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Billy Duberstein)","title":"Why MedMen Could Be the Best Pot Stock in the U.S… or the Worst","description":"This cannabis retailer is spending big in hopes of making an even larger impact.","url":"https://www.fool.com/investing/2019/04/20/why-medmen-could-be-the-best-pot-stock-in-the-us-o.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519406/forget-stoner-page-2018.jpg","publishedAt":"2019-04-20T10:30:00Z","content":"With Canada's legalization of marijuana in late 2018, much of the attention has been on companies that sell into the country's fully legal market, but now that Canada has gone ahead, many think full U.S. decriminalization could be around the corner.\r\nEven wit… [+7868 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Keith Speights)","title":"3 Surprising Targets for Increased Marijuana Advertising Spending on 4/20","description":"If you want to know which groups are using cannabis products more, just follow the advertising money.","url":"https://www.fool.com/investing/2019/04/20/3-surprising-targets-for-increased-marijuana-adver.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519365/dog-eating-marijuana-leaf.jpg","publishedAt":"2019-04-20T12:15:00Z","content":"Marijuana sales are rising in the U.S. as more states have legalized medical cannabis, adult-use recreational cannabis, or both. And advertising spending in the U.S. cannabis industry is on the rise, too.\r\nAdloop Media, which offers an advertising-technology … [+4061 chars]"},{"source":{"id":null,"name":"Vimeo.com"},"author":null,"title":"How It's Goin'","description":"A bittersweet comedy about Steven, a recently divorced father and his young daughter, Cali. Steve’s perfect day with his daughter in San Francisco's Golden Gate Park is ruined when Cali’s mom comes to pick her up, leading Steve on an unexpected journey throug…","url":"https://vimeo.com/331357765","urlToImage":"https://i.vimeocdn.com/filter/overlay?src0=https%3A%2F%2Fi.vimeocdn.com%2Fvideo%2F776852792_1280x720.webp&src1=https%3A%2F%2Ff.vimeocdn.com%2Fimages_v6%2Fshare%2Fplay_icon_overlay.png","publishedAt":"2019-04-20T18:36:14Z","content":null},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Jennifer Ouellette","title":"Review: Santa Clarita Diet S3 blends slapstick, satire with genuine heart","description":"Series closes S3 on a cliffhanger amidst uncertainty about its renewal by Netflix","url":"https://arstechnica.com/gaming/2019/04/review-santa-clarita-diet-s3-blends-slapstick-satire-with-genuine-heart/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2019/04/diet6-760x380.jpg","publishedAt":"2019-04-20T14:30:17Z","content":"Enlarge/ Sheila (Drew Barrymore) and Joel (Tim Olyphant) Hammond are married real estate agents with an undead secret.\r\n0 with 0 posters participating\r\nThe Santa Clarita Diet, Netflix's smart, slyly satiric sitcom about a zombie outbreak in suburban Southern … [+5532 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Anita Bennett","title":"Will Smith Rocks Coachella During Surprise Performance With Son Jaden","description":"The Fresh Prince is back. Will Smith returned to his music persona Friday night when he joined son Jaden Smith on stage at the Coachella Valley Music and Arts Festival for a performance of the 20-year-old’s single “Icon.” The elder Smith posted video of his s…","url":"https://deadline.com/2019/04/will-smith-rocks-coachella-with-surprise-performance-1202599274/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/will-smith-performs-at-coachella.jpg?w=630","publishedAt":"2019-04-20T22:31:39Z","content":"The Fresh Prince is back.\r\nWill Smith returned to his music persona Friday night when he joined son Jaden Smith on stage at the Coachella Valley Music and Arts Festival for a performance of the 20-year-old’s single “Icon.”\r\nThe elder Smith posted video of his… [+1195 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"Joe Biden expected to launch presidential campaign next week","description":"Joe Biden, 76, would be the most experienced politician in the race, and the second oldest, after 77-year-old Bernie Sanders.","url":"https://indianexpress.com/article/world/united-states-joe-biden-expected-to-launch-presidential-campaign-next-week-5685335/","urlToImage":"https://images.indianexpress.com/2019/04/joe-biden-759.jpg?w=759","publishedAt":"2019-04-20T01:38:20Z","content":"Former vice president Joe Biden talks with officials after speaking at a rally in support of striking Stop &amp; Shop workers in Boston, Thursday. (AP Photo)\r\nFormer Vice President Joe Biden is expected to join the crowded 2020 Democratic presidential field n… [+3659 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"Roman Polanski asks court to restore his film academy membership","description":"Roman Polanski, who won the best director Oscar for The Pianist in 2003, remains a fugitive after pleading guilty to unlawful sex with a minor in 1977 and fleeing the United States the following year. He has been living in Europe since.","url":"https://indianexpress.com/article/entertainment/hollywood/roman-polanski-asks-court-to-restore-his-film-academy-membership-5685433/","urlToImage":"https://images.indianexpress.com/2019/04/roman-polanski-759.jpg?w=759","publishedAt":"2019-04-20T04:03:39Z","content":"Roman Polanski is asking a judge to restore his membership in the Academy of Motion Picture Arts and Sciences after he was expelled for misconduct. (Source: AP Photo/Francois Mori, File)\r\nRoman Polanski asked a judge Friday to restore his membership in the or… [+2928 chars]"},{"source":{"id":null,"name":"Grist.org"},"author":"Oliver Milman","title":"‘We’re not a dump’ — poor Alabama towns struggle under the stench of toxic landfills","description":"\"Let every state take care of their own trash but don’t bring it to Alabama.\"","url":"http://grist.org/article/were-not-a-dump-poor-alabama-towns-struggle-under-the-stench-of-toxic-landfills/","urlToImage":"https://grist.files.wordpress.com/2019/04/stones-throw-landfill.jpg?w=1200&h=675&crop=1","publishedAt":"2019-04-20T11:00:27Z","content":"This story was originally published by the Guardian and is reproduced here as part of theClimate Desk collaboration.\r\nWest Jefferson, Alabama, a somnolent town of around 420 people northwest of Birmingham, was an unlikely venue to seize the national imaginati… [+11989 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Robyn Merrett","title":"Seeking Sister Wife Star Vanessa Cobbs Announces Split from Her Polygamist Husband and His Wife","description":"Seeking Sister Wife star Vanessa Cobbs is calling it quits with the Snowden family. Vanessa announced her decision to leave her polygamist husband Dimitri Snowden and his wife Ashley on Instagram explaining, “After some deep soul searching, I have decided to …","url":"https://people.com/tv/seeking-sister-wife-star-vanessa-cobbs-splits-polygamist-husband/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/v3333.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630","publishedAt":"2019-04-20T00:06:18Z","content":"Seeking Sister Wife star Vanessa Cobbs is calling it quits with the Snowden family.\r\nVanessa announced her decision to leave her polygamist husband Dimitri Snowden and his wife Ashley on Instagram explaining, “After some deep soul searching, I have decided to… [+3286 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Robyn Merrett","title":"Kim Kardashian Says She Would Never Use 'Privilege' to Get Her Kids Into College","description":"Kim Kardashian is speaking out on the college admissions scandal which has landed fellow celebrities Felicity Huffman and Lori Loughlin in hot water. As one of the most influential women in Hollywood, Kardashian, 38, says she would never abuse her fame to get…","url":"https://people.com/tv/kim-kardashian-speaks-college-admissions-scandal/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/kimkcnn.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-20T14:04:10Z","content":"Kim Kardashian is speaking out on the college admissions scandal which has landed fellow celebrities Felicity Huffman and Lori Loughlin in hot water.\r\nAs one of the most influential women in Hollywood, Kardashian, 38, says she would never abuse her fame to ge… [+4058 chars]"},{"source":{"id":null,"name":"Listendata.com"},"author":"Ekta Aggarwal","title":"ListenData: Pandas Python Tutorial - Learn by Examples","description":"Python Pandas Tutorial for Beginners  - Step by step guide to learn data analysis using python and pandas package with examples to handle and manipulate data","url":"https://www.listendata.com/2017/12/python-pandas-tutorial.html","urlToImage":"https://1.bp.blogspot.com/-lraeOI1CwE0/WkPx7GXrlMI/AAAAAAAAGkY/dMU2LC9kUZMMR8C4ZoKbIbH_VahIba9KACLcBGAs/s72-c/pandas.PNG","publishedAt":"2019-04-20T09:28:54Z","content":"Why pandas?It has many functions which are the essence for data handling. In short, it can perform the following tasks for you -Create a structured data set similar to R's data frame and Excel spreadsheet.\r\nReading data from various sources such as CSV, TXT, … [+16753 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Sam Abuelsamid, Contributor, Sam Abuelsamid, Contributor https://www.forbes.com/sites/samabuelsamid/","title":"Mazda's Diesel Challenge Points To Future Autonomous Certification Difficulties","description":"The example of Mazda's challenges with getting its diesel engine approved for sale in California, point to the difficulties the industry may face in the coming years with automated driving","url":"https://www.forbes.com/sites/samabuelsamid/2019/04/20/mazdas-diesel-challenge-points-to-future-autonomous-certification-difficulties/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fsamabuelsamid%2Ffiles%2F2019%2F04%2FIMG_5255_HDR-1200x794.jpg","publishedAt":"2019-04-20T13:33:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\n2019 Mazda CX-5 Signature AWD\r\nSam Abuelsamid\r\nThis week Mazda finally released its long-awaited diesel CX-5 crossover into the U.S. market. The actual wisdom of selling this product in 2019 is the topic… [+9863 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Alex Knapp, Forbes Staff, Alex Knapp, Forbes Staff https://www.forbes.com/sites/alexknapp/","title":"Joyn Bio Opens California Facility To Test Its Engineered Microbes On Crop Growth","description":"The AgTech venture will soon be opening a new facility in California to test how well its engineered microbes work as a replacement for fertilizer.","url":"https://www.forbes.com/sites/alexknapp/2019/04/19/joyn-bio-opens-california-facility-to-test-its-engineered-microbes-on-crop-growth/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F961851582%2F960x0.jpg","publishedAt":"2019-04-20T01:38:35Z","content":"The sun is setting behind a cornfield.\r\nGetty\r\nJoyn Bio, a joint agtech venture between synthetic biology company Ginkgo Bioworks and Bayer, plans to open a research facility in California to speed up the development of its engineered microbes. The aim: fix n… [+4692 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Samar Marwan, Forbes Staff, Samar Marwan, Forbes Staff https://www.forbes.com/sites/samarmarwan/","title":"Next Year’s 4/20 Celebrations In California Will Look A Lot More Legal","description":"One of the main objectives of the new law to give attendees access to legal lab tested cannabis in an effort to steer business away from illicit dealers.","url":"https://www.forbes.com/sites/samarmarwan/2019/04/20/this-is-what-the-future-of-420-will-look-like-for-california/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F949250046%2F960x0.jpg","publishedAt":"2019-04-20T10:30:00Z","content":"SAN FRANCISCO, CA - APRIL 20: A cloud of marijuana smoke hangs over a crowd of people during a 420 Day celebration on 'Hippie Hill' in Golden Gate Park on April 20, 2018 in San Francisco, California. In the first year that marijuana is legal for\r\nGetty Images… [+8880 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Warren Bobrow, Contributor, Warren Bobrow, Contributor https://www.forbes.com/sites/warrenbobrow/","title":"OLO Sublinguals Microdosed Experiences Placed Under The Tongue","description":"Focus. Focus is the perfect slice of getting the job done the first time. Focus brings you deep thought and getting it all done.","url":"https://www.forbes.com/sites/warrenbobrow/2019/04/20/olo-sublinguals-microdosed-experiences-placed-under-the-tongue/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fwarrenbobrow%2Ffiles%2F2019%2F04%2FOLO_05.18.18_5016-086_FOCUS-1200x800.jpg","publishedAt":"2019-04-20T14:53:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nI never thought that less would truly exemplify more, but I have been wrong before about micro-dosing cannabis. Traditionally on this 4/20 day, it has special meaning to many, but in my case it is especi… [+9681 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Roger Conrad, Contributor, Roger Conrad, Contributor https://www.forbes.com/sites/greatspeculations/people/rogerconrad/","title":"Berkshire Utilities' Next Big Utility Bite","description":"I’ve personally owned Berkshire Hathaway long enough to build up unrealized gains five times my initial investment. That hardly makes me unique. Whatever happens now will have huge consequences not just for shareholders, but for the industries it operates in …","url":"https://www.forbes.com/sites/greatspeculations/2019/04/20/berkshire-utilities-next-big-utility-bite/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_25%2Fpt_25_193828_o.jpg%3Ft%3D1555763404","publishedAt":"2019-04-20T12:30:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nCharlie Munger, vice chairman of Berkshire Hathaway Inc., speaks during the Daily Journal Corp. shareholder meeting in Los Angeles, California, U.S., on Thursday, Feb. 14, 2019. Photographer: Patrick T. … [+12774 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Patrick Gleason, Contributor, Patrick Gleason, Contributor https://www.forbes.com/sites/patrickgleason/","title":"U.S. Public Education Is Not Suffering From Financial Starvation, Contrary To Claims","description":"The ongoing 2019 state legislative sessions are demonstrating glaring the contrast between the two major political parties when it comes to where they stand on education policy and reforms that expand school choice.","url":"https://www.forbes.com/sites/patrickgleason/2019/04/20/u-s-public-education-is-not-suffering-from-financial-starvation-contrary-to-claims/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1130949978%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-20T13:42:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAmong the prominent individuals and organizations working to improve U.S. public education a split has emerged. Some are focused on pumping additional money into the system, whereas others emphasize refo… [+14394 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Brett Owens, Contributor, Brett Owens, Contributor https://www.forbes.com/sites/brettowens/","title":"32 Dividend Stocks That Could Double Your Money","description":"Growth or yield? Why choose when we can have both.","url":"https://www.forbes.com/sites/brettowens/2019/04/20/32-dividend-stocks-that-could-double-your-money/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fbrettowens%2Ffiles%2F2019%2F04%2FREIT-Div-Increase-Table.jpg","publishedAt":"2019-04-20T20:24:00Z","content":"Growth or yield? Why choose when we can have both.There are 32 dividend hikes on the way that are going to set up their investors for a big 12 months ahead. How? Simplethese payout raises are going to provide fuel to their attached share prices. The 10%+ rais… [+18051 chars]"},{"source":{"id":null,"name":"Amazon.com"},"author":"rss@techbargains.com","title":"Amazon Deal of the Day: Save 20% Feather & Stitch New York Cotton Sheets","description":"Buy 500 Thread Count 100% Cotton Stripe, Best Hotel Luxury Bedding 3-Piece Duvet Cover Set Zipper Closure-Full/Queen (90\"x92\")-3 Piece (1 Duvet Cover + 2 Pillow Shams) Soft, Silky Sateen Weave: Sheet & Pillowcase Sets - Amazon.com ✓ FREE DELIVERY possible on …","url":"https://www.amazon.com/Thread-Cotton-Bedding-3-Piece-Closure-Full/dp/B07LCSHXS3","urlToImage":null,"publishedAt":"2019-04-20T11:30:00Z","content":"I don't know what it is, but I had a hard time finding Cal King sheets in California! It was so frustrating and the only way I could've bought any local was at Bed Bath for double what I paid for these AND for cheaper quality! It's been 1 mo since we've put t… [+890 chars]"},{"source":{"id":null,"name":"10news.com"},"author":"","title":"Vehicle wanted in LA-area Amber Alert found in San Ysidro - 10News","description":"Vehicle wanted in LA-area Amber Alert found in San Ysidro 10News Suspect car connected to missing teen Alora Benitez, Carson murder investigation found in San Diego border town KABC-TV Missing California teen believed to be with murder suspects NBC News Sheri…","url":"https://www.10news.com/news/local-news/vehicle-wanted-in-los-angeles-area-amber-alert-found-abandoned-in-san-ysidro","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/776897a/2147483647/strip/true/crop/900x473+0+101/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb7%2F38%2F7e193a9e400ba663302ba627c6b2%2Falora-benitez.jpg","publishedAt":"2019-04-20T01:27:00Z","content":"SAN YSIDRO, Calif. (KGTV) A vehicle wanted in connection with an Amber Alert out of Los Angeles was recovered in the South Bay Friday.\r\nSan Diego Police found a 2013 white BMW sedan wanted linked to the search for missing 15-year-old Alora Benitez in San Ysid… [+954 chars]"},{"source":{"id":null,"name":"Thebaynet.com"},"author":null,"title":"Severe Thunderstorm Warning for Southern Maryland | thebaynet.com - Bay Net","description":"Severe Thunderstorm Warning for Southern Maryland | thebaynet.com Bay Net Storms bring winds, tornadoes Friday to the Triangle Raleigh News & Observer Severe thunderstorm warning issued for central Pa. counties PennLive Multiple reports of damage in Franklin …","url":"http://www.thebaynet.com/articles/0419/severe-thunderstorm-warning-for-southern-maryland.html","urlToImage":"http://www.thebaynet.com/media/coverphoto/638a024e-8933-4629-b733-209753aadba7.jpg","publishedAt":"2019-04-20T00:46:54Z","content":"Weather Updated: Apr 19 8:34PMIssued by the National Weather ServiceFor Saint Marys County, MarylandSEVERE THUNDERSTORM WARNING FROM 8:34PM EDT FRI UNTIL 9:30PM EDT FRI THE NATIONAL WEATHER SERVICE IN STERLING VIRGINIA HAS ISSUED A * SEVERE THUNDERSTORM WARNI… [+1212 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Deroy Murdock","title":"Deroy Murdock: Mueller report's release was a model of transparency - Fox News","description":"Deroy Murdock: Mueller report's release was a model of transparency Fox News How a legal dispute between Mueller and Barr drove the end of the special counsel’s probe The Washington Post Romney 'sickened' by White House 'dishonesty' ABC News Justice Departmen…","url":"https://www.foxnews.com/opinion/murdock-mueller-report","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2018/12/robert-mueller-AP.jpg","publishedAt":"2019-04-20T18:24:14Z","content":"Under federal law, Attorney General William Barr could have taken Special Counsel Robert S. Mueller III’s long-awaited Russiagate report, shoved it in a drawer, and sent the following letter to Capitol Hill:\r\n“Dear Congress:\r\n“No collusion. No obstruction.\r\n“… [+1545 chars]"},{"source":{"id":null,"name":"Kesq.com"},"author":"#printStr($author.authorFirstName) #printStr($author.authorLastName)","title":"Investigators seek woman who threw puppies in dumpster in Coachella - KESQ","description":"Investigators seek woman who threw puppies in dumpster in Coachella KESQ Coachella Woman Caught on Video Throwing Bag of Puppies in Dumpster TMZ Video catches woman tossing 7 newborn puppies into Coachella dumpster in 90-degree weather KABC-TV News Woman caug…","url":"https://www.kesq.com/news/investigators-seek-woman-who-threw-puppies-in-dumpster-in-coachella/1070708360","urlToImage":"https://media.kesq.com/npg-kesq-media-us-east-1/photo/2019/04/19/4-19-DUMPED-PUPPIES-GFX_1555719332872_38143737_ver1.0_1280_720.png","publishedAt":"2019-04-20T00:16:00Z","content":"Woman caught on camera dumping puppies\r\nCOACHELLA, Calif.- - A woman is being sought by law enforcement after she was caught on camera throwing a bag of puppies in a dumpster in Coachella. \r\nOn Thursday afternoon around 1:00 p.m., a white Jeep Wrangler pulled… [+1570 chars]"},{"source":{"id":null,"name":"Mercurynews.com"},"author":"Jason Green","title":"Woman at center of Palo Alto MAGA uproar missing - East Bay Times","description":"Woman at center of Palo Alto MAGA uproar missing East Bay Times PALO ALTO — Authorities are searching for a woman who caused a national uproar — and received death threats — earlier this month after she publicly... View full coverage on Google News","url":"http://www.mercurynews.com/woman-at-center-of-palo-alto-maga-uproar-missing","urlToImage":"https://www.eastbaytimes.com/wp-content/uploads/2019/04/SJM-L-MANKEY-0420-1.jpg?w=622&h=438","publishedAt":"2019-04-20T13:01:00Z","content":"PALO ALTO — Authorities are searching for a woman who caused a national uproar — and received death threats — earlier this month after she publicly lambasted a 74-year-old man for wearing a Make America Great Again baseball cap at a Palo Alto coffee shop.\r\nRe… [+1953 chars]"},{"source":{"id":null,"name":"Tvnz.co.nz"},"author":null,"title":"Children who were starved and shackled by parents want normal adulthoods - TVNZ","description":"Children who were starved and shackled by parents want normal adulthoods TVNZ They held their children in a house of chains. Now they may be in prison for life. The Washington Post Kids Speak As Parents Are Sentenced To Life In 'House Of Horrors' Case Scary M…","url":"https://www.tvnz.co.nz/one-news/world/children-were-starved-and-shackled-parents-want-normal-adulthoods","urlToImage":"https://www.tvnz.co.nz/content/dam/images/news/2019/04/20/life-in-prison-ordered-for-us-parents-who-tortured-and-starved-t.hashed.0d436c88.desktop.story.share.jpg","publishedAt":"2019-04-20T09:57:15Z","content":"The attorney for the adult children who were tortured and abused by their California parents for years says they're trying to live their lives as normally as possible and each is grappling with how much they're willing to forgive.\r\nAttorney Jack Osborn says D… [+1706 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Adam Shaw","title":"Controversial Steele dossier back in spotlight after Mueller report's release - Fox News","description":"Controversial Steele dossier back in spotlight after Mueller report's release Fox News FBI had doubts about top Trump dossier source before Carter Page FISA warrant renewals Washington Examiner Mueller Report Likely to Renew Scrutiny of Steele Dossier The New…","url":"https://www.foxnews.com/politics/controversial-steele-dossier-back-in-spotlight-after-mueller-reports-release","urlToImage":"https://media2.foxnews.com/BrightCove/694940094001/2019/04/17/694940094001_6027024337001_6027015912001-vs.jpg","publishedAt":"2019-04-20T20:00:18Z","content":"With Special Counsel Robert Mueller’s Russia report now out in the open, attention is likely to return in coming weeks to the salacious and unverified anti-Trump dossier compiled by former British spy Christopher Steele -- a dossier whose more sensational cla… [+4539 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"https://www.facebook.com/colby.itkowitz","title":"Trump administration says immigrants working in legal marijuana industry lack ‘moral character’ for citizenship - The Washington Post","description":"Trump administration says immigrants working in legal marijuana industry lack ‘moral character’ for citizenship The Washington Post Working in legal marijuana industry could keep immigrants from becoming citizens NBC News Immigrants are being denied US citize…","url":"https://www.washingtonpost.com/politics/2019/04/20/trump-administration-immigrants-working-legal-marijuana-industry-lack-moral-character-citizenship/","urlToImage":"https://www.washingtonpost.com/resizer/Tll4i9UjpLdFaJ96eJxIe2sRDXk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W6LHELCXHII6TKUDKBHQQ27V2Y.jpg","publishedAt":"2019-04-20T18:33:19Z","content":"Immigrants who use marijuana or who work in the cannabis industry can be denied citizenship, even if they are doing so in states where it is legal, U.S. Citizenship and Immigration Services said Friday.\r\nThe guidance, issued coincidentally or not just before … [+4295 chars]"},{"source":{"id":null,"name":"Nj.com"},"author":"Jeremy Schneider | NJ Advance Media For NJ.com","title":"What is 420 Day? Why is 4/20 national weed day? What does it mean, where does it come from and is marijuana legal? - NJ.com","description":"What is 420 Day? Why is 4/20 national weed day? What does it mean, where does it come from and is marijuana legal? NJ.com EDITOR'S NOTE: Entrepreneurs everywhere are eyeing the billion-dollar legal weed industry, an economic opportunity unrivaled in modern N.…","url":"https://www.nj.com/marijuana/2019/04/what-is-420-day-why-is-420-national-weed-day-what-does-it-mean-where-does-it-come-from-and-is-marijuana-legal.html","urlToImage":"https://www.nj.com/resizer/2HhPltnKGSQtvU1BQq2NwSCnLBE=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/QXB6OQ4K7FGUFIKTWB7Y2KF5Z4.jpg","publishedAt":"2019-04-20T05:28:00Z","content":"EDITORS NOTE:Entrepreneurs everywhere are eyeing the billion-dollar legal weed industry, an economic opportunity unrivaled in modern N.J. history.NJ Cannabis Insiderfeatures exclusive weekly content geared toward those interested in the marijuana industry.Vie… [+2725 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":null,"title":"Kate Smith statue covered up in Philadelphia as late 'God Bless America' singer faces new scrutiny - Fox News","description":"Kate Smith statue covered up in Philadelphia as late 'God Bless America' singer faces new scrutiny Fox News Yanks, Flyers drop 'God Bless America' rendition ESPN Singer Kate Smith Silenced At Yankee Stadium CBS New York Flyers To Stop Using Kate Smith’s Recor…","url":"https://www.foxnews.com/sports/philadelphia-flyers-cover-god-bless-america-singer-over-racist-songs","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/AP19109614127072.jpg","publishedAt":"2019-04-20T06:38:41Z","content":"The NHL's Philadelphia Flyers on Friday joined baseball's New York Yankees in halting the playing of Kate Smith's rendition of \"God Bless America\" at home games because of lyrics in other songs the late singer recorded.\r\nThe Flyers also covered up a statue of… [+3569 chars]"},{"source":{"id":null,"name":"Eonline.com"},"author":"Lena Grossman","title":"Justin Bieber Makes Cheeky Comment About Hailey Bieber's Body","description":"Justin Bieber loves his wife Hailey Bieber for both her inner and her outer beauty. The \"Sorry\" singer and Hailey have been partying it up at Coachella 2019 with some of their...","url":"https://www.eonline.com/news/1034367/justin-bieber-makes-cheeky-comment-about-hailey-bieber-s-body","urlToImage":"https://akns-images.eonline.com/eol_images/Entire_Site/2019313/rs_600x600-190413202646-600-justin-bieber-hailey-baldwin.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90","publishedAt":"2019-04-20T21:07:52Z","content":"Justin Bieber loves his wife Hailey Bieber for both her inner and her outer beauty.\r\nThe \"Sorry\" singer and Hailey have been partying it up at Coachella 2019 with some of their close pals, including Hailey's best friend Kendall JennerKendall, who is a total s… [+897 chars]"},{"source":{"id":null,"name":"Eonline.com"},"author":"Corinne Heller","title":"Inside Amanda Bynes' Recovery: She's \"Working on Herself\" After Graduating FIDM","description":"Now a college graduate, Amanda Bynes is \"working on herself\" amid her recovery and a new rehab stint. The 33-year-old Hairspray and Easy A actress had checked into a facility in...","url":"https://www.eonline.com/news/1034323/inside-amanda-bynes-recovery-she-s-working-on-herself-after-graduating-fidm","urlToImage":"https://akns-images.eonline.com/eol_images/Entire_Site/201921/rs_600x600-190301101453-600-amanda-bynes-metal-facility.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90","publishedAt":"2019-04-20T15:05:23Z","content":"The actress had enrolled at FIDM, a for-profit California college, in early 2014, weeks after she left a treatment facility and months after she was placed on an involuntary 5150 psychiatric hold in her hometown of Thousand Oaks following legal and personal t… [+1623 chars]"},{"source":{"id":null,"name":"Eonline.com"},"author":"Johnni Macke","title":"From Hop to Easter Parade: The Top 12 Easter Movies to Watch This Holiday","description":"Hippity, hoppity, Easter's on its way! In case you didn't already know, Easter is tomorrow, which means it's time to get ready to brunch, go on an Easter egg hunt and head to...","url":"https://www.eonline.com/shows/peoples_choice_awards/news/1028967/from-hop-to-easter-parade-the-top-12-easter-movies-to-watch-this-holiday","urlToImage":"https://akns-images.eonline.com/eol_images/Entire_Site/201932/rs_600x600-190402091911-600x600-hop-gj-4-2-19.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90","publishedAt":"2019-04-20T15:00:00Z","content":"Hippity, hoppity, Easter's on its way!\r\nIn case you didn't already know, Easter is tomorrow, which means it's time to get ready to brunch, go on an Easter egg hunt and head to mass before eating all the candy you can imagine.\r\nAs you enjoy the ultimate Sunday… [+4502 chars]"},{"source":{"id":null,"name":"Maderatribune.com"},"author":"For The Madera Tribune","title":"Goodyear exec to headline Valley business summit | Central California newspaper - The Madera Tribune","description":"Goodyear exec to headline Valley business summit | Central California newspaper The Madera Tribune The San Joaquin Valley Manufacturing Alliance (SJVMA) and the Fresno Business Council (FBC) have announced the keynote speaker for Valley Made: The...","url":"http://www.maderatribune.com/single-post/2019/04/20/Goodyear-exec-to-headline-Valley-business-summit","urlToImage":"https://static.wixstatic.com/media/b8ebb5_0db1b9f636b74ad7b110696e62044394%7Emv2.jpg","publishedAt":"2019-04-20T15:04:08Z","content":"The San Joaquin Valley Manufacturing Alliance (SJVMA) and the Fresno Business Council (FBC) have announced the keynote speaker for Valley Made: The 5th annual Manufacturing Summit. He is Billy Taylor, global director of diversity and inclusion at Goodyear Tir… [+3419 chars]"},{"source":{"id":null,"name":"Kcra.com"},"author":"Melinda Meza","title":"New Modesto business brings 250 jobs to region - KCRA Sacramento","description":"New Modesto business brings 250 jobs to region KCRA Sacramento A new business in opening in Modesto. The company makes frames for new homes. The business expects to bring 250 jobs to the region. Get the full story in the...","url":"https://www.kcra.com/article/new-modesto-brings-250-jobs-to-region/27212489","urlToImage":"https://kubrick.htvapps.com/vidthumb/081592af-7d3c-4230-9ca1-304a257052fb/081592af-7d3c-4230-9ca1-304a257052fb_image.jpg?crop=0.778xw:0.777xh;0.103xw,0&resize=1200:*","publishedAt":"2019-04-20T20:51:00Z","content":"MODESTO, Calif. (KCRA) —A new business is bringing hundreds of jobs to the valley and promoting a housing boom in Central California. \r\nA business named Entekra is expanding to Modesto, bringing hundreds of jobs with it.\r\nWe are bringing the United States con… [+1226 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"Motley Fool","title":"1 Big Reason Why Disney Stock Is Just Getting Started - Fox Business","description":"1 Big Reason Why Disney Stock Is Just Getting Started Fox Business Walt Disney (NYSE: DIS) is a market darling again. The media giant's stock is hitting new highs, finally taking out its peak 2015 prices. The stock has moved...","url":"https://www.fool.com/investing/2019/04/20/1-big-reason-why-disney-stock-is-just-getting-star.aspx","urlToImage":"","publishedAt":"2019-04-20T22:54:05Z","content":"Walt Disney (NYSE: DIS) is a market darling again. The media giant's stock is hitting new highs, finally taking out its peak 2015 prices. The stock has moved nearly 14% higher over the past five trading days, a big move for a stock that has been stuck in neut… [+3172 chars]"},{"source":{"id":null,"name":"Times-herald.com"},"author":null,"title":"Business Briefs - Newnan Times-Herald","description":"Business Briefs Newnan Times-Herald Dr. Trevor Turner joins Georgia Bone & Joint. Georgia Bone & Joint Physicians – with locations in Newnan and Peachtree City – recently announced the...","url":"http://times-herald.com/news/2019/04/business-briefs-1","urlToImage":"http://times-herald.com//cdn.nthstatic.net/assets/photos/2019/business-briefs-1/_articlePhotoFull/turner.jpg?mtime=20190420160010","publishedAt":"2019-04-20T07:00:00Z","content":"Photo courtesy Georgia Bone &amp; Joint Physicians\r\nDr. Trevor Turner\r\nDr. Trevor Turner joins Georgia Bone &amp; Joint\r\nGeorgia Bone &amp; Joint Physicians with locations in Newnan and Peachtree City recently announced the addition of Trevor Turner, MD/FAWM/… [+3024 chars]"},{"source":{"id":null,"name":"Startlandnews.com"},"author":null,"title":"KCMO ready to do business with marijuana startups; entrepreneurs of color see 'catalyst for empowerment' - Startland News","description":"KCMO ready to do business with marijuana startups; entrepreneurs of color see 'catalyst for empowerment' Startland News A green rush is growing in Missouri, and if attitudes of state officials, businesses owners and marijuana advocates are any indication, KC …","url":"https://www.startlandnews.com/2019/04/kansas-city-marijuana/","urlToImage":"https://www.startlandnews.com/app/uploads/2019/04/get-budding.jpg","publishedAt":"2019-04-20T02:31:00Z","content":"A green rush is soaking up sunshine in Missouri, and if attitudes of state officials, businesses owners and marijuana advocates are any indication, Kansas City is fertile ground for the movement.\r\nWe have a huge diversity of business opportunities, said Rick … [+6275 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":null,"title":"For three years her skin ulcers and pain would flare, then vanish, stumping doctors. Her daughter, a nurse, finally figured it out. - The Washington Post","description":"For three years her skin ulcers and pain would flare, then vanish, stumping doctors. Her daughter, a nurse, finally figured it out. The Washington Post After hearing a case study in class, Kimberly Ho was startled by the similar symptoms.","url":"https://www.washingtonpost.com/national/health-science/for-three-years-her-skin-ulcers-and-pain-would-flare-then-vanish-stumping-doctors-her-daughter-a-nurse-finally-figured-it-out/2019/04/19/b8b4da38-5481-11e9-9136-f8e636f1f6df_story.html","urlToImage":"https://www.washingtonpost.com/resizer/TLE2ipHkuaFTrRturlgZAiS2FsA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XPLTCATBN4I6TH7SVPEYJXE65Q.jpg","publishedAt":"2019-04-20T15:02:37Z","content":"Kimberly Ho, a newly minted nurse at Childrens National Medical Center just off a 12-hour overnight shift, struggled to focus on a presentation about working with sexually traumatized children and adolescents.\r\nAs the picture of a skin infection flashed on th… [+9026 chars]"},{"source":{"id":null,"name":"Theblaze.com"},"author":"Chris Enloe","title":"Eric Swalwell accused of sexism over this alarming response to challenge from Dana Loesch","description":"Rep. Eric Swalwell (D-Calif.), who is running for the 2020 Democratic presidential nomination on a gun control platform, was widely denounced Friday after attacking conservative commentator Dana Loesch with what was characterized as an incredibly sexist messa…","url":"https://www.theblaze.com/news/eric-swalwell-dana-loesch-sexist-response","urlToImage":"https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19407338%2F1200x600.jpg/2000%2C2000/jPOXcoOfQd0xJZgM/img.jpg","publishedAt":"2019-04-20T14:31:05Z","content":"Rep. Eric Swalwell (D-Calif.), who is running for the 2020 Democratic presidential nomination on a gun control platform, was widely denounced Friday after attacking conservative commentator Dana Loesch with what was characterized as an incredibly sexist messa… [+2149 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Ruth Reader","title":"The Bauhaus of Blunts? Today’s most ambitious cannabis companies are high on design","description":"To stand out in the crowd, cannabis companies are getting creative with their lifestyle branding. Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in po…","url":"https://www.fastcompany.com/90324682/the-bauhaus-of-blunts-todays-most-ambitious-cannabis-companies-are-high-on-design?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcocreate%2Ffeed+%28Co.Create%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/03/p-2-hero-in-the-weeds-FA0519CANN001.jpg","publishedAt":"2019-04-20T06:00:17Z","content":"Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in posh retail outlets, which stock dozens of different products, from medicinal-style vaporizers to TH… [+3389 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Martine Paris","title":"As legalized cannabis spreads, its startup economy is booming","description":"Canada has a head start, but investors see potential for explosive growth once regulation catches up with reality. April 20th has long been a day of defiance for cannabis activists, but in 2019, 420 is taking on new meaning as legalization continues to sweep …","url":"https://www.fastcompany.com/90337501/why-the-tech-industry-is-high-on-cannabis?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcocreate%2Ffeed+%28Co.Create%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-cannabis-growth-tech.jpg","publishedAt":"2019-04-20T00:00:39Z","content":"April 20th has long been a day of defiance for cannabis activists, but in 2019, 420 is taking on new meaning as legalization continues to sweep across the U.S.\r\nWeed is now legal in 33 states for medical use, and 10 states for recreational use. It’s also lega… [+6445 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By jillian.lucas@thedailybeast.com (Jillian Lucas)","title":"Scouted: The Top Books For Wine Lovers, Chosen By The Editors of Half Full","description":"Wine certainly has a lot of history. From its religious implications to the bottles found on the Titanic, there’s a lot to unpack when it comes to wine. Good thing there’s a ton of literature about where wine has been and where it’s going, and you deserve to …","url":"https://www.thedailybeast.com/the-top-books-about-wine","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555770646/68faw2_uidql6","publishedAt":"2019-04-20T18:01:56Z","content":"Wine certainly has a lot of history. From its religious implications to the bottles found on the Titanic, theres a lot to unpack when it comes to wine. Good thing theres a ton of literature about where wine has been and where its going, and you deserve to rea… [+4570 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By amy.zimmerman@thedailybeast.com (Amy Zimmerman)","title":"Coachella Security Guards Allege Inhumane Treatment: ‘People Over Here Are Starving’","description":"Matt Winkelmeyer/Getty Every year, music lovers and miscellaneous basics flood Indio, California, for the Coachella Valley Music and Arts Festival. Coachella is known for its huge headlining artists and general aura of douchebaggery—the stereotypical festival…","url":"https://www.thedailybeast.com/coachella-security-guards-allege-inhumane-treatment-people-over-here-are-starving","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555782873/190420-zimmerman-coachella-unfair-treatment-hero_1_vloaxz","publishedAt":"2019-04-20T18:08:13Z","content":"Every year, music lovers and miscellaneous basics flood Indio, California, for the Coachella Valley Music and Arts Festival. Coachella is known for its huge headlining artists and general aura of douchebaggerythe stereotypical festivalgoer is a rich kid sport… [+12393 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By Joseph.Longo@thedailybeast.com (Joseph Longo)","title":"Chris Lilley’s New Netflix Show ‘Lunatics’ Is Painfully Out of Touch","description":"Vince Valitutti/Netflix Lunatics is classic Chris Lilley—for better and worse. I could give you the synopsis—the Australian comedian’s new 10-part mockumentary series on Netflix chronicles the mundane day-to-day lives of six eccentrics, all played by Lilley. …","url":"https://www.thedailybeast.com/chris-lilleys-netflix-show-lunatics-no-blackface-but-still-painfully-out-of-touch","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2025,w_3600,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555781125/190419-longo-lunatics-tease_e8rvmn","publishedAt":"2019-04-20T17:25:42Z","content":"Lunatics is classic Chris Lilleyfor better and worse. I could give you the synopsisthe Australian comedians new 10-part mockumentary series on Netflix chronicles the mundane day-to-day lives of six eccentrics, all played by Lilley. They include Becky, a seven… [+4237 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Ruth Reader","title":"The Bauhaus of Blunts? Today’s most ambitious cannabis companies are high on design","description":"To stand out in the crowd, cannabis companies are getting creative with their lifestyle branding. Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in po…","url":"https://www.fastcompany.com/90324682/the-bauhaus-of-blunts-todays-most-ambitious-cannabis-companies-are-high-on-design?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcoexist%2Ffeed+%28Co.Exist%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/03/p-2-hero-in-the-weeds-FA0519CANN001.jpg","publishedAt":"2019-04-20T06:00:17Z","content":"Marijuana has come a long way from the days of plastic baggies and glass jars filled with OG Kush and Sticky Icky Icky. Today’s cannabis (née weed) is sold in posh retail outlets, which stock dozens of different products, from medicinal-style vaporizers to TH… [+3389 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Martine Paris","title":"As legalized cannabis spreads, its startup economy is booming","description":"Canada has a head start, but investors see potential for explosive growth once regulation catches up with reality. April 20th has long been a day of defiance for cannabis activists, but in 2019, 420 is taking on new meaning as legalization continues to sweep …","url":"https://www.fastcompany.com/90337501/why-the-tech-industry-is-high-on-cannabis?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcoexist%2Ffeed+%28Co.Exist%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-cannabis-growth-tech.jpg","publishedAt":"2019-04-20T00:00:39Z","content":"April 20th has long been a day of defiance for cannabis activists, but in 2019, 420 is taking on new meaning as legalization continues to sweep across the U.S.\r\nWeed is now legal in 33 states for medical use, and 10 states for recreational use. It’s also lega… [+6445 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Stocks To Watch","title":"Stocks To Watch: Earnings Blitz And Autonomy Talk","description":"Welcome to Seeking Alpha's Stocks to Watch - a preview of key events scheduled for the next week. Follow this account and turn the e-mail alert on to receive th","url":"https://seekingalpha.com/article/4255527-stocks-watch-earnings-blitz-autonomy-talk","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-20T12:05:47Z","content":"Welcome to Seeking Alpha's Stocks to Watch - a preview of key events scheduled for the next week. Follow this account and turn the e-mail alert on to receive this article in your inbox every Saturday morning.\r\nAnother nice ramp-up of earnings arrives next wee… [+10648 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"The Owl","title":"The Frontier Communications' Board Needs A Reset: Here's Why And Here's How","description":"Frontier has lost 98% of equity value since the CTF acquisition was consummated, so the strategies of the board and company leadership have been value destroyin","url":"https://seekingalpha.com/article/4255509-frontier-communications-board-needs-reset","urlToImage":"https://static.seekingalpha.com/uploads/2019/4/16/585273-155546190812682.png","publishedAt":"2019-04-20T04:58:13Z","content":"This article is intended for investors oriented towards value-deep, value-distressed asset investing. Those seeking moderate- to high-risk value investments may have an interest in this article. Investments in this company at any level of the capital structur… [+31367 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"USC signs guard Ethan Anderson","description":"Guard Ethan Anderson has signed to play for Southern California, joining the Trojans' previously announced four-member recruiting class","url":"https://www.foxsports.com/college-basketball/story/usc-signs-guard-ethan-anderson-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-20T01:08:38Z","content":"LOS ANGELES (AP) — Guard Ethan Anderson has signed to play for Southern California, joining the Trojans‘ previously announced recruiting class.\r\nAnderson averaged 20.8 points, 6.2 rebounds and 6.3 assists as a senior at Fairfax High in Los Angeles. The 6-foot… [+444 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Santa Anita to run 3 days a week, hike purses for 6 weeks","description":"Santa Anita will race three days a week instead of four over the next four weeks because the track has lost some of its horse population to out-of-state venues","url":"https://www.foxsports.com/horse-racing/story/santa-anita-to-run-3-days-a-week-hike-purses-for-6-weeks-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-20T01:49:10Z","content":"ARCADIA, Calif. (AP) — Santa Anita will race three days a week instead of four over the next four weeks because the track has lost some of its horse population to out-of-state venues.\r\nSeveral stables have shipped horses to Kentucky to run at Keeneland and Ch… [+1176 chars]"},{"source":{"id":null,"name":"Voanews.com"},"author":"VOA","title":"San Francisco to Charge for Driving on Lombard Street","description":"Visitors may soon have to pay as much as $10 to drive down the world-famous Lombard Street in San Francisco, California. Lombard Street winds down a hill and is often overrun by tourists. It is known as the “most crooked street in the world.” In an effort to …","url":"https://learningenglish.voanews.com/a/san-francisco-to-charge-for-driving-on-lombard-street/4881557.html","urlToImage":"https://gdb.voanews.com/70DF0357-99D9-49C1-9954-79BDFF89D0C1_cx11_cy17_cw85_w1200_r1_s.jpg","publishedAt":"2019-04-20T21:57:04Z","content":"Visitors may soon have to pay as much as $10 to drive down the world-famous Lombard Street in San Francisco, California.\r\nLombard Street winds down a hill and is often overrun by tourists. It is known as the most crooked street in the world.\r\nIn an effort to … [+3068 chars]"},{"source":{"id":null,"name":"Voanews.com"},"author":"VOA","title":"Study: Some US Colleges Fail to Reach Rural Students","description":"With more than 4,000 colleges and universities in the Unites States, it may seem like students have plenty of access to higher education. But that is not always the case for students from places like central Colorado or western Texas, for example. For high sc…","url":"https://learningenglish.voanews.com/a/some-us-colleges-fail-to-reach-rural-students/4882150.html","urlToImage":"https://gdb.voanews.com/56474A23-F973-4DC2-A01A-B2F307435554_w1200_r1_s.jpg","publishedAt":"2019-04-20T22:01:29Z","content":"With more than 4,000 colleges and universities in the Unites States, it may seem like students have plenty of access to higher education.\r\nBut that is not always the case for students from places like central Colorado or western Texas, for example. For high s… [+6242 chars]"}]}