{"status":"ok","totalResults":1647,"articles":[{"source":{"id":null,"name":"Lifehacker.com"},"author":"Josh Ocampo","title":"How Do I Recycle Old Batteries?","description":"There’s an overwhelming sense of guilt that washes over me when I throw something in the trash that probably shouldn’t be there—particularly when it comes to e-waste. Are broken headphones recyclable? What should I do with old laptop chargers? And what do I d…","url":"https://lifehacker.com/how-do-i-recycle-old-batteries-1834215406","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--C8m2jjL7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/zm53uxzixiji9kyxus5i.jpg","publishedAt":"2019-04-22T20:00:00Z","content":"Theres an overwhelming sense of guilt that washes over me when I throw something in the trash that probably shouldnt be thereparticularly when it comes to e-waste. Are broken headphones recyclable? What should I do with old laptop chargers? And what do I do w… [+2921 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Sean O'Kane","title":"Here’s how to watch Tesla’s self-driving event today","description":"Elon Musk is likely to share more about the company’s years-long push for full self-driving tech. Investors will get “test-drives to experience [Tesla’s] Autopilot software,” including features and functionality that “are under active development.”","url":"https://www.theverge.com/2019/4/22/18511252/how-to-watch-tesla-autonomy-day-live-stream-elon-musk","urlToImage":"https://cdn.vox-cdn.com/thumbor/_JyxWjlLf3him8qIr2im2mlSU3s=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10228171/jbareham_180213_2301_0200.jpg","publishedAt":"2019-04-22T18:16:59Z","content":"Tesla is about to hold an “Autonomy Investor Day” today at its headquarters in Palo Alto, California. The event was slated to start at 2PM ET (but is running a little late), and you can watch it above or at this link. The event comes two days before Tesla is … [+2894 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Patrick Howell O'Neill","title":"California Eyes Ban on Contracts With All Tech Companies That Work With ICE","description":"Up and down the state of California, lawmakers and activists have been pushing a local and state-level campaign to kill contracts with tech companies that work with Homeland Security’s Immigration and Customs Enforcement. Read more...","url":"https://gizmodo.com/california-eyes-ban-on-contracts-with-all-tech-companie-1834216493","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--T4rbIFoY--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/dnyw19alfh2b9ztv6t3y.jpg","publishedAt":"2019-04-22T19:12:00Z","content":"Up and down the state of California, lawmakers and activists have been pushing a local and state-level campaign to kill contracts with tech companies that work with Homeland Securitys Immigration and Customs Enforcement.\r\nOn Tuesday in Sacramento, the Califor… [+3572 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"JILL COWAN","title":"California Today: It’s Earth Day. Here’s How to Make Less Trash.","description":"Monday: You don’t have to be a climate scientist. Also: more fallout from Nipsey Hussle, and a guide to Mendocino County","url":"https://www.nytimes.com/2019/04/22/us/california-earth-day-berkeley-chou-hall.html","urlToImage":"https://static01.nyt.com/images/2019/04/22/us/22berkeleycatoday/22berkeleycatoday-facebookJumbo-v2.jpg","publishedAt":"2019-04-22T13:01:30Z","content":"Weve been talking a lot about the desertlately, but if thats too much of a haul for a weekend trip from wherever you live, you might instead consider a getaway to Mendocino County.\r\nThe Times just published a new 36 Hours guide to the area about 90 miles nort… [+947 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"TIM ARANGO","title":"A Real Estate Mogul Seeks to Expand His Influence Over Los Angeles","description":"Rick J. Caruso, a developer and chairman of the board of trustees at the University of Southern California, has become a figure of increasing influence in the city.","url":"https://www.nytimes.com/2019/04/22/us/los-angeles-rick-caruso-usc.html","urlToImage":"https://static01.nyt.com/images/2019/04/04/us/00caruso-02/merlin_152993976_9d7dc81b-cdd4-4b47-8741-ba474e367675-facebookJumbo.jpg","publishedAt":"2019-04-22T15:59:06Z","content":"Last summer, Mr. Caruso became chairman of the board and installed Wanda Austin, a former aerospace executive, as interim president, forcing out C.L. Max Nikias, who still had many loyalists among the board who opposed Mr. Carusos efforts to install new leade… [+2217 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"NEAL E. BOUDETTE","title":"Elon Musk Predicts Tesla Driverless Taxi Fleet Next Year","description":"A Tesla delivery site in Norway. Tesla’s chief executive, Elon Musk, says the company is on the verge of making cars that can drive themselves safely on any road.","url":"https://www.nytimes.com/2019/04/22/business/elon-musk-tesla-autopilot.html","urlToImage":"https://static01.nyt.com/images/2019/04/22/business/22tesla1/22tesla1-facebookJumbo.jpg","publishedAt":"2019-04-22T23:45:15Z","content":"Just last week, a parked Tesla caught fire at a service center near Pittsburgh. The car had previously caught fire in February, according to a local news report. In February, a man was killed in Florida when the Tesla he was driving crashed and was engulfed i… [+2181 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Eric Cheung, CNN","title":"Philippines rocked by deadly earthquake","description":"A 6.1-magnitude earthquake struck near the town of Bodega on the Philippine island of Luzon on Monday, according to the United States Geological Survey (USGS).","url":"https://www.cnn.com/2019/04/22/asia/philippines-earthquake-intl/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190422163353-03-philippines-earthquake-0422-super-tease.jpg","publishedAt":"2019-04-22T16:26:44Z","content":"(CNN)A 6.1-magnitude earthquake struck near the town of Bodega on the Philippine island of Luzon on Monday, according to the United States Geological Survey (USGS).\r\nPampanga Governor Lilia Pineda said at least eight people in the province were killed in the … [+1982 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Kelly McLaughlin","title":"Police are looking for a woman who threw 7 3-day-old puppies into a Dumpster in Coachella","description":"Riverside County Animal Services released footage of a woman who threw seven 3-day-old puppies into a Dumpster behind an auto parts store in Coachella, California, on Thursday. Less than an hour after the puppies were left in the Dumpster, a passerby found th…","url":"https://www.thisisinsider.com/woman-threw-puppies-into-dumpster-coachella-police-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbdc859d2ce781d2b615e92-1536-768.jpg","publishedAt":"2019-04-22T13:55:26Z","content":"Authorities in California are searching for a woman who was filmed throwing seven 3-day-old puppies into a dumpster behind an auto parts store in Coachella. \r\n Riverside County Animal Services shared video of the incident on Facebook, saying the woman dropped… [+1292 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Tiana Attride","title":"15 photos that will make you wish you lived in the Pacific Northwest","description":"The Pacific Northwest is one of the US's most beautiful locations for those looking for both unique cities and breathtaking nature. The turquoise waters of Diablo Lake in Washington state are a sight straight from a painting. Portland, Oregon, gives visitors …","url":"https://www.thisisinsider.com/pacific-northwest-pictures-make-you-wish-you-lived-there-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbdfe052730ca1f284d30e8-750.jpg","publishedAt":"2019-04-22T17:46:32Z","content":"The Pacific Northwest may be comprised of just a few states, but across those territories lies enough natural beauty to last a lifetime. \r\n Some people may think the bulk of the West Coast's magic exists in California, but those in-the-know are aware of all t… [+254 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Lara Walsh","title":"The 'You' season 2 cast is filled with new and familiar faces. Here's who you can expect to see in the upcoming season.","description":"The cast of \"You\" season two will feature some familiar faces and some new ones. Victoria Pedretti, from the Netflix original \"The Haunting of Hill House,\" will appear as Joe's new love interest. \"Undateable\" star Chris D'Elia will be playing a comic named He…","url":"https://www.thisisinsider.com/cast-of-you-season-two-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbde43f2730ca1cf64755e4-750.jpg","publishedAt":"2019-04-22T15:51:06Z","content":"After leaving viewers on a chilling note, the Lifetime-turned-Netflix thriller is set to follow Joe Goldberg (Penn Badgley) to California, introducing viewers to a new leading lady and several other new faces that might make the bookstore manager's penchant f… [+574 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Meghan Morris","title":"iM Global has taken a stake in a top-performing equity business, as it looks to put its remaining $400 million to work","description":"Investment firm iM Global Partner is buying a 40% stake in Scharf Investments, one of iM Global's executives told Business Insider. The California equity manager, which now oversees $3.4 billion, has quintupled in size since 2007. The deal comes amid a hot ti…","url":"https://www.businessinsider.com/im-global-buys-40-interest-in-californias-scharf-investments-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbdb2c112ece25fac788714-1536-768.jpg","publishedAt":"2019-04-22T13:00:00Z","content":"iM Global Partner, an investment firm that buys minority stakes in asset managers, has inked its latest deal, an executive told Business Insider. \r\n The Philadelphia-based firm is buying a 40% stake in Scharf Investments, a Scotts Valley, California-based equ… [+2490 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Marley Jay","title":"One of America's top-ranked wealth managers details a huge strategic change she made after 20 years of success — and says she'd do it again in a heartbeat","description":"Rebecca Rothstein manages $3.8 billion for the ultra-wealthy, and in 2018 she made a big change after by going all-in on exchange-traded funds. Rothstein says her firm, RVR Group — which is part of Bank of America Merrill Lynch — now owns about 90% of its sto…","url":"https://www.businessinsider.com/money-management-advice-top-ranked-advisor-rebecca-rothstein-details-big-strategy-shift-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba1d50b8342c3d755a621f-750-375.jpg","publishedAt":"2019-04-22T09:58:00Z","content":"Twenty years into a successful career managing wealth, Rebecca Rothstein decided it was time for a change. \r\n She had been repeatedly ranked as one of the best US wealth advisors for more than a decade, and last year Forbes named her the top woman in her fiel… [+2449 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Frank Olito","title":"The 12 best amusement parks in the US that aren't Disney","description":"There are amusement parks all over the country that are great — and cheaper — alternatives to Disney parks. Cedar Point in Ohio, Silver Dollar City in Missouri, and Dollywood in Tennessee have thrilling rides that are comparable to those at Disney. Busch Gard…","url":"https://www.thisisinsider.com/underrated-cheap-amusement-parks-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbe35cf2730ca2444735769-750.jpg","publishedAt":"2019-04-22T21:44:16Z","content":"Although a trip to Disney is supposed to be filled with magic, sometimes it can just be expensive, crowded, and downright disappointing. \r\n But there are other amusement parks all over the country that have exciting rides and experiences at half the cost. Whi… [+289 chars]"},{"source":{"id":null,"name":"Greenentrepreneur.com"},"author":"Jonathan Small","title":"What the Chronic Cup Taught Us About the Canna-Business","description":"The pitch contest, sponsored by Flower Co, showcased a variety of approaches to the industry.","url":"https://www.greenentrepreneur.com/article/332443","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190417202429-MathewPasqualWinnerTonyLibbyTed1.jpeg","publishedAt":"2019-04-22T18:24:00Z","content":"April\r\n22, 2019\r\n3 min read\r\nI recently had the opportunity to judge the Chronic Cup in San Francisco. The Shark Tank-ish pitch event awarded $10k to a variety of California-focused cannabis startup. It was sponsored byFLOWER CO, an online, subscription-based… [+3057 chars]"},{"source":{"id":null,"name":"Entrepreneur.com"},"author":"Hayden Field","title":"There's a Massive Gender Gap in AI, but Tech Education Programs for Young Girls Aim to Close It","description":"Iridescent, a tech education nonprofit, teaches women and girls about AI, tech entrepreneurship and more. So far, it's trained more than 114,000 people from 115 countries.","url":"https://www.entrepreneur.com/article/332481","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190418162101-GettyImages-705001881.jpeg","publishedAt":"2019-04-22T12:30:00Z","content":"April\r\n22, 2019\r\n10 min read\r\nTara Chklovski had the weight of her family on her shoulders.\r\nGrowing up in India in what she calls a lower-middle-class family, it was difficult not to notice the poverty around her -- especially the pivotal role chance plays i… [+11156 chars]"},{"source":{"id":null,"name":"Aa.com.tr"},"author":null,"title":"US nears record number of measles cases - Anadolu Agency","description":"US nears record number of measles cases Anadolu Agency New York Measles Outbreaks Drive US Cases Up to 626 TIME Measles nears record in US as the disease spreads in New York CNBC El Al Flight Attendant in Deep Coma After Contracting Measles on NY to TLV Journ…","url":"https://www.aa.com.tr/en/americas/us-nears-record-number-of-measles-cases/1460031","urlToImage":"https://cdnuploads.aa.com.tr/uploads/Contents/2019/04/22/thumbs_b_c_1022f602f85530fb4a8b74a633985214.jpg?v=183722","publishedAt":"2019-04-22T15:39:16Z","content":"WASHINGTON\r\nThe number of measles cases in the U.S. is approaching its highest since the disease was declared eliminated in 2000, the Centers for Disease Control (CDC) said Monday.\r\nSo far in 2019, 626 cases have been reported, 41 less than the current record… [+943 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":null,"title":"Disney’s CEO made 1,424 times as much as his employees. An heir to the Disney fortune thinks that’s ‘insane.’ - The Washington Post","description":"Disney’s CEO made 1,424 times as much as his employees. An heir to the Disney fortune thinks that’s ‘insane.’ The Washington Post Abigail Disney Calls Bob Iger’s $65 Million Compensation ‘Insane’ Variety Disney heiress calls CEO Bob Iger's $65.6 million total…","url":"https://www.washingtonpost.com/nation/2019/04/22/disneys-ceo-made-times-much-his-employees-an-heir-disney-fortune-thinks-thats-insane/","urlToImage":"https://www.washingtonpost.com/resizer/0mMbrU2bmfrrNZldEKQ85Kykd7Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FJIA7GQM6ZF73FWJKC4OWAU4AY.jpg","publishedAt":"2019-04-22T10:18:43Z","content":"Abigail Disney did the math.\r\nLast year, when Bob Iger, the CEO of Walt Disney Co., earned a bonus that brought his total compensation to $65.6 million, she discovered that he could have awarded a 15 percent raise to everyone who worked at Disneyland and stil… [+7109 chars]"},{"source":{"id":null,"name":"Castanet.net"},"author":null,"title":"Queen turns 93 - World News - Castanet.net","description":"Queen turns 93 - World News Castanet.net Queen Elizabeth II turns 93 on Easter Sunday CityNews Vancouver Prince Harry Reunites With William and Kate at Easter Service E! Online Britain's Queen Elizabeth celebrates 93rd birthday at Easter service The Globe and…","url":"https://www.castanet.net/news/World/254454/Queen-turns-93","urlToImage":"https://www.castanet.net/content/2019/4/LKW108-421_2019_094139_p3382273.jpg","publishedAt":"2019-04-22T14:10:00Z","content":"World  \r\nQueen Elizabeth II is celebrating her 93rd birthday, which this year coincides with Easter Sunday.\r\nThe queen is marking Easter by attending a service with other senior royals at St. George's Chapel on the grounds of Windsor Castle, west of London.\r\n… [+34919 chars]"},{"source":{"id":null,"name":"Readwrite.com"},"author":"Zach Butler","title":"Unlocking the Promise of Enterprise IoT","description":"The promise of IoT is enormous, from reducing operational costs to improving workplace safety; yet many organizations face hurdles when it comes to delivering on this potential. New findings from a recent survey IoT World conducted of IoT business decision ma…","url":"https://readwrite.com/2019/04/22/unlocking-the-promise-of-enterprise-iot/","urlToImage":"https://images.readwrite.com/wp-content/uploads/2019/04/IoT-World-for-Readwrite.jpg","publishedAt":"2019-04-22T18:00:26Z","content":"The promise of IoT is enormous, from reducing operational costs to improving workplace safety; yet many organizations face hurdles when it comes to delivering on this potential. New findings from a recent survey IoT World conducted of IoT business decision ma… [+3433 chars]"},{"source":{"id":null,"name":"Kotaku.com"},"author":"Forest Lassman","title":"Where Are Uncharted 2's Developers Today?","description":"Each person who worked on 2009&#39;s Uncharted 2: Among Thieves had their own path to the game. Some had been at Naughty Dog for years, while others were hired mid-development. In the decade since the PlayStation 3 game’s release, people have continued to mov…","url":"https://kotaku.com/where-are-uncharted-2s-developers-today-1834220699","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--r-HYiHPr--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/h9gbrcwqu9vtuivxgrlu.png","publishedAt":"2019-04-22T19:30:00Z","content":"Each person who worked on 2009's Uncharted 2: Among Thieves had their own path to the game. Some had been at Naughty Dog for years, while others were hired mid-development. In the decade since the PlayStation 3 games release, people have continued to move aro… [+16816 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"Heiress \"Instagram influencer\" whose parents are accused of paying a $500K bribe to get her into USC has trademark application rejected for punctuation errors","description":"Olivia Jade Giannulli is the millionaire heiress of actor Lori Laughlin and fashion designer Mossimo Giannulli, who are accused of paying a $500,000 bribe to the University of Southern California to secure her admission; Jade's university career was bound up …","url":"https://boingboing.net/2019/04/22/delicious-irony.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/5598101411_628824cb80_o.jpg","publishedAt":"2019-04-22T18:19:40Z","content":"Olivia Jade Giannulli is the millionaire heiress of actor Lori Laughlin and fashion designer Mossimo Giannulli, who are accused of paying a $500,000 bribe to the University of Southern California to secure her admission; Jade's university career was bound up … [+2930 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"Elizabeth Warren's latest proposal: cancel student debt, make college free","description":"Elizabeth Warren has proposed a $1.25 trillion plan to forgive student debts and make all public college and university undergraduate education free, as well as earmarking $50B for historically Black colleges, and expanding federal grants to help pay for all …","url":"https://boingboing.net/2019/04/22/scholars-jubilee.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/6304808136_a4465d1240_z-1.jpg","publishedAt":"2019-04-22T18:38:08Z","content":"Elizabeth Warren has proposed a $1.25 trillion plan to forgive student debts and make all public college and university undergraduate education free, as well as earmarking $50B for historically Black colleges, and expanding federal grants to help pay for all … [+4305 chars]"},{"source":{"id":null,"name":"Venturebeat.com"},"author":"Kyle Wiggers","title":"OpenAI’s Dota 2 bot defeated 99.4% of players in public matches","description":"San Francisco-based OpenAI says its AI-imbued Dota 2 bot beat a whopping 99.4% of players in public matches over the course of several days.","url":"https://venturebeat.com/2019/04/22/openais-dota-2-bot-defeated-99-4-of-players-in-public-matches/","urlToImage":"https://venturebeat.com/wp-content/uploads/2018/08/DSC_7309-2.jpg?w=1200&strip=all","publishedAt":"2019-04-22T13:46:09Z","content":"OpenAI Five — the AI-imbued bot designed by San Francisco, California-based research organization OpenAI that defeated a professional esports team at Valve’s Dota 2 earlier this month — became publicly playable last week via Arena, a mode which allowed player… [+9194 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"larry buhl","title":"California’s high-value crops, like fruits and nuts, are the ones most vulnerable to climate change","description":"A sobering recent study says that almost all of the state’s crops, together valued at more than $50 billion a year, will be endangered by rising temperatures and unstable weather patterns brought by climate change. Capital & Main is an award-winning publicati…","url":"https://www.fastcompany.com/90338329/californias-high-value-crops-are-the-ones-most-vulnerable-to-climate-change?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-california-crops.jpg","publishedAt":"2019-04-22T14:30:25Z","content":"“We’re at a moment of clarity across the agriculture industry and the state regarding climate change,” said Brillinger. “After the deepest drought in the state’s history, plus two years of wildfires, there have been many wake-up calls.”\r\nMedium- and small-sca… [+4671 chars]"},{"source":{"id":null,"name":"Publicintegrity.org"},"author":"Dave Levinthal / Center for Public Integrity","title":"2020 Candidates Talk Up Small Donors, But Stay Quiet on Bundlers","description":"Most Democrats who want to win the White House have all but fetishized small-dollar donors. Enthusiastic supporters who contribute $20 here or $50 there offer candidates grassroots street cred during a presidential primary season in which corporate money and …","url":"https://publicintegrity.org/federal-politics/elections/bundlers-president-election-2020/","urlToImage":"https://timedotcom.files.wordpress.com/2019/03/kamala-harris-teacher-pay-plan.jpg?quality=85","publishedAt":"2019-04-22T14:25:03Z","content":"Most Democrats who want to win the White House have all but fetishized small-dollar donors. \r\nEnthusiastic supporters who contribute $20 here or $50 there offer candidates grassroots street cred during a presidential primary season in which corporate money an… [+7937 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Police search for woman who tossed bag of 7 live puppies into Coachella dumpster","description":"Authorities in California are asking for the public's help in identifying a woman caught on surveillance tossing a bag of 3-day-old puppies into a dumpster.","url":"https://news.yahoo.com/police-search-woman-tossed-bag-181202065.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/7r9HW1dz.uimaaxw1ypwEw--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/485x318+0+32/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-04/fa65c970-6529-11e9-975e-5d6828e10774","publishedAt":"2019-04-22T18:12:02Z","content":"Authorities in California are asking for the public's help in identifying a woman caught on surveillance video tossing a bag of 3-day-old puppies into a dumpster in Coachella, Calif. \r\nFootage released by the Riverside County Department of Animal Services (RC… [+1574 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Church parishioners help tackle woman holding gun and baby at Easter Sunday service","description":"A mother holding a 10-month-old baby and waving a gun was tackled at a California church on Easter Sunday and arrested after she made threats to blow up the building.","url":"https://news.yahoo.com/church-parishioners-help-tackle-woman-113753367.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/bt6F8qF6.622D7OCx__2DQ--~B/aD0zNjA7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/11734/c1d7df6c-0ce9-4e1a-80d9-61c93a15e582/a6e7d7fb-e094-564d-abd9-feda83c697c3/data_3_0.jpg?s=fc4fcbe9eaad2691c463fcc6c87886d1&c=47d4914aa7cd33f5d119fb1065ca3827&a=foxnews&mr=0","publishedAt":"2019-04-22T11:37:53Z","content":"A mother holding a 10-month-old baby and waving a gun was tackled at a California church on Easter Sunday and arrested after she made threats to blow up the building."},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Pete Buttigieg scrambles to turn 2020 buzz into momentum","description":"MANCHESTER, N.H. (AP) — There are no policy positions on his website. He has virtually no paid presence in the states that matter most. And his campaign manager is a high school friend with no experience in presidential politics.","url":"https://news.yahoo.com/buttigieg-scrambles-turn-2020-buzz-042014920.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/PV_LRajPt.rmTu5BipxNdw--~B/aD0yODM0O3c9NDY1NjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/ef95769a61f04643beb03084f2ed3966.jpg","publishedAt":"2019-04-22T18:50:04Z","content":"MANCHESTER, N.H. (AP) There are no policy positions on his website. He has virtually no paid presence in the states that matter most. And his campaign manager is a high school friend with no experience in presidential politics.\r\nThis is the upstart campaign o… [+6836 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"David Pescovitz","title":"A day working at Rustler Steak House (1977)","description":"\"Back in 1976/77, I worked at the Rustler Steak House in Alameda, California,\" writes Take2MarkTV. \"One night, I took my Super 8 camera with me to document a typical shift.\" Growing up, my family preferred the local Ponderosa Steakhouse over Rustler, and even…","url":"https://boingboing.net/2019/04/22/a-day-working-at-rustler-steak.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/screenshot-53.jpg","publishedAt":"2019-04-22T07:08:21Z","content":"\"Back in 1976/77, I worked at the Rustler Steak House in Alameda, California,\" writes Take2MarkTV. \"One night, I took my Super 8 camera with me to document a typical shift.\"\r\nGrowing up, my family preferred the local Ponderosa Steakhouse over Rustler, and eve… [+2173 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"HuffPost Video","title":"Eating Ugly: The Food Waste That Could Refeed America","description":"California is the country’s biggest produce-growing region grappling with ways to rescue edible food waste and reduce greenhouse gas emissions from landfills.","url":"https://www.huffpost.com/entry/eating-ugly-the-food-waste-that-could-refeed-america_n_5cbdd120e4b032e7cebb0cd0","urlToImage":"https://img.huffingtonpost.com/asset/5cbdd1c1240000b900068433.jpeg?cache=sklhGnXn9d&ops=1200_630","publishedAt":"2019-04-22T14:38:43Z","content":null},{"source":{"id":null,"name":"Huffpost.com"},"author":"Sam Levine","title":"Democratic Presidential Contenders Criticize New Hampshire Voting Restriction","description":"Opponents say a new law amounts to a poll tax in the state that plays a crucial role in presidential politics.","url":"https://www.huffpost.com/entry/2020-democrats-new-hampshire-voting-law_n_5cbde8a0e4b032e7cebb3d72","urlToImage":"https://img.huffingtonpost.com/asset/5cbdebef2a0000e8044f941c.jpeg?cache=q7R6y1PUNG&ops=1200_630","publishedAt":"2019-04-22T17:59:47Z","content":"Several Democrats running for the White House quickly came out against a revision to New Hampshire voting laws that adds a requirement on voters in the state the holds the nation’s first presidential primary. \r\nNew Hampshire currently only requires that peopl… [+2556 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"Measles cases 'likely' to break yearly record in just 4 months","description":"The Centers for Disease Control reports that there have been 626 confirmed cases of measles so far this year, marking an increase of 71 new cases since last week.","url":"https://abcnews.go.com/Health/measles-cases-break-yearly-record-months/story?id=62552978","urlToImage":"https://s.abcnews.com/images/US/washington-measles-02-rtr-jc-190418_hpMain_16x9_992.jpg","publishedAt":"2019-04-22T16:59:36Z","content":"The number of measles cases in the U.S. so far this year is approaching the record for the decade -- and in just four months time, according to new data.\r\nThe Centers for Disease Control and Prevention reports that there have been 626 confirmed cases of measl… [+1724 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Special to USA TODAY, Matthew Wilson, Special to USA TODAY","title":"'Shark Tank' recap: Sisters' macaron ice cream sandwiches prove a sweet investment","description":"Gwen and Christine Nguyen own Mavens Creamery, a California-based macaron ice cream sandwich maker. They were asking the sharks for $400,000.","url":"https://www.usatoday.com/story/life/2019/04/22/shark-tank-sisters-macaron-ice-cream-sandwiches-sweet-investment/3535494002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/21/USAT/d13ecb05-6f2a-40fa-890c-a6a9b999bfe0-150291_2056.jpg?crop=2399,1350,x0,y89&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T03:00:03Z","content":"On Sundays Shark Tank, the daughters of a Vietnamese refugee made their fathers entrepreneurial dreams a reality. And Kevin OLeary coached his fellow sharks on how to properly say macaron:  Its not mac-a-roon. Its mah-kah-ron. Get it right.\r\nGwen and Christin… [+3637 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Ryan W. Miller, USA TODAY","title":"71 additional measles cases confirmed as CDC warns record levels nearing","description":"A total of 626 measles cases in 22 states have been confirmed since Jan. 1, the Centers for Disease Control and Prevention said.","url":"https://www.usatoday.com/story/news/health/2019/04/22/measles-outbreak-71-additional-cases-22-states-confirmed-cdc/3536904002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/09/USAT/ad431b1a-d42b-4898-844c-a02391972c95-AP_Measles_Vaccine.JPG?crop=5211,2931,x1,y440&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T14:09:32Z","content":"Outbreaks across the U.S. have forced officials to declare emergencies. Why are we starting to see the rise of these outbreaks? It dates back to the anti-vax movement.\r\n Just the FAQs, USA TODAY\r\nAn additional 71 measles cases were reported across the United … [+1642 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Elizabeth Weise, USA TODAY","title":"Life after solving climate change: Not mud huts and gruel but clean air and warm homes","description":"What will life be like after we've solved climate change? Better than today or worse? Mud huts and gruel or the flying cars and the Jetsons?","url":"https://www.usatoday.com/story/news/nation/2019/04/22/heres-what-world-look-like-once-we-solve-climate-change/3400271002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/11/USAT/d0b73f0f-40e3-4a85-b26f-17389e36dacc-Weise-2017-07-15-0802.JPG?crop=4031,2267,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T10:01:07Z","content":"The Turning Torso tower in Malmö, Sweden. The nations third largest city, it has a population of 600,000 and is working to be carbon-neutral by 2030. The city is building new eco-neighborhoods that combine urban planning and energy-efficient buildings in area… [+15547 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"A baseball branding bonanza, and 2 guys helping it happen","description":"Branded: Minor league ball teams get help finding identity","url":"https://www.usatoday.com/story/sports/mlb/2019/04/22/a-baseball-branding-bonanza-and-2-guys-helping-it-happen/39377963/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-22T06:05:41Z","content":"ALLENTOWN, Pa. (AP) On a spring evening in eastern Pennsylvania, upon a bluff overlooking the Lehigh Valley, a carnival of baseball and pork products is at hand.\r\nFrom loudspeakers, swine-like sounds reverberate. Vendors roam the stands in clothing festooned … [+10138 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Pitching carrying Vols toward their 1st NCAA bid since 2005","description":"Volunteers are riding their pitching toward first NCAA Tournament bid since 2005","url":"https://www.usatoday.com/story/sports/college/baseball/2019/04/22/pitching-carrying-vols-toward-their-1st-ncaa-bid-since-2005/39380005/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/05faba7a5a809c0f9b67591c50ea35c72b05c009/c=0-0-3508-1973/local/-/media/2019/04/22/USATODAY/usatsports/e293c638abbf454283f751623d855947.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T20:54:47Z","content":"Tennessee's pitching has given the Volunteers an excellent opportunity to end the Southeastern Conference's longest NCAA Tournament drought.\r\nThe Vols (30-11, 9-9 SEC) have allowed two runs or less in seven of their last eight games. Tennessee has gone 7-1 du… [+4456 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Opinion contributors, Russ Feingold and Tommy Thompson, Opinion contributors","title":"On Earth Day, let's restore bipartisanship on the environment: Feingold and Thompson","description":"Our environment, economy and health depend on conserving natural resources. We disagree on a lot, but we both believe Americans must be good stewards.","url":"https://www.usatoday.com/story/opinion/2019/04/22/earth-day-find-bipartisan-common-ground-conserve-environment-column/3508991002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/7ace339f-52f0-4057-9d94-6e1b500b1e79-AP_Earth_Day.JPG?crop=3599,2015,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T10:00:05Z","content":"The environment has become a polarizing issue in recent years, but as honorary co-chairs of the Year of the Environment launching Monday on Earth Day, we are hoping to help make it a bipartisan cause again.\r\nThe initiative, aimed at commemorating a half-centu… [+4875 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Josh Hafner and Kirk A. Bado, USA TODAY","title":"They found 75 bomb detonators in a dump","description":"From the latest with the Sri Lanka bombings to Earth Day, here's Monday's top news.","url":"https://www.usatoday.com/story/news/2019/04/22/earth-day-sri-lanka-and-miguel-cabrera-heres-mondays-top-news/3359376002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/USAT/da405253-9df0-4adf-b33f-6733af4c7002-AFP_AFP_1FU2L2.JPG?crop=4410,2481,x0,y167&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T23:22:15Z","content":"A woman prays at St. Sebastian's Church in Negombo on April 22, 2019, a day after the building was hit as part of a series of bomb blasts targeting churches and luxury hotels in Sri Lanka.\r\n (Photo: JEWEL SAMAD, AFP/Getty Images)\r\nIt's a bleak Monday, friends… [+5042 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Bruins, Leafs go to Game 7 for 3rd straight playoff matchup","description":"The Boston Bruins and Toronto Maple Leafs are headed to Game 7 for the second straight year and the third time in as many playoff matchups","url":"https://www.usatoday.com/story/sports/nhl/2019/04/22/bruins-leafs-go-to-game-7-for-3rd-straight-playoff-matchup/39380757/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/3b6ba1a508b0bc3df7e3f843c3a836fbbfe73736/c=0-644-1977-1756/local/-/media/2019/04/22/USATODAY/usatsports/1ee9bc2932164d27aca81d5adb94ea45.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T22:45:12Z","content":"BOSTON (AP) Bruins coach Bruce Cassidy doesn't want to change too much heading into Game 7 of Boston's first-round series against Toronto, explaining that his players \"are a bit like dogs.\"\r\n\"They love routines, especially on game days,\" he said after the tea… [+4380 chars]"},{"source":{"id":null,"name":"Democratandchronicle.com"},"author":"Albany Bureau, Joseph Spector, Albany Bureau","title":"New York eyes becoming a sanctuary state for undocumented immigrants","description":"A bill would let immigrants in the country illegally avoid prosecution by federal authorities in most cases, making New York a sanctuary state.","url":"https://www.democratandchronicle.com/story/news/politics/albany/2019/04/22/new-york-eyes-becoming-sanctuary-state-undocumented-immigrants/3538252002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/PROC/38e0fe60-a09b-444f-8148-3ff7d41e58e7-Senate_chamber_gallery_2019.jpg?crop=2999,1685,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T18:05:06Z","content":"Bryan MacCormack, executive director of Columbia County Sanctuary Movement, was videotaped by his passenger during an encounter with an ICE agent in Hudson on March 5, 2019.\r\n Joseph Spector, Albany Bureau Chief\r\nALBANY - A bill in the state Legislature would… [+4729 chars]"},{"source":{"id":null,"name":"247wallst.com"},"author":"24/7 Wall Street, Samuel Stebbins, 24/7 Wall Street","title":"Viva Las Vegas, here's the fastest growing cities in each state and Sin City is among them","description":"Nearly every state has at least one city that has reported rapid population growth in recent years. Net migration and natural growth are the factors.","url":"https://247wallst.com/special-report/2019/04/18/the-fastest-growing-city-in-each-state-4?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2019/04/18/USATODAY/usatsports/gettyimages-946583362.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T10:00:07Z","content":"The U.S. population growth rate recently hit a low point not seen since 1937, when the country was in the thick of the Great Depression. The U.S. population grew by just 0.62% between July 2017 and July 2018, according to Census Bureau data. The slowing natio… [+13870 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"James Rogers","title":"Hiker discovers cute 'abandoned puppy,' gets big surprise","description":"A hiker in Southern California thought he had found an abandoned puppy in a canyon recently. The cute animal, however, was not all that it seemed.","url":"https://www.foxnews.com/science/hiker-discovers-cute-abandoned-puppy-gets-big-surprise","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Coyote3.jpg","publishedAt":"2019-04-22T15:54:47Z","content":"A hiker in Southern California thought he had found an abandoned puppy in a canyon recently. The cute animal, however, was not all that it seemed.\r\nThe San Diego Union-Tribune reports that the man was walking his dog when he spotted what he thought was an aba… [+1909 chars]"},{"source":{"id":null,"name":"Newyorker.com"},"author":"Ben Taub","title":"The Mail","description":"Letters respond to Nicola Twilley’s article on the dangers of indoor smog and Paige Williams’s piece on the Stop the Bleed initiative.","url":"https://www.newyorker.com/magazine/2019/04/29/letters-from-the-april-29-2019-issue","urlToImage":"","publishedAt":"2019-04-22T09:00:00Z","content":"Every Breath You Take\r\nNicola Twilley, in her insightful piece about the overlooked dangers of indoor air pollution, writes that a very unhealthy designation for outdoor air is rare in the United States today (Home Smog, April 8th). This is true, but it is im… [+3247 chars]"},{"source":{"id":null,"name":"Newyorker.com"},"author":"Lauren Collins","title":"The Culinary Muse of the Caucasus","description":"As Americans look to Georgia for inspiration, Georgians are looking to Barbare Jorjadze, Lauren Collins writes.","url":"https://www.newyorker.com/magazine/2019/04/29/the-culinary-muse-of-the-caucasus","urlToImage":"https://media.newyorker.com/photos/5cb8afa192dcf02ddc861540/16:9/w_1200,h_630,c_limit/190429_r34184.jpg","publishedAt":"2019-04-22T09:00:00Z","content":"I distinctly remember the first time I had sushi: September 11, 1998. I was a college freshman, newly arrived on campus after a three-night hiking trip that the university had organized as an orientation activity. Since the dining halls werent open yet, the t… [+36746 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"Star Wars Galaxy's Edge Reservations at Disneyland Open May 2","description":"The West Coast opening of Star Wars Galaxy’s Edge is just over a month away, and fans finally know when they can fight over the right to attend. Read more...","url":"https://io9.gizmodo.com/star-wars-galaxys-edge-reservations-at-disneyland-open-1834218714","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--SKkXnXHp--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oj6ysblbpdxmbwo6rglp.jpg","publishedAt":"2019-04-22T18:45:00Z","content":"The West Coast opening of Star Wars Galaxys Edgeis just over a month away, and fans finally know when they can fight over the right to attend.\r\nGalaxys Edge at Disneyland in Anaheim, California opens May 31but if you want to attend any day between May 31 to J… [+1786 chars]"},{"source":{"id":null,"name":"Digitaltrends.com"},"author":"Bruce Brown","title":"Where to go when your EV is low: Rich neighborhoods have most charging stations","description":"If you're running low on juice in your electric vehicle, head for the rich part of town. A survey by Realtor.com found home prices are higher in areas with more electric vehicle charging stations. The median list price for homes in the 20 ZIP codes with the m…","url":"https://www.digitaltrends.com/cars/realtorcom-ev-charging-stations-zip-code-home-prices/","urlToImage":"https://icdn3.digitaltrends.com/image/volta_free_ev_charging_station_with_intercharge_logo-1-1200x630-c-ar1.91.jpg","publishedAt":"2019-04-22T13:15:38Z","content":"If you’re running low on juice in your electric car, truck, or SUV, head for the wealthiest part of town. An April survey by Realtor.com found that home prices in the top 20 areas in the U.S. with the most electric vehicle charging stations were more than two… [+2540 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Ashley Fetters","title":"When Families Feud Over Vaccines","description":"The question of whether vaccinations should be a duty or a choice has caused rifts between relatives.","url":"https://www.theatlantic.com/family/archive/2019/04/when-families-feud-over-vaccines/587629/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_95012012/facebook.jpg?1555946906","publishedAt":"2019-04-22T15:32:51Z","content":"Colleen Brown of Cleveland, Ohio, has been known to post on Facebook now and again about the dangers of not vaccinating kids—local news stories about schools closing because a student has been exposed to the measles, she says, that kind of thing. A few years … [+9012 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Julie Kim","title":"Grieving the Future I Imagined for My Daughter","description":"I now had two children, but was only just beginning to understand what it means to be a parent.","url":"https://www.theatlantic.com/family/archive/2019/04/1p36-genetic-disorder-reshaping-my-family/586717/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/Izzy_Essay_Final_c/facebook.png?1554752767","publishedAt":"2019-04-22T13:50:00Z","content":"Just after midnight, I felt the first unmistakable contraction. I still had two days until my due date, but I knew it was time to get to the hospital. A bulldozer inside my uterus revved its engine, shifted into high gear, and rammed a baby out into the world… [+13635 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Sam Quinones","title":"The Penance of Doc O","description":"Lou Ortenzio was a trusted West Virginia doctor who got his patients—and himself—hooked on opioids. Now he’s trying to rescue his community from an epidemic he helped start.","url":"https://www.theatlantic.com/magazine/archive/2019/05/opioid-epidemic-west-virginia-doctor/586036/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/2019/04/WEL_Ortenzio_Opener/facebook.jpg?1555598527","publishedAt":"2019-04-22T12:00:00Z","content":"Well past seven one evening in 1988, after the nurses and the office manager had gone home, as he prepared to see the last of his patients and return some phone calls, Dr. Lou Ortenzio stopped by the cupboard where the drug samples were kept. Ortenzio, a 35-y… [+31350 chars]"},{"source":{"id":null,"name":"Thesunmagazine.org"},"author":null,"title":"The Great Work: Ralph Nader on Taking Back Power from the Corporate State","description":"Ralph Nader On Taking Back Power From The Corporate State","url":"https://www.thesunmagazine.org/issues/521/the-great-work","urlToImage":"http://www.thesunmagazine.org/files/2019-04/521-04-aguilar-preview.jpg","publishedAt":"2019-04-22T01:59:05Z","content":"Ralph Nader ran for president four times, but most people only remember when he ran against Al Gore and George W. Bush in 2000. As the Green Party nominee Nader got nearly 3 million votes, 97,421 of them in Florida — a pivotal state where, after a contentious… [+48946 chars]"},{"source":{"id":null,"name":"Knpr.org"},"author":null,"title":"Murdering the Mayor of Paradise","description":"Sixty years ago, the grisly killings of the Riviera Hotel’s president and his wife stunned Las Vegas — and would haunt the casino industry for a generation.","url":"https://knpr.org/desert-companion/2018-11/murdering-mayor-paradise","urlToImage":"https://knpr.org/sites/default/files/public/styles/detail/public/images/article/jhp_24265_large.jpg?itok=VFr_jdyh","publishedAt":"2019-04-22T22:53:48Z","content":"Sixty years ago, the grisly killings of the Riviera Hotels president and his wife stunned Las Vegas and would haunt the casino industry for a generation\r\nThe ranch-style home at 1115 Monte Vista in the upscale Encanto neighborhood of Phoenix was quiet when th… [+31789 chars]"},{"source":{"id":null,"name":"Buzzfeednews.com"},"author":"Tanya Chen","title":"A Woman In Coachella Was Caught On Camera Tossing 7 Puppies In A Dumpster","description":"Riverside County Animal Services told BuzzFeed News that had a man not discovered the 3-day-old puppies within a 15-minute window, they would not have survived. View Entire Post ›","url":"https://www.buzzfeednews.com/article/tanyachen/a-woman-in-coachella-was-caught-on-camera-tossing-seven","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2019-04/22/14/enhanced/buzzfeed-prod-web-05/original-27853-1555956820-3.jpg?crop=1024:536;0,132","publishedAt":"2019-04-22T18:36:39Z","content":"Officials at the Riverside County Animal Services in Coachella, California, are working with the local sheriff's department to arrest a woman they've now identified as the suspect in disturbing security footage released on Friday.\r\nIn the footage, the suspect… [+2399 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Danielle Simone Brand, Harry Cheadle","title":"The 'Wild West' of Weed Is Dying Out. Here's What's Replacing It","description":"Working in cannabis used to be a crime, but now it's looking like a real career, complete with benefits.","url":"https://www.vice.com/en_us/article/neav4z/how-legal-cannabis-has-changed-the-weed-industry","urlToImage":"https://video-images.vice.com/articles/5cb8c977c95973000783452a/lede/1555965710305-Weed_Office.png?crop=1xw:1xh;center,center&resize=1200:*","publishedAt":"2019-04-22T21:13:37Z","content":"Alicia Ashley works in what is essentially a weed factory. Her job is to roll joints by hand, run a label printer, and attach those labels to jars of cannabis flower, all while making sure the products look and smell appealing. Ashley works for Flow Kana, a c… [+12846 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Associated Press","title":"Tesla to pitch 'Full Self-Driving' today amid skepticism: 'It's all hype'","description":"Filed under: Green, Tesla, Autonomous, Electric Elon Musk says Tesla has it figured out; everyone else says no, it doesn't. Continue reading Tesla to pitch 'Full Self-Driving' today amid skepticism: 'It's all hype' Tesla to pitch 'Full Self-Driving' today ami…","url":"https://www.autoblog.com/2019/04/22/tesla-full-self-driving-skepticism/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/5790x3258+586+529/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-images/2019-04/6fdbc200-64fc-11e9-b1fc-528f2da756de","publishedAt":"2019-04-22T12:45:00Z","content":"SAN FRANCISCO — Tesla CEO Elon Musk appears poised to transform the company's electric cars into driverless vehicles in a risky bid to realize a bold vision that he has been floating for years.\r\nThe technology required to make that quantum leap is scheduled t… [+6904 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Brett Arends","title":"Gas prices hit $4.70 per gallon in California as Trump says he will enforce Iran sanctions","description":"‘We’re seeing crazy prices for gasoline out here in California,’ said Karl Brauer, economist for Kelley Blue Book.","url":"https://www.marketwatch.com/story/gas-prices-hit-470-per-gallon-in-california-as-trump-says-he-will-enforce-iran-sanctions-2019-04-22","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HE384_traffi_ZG_20190221165250.jpg","publishedAt":"2019-04-22T19:15:15Z","content":"President Trump announced Monday that hes slapping oil sanctions on Iran, the worlds fourth biggest oil producer. \r\nOn Monday, Trump tweeted: Saudi Arabia and others in OPEC will more than make up the Oil Flow difference in our now Full Sanctions on Iranian O… [+5931 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Tesla pushes forward on autonomous driving with new computer chip","description":"Tesla on Monday unveiled computer hardware for \"full self-driving\" capabilities as part of its strategy to bring autonomous cars to the mainstream. At an investor presentation, the electric carmaker revealed technical details of a new chip and computer being …","url":"https://news.yahoo.com/tesla-pushes-forward-autonomous-driving-computer-chip-205919153.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/geZ4TLLp3Ch3hngktocrVw--~B/aD0xMDQ1O3c9NzMyO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_US/News/US-AFPRelax/000_8e3wj.3960f091715.original.jpg","publishedAt":"2019-04-22T20:59:19Z","content":"Tesla on Monday unveiled computer hardware for \"full self-driving\" capabilities as part of its strategy to bring autonomous cars to the mainstream.\r\nAt an investor presentation, the electric carmaker revealed technical details of a new chip and computer being… [+2125 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Johnson & Johnson Heirs List Hudson Valley Estate with Helipad for $13 Million","description":"The property is a subdivision of the family’s 600-acre estate called Lightning Tree Farm","url":"https://news.yahoo.com/johnson-johnson-heirs-list-hudson-211209269.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/u6C9QYc3n68ODv8Xcoa8MA--~B/aD0xMzg1O3c9MjUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/architectural_digest_422/218bc5f658ac90625a1b87dbf99c37de","publishedAt":"2019-04-22T21:12:09Z","content":"Elizabeth Ross \"Libet\" Johnson, great-granddaughter of the cofounder of Johnson &amp; Johnson, had an impressive real-estate portfolio during her lifetime, which included a townhouse and condo in New York City as well as several California homes. But her gran… [+2186 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Robert Schroeder","title":"Capitol Report: Buttigieg compares Sanders supporters to Trump fans | Democrats plot next move in Trump tax-return fight","description":"Pete Buttigieg took a dig at fellow 2020 candidate Sen. Bernie Sanders’ supporters, the Washington Examiner reports, drawing parallels between them and fans of President Trump during a campaign stop in New Hampshire.","url":"https://www.marketwatch.com/story/buttigieg-compares-sanders-supporters-to-trump-fans-democrats-plot-next-move-in-trump-tax-return-fight-2019-04-22","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HH568_buttig_ZG_20190414161342.jpg","publishedAt":"2019-04-22T12:47:27Z","content":"Pete Buttigieg speaks at the 2019 National Action Network National Convention in New York on April 4. \r\nPete Buttigieg took a dig at fellow 2020 candidate Sen. Bernie Sanders supporters, the Washington Examiner reports, drawing parallels between them and fans… [+3102 chars]"},{"source":{"id":null,"name":"Livability.com"},"author":"Kevin Litwin","title":"Livability: Try one of these picturesque destinations this summer— free of tourist traps","description":"Find adventure, beauty and relaxation for a spring or summer vacation at one of these U.S. places.","url":"https://livability.com/topics/experiences-adventures/best-maybe-unexpected-places-to-visit-in-spring-summer","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HH877_Liv_po_ZG_20190418102248.jpg","publishedAt":"2019-04-22T08:58:40Z","content":"With spring in full bloom and summer just around the corner, the itch to get out and explore and find adventure is strong. These splendid seven cities are ideal springtime and summer destinations, with vivid attractions and activities to experience and remini… [+3571 chars]"},{"source":{"id":null,"name":"Kk.org"},"author":"mark","title":"Pin Locks Enamel Pin Keepers","description":"Keeps your favorite enamel pins from falling off your clothes","url":"https://kk.org/cooltools/pin-locks-enamel-pin-keepers/","urlToImage":"https://kk.org/cooltools/files/2019/04/71DiHw4QqXL._SL1500_.jpg","publishedAt":"2019-04-22T12:00:27Z","content":"Keeps your favorite enamel pins from falling off your clothes\r\nIf you wear enamel pins, particularly pins that have any kind of sentimental value to you, I highly recommend a set of pin locks.  ($6 for 12) I picked up a set of ten pin locks similar to these a… [+1435 chars]"},{"source":{"id":null,"name":"Webdesignerdepot.com"},"author":"Paddi MacDonnell","title":"20 Freshest Web Designs, April 2019","description":"Welcome to our roundup of the best new sites to be launched (or relaunched with significant updates) in the last four weeks. After last month's flirtation with monochrome, this month's set of sites return to the overriding trend of 2019: color. Huge images ar…","url":"https://www.webdesignerdepot.com/2019/04/20-freshest-web-designs-april-2019/","urlToImage":"https://www.webdesignerdepot.com/cdn-origin/uploads/2019/04/featured_fresh-1024x563.png","publishedAt":"2019-04-22T10:45:47Z","content":"Welcome to our roundup of the best new sites to be launched (or relaunched with significant updates) in the last four weeks.\r\nAfter last months flirtation with monochrome, this months set of sites return to the overriding trend of 2019: color. Huge images are… [+5342 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Roberta Kwok","title":"Junior AI researchers are in demand by universities and industry","description":"Opportunities for moving between academia and business are expanding for scientists as companies step up recruitment.","url":"https://www.nature.com/articles/d41586-019-01248-w?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01248-w/d41586-019-01248-w_16656350.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"Artificial-intelligence researchers are finding ways to try out and to combine academic and industry work.Credit: Jens Schlueter/EPA-EFE/Shutterstock\r\nArtificial-intelligence (AI) researchers across all academic career stages are feeling the lure of industry,… [+14932 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Flora Graham","title":"Daily briefing: What it will take to maintain a liveable planet","description":"Fully protect 30% of Earth’s surface and sustainably manage another 20%. Plus: an ancient mega-carnivore and networking for introverted scientists.","url":"https://www.nature.com/articles/d41586-019-01326-z?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01326-z/d41586-019-01326-z_16527078.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"Hello Nature readers, would you like to get this Briefing in your inbox free every day? Sign up here.\r\nSimbakubwa kutokaafrika had three rows of meat-shearing teeth and was larger than a polar bear.Credit: Mauricio Anton\r\nA huge jawbone that had been languish… [+3406 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Sara Reardon","title":"Disembodied pig brains revived: Your questions answered","description":"From consciousness to death to cryonics, Nature’s news team answers reader questions about a remarkable piece of research.","url":"https://www.nature.com/articles/d41586-019-01289-1?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01289-1/d41586-019-01289-1_16659580.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"Scientists at Yale University have revived the disembodied brains of pigs four hours after death. Although the team stopped short of restoring consciousness, bioethicists say that its approach has profound ethical implications.\r\nNature's news team answers som… [+4997 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Sara Reardon","title":"CRISPR gene-editing creates wave of exotic model organisms","description":"But the practical challenges of breeding and maintaining unconventional lab animals persist.","url":"https://www.nature.com/articles/d41586-019-01300-9?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01300-9/d41586-019-01300-9_16662448.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"The Hawaiian bobtail squid (Euprymna scolopes) alters the camouflage patterns on its skin based on what it sees.Credit: Eric Roettinger/Kahi Kai Images\r\nJoseph Parker has wanted to know what makes rove beetles tick since he was seven years old. The entomologi… [+6043 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Ehsan Nabavi","title":"Why the huge growth in AI spells a big opportunity for transdisciplinary researchers","description":"My journey from civil engineer to sociologist and sustainability researcher gave me the ideal mix of skills for working in artificial intelligence, says Ehsan Nabavi.","url":"https://www.nature.com/articles/d41586-019-01251-1?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01251-1/d41586-019-01251-1_16664502.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"Credit: Getty\r\nAs a civil engineer with a PhD in sociology who now works in artificial intelligence (AI), my varied skill set and research background are perfect for this burgeoning field. If youve moved across disciplines, you could also be an ideal candidat… [+7109 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Karolina M. Zielinska-Dabkowska, Kyra Xavia","title":"Protect our right to light","description":"Skyscrapers in cities rob people of sunlight and put human health, well-being and sustainability at risk, warn Karolina M. Zielinska-Dabkowska and Kyra Xavia.","url":"https://www.nature.com/articles/d41586-019-01238-y?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+nature%2Frss%2Fcurrent+%28Nature+-+Issue%29","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01238-y/d41586-019-01238-y_16659496.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"High-rise buildings cast shade for much of the day on public spaces in Hong Kong, one of the most densely populated cities on Earth.Credit: Ian Teh/Panos\r\nThe struggle for light is how the Swiss architect Le Corbusier described the history of architecture in … [+12394 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Roberta Kwok","title":"Junior AI researchers are in demand by universities and industry","description":"Opportunities for moving between academia and business are expanding for scientists as companies step up recruitment.","url":"https://www.nature.com/articles/d41586-019-01248-w","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01248-w/d41586-019-01248-w_16656350.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"Artificial-intelligence researchers are finding ways to try out and to combine academic and industry work.Credit: Jens Schlueter/EPA-EFE/Shutterstock\r\nArtificial-intelligence (AI) researchers across all academic career stages are feeling the lure of industry,… [+14932 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Flora Graham","title":"Daily briefing: What it will take to maintain a liveable planet","description":"Fully protect 30% of Earth’s surface and sustainably manage another 20%. Plus: an ancient mega-carnivore and networking for introverted scientists.","url":"https://www.nature.com/articles/d41586-019-01326-z","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01326-z/d41586-019-01326-z_16527078.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"Hello Nature readers, would you like to get this Briefing in your inbox free every day? Sign up here.\r\nSimbakubwa kutokaafrika had three rows of meat-shearing teeth and was larger than a polar bear.Credit: Mauricio Anton\r\nA huge jawbone that had been languish… [+3406 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Sara Reardon","title":"Disembodied pig brains revived: Your questions answered","description":"From consciousness to death to cryonics, Nature’s news team answers reader questions about a remarkable piece of research.","url":"https://www.nature.com/articles/d41586-019-01289-1","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01289-1/d41586-019-01289-1_16659580.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"Scientists at Yale University have revived the disembodied brains of pigs four hours after death. Although the team stopped short of restoring consciousness, bioethicists say that its approach has profound ethical implications.\r\nNature's news team answers som… [+4997 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Sara Reardon","title":"CRISPR gene-editing creates wave of exotic model organisms","description":"But the practical challenges of breeding and maintaining unconventional lab animals persist.","url":"https://www.nature.com/articles/d41586-019-01300-9","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01300-9/d41586-019-01300-9_16662448.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"The Hawaiian bobtail squid (Euprymna scolopes) alters the camouflage patterns on its skin based on what it sees.Credit: Eric Roettinger/Kahi Kai Images\r\nJoseph Parker has wanted to know what makes rove beetles tick since he was seven years old. The entomologi… [+6043 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Ehsan Nabavi","title":"Why the huge growth in AI spells a big opportunity for transdisciplinary researchers","description":"My journey from civil engineer to sociologist and sustainability researcher gave me the ideal mix of skills for working in artificial intelligence, says Ehsan Nabavi.","url":"https://www.nature.com/articles/d41586-019-01251-1","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01251-1/d41586-019-01251-1_16664502.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"Credit: Getty\r\nAs a civil engineer with a PhD in sociology who now works in artificial intelligence (AI), my varied skill set and research background are perfect for this burgeoning field. If youve moved across disciplines, you could also be an ideal candidat… [+7109 chars]"},{"source":{"id":null,"name":"Nature.com"},"author":"Karolina M. Zielinska-Dabkowska, Kyra Xavia","title":"Protect our right to light","description":"Skyscrapers in cities rob people of sunlight and put human health, well-being and sustainability at risk, warn Karolina M. Zielinska-Dabkowska and Kyra Xavia.","url":"https://www.nature.com/articles/d41586-019-01238-y","urlToImage":"https://media.nature.com/lw1024/magazine-assets/d41586-019-01238-y/d41586-019-01238-y_16659496.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"High-rise buildings cast shade for much of the day on public spaces in Hong Kong, one of the most densely populated cities on Earth.Credit: Ian Teh/Panos\r\nThe struggle for light is how the Swiss architect Le Corbusier described the history of architecture in … [+12394 chars]"},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Noah Yoo","title":"Woodsist Festival 2019 Lineup: Whitney, Woods, Real Estate, Waxahatchee, and More","description":"Kevin Morby, Hand Habits, and others set for the one-day fest, which is taking place for the first time since 2016","url":"https://pitchfork.com/news/woodsist-festival-2019-lineup-whitney-woods-real-estate-waxahatchee-and-more/","urlToImage":"https://media.pitchfork.com/photos/5cbccf78c0d4212dc70e29b1/2:1/w_790/Waxahatchee,%20Whitney,%20Woods.png","publishedAt":"2019-04-22T19:10:39Z","content":"Woodsist Festival is returning for its first edition since 2016. The fest, which had been held in California, will take place on Saturday, September 28, at Arrowood Farms, a brewery and farm based in Accord, New York. On the bill this year are Whitney, Real E… [+213 chars]"},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Sam Sodomsky","title":"Animal Collective Announce Fall Tour Dates","description":"A run of U.S. shows in October","url":"https://pitchfork.com/news/animal-collective-announce-fall-tour-dates/","urlToImage":"https://media.pitchfork.com/photos/5cbe06659a38990334200640/2:1/w_790/Animal-Collective.jpg","publishedAt":"2019-04-22T18:33:09Z","content":"Animal Collective have announced a short U.S. tour in October. The six-date trek kicks off in Tulsa, Oklahoma and currently wraps up in Big Sur, California. Check out their itinerary below.\r\nIn 2018, Animal Collective released the audiovisual album Tangerine … [+419 chars]"},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Madison Bloom","title":"Watch Ariana Grande Bring Out Justin Bieber at Coachella 2019","description":"He played “Sorry” and teased a new album as Grande headlined the closing night","url":"https://pitchfork.com/news/watch-ariana-grande-bring-out-justin-bieber-at-coachella-2019/","urlToImage":"https://media.pitchfork.com/photos/5cbdc258c7c0dc2dd52f5692/2:1/w_790/justin%20bieber%20ariana%20grande%20coachella.jpg","publishedAt":"2019-04-22T13:36:20Z","content":"Ariana Grande headlined night three of Coachellas second and final weekend in Indio, California last night. She brought out Justin Bieber for Sorry, after which he teased an incoming new album. Watch it all go down below.\r\nhttps://twitter.com/JBinAV/status/11… [+640 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Kyle Mizokami on Foxtrot Alpha, shared by Kyle Mizokami to Jalopnik","title":"Could This Oddball Stealth Jet (Partly) Replace the A-10 Warthog?","description":"The Scaled Composites Model 401 is a small, single engine jet that looks just like what the military wants: new a light attack aircraft capable of supporting troops on the ground. It’s also a total weirdo. Read more...","url":"https://foxtrotalpha.jalopnik.com/could-this-oddball-stealth-jet-partly-replace-the-a-1-1833954225","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--i-8jMuoi--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/u1m3gxtq3esyqkq7ocnp.png","publishedAt":"2019-04-22T20:20:00Z","content":"The Scaled Composites Model 401 is a small, single engine jet that looks just like what the military wants: new a light attack aircraft capable of supporting troops on the ground. Its also a total weirdo.\r\nBuilt by Scaled Composites, a general purveyor of str… [+4483 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Erik Shilling","title":"Detroit May Have Screwed Itself Out of Generation Z Sales","description":"The kids aren’t into the cars, Tesla’s making big claims about self-driving, Carlos Ghosn is in more trouble and so much more for The Morning Shift of Monday, April 22, 2019. Read more...","url":"https://jalopnik.com/detroit-may-have-screwed-itself-out-of-generation-z-sal-1834211828","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--y-ole2nB--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xqubs5lpq5hpiydhwwsr.png","publishedAt":"2019-04-22T14:15:00Z","content":"The kids arent into the cars, Teslas making big claims about self-driving, Carlos Ghosn is in more trouble and so much more for The Morning Shift of Monday, April 22, 2019.\r\n1st Gear: Generation Z Is Too Busy and Poor to Be Bothered With Cars\r\nToday if youre … [+10561 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Michele Debczak","title":"Washington Is Set to Become the First State to Allow Human Composting","description":"Composting human remains is cheaper and more eco-friendly than traditional burial options, and Washington state may soon make it legal.","url":"http://mentalfloss.com/article/581044/washington-first-state-allow-human-composting","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_3006,w_5348,x_0,y_279/v1555944169/shape/mentalfloss/istock-489871228.jpg?itok=GehyHoov","publishedAt":"2019-04-22T16:30:00Z","content":"Fashion is one of Earths most resource-intensive, environment-polluting industries. Manufacturing clothing requires vast quantities of water, international transport, and laborand after all that, clothes regularly get thrown away after just a few months or ye… [+5697 chars]"},{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"Here's What to Do This Earth Day Instead of Shopping","description":"Earth Day is the time to celebrate our planet -- which, as we march towards a shaky future, is more important than ever. Today is the perfect day take a moment to smell the roses and enjoy the natural benefits of this humble orb as it flies us all through spa…","url":"https://hypebeast.com/2019/4/earth-day-activities-fashion-shopping-alternatives","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F04%2Fearth-day-fashion-industry-tips-tw.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2019-04-22T15:31:25Z","content":"Earth Day is the time to celebrate our planet — which, as we march towards a shaky future, is more important than ever. Today is the perfect day take a moment to smell the roses and enjoy the natural benefits of this humble orb as it flies us all through spac… [+14608 chars]"},{"source":{"id":null,"name":"Cracked.com"},"author":null,"title":"6 Throwaway Lines That Secretly Change The Entire Movie","description":"By Spencer Thew,Mike Bedard,Ed Stevens,Dan Hopper,Michael Battaglino Published: April 22nd, 2019","url":"https://www.cracked.com/article_26323_6-throwaway-lines-that-secretly-change-entire-movie.html","urlToImage":"https://s3.crackedcdn.com/phpimages/article/1/6/0/695160_v2.jpg","publishedAt":"2019-04-22T07:00:00Z","content":"Good zing on lawyers, movie. Also, the concept of justice is dead now. They didn't merely abolish private lawyers, but also public defenders, meaning that people have absolutely no defense against state prosecutors. And there's nothing to suggest that the cou… [+1498 chars]"},{"source":{"id":null,"name":"Futurity.org"},"author":"Trina Wood-UC Davis","title":"Good news about mercury in dog food","description":"\"These results should be reassuring to dog owners.\"","url":"https://www.futurity.org/mercury-in-dog-food-2042452-2/","urlToImage":"https://www.futurity.org/wp/wp-content/uploads/2019/04/goofy_dog_1600.jpg","publishedAt":"2019-04-22T17:39:41Z","content":"An investigation into levels of methylmercury in a small sampling of commercial dog food offers good news for dog owners.\r\nOf the 24 diets tested, only three were positive for low concentrations of total mercury, and only one of those contained detectable met… [+2287 chars]"},{"source":{"id":null,"name":"Futurity.org"},"author":"Sonia Fernandez-UCSB","title":"Oceans have a bunch of ways to lock away carbon","description":"As a runaway climate scenario looms, scientists are hurrying to fully understand Earth's largest carbon sink: its oceans.","url":"https://www.futurity.org/ocean-pumps-carbon-sink-particle-pumps-2041452-2/","urlToImage":"https://www.futurity.org/wp/wp-content/uploads/2019/04/wave_1600.jpg","publishedAt":"2019-04-22T12:51:16Z","content":"Oceans are the Earth’s largest carbon sink. Now, a new study aims to explain how ocean pumps capture and store it.\r\nKnowing the mechanics of how things work will become increasingly important as the planet warms and as we try to get ahead of a runaway climate… [+3693 chars]"},{"source":{"id":null,"name":"Petapixel.com"},"author":"Rogelio Bernal Andreo","title":"How I Helped Put McWay Falls on the Map for Nightscape Photos","description":"McWay Falls has been a tourist destination for longer than many of us even heard of the place, but it wasn’t until 2012 that photographer Steven Christenson really “discovered” the potential of the site at night. Nestled in the rugged and gorgeous part of the…","url":"https://petapixel.com/2019/04/22/how-i-helped-put-mcway-falls-on-the-map-for-nightscape-photos/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+PetaPixel+%28PetaPixel%29","urlToImage":"https://petapixel.com/assets/uploads/2019/04/mcwayfallsfeat.jpg","publishedAt":"2019-04-22T17:53:10Z","content":"McWay Falls has been a tourist destination for longer than many of us even heard of the place, but it wasn’t until 2012 that photographer Steven Christenson really “discovered” the potential of the site at night. Nestled in the rugged and gorgeous part of the… [+6637 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Ben Pearson","title":"Contest: Win Free Tickets to an Early ‘Tolkien’ Screening, Featuring a Q&A With Cast and Filmmakers","description":"Fox Searchlight has been developing a movie based on the life of The Hobbit and The Lord of the Rings author J.R.R. Tolkien for six years, and Tolkien is finally coming to theaters this May. And if you’re a fan of the author and you live in the Los Angeles ar…","url":"https://www.slashfilm.com/tolkien-contest/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Tolkien-contest.jpg","publishedAt":"2019-04-22T15:30:27Z","content":"Fox Searchlight has been developing a movie based on the life of The Hobbit and The Lord of the Rings author J.R.R. Tolkien for six years, and Tolkien is finally coming to theaters this May. And if you’re a fan of the author and you live in the Los Angeles ar… [+2036 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Peter Sciretta","title":"Water Cooler: Game of Thrones, Bosch, Homecoming, Police Story, Tolkien, Formula 1, Vlogging Disneyland, B.P.R.D., Cuphead","description":"On the April 22 2019 episode of /Film Daily, /Film editor in chief Peter Sciretta is joined by /Film managing editor Jacob Hall, senior writer Ben Pearson, and writers Hoai-Tran Bui and Chris Evangelista to talk about what they’ve been up to at The Water Cool…","url":"https://www.slashfilm.com/water-cooler-game-of-thrones-bosch-homecoming-police-story-tolkien-formula-1-vlogging-disneyland-b-p-r-d-cuphead/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/homecoming-a-film-by-beyonce.jpg","publishedAt":"2019-04-22T21:06:55Z","content":"On the April 22 2019 episode of /Film Daily, /Film editor in chief Peter Sciretta is joined by /Film managing editor Jacob Hall, senior writer Ben Pearson, and writers Hoai-Tran Bui and Chris Evangelista to talk about what theyve been up to at The Water Coole… [+2645 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Josh Spiegel","title":"The Modern Theme Park Was Born at the 1964 World’s Fair – Here’s How it Happened","description":"(Welcome to The Disney Discourse, a recurring feature where Josh Spiegel discusses the latest in Disney news. He goes deep on everything from the animated classics to the theme parks to live-action franchises.) The concept of what a theme park is, or can be, …","url":"https://www.slashfilm.com/1964-worlds-fair/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/1964-Worlds-Fair.jpg","publishedAt":"2019-04-22T20:00:44Z","content":"(Welcome to The Disney Discourse, a recurring feature where Josh Spiegel discusses the latest in Disney news. He goes deep on everything from the animated classics to the theme parks to live-action franchises.)\r\nThe concept of what a theme park is, or can be,… [+6987 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Hoai-Tran Bui","title":"The WGA vs. ATA Standoff Explained: What is Happening in Hollywood Between Writers and Their Agents?","description":"A battleground has formed in Hollywood, but it’s not the stuff of movies. The fights are taking place in boardrooms, and soon courtrooms, as writers and their agents wage a war that is as tricky as it is potentially transformative of the entire movie and TV l…","url":"https://www.slashfilm.com/wga-ata-explainer/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/wga-e1555948205964.jpg","publishedAt":"2019-04-22T17:00:59Z","content":"A battleground has formed in Hollywood, but it’s not the stuff of movies. The fights are taking place in boardrooms, and soon courtrooms, as writers and their agents wage a war that is as tricky as it is potentially transformative of the entire movie and TV l… [+13047 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"eschneider@politico.com (Elena Schneider)","title":"Klobuchar makes more top hires as she ramps up her presidential bid","description":"The Minnesota Democrat named five new staffers on Monday.","url":"https://www.politico.com/story/2019/04/22/klobuchar-presidential-campaign-hires-1284599","urlToImage":"https://static.politico.com/ef/a7/593309f54c088150419bf9c3dfc8/190422-klobuchar-gty-773.jpg","publishedAt":"2019-04-22T13:12:46Z","content":"Democratic presidential candidate Sen. Amy Klobuchar speaks to the media after holding a Health Care roundtable on April 16 in Miami, Florida. | Joe Raedle/Getty Images\r\nAmy Klobuchar rolled out additional top hires for her presidential bid, a sign of her int… [+2577 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"coprysko@politico.com (Caitlin Oprysko)","title":"Trump says kid at Easter egg roll told him to 'keep building that wall'","description":"“I will. Oh, It’s happening. It’s being built now,&quot; Trump told the child.","url":"https://www.politico.com/story/2019/04/22/easter-egg-roll-trump-border-wall-1286361","urlToImage":"https://static.politico.com/09/1f/a75825104bf39ff2ea9f1359d8e9/190422-trump-melania-gty-773.jpg","publishedAt":"2019-04-22T17:09:31Z","content":"President Donald Trump and First Lady Melania Trump take part in the annual White House Easter Egg Roll on the South Lawn of the White House Monday. | Mandel Ngan/Getty Images\r\nIn between games of \"Be Best\" hopscotch and the namesake event at the White House'… [+3009 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"smurray@politico.com (Stephanie Murray)","title":"Seth Moulton announces 2020 bid","description":"He is the third Massachusetts politician to throw a hat into the 2020 ring.","url":"https://www.politico.com/story/2019/04/22/moulton-announces-2020-bid-1284347","urlToImage":"https://static.politico.com/53/b1/e2ef5a984fbd91e35d11787bd18c/190422-seth-moulton-3-ap-773.jpg","publishedAt":"2019-04-22T10:33:30Z","content":"Despite being the 19th Democrat to announce a presidential run, Rep. Seth Moulton's campaign sees the field as \"wide open\" at this point in the 2020 contest. | J. Scott Applewhite/AP Photo\r\nBOSTON Rep. Seth Moulton announced he's running for president on Mond… [+3239 chars]"},{"source":{"id":"recode","name":"Recode"},"author":"Eric Johnson","title":"Tech is “flunking” the diversity test, says activist and venture capitalist Freada Kapor Klein","description":"On the latest Recode Decode, Kapor Klein says we need to “take a deep hard look at the BS notion of meritocracy.”","url":"https://www.recode.net/podcasts/2019/4/22/18485702/freada-kapor-klein-venture-capital-diversity-flunking-teddy-schleifer-decode-podcast-interview","urlToImage":"https://cdn.vox-cdn.com/thumbor/ltPr94i90YzeOaMoIhSa1cNSbYI=/0x765:2627x2140/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16162349/Freada_Kapor_Klein.jpg","publishedAt":"2019-04-22T10:20:00Z","content":"On the latest Recode Decode, Kapor Klein says we need to “take a deep hard look at the BS notion of meritocracy.” In recent years, several venture capital firms in Silicon Valley have made public strides to become more diverse after decades of being predomina… [+50557 chars]"},{"source":{"id":null,"name":"Digg.com"},"author":null,"title":"Maniacal Pinball Collector Shows Off His Haul Of 1,700 Machines","description":"Michael Schiess started slow with just a handful of games in his living room. Soon, however, things really started getting rolling down the playfield and now he is the purveyor of the Pacific Pinball Museum Annex in Alameda, California.","url":"http://digg.com/video/pinball-collection-michael-schiess","urlToImage":"http://static.digg.com/images/1f7a2926a1d449d18be361104e4239fc_1412280bff0c8274c6d359e81055ec50_1_social_large.jpeg","publishedAt":"2019-04-22T00:42:34Z","content":null},{"source":{"id":null,"name":"Apple.com"},"author":null,"title":"Echo In The Canyon - Trailer","description":"Echo In The Canyon celebrates the explosion of popular music that came out of LAâs Laurel Canyon in the mid-60s as folk went electric and The Byrds, The Beach Boys, Buffalo Springfield and The Mamas and the Papas gave birth to the California Sound. Â It was…","url":"https://trailers.apple.com/trailers/independent/echo-in-the-canyon/","urlToImage":"https://trailers.apple.com/trailers/independent/echo-in-the-canyon/images/poster-large.jpg?lastmod=1","publishedAt":"2019-04-22T08:00:00Z","content":null},{"source":{"id":null,"name":"Tmz.com"},"author":"TMZ Staff","title":"Kid Cudi Drops $10k on Postmates, Feeds Homeless Popeyes Chicken","description":"Kid Cudi just wrapped up a very busy weekend at Coachella, but he still found time to feed the needy... with a huge assist from Postmates. The rapper got things started off on the right foot in the California desert Friday night by ordering…","url":"https://www.tmz.com/2019/04/22/kid-cudi-10k-postmates-feed-homeless-popeyes-chicken-coachella/","urlToImage":"https://images.tmz.com/2019/04/22/0422-kid-cudi-postmates-tmz-3-1200x630.jpg","publishedAt":"2019-04-22T21:47:00Z","content":null},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"Flowspace, which offers cloud-based inventory, order, and warehouse management software, raises $12M Series A led by Canvas Ventures (Vishnu Rajamanickam/FreightWaves)","description":"Vishnu Rajamanickam / FreightWaves : Flowspace, which offers cloud-based inventory, order, and warehouse management software, raises $12M Series A led by Canvas Ventures — Flowspace, a California-based on-demand warehousing and fulfillment startup, announced …","url":"https://www.techmeme.com/190422/p5","urlToImage":"http://static1.squarespace.com/static/5899e78b1b10e35238fba886/5899fd066b8f5bbffd76925f/5cb5cd047817f7d132aca36b/1555421409661/shutterstock_1038530764.jpg?format=1500w","publishedAt":"2019-04-22T12:55:03Z","content":null},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Al Jazeera","title":"US House Democrats' views vary after Mueller report: Pelosi","description":"Pelosi says while Democrats' views range from investigations to impeachment, 'we all agree we should find truth'.","url":"https://www.aljazeera.com/news/2019/04/house-democrats-views-vary-mueller-report-pelosi-190422201006507.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/3/29/6bc9ace34dd748b5a6665c488ba9baea_18.jpg","publishedAt":"2019-04-22T21:20:47Z","content":"United States House Democrats' views vary on how to proceed after last week's release of a redacted version of Special Counsel Robert Mueller's Russia probe, House Speaker Nancy Pelosi said on Monday.\r\nIn a letter to fellow Democratic politicians, Pelosi said… [+3843 chars]"},{"source":{"id":"al-jazeera-english","name":"Al Jazeera English"},"author":"Steven Borowiec","title":"The existential crisis facing North Korean schools in Japan","description":"Around 70 Joseon schools in Japan have funding slashed by the government and are targeted by nationalist organisations.","url":"https://www.aljazeera.com/indepth/features/existential-crisis-facing-north-korean-schools-japan-190422013659917.html","urlToImage":"https://www.aljazeera.com/mritems/Images/2019/4/22/f1e35a7b36cb40029d2a0da3a3b53b49_18.jpg","publishedAt":"2019-04-22T23:25:33Z","content":"At a ceremony to mark the start of a new school year, the principal of the largest Korean school in Japan stood in front of a massive North Korean flag and pledged to continue the school's mission to toil for the advancement of the Korean people.\r\nAt the cere… [+7474 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Ryan Reed","title":"Michael Avenatti Indictment Includes Embezzling Nearly $2 Million of NBA Star’s Payment to Ex","description":"Celebrity attorney allegedly used money paid by Miami Heat's Hassan Whiteside in settlement to buy share of private jet","url":"https://www.rollingstone.com/culture/culture-news/michael-avenatti-embezzlement-hassan-whiteside-825630/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/michael-avenatti-accused-of-embezzling.jpg","publishedAt":"2019-04-22T21:09:03Z","content":"Michael Avenatti has been accused of embezzling nearly $2 million of a payment made in January 2017 to his client, Alexis Gardner, from her then-boyfriend, Miami Heat star Hassan Whiteside, The Los Angeles Times reports. \r\nGardner, an actress and barista, hir… [+2761 chars]"}]}