{"status":"ok","totalResults":1633,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Connie Loizos","title":"Caterina Fake is known for her trend-spotting; here’s some of what she’s chasing now","description":"Roughly a year ago, entrepreneurs Caterina Fake and Jyri Engeström decided to form a traditional venture outfit called Yes VC. Fast forward, and the duo has nearly closed on $50 million for their debut fund, including backing from Supercell founder Ilkka Paan…","url":"http://techcrunch.com/2019/04/19/caterina-fake-is-known-for-her-trend-spotting-heres-some-of-what-shes-chasing-now/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/04/Screen-Shot-2019-04-19-at-4.03.13-PM.png?w=681","publishedAt":"2019-04-19T23:04:08Z","content":"Roughly a year ago, entrepreneurs Caterina Fake and Jyri Engeström decided to form a traditional venture outfit called Yes VC. Fast forward, and the duo has nearly closed on $50 million for their debut fund, including backing from Supercell founder Ilkka Paan… [+7004 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Dell Cameron","title":"Medical Files of 145,000 Vulnerable Rehab Patients Carelessly Leaked Online","description":"The leaks are never-ending; but naturally, some are more sensitive than others. Read more...","url":"https://gizmodo.com/medical-files-of-145-000-vulnerable-rehab-patients-care-1834177125","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--N-k_6hHt--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/in7hkyxgonwst60ee1tb.jpg","publishedAt":"2019-04-19T22:00:00Z","content":"The leaks are never-ending; but naturally, some are more sensitive than others.\r\nSome 145,000 patients have had their protected health information exposed in what is only the latest of many major leaks of sensitive medical records in recent years, according t… [+3375 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"TIM ARANGO","title":"Nipsey Hussle Was Hailed as a Hero. But to California Officials, He Was Still a Gangster.","description":"Gang databases can be used to revoke parole and enhance punishments. But, one expert says, “No one ever makes it off that list. No one.”","url":"https://www.nytimes.com/2019/04/19/us/nipsey-hussle-death-california-gangs.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/us/00nipseygang-02/00nipseygang-02-facebookJumbo.jpg","publishedAt":"2019-04-19T17:07:42Z","content":"At the time of his death he was an icon of the community, Ms. McKnight said of Hussle. The whole city shut down to mourn this man. Even Congress recognized him. So how is it that Mr. Lathan was going to have a meeting with a person affiliated with a gang?\r\nMr… [+1512 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"DAVID WALDSTEIN and KELLY WHITESIDE","title":"Knicks Fans Dream of Durant and Irving. Will Dolan Be the Nightmare?","description":"The Knicks could be a superteam next season. Or their owner, James L. Dolan, could mess it all up. What’s a fan to believe?","url":"https://www.nytimes.com/2019/04/19/sports/knicks-durant-kyrie-dolan.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/sports/19dolan/19dolan-facebookJumbo.jpg","publishedAt":"2019-04-19T09:00:14Z","content":"Prudent decisions have not always been the norm with the Knicks. This is the organization that Stern once said was not a model of intelligent management. That comment came a dozen years ago, toward the end of an ugly time in the history of the organization, w… [+1972 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"NICHOLAS FANDOS","title":"Democrats Draw Closer to a Dicey Question: Whether to Impeach Trump","description":"“We will have to go follow the evidence where it leads,” said Representative Jerrold Nadler, Democrat of New York and the chairman of the House Judiciary Committee. “And I don’t know exactly where it will lead.”","url":"https://www.nytimes.com/2019/04/18/us/politics/impeaching-trump.html","urlToImage":"https://static01.nyt.com/images/2019/04/18/us/politics/18dc-cong-01/18dc-cong-01-facebookJumbo.jpg","publishedAt":"2019-04-19T01:28:34Z","content":"In that case, Democrats would be able to draw questions about the presidents behavior out for months, if not longer, keeping a cloud over Mr. Trump as he runs for re-election. Several House committees have already opened broad investigations into Russian elec… [+1893 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"JILL COWAN","title":"California Today: A Desert Festival Not Named Coachella","description":"Decidedly not Coachella: Ariana Vafadari, an opera singer, performed on the beach at sunrise.","url":"https://www.nytimes.com/2019/04/19/us/bombay-beach-biennale-salton-sea.html","urlToImage":"https://static01.nyt.com/images/2019/04/14/fashion/19bombaybeachcatoday/12bombaybeach4-facebookJumbo-v2.jpg","publishedAt":"2019-04-19T13:23:40Z","content":"This week, Tejal Rao, The Timess California restaurant critic, takes us to yet another desert destination this one culinary: \r\nBeyoncés two-hour-long documentary about her show Homecoming at last years Coachella dropped this week on Netflix, but that beautifu… [+1191 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"ALEXANDER BURNS and SHANE GOLDMACHER","title":"Joe Biden Begins Taking Money for a 2020 Presidential Campaign","description":"Major Democratic donors in Pennsylvania and California are soliciting big checks for Joe Biden, who is expected to launch his 2020 campaign next week.","url":"https://www.nytimes.com/2019/04/19/us/politics/joe-biden-2020-fundraising.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/us/politics/19biden/19biden-facebookJumbo.jpg","publishedAt":"2019-04-19T19:28:32Z","content":"The pursuit of big donors could be politically risky for Mr. Biden in a Democratic primary already infused with outrage about the influence of the wealthy in politics. Some of Mr. Bidens rivals, including Senators Bernie Sanders of Vermont and Elizabeth Warre… [+1820 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"ANEMONA HARTOCOLLIS","title":"Couple Who Tortured 12 Children in Their California Home Are Sentenced to Life","description":"Louise Turpin, left, and her husband, David Turpin, right, during a court hearing in Riverside, Calif., in February. The couple pleaded guilty to torturing and abusing 12 of their 13 children.","url":"https://www.nytimes.com/2019/04/19/us/turpin-family.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/us/19turpins/19turpins-facebookJumbo.jpg","publishedAt":"2019-04-19T17:27:01Z","content":"[Read more about how the teenager alerted the authorities to her familys dark secret.]\r\nNow the parents, David and Louise Turpin, are likely to spend the rest of their lives locked up. The Turpins were sentenced after pleading guilty in February in Riverside … [+1478 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Killed reporter's commitment to truth 'absolute'","description":"Lyra McKee was \"a rising star\" in journalism, whose killing has left friends \"numb with grief\".","url":"https://www.bbc.co.uk/news/uk-northern-ireland-47987807","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/0FA2/production/_106520040_01aaa1.jpg","publishedAt":"2019-04-19T10:07:10Z","content":"Image caption\r\n Lyra McKee gave a TED talk in 2017 about the Orlando gay nightclub shootings the previous year\r\n\"Kid, it's gonna be okay... it's going to get better.\r\n\"You're going to join a scheme that trains people your age to be journalists... for the firs… [+4991 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Hear Turpin children recount their childhood","description":"David and Louise Turpin hear impact statements from two of their children during their sentencing. The Turpins pleaded guilty to holding captive and torturing their children for years in their California home.","url":"https://www.cnn.com/videos/justice/2019/04/19/turpin-children-impact-statements-parents-sentencing-bts-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/180115211915-02-turpin-file-super-tease.jpg","publishedAt":"2019-04-19T17:58:09Z","content":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Eric Berger","title":"Rocket Report: A new Delta 2, Blue Origin inks with NASA, a fiery Falcon Heavy","description":"\"Do everything in your power to keep the acquisition on schedule.”","url":"https://arstechnica.com/science/2019/04/rocket-report-a-new-delta-2-blue-origin-inks-with-nasa-a-fiery-falcon-heavy/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2018/07/Rocket-Report-Intro-3-760x380.jpg","publishedAt":"2019-04-19T11:00:28Z","content":"Enlarge/ The Rocket Report is published weekly.\r\n0 with 0 posters participating\r\nWelcome to Edition 1.45 of the Rocket Report! This week, half of our stories concern the biggest rockets on the planet, from Blue Origin engine tests at Marshall Space Flight Cen… [+11910 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Nicole Einbinder","title":"A California couple was sentenced to life in prison after years of torturing their children","description":"David and Louise Turpin were sentenced on Friday to 25 years to life in prison for torturing and abusing their 13 children. The Southern California couple pleaded guilty in February to 14 felony charges related to torture and other instances of abuse against …","url":"https://www.thisisinsider.com/david-and-louis-turpin-sentenced-to-life-in-prison-after-torturing-their-children-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba25a32730ca0b7b0bc708-2732-1366.jpg","publishedAt":"2019-04-19T19:44:55Z","content":"The Southern California couple at the center of a shocking case of child abuse were sentenced on Friday to 25 years to life in prison, with no possibility of parole — wrapping up a disturbing saga that first gripped the country last year when their 17- and 13… [+2584 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Callie Ahlgrim","title":"Inside Kim Kardashian and Kanye West's palatial $60 million mansion — where the sinks are magic, TVs come out of the floor, and everything is beige","description":"Kim Kardashian West was recently photographed and filmed at her home for a Vogue cover story. She and her husband, Kanye West, previously had a family rule not to show their home on social media. The interior space is minimalist, monochromatic, and features a…","url":"https://www.thisisinsider.com/kim-kardashian-kanye-wests-mansion-photos-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba049b2730ca08b1651a83-2732-1366.jpg","publishedAt":"2019-04-19T17:25:10Z","content":"As the cover star of Vogue's May issue, Kim Kardashian West was recently photographed and filmed at her secluded home in Hidden Hills, California. \r\n In particular, a video for the magazine's \"73 Questions\" series gave fans an intimate look inside the West fa… [+306 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Kelly McLaughlin","title":"Lori Loughlin's husband lied about going to USC, but here's where the other parents involved in the college admissions scandal went to school","description":"Many of the parents charged in the college admissions scandal went to elite universities like Harvard, Yale and Cornell. Some of the parents continued their education, going to law school or business school after completing undergraduate studies. An interview…","url":"https://www.thisisinsider.com/heres-where-parents-went-to-school-college-admissions-scandal-2019-4","urlToImage":"https://static.businessinsider.com/image/5cb9ecf0d2ce7809ed6b3cfd-750.jpg","publishedAt":"2019-04-19T15:44:42Z","content":"An interview resurfaced this week revealing that long before Lori Loughlin's husband, Mossimo Giannulli, was indicted as part of the college admissions scandal, he lied to his father about attending the University of Southern California. \r\n He told the fashio… [+3523 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Hillary Hoffower","title":"Inside the Neon Carnival, Coachella's exclusive, star-studded after-party where money doesn't score an invite","description":"The Neon Carnival is Coachella 's notorious, unofficial after-party. Exclusive and star-studded, the invite-only Neon Carnival attracts A-list guests, from Drake to Leonardo DiCaprio. Take a look inside the party and what it takes to bring it all together. Vi…","url":"https://www.businessinsider.com/coachella-neon-carnival-exclusive-after-party-leonardo-dicaprio-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb8d6f2ac92a1224e7a45b9-1920-960.jpg","publishedAt":"2019-04-19T15:10:00Z","content":"The Coachella Valley Music and Arts Festival may have been dubbed the \"the influencer Olympics\" this year, but not everyone gets the invite to its notorious after-party — the Neon Carnival. \r\n Every year, the Neon Carnival takes place in Thermal, California, … [+716 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Paige Leskin","title":"Zoom's stock soared in the video-conferencing company's public trading debut, making CEO Eric Yuan a billionaire (ZOOM)","description":"Zoom, a video-conferencing company, went public Thursday and began trading on the Nasdaq. Shares jumped 72% on its opening day, putting the company's valuation at nearly $16 billion. Zoom CEO Eric Yuan owns 20.5% of the company's stock, which makes Yuan one o…","url":"https://www.businessinsider.com/zoom-ceo-eric-yuan-now-billionaire-ipo-trading-debut-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9ce8fc3b089366a050c2d-2732-1366.jpg","publishedAt":"2019-04-19T14:39:30Z","content":"The CEO of video-conferencing company Zoom is the newest member of an elite class of tech billionaires that include names like Bill Gates, Mark Zuckerberg, and Jeff Bezos. \r\n CEO Eric Yuan was made a billionaire Thursday on Zoom's first day of trading on the … [+1400 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Kelly McLaughlin","title":"The college admissions scandal highlights just how much even successful people believe elite educations matter","description":"Among the 33 parents indicted as part of the college admissions scandal, the majority of them received their bachelor degrees, and many went to law or business school for higher degrees. Jonathan Ginsberg, the COO of Beyond Education Consulting, told INSIDER …","url":"https://www.thisisinsider.com/college-admissions-scandal-successful-people-elite-education-2019-4","urlToImage":"https://static.businessinsider.com/image/5cb9cdc42730ca02ec611f20-750.jpg","publishedAt":"2019-04-19T13:31:42Z","content":"The college admissions scandal has not only highlighted the extreme lengths parents will go to get their children into top universities, but also how much successful people value elite and status-based educations. \r\n Among the 33 parents indicted as part of t… [+7889 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joe Perticone","title":"The Mueller report changes nothing for Congress, which remains as fiercely divided as ever","description":"The release of the Mueller report has only hardened the previously-held stances Democrats and Republicans have on President Donald Trump. Democrats took issue with Attorney General William Barr's handling of the report's release. Republicans focused on part o…","url":"https://www.businessinsider.com/mueller-report-changes-nothing-fiercely-divided-congress-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb8a041d1a2f817dc5aa468-2732-1366.jpg","publishedAt":"2019-04-19T14:12:38Z","content":"WASHINGTON — The special counsel's final report released Thursday, revealing that no one in President Donald Trump's 2016 campaign colluded with the Russians to fix the election but left the question of obstruction of justice somewhat open-ended. \r\n For every… [+5295 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Lucia Moses","title":"'We're an anomaly': Complex Networks ignored the digital media playbook and now it's on track to make at least $200 million this year, profitably","description":"Sneaker culture-focused media company Complex Networks is an exception to the gloom and doom surrounding digital media. CEO Rich Antoniello has avoided a lot of the playbook that's driven digital media in the past several years. Complex has diversified its bu…","url":"https://www.businessinsider.com/complex-networks-is-on-track-to-exceed-200-million-this-year-profitably-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb8cf5112ece221874398f6-2732-1366.jpg","publishedAt":"2019-04-19T11:00:00Z","content":"It's a gloomy time for digital media, but not for Rich Antoniello. \r\n While headlines scream about other digital media companies trying to cut their way to profitability, hanging for-sale signs, and selling at fire-sale prices, Complex Networks, a 17-year-old… [+13481 chars]"},{"source":{"id":null,"name":"Greenentrepreneur.com"},"author":"Scott McGovern","title":"Pay Attention to These 6 Cannabis Industry Trends","description":"The weed businesses that thrived four years ago don't necessarily yield big profits today as new cannabis industry trends dictate the market.","url":"https://www.greenentrepreneur.com/article/332348","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190418180609-GettyImages-899527610-crop.jpeg","publishedAt":"2019-04-19T12:00:00Z","content":"April\r\n19, 2019\r\n7 min read\r\nOpinions expressed by Green Entrepreneur contributors are their own.\r\nCannabis industry trends evolve faster than most markets. Not only haven’t regulations been finalized, but methods of consumption, investment and the geography … [+7350 chars]"},{"source":{"id":null,"name":"Iflscience.com"},"author":"Madison Dapcevich","title":"No, You Don't Need To Worry About The 1.8 Million \"Hidden\" Earthquakes Detected In Southern California - IFLScience","description":"No, You Don't Need To Worry About The 1.8 Million \"Hidden\" Earthquakes Detected In Southern California IFLScience Southern California Gets Ten Times As Many Earthquakes As We Thought Motherboard California earthquake: TWO MILLION quakes rock South California …","url":"https://www.iflscience.com/environment/no-you-dont-need-to-worry-about-the-18-million-hidden-earthquakes-detected-in-southern-california/","urlToImage":"https://cdn.iflscience.com/images/e8317a34-4c3c-505f-8802-024875209bc2/default-1555647530-cover-image.jpg","publishedAt":"2019-04-19T10:45:00Z","content":"An analysis of 10 years of seismic data from Southern California has revealed almost 2 million previously hidden earthquakes 10 times the number of seismic activities previously recorded. This equates to about 495 earthquakes every day across the southern par… [+2692 chars]"},{"source":{"id":null,"name":"Wcvb.com"},"author":"CNN","title":"California couple sentenced to 25 years to life in prison after children testify about years of torture - WCVB Boston","description":"California couple sentenced to 25 years to life in prison after children testify about years of torture WCVB Boston California couple sentenced to life in prison for torturing 12 children The Guardian House of horrors case: Turpin parents sentenced to life in…","url":"https://www.wcvb.com/article/california-couple-sentenced-to-25-years-to-life-in-prison-after-children-testify-about-years-of-torture/27208793","urlToImage":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/s088360217-jpg-1555696138.jpg?crop=0.982xw:0.983xh;0,0&resize=1200:*","publishedAt":"2019-04-19T17:52:00Z","content":"RIVERSIDE COUNTY, Calif. —David, 57, and Louise Turpin, 50, were sentenced to 25 years to life in prison after they pleaded guilty to holding captive and torturing 12 of their 13 children for years in their California home.\r\nThe parents each spoke before the … [+2105 chars]"},{"source":{"id":null,"name":"Ctvnews.ca"},"author":"Brian Melley","title":"Parents who starved and shackled children sentenced to life - CTV News","description":"A California couple who inflicted years of torture and abuse on 12 of their 13 children and were only discovered when one of their daughters fled their home and pleaded for help to a 911 operator were sentenced to life in prison Friday, with parole possible a…","url":"https://www.ctvnews.ca/world/parents-who-starved-and-shackled-children-sentenced-to-life-1.4386949","urlToImage":"https://www.ctvnews.ca/polopoly_fs/1.4387200.1555700177!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","publishedAt":"2019-04-19T17:29:00Z","content":"LOS ANGELES -- A California couple who for years starved a dozen of their children and kept some shackled to beds were sentenced Friday to life in prison, ending a shocking case that revealed a house of horrors hidden behind a veneer of suburban normalcy.\r\nTh… [+3199 chars]"},{"source":{"id":null,"name":"Nzherald.co.nz"},"author":null,"title":"Turpin parents sentenced to life in prison for torturing their children - New Zealand Herald","description":"Turpin parents sentenced to life in prison for torturing their children New Zealand Herald Parents who starved and shackled children sentenced to life CTV News California couple sentenced to life for shackling, abusing their 12 children CBC.ca Turpin sentenci…","url":"https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12223889","urlToImage":null,"publishedAt":"2019-04-19T18:38:40Z","content":null},{"source":{"id":null,"name":"Aol.com"},"author":"Gibson Johns","title":"Olivia Jade was spotted parting with YouTube friends on social media amid college bribery scandal - AOL","description":"Olivia Jade was spotted parting with YouTube friends on social media amid college bribery scandal AOL Olivia Jade spotted partying with YouTube celebrities amid college admissions scandal Fox News Lori Loughlin ‘Could Spend Years, If Not Decades, Behind Bars,…","url":"https://www.aol.com/article/entertainment/2019/04/19/olivia-jade-parties-with-youtube-friends-amid-scandal/23714573/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2261x1482+865+412/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2Fd2bb2430-62c5-11e9-bfdf-e9b3c8ee831e","publishedAt":"2019-04-19T17:09:41Z","content":"Olivia Jade isn't letting the college admissions scandal get in her way of having fun.\r\nThe 19-year-old beauty guru was spotted laughing and smiling at a house party on Thursday, in videos posted to YouTube star Heath Hussar's Instagram Stories.\r\nOlivia can b… [+4444 chars]"},{"source":{"id":null,"name":"Kotaku.com"},"author":"Gita Jackson","title":"The No Man's Sky Community That Feels Like A Car Show","description":"Although No Man’s Sky has true multiplayer now, there are still only a few ways to interact with other players. In order to show off your cool stuff or help other players find the tools or ships they want, you have to exchange coordinates with them offline. T…","url":"https://kotaku.com/the-no-mans-sky-community-that-feels-like-a-car-show-1834176655","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--HwtkquKr--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/dlkd7akjymxvdvffrd7d.png","publishedAt":"2019-04-19T21:30:00Z","content":"Although No Mans Sky has true multiplayer now, there are still only a few ways to interact with other players. In order to show off your cool stuff or help other players find the tools or ships they want, you have to exchange coordinates with them offline. Th… [+3702 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"David Pescovitz","title":"Where pinball machines live forever","description":"Michael Schiess is the founder of the Pacific Pinball Museum in Alameda, California where he cares for nearly 2,000 pinball machines from across time. Schiess's mission in life? \"To inspire an interest in science, art and history through pinball, and to prese…","url":"https://boingboing.net/2019/04/19/where-pinball-machines-live-fo.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/screenshot-49.jpg","publishedAt":"2019-04-19T14:40:40Z","content":"A pixel-perfect implementation of Super Mario Bros. is now available for the Commodore 64, a good three decades after that computer’s (and the Nintendo Entertainment System’s) heydey. This is a Commodore 64 port of the 1985 game SUPER MARIO BROS. for the Fami… [+1697 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Rob Beschizza","title":"Super Mario Bros. released for C64","description":"A pixel-perfect implementation of Super Mario Bros. is now available for the Commodore 64, a good three decades after that computer's (and the Nintendo Entertainment System's) heydey. This is a Commodore 64 port of the 1985 game SUPER MARIO BROS. for the Fami…","url":"https://boingboing.net/2019/04/19/super-mario-bros-released-for.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/c64-mario.jpg","publishedAt":"2019-04-19T13:14:21Z","content":"A pixel-perfect implementation of Super Mario Bros. is now available for the Commodore 64, a good three decades after that computer's (and the Nintendo Entertainment System's) heydey. \r\nThis is a Commodore 64 port of the 1985 game SUPER MARIO BROS. for the Fa… [+2611 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"IPOs have sent Uber and Lyft fares skyrocketing, while driver pay plummets","description":"The public markets are hungry: as Uber and Lyft look to IPOs to let their investors -- who have been subsidizing 40-50% of every ride -- redeem their shares through sales to the public capital markets, the companies are desperate for ways to reduce their unpr…","url":"https://boingboing.net/2019/04/19/opacity-n-gouging.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/Sinking_of_the_Lusitania_London_Illus_News.jpg","publishedAt":"2019-04-19T13:42:49Z","content":"The public markets are hungry: as Uber and Lyft look to IPOs to let their investors -- who have been subsidizing 40-50% of every ride -- redeem their shares through sales to the public capital markets, the companies are desperate for ways to reduce their unpr… [+3708 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Rina Raphael","title":"Mental health concerns by state: This map shows the most googled terms","description":"A new report examined Americans’ most googled mental health concerns and found that geography certainly plays a roll. How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health conc…","url":"https://www.fastcompany.com/90337315/mental-health-concerns-by-state-this-map-shows-the-most-googled-terms?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-2-90337315-the-most-googled-mental-health-concernsand8211by-state.jpg","publishedAt":"2019-04-19T11:08:04Z","content":"How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health concerns among Americans and found that geography certainly plays a roll.[Image: TermLife2Go]\r\nAnalysts at TermLife2Go.com… [+1028 chars]"},{"source":{"id":"time","name":"Time"},"author":"ALEX VEIGA / AP","title":"Corporate America Gears Up for ‘Weed Day’ Celebrations on April 20","description":"The counter-culture celebration on Apr. 20 was all about getting stoned, but is now so mainstream brands are starting to embrace it.","url":"http://time.com/5573878/420-april-20-weed-marijuana-cannabis-day-marketing-brands/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/gettyimages-949250036.jpg?quality=85","publishedAt":"2019-04-19T05:49:27Z","content":"LOS ANGELES — Potheads have for decades celebrated their love of marijuana on April 20, but the once counter-culture celebration that was all about getting stoned now is so mainstream Corporate America is starting to embrace it.\r\nNo, Hallmark doesn’t yet have… [+5217 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"'House of horrors': California couple sentenced to life in prison for torturing their children","description":"David and Louise Turpin, who pleaded guilty in February to torture and false imprisonment, are eligible for parole after 25 years.","url":"https://news.yahoo.com/apos-house-horrors-apos-california-174740189.html","urlToImage":null,"publishedAt":"2019-04-19T22:36:30Z","content":null},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Parents who tortured children get life after kids speak","description":"A California couple who inflicted years of torture and abuse on 12 of their 13 children and were only discovered when one of their daughters fled their home and pleaded for help to a 911 operator were sentenced to life in prison Friday, with parole possible a…","url":"https://news.yahoo.com/parents-tortured-children-life-kids-184820789.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/K_KA2MsZa3fTVe7LGZu8yw--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://slick-prod.s3-us-west-2.amazonaws.com/slick_thumb/giraffe-275780-1555699606497.jpg","publishedAt":"2019-04-19T18:48:20Z","content":"A California couple who inflicted years of torture and abuse on 12 of their 13 children and were only discovered when one of their daughters fled their home and pleaded for help to a 911 operator were sentenced to life in prison Friday, with parole possible a… [+13 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"US 'House of Horrors' parents jailed for torture, abuse","description":"A California couple were jailed for at least 25 years on Friday after admitting to imprisoning and torturing 12 of their 13 children in a grisly \"House of Horrors\" case that shocked the world. David Allen Turpin, 57, and his wife Louise Anna Turpin, 50, had p…","url":"https://news.yahoo.com/us-house-horrors-parents-jailed-torture-abuse-175609640.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/TIFpUAzJZizSKRpgACt2lA--~B/aD03MzI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/6e0ecd63ee1900aad437af34d4edeefa7f51817b.jpg","publishedAt":"2019-04-19T17:56:09Z","content":"Riverside (United States) (AFP) - A California couple were jailed for at least 25 years on Friday after admitting to imprisoning and torturing 12 of their 13 children in a grisly \"House of Horrors\" case that shocked the world.\r\nDavid Allen Turpin, 57, and his… [+2015 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"US 'House of Horrors' parents jailed for torture, abuse","description":"A California couple were handed life sentences Friday after admitting to imprisoning and torturing 12 of their 13 children in a grisly \"House of Horrors\" case that shocked the world. David Allen Turpin, 57, and his wife Louise Anna Turpin, 50, had pleaded gui…","url":"https://news.yahoo.com/us-house-horrors-parents-jailed-torture-abuse-183502141.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/TIFpUAzJZizSKRpgACt2lA--~B/aD03MzI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/6e0ecd63ee1900aad437af34d4edeefa7f51817b.jpg","publishedAt":"2019-04-19T18:35:02Z","content":"Riverside (United States) (AFP) - A California couple were handed life sentences Friday after admitting to imprisoning and torturing 12 of their 13 children in a grisly \"House of Horrors\" case that shocked the world.\r\nDavid Allen Turpin, 57, and his wife Loui… [+4009 chars]"},{"source":{"id":"time","name":"Time"},"author":"Brian Melley / AP","title":"A California Couple Who Shackled and Tortured Their Children Face Life in Prison","description":"David and Louise Turpin face 25 years to life in prison when sentenced Friday. The couple earlier pleaded guilty to 14 criminal charges.","url":"http://time.com/5573891/california-couple-shackled-children-prison-turpin/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/california-couple-shackled-children.jpg?quality=85","publishedAt":"2019-04-19T06:07:10Z","content":"(LOS ANGELES) — The desperate cry for help came from a girl who had lived in such isolation for 17 years that she didn’t know her address, the month of the year or what the word medication meant.\r\nBut after jumping out a window from the filthy home where she … [+3175 chars]"},{"source":{"id":null,"name":"Slate.com"},"author":"Marissa Martinelli","title":"Why Must Hollywood Deny Us the Pleasure of Seeing Lori Loughlin’s Latest Projects?","description":"The Hallmark Channel has cut ties with the actress over Operation Varsity Blues.","url":"https://slate.com/culture/2019/04/lori-loughlin-when-calls-the-heart-varsity-blues.html","urlToImage":"https://compote.slate.com/images/494516a1-1ebf-4118-8851-89c5937a640e.jpeg?width=780&height=520&rect=1560x1040&offset=0x0","publishedAt":"2019-04-19T20:33:42Z","content":"Lori Loughlin in When Calls the Heart.\r\nThe Best College Gymnast in America Is Also the Most Hated\r\nThe One Death Game of Thrones Cant Face\r\nWhat Happened to Winter on Game of Thrones?\r\nThe Stormy Story of Three Kings, the Only Great Movie About the Gulf War\r… [+4502 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"IPOs have sent Uber and Lyft fares skyrocketing, while driver pay plummets","description":"The public markets are hungry: as Uber and Lyft look to IPOs to let their investors -- who have been subsidizing 40-50% of every ride -- redeem their shares through sales to the public capital markets, the companies are desperate for ways to reduce their unpr…","url":"http://feeds.boingboing.net/~r/boingboing/iBag/~3/DQKJ6w_2Hkg/opacity-n-gouging.html","urlToImage":null,"publishedAt":"2019-04-19T13:42:49Z","content":null},{"source":{"id":null,"name":"Huffpost.com"},"author":"AP","title":"California Parents Who Tortured Their Children Get Life In Prison","description":"David and Louise Turpin shackled and beat a dozen of their children in a filthy suburban house for years.","url":"https://www.huffpost.com/entry/california-torture-house-prison_n_5cba0c33e4b068d795cc36ef","urlToImage":"https://img.huffingtonpost.com/asset/5cba0c891f000058017f2059.jpeg?cache=mihfzeui0p&ops=1910_1000","publishedAt":"2019-04-19T18:06:54Z","content":"LOS ANGELES (AP) A California couple who inflicted years of torture and abuse on 12 of their 13 children and were only discovered when one of their daughters fled their home and pleaded for help to a 911 operator were sentenced to life in prison Friday, with … [+3679 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Reuters","title":"U.S. Court Upholds Most Of California’s ‘Sanctuary’ Migrant Laws","description":"The U.S. 9th Circuit Court of Appeals in San Francisco largely affirmed a July ruling from a lower court.","url":"https://www.huffpost.com/entry/us-court-upholds-most-of-californias-sanctuary-migrant-laws_n_5cb93939e4b06605e3ed17fd","urlToImage":"https://img.huffingtonpost.com/asset/5cb939db240000c602044d08.jpeg?cache=jremoer8vo&ops=1910_1000","publishedAt":"2019-04-19T03:05:05Z","content":"The Trump administration lost a court bid on Thursday aimed at striking down Californias sanctuary statutes that prevent local law enforcement from helping the U.S. governments crackdown on illegal immigration.\r\nThe U.S. 9th Circuit Court of Appeals in San Fr… [+1711 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Jenna Amatulli","title":"‘Pitch Perfect’ Co-Stars Skylar Astin, Anna Camp Break Up","description":"In a statement to People, the pair said that they decided to separate \"mutually and amicably.\"","url":"https://www.huffpost.com/entry/pitch-perfect-skylar-astin-anna-camp_n_5cba10e9e4b032e7ceb80db4","urlToImage":"https://img.huffingtonpost.com/asset/5cba14b924000076000682ee.jpeg?cache=eM0V4ByY6O&ops=1200_630","publishedAt":"2019-04-19T19:11:35Z","content":"Skylar Astin and Anna Camp, stars of the hit franchise “Pitch Perfect,” have split up.\r\nThe duo released a statement to People on Friday saying: “We can confirm that we have decided to separate, and this decision was made mutually and amicably. We kindly ask … [+620 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"UNC coach Hatchell resigns after program review","description":"Sylvia Hatchell has stepped down as North Carolina's women's basketball coach after an external review found she had made \"racially insensitive\" comments and applied \"undue influence\" regarding players' ability to compete through medical issues.","url":"http://www.espn.com/womens-college-basketball/story/_/id/26557340/unc-coach-hatchell-resigns-program-review","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F1217%2Fr303790_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:36:40Z","content":"RALEIGH, N.C. -- North Carolina women's basketball coach Sylvia Hatchell resigned Thursday after an external review found she had made \"racially insensitive\" comments and applied \"undue influence\" regarding players' ability to compete through medical issues.\r… [+2223 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"The 11 mass deadly school shootings that happened since Columbine","description":"The images of teenagers running from their school with their hands up – as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight.","url":"https://abcnews.go.com/US/11-mass-deadly-school-shootings-happened-columbine/story?id=62494128","urlToImage":"https://s.abcnews.com/images/US/GTY_columbine_jtm_141007_hpMain_5_16x9_992.jpg","publishedAt":"2019-04-19T13:46:35Z","content":"The images of teenagers running from their school with their hands up as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight at subsequent school shootings.\r\nAnd for many, including eventual school shooters, there was so… [+9433 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Buzz60, Buzz60","title":"Southern California experiences an earthquake every 3 minutes, study","description":"New research from the California Institute of Technology estimates that Southern California experiences 495 small quakes a day, that are largely undetectable by humans. Veuer's Sam Berman has the full story.","url":"https://www.usatoday.com/videos/news/2019/04/19/southern-california-experiences-earthquake-every-3-minutes-study/3522216002/","urlToImage":"","publishedAt":"2019-04-19T19:54:11Z","content":null},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Brett Molina, USA TODAY","title":"Southern California experiences 'hidden' earthquakes every 3 minutes, says study","description":"Southern California experienced 1.8 million earthquakes between 2008 and 2017, equivalent to one quake every three minutes, seismologists say.","url":"https://www.usatoday.com/story/news/nation/2019/04/19/hidden-earthquakes-southern-calif-has-one-every-3-minutes-study/3517845002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/ec162391-1ec6-40cc-89ac-1d5699565ac0-AP_Small_California_Earthquake.jpg?crop=2403,1352,x0,y186&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T11:37:06Z","content":"Part of a tree broken lies along State Route 18 after a rockslide blocked the road in the Southern California community of Snow Valley, enroute to Big Bear Lake on Saturday, July 5, 2014, following a widely felt small earthquake.\r\n (Photo: Rick Sforza, AP)\r\nB… [+1909 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, N'dea Yancey-Bragg, USA TODAY","title":"DNA from an old razor helped police solve 41-year-old rape and murder California cold case","description":"After more than four decades, a suspect has been identified in the rape and murder of two women in California.","url":"https://www.usatoday.com/story/news/nation/2019/04/18/old-razor-41-year-old-california-cold-case/3515419002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/fd61a888-26c1-4879-aee1-9dd65124aaec-AP_Cold_Case_Murders_Suspect_Dead.JPG?crop=2275,1320,x0,y839&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T02:13:09Z","content":"This undated photo provided by the San Luis Obispo County Sheriff's Office shows Arthur Rudy Martinez. Authorities say DNA evidence has linked the cold-case rape and murder of two women in California's Central Coast to a man who died in a prison in Washington… [+5159 chars]"},{"source":{"id":null,"name":"Desertsun.com"},"author":"Palm Springs Desert Sun, Colin Atagi and Shane Newell, Palm Springs Desert Sun","title":"California couple face lengthy prison terms for torturing their 13 children","description":"David and Louise Turpin pleaded guilty  in February to charges of torture, false imprisonment and child endangerment.","url":"https://www.desertsun.com/story/news/crime_courts/2019/04/19/turpins-sentenced-friday-after-convicted-torturing-their-13-children/3434703002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/81fd22dc6163ec9fa56f612a28b0573723af6bbd/c=0-51-1000-616/local/-/media/2018/01/18/PalmSprings/PalmSprings/636518945654034143--MG-3485.JPG?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T01:22:13Z","content":"The press conference was held on Feb. 22, 2019 after David and Louise Turpin plead guilty to torture, abuse charges.\r\n Sam Metz, The Desert Sun\r\nPALM SPRINGS, Calif. The Southern California couple who pleaded guilty to torture, false imprisonment and endanger… [+6784 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP, AP","title":"Lawyer: abused children 'humbled that people care","description":"A California couple who pleaded guilty to years of torture and abuse of 12 of their 13 children have been sentenced to life in prison with possibility of parole after 25 years. An attorney says the children are moving on with their lives. (April 19)","url":"https://www.usatoday.com/videos/news/nation/2019/04/19/lawyer-abused-children-humbled-people-care/3524890002/","urlToImage":"https://mp4media.gannett-cdn.com/28911775001/28911775001_6028091504001_6028090601001-vs.jpg?pubId=28911775001","publishedAt":"2019-04-19T21:50:35Z","content":null},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Kristin Lam, USA TODAY","title":"US appeals court rejects Trump administration lawsuit, upholds most of California's sanctuary laws","description":"A federal appeals court upheld California's sanctuary state law, ruling it does not interfere with the enforcement of federal immigration laws.","url":"https://www.usatoday.com/story/news/nation/2019/04/18/california-sanctuary-law-appeals-court-upholds-immigration-laws/3514813002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/15/USAT/10686a01-f6b7-43a7-98fa-5e7c11f17836-AP_Sanctuary_Cities.JPG?crop=2999,1687,x0,y224&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T01:35:10Z","content":"House Speaker Nancy Pelosi says rounding up immigrants and shipping them to sanctuary cities is \"disrespectful.\" The California Democrat was asked about reports that the White House had considered sending immigrants to sanctuary cities. (April 12)\r\n AP, AP\r\nA… [+2174 chars]"},{"source":{"id":null,"name":"Azcentral.com"},"author":"Arizona Republic, Scott Craven, Arizona Republic","title":"New Mickey Mouse attraction delayed until 2020 at Disney World, is coming to Disneyland in 2022","description":"Mickey and Minnie's Runaway Railway, which whisks guests along a wild train ride will open at Disney World in 2020 and Disneyland in 2022.","url":"https://www.azcentral.com/story/travel/destinations/california/2019/04/19/disneyland-toontown-mickey-and-minnie-runaway-railway/3521178002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PPHX/8a7db480-840c-427a-819d-7f6c90fe8c9e-MickeyMinniesRunawayRailway52.jpg?crop=3211,1799,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T19:51:21Z","content":"Star Wars: Galaxy's Edge will open at Disneyland on May 31and Walt Disney World on August 29.\r\n USA TODAY\r\nWith all the hype surrounding Disneyland and Disney World's new Star Wars land, one of Disneyland's most overlooked areas is about to get a much-needed … [+2037 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Kaiser Health News, Rob Waters, Kaiser Health News","title":"Fatty liver disease strikes Latino children like a ‘silent tsunami’","description":"Research shows about 1 in 4 people in the U.S. have fatty liver disease. But among Latinos, especially of Mexican and Central American descent, the rate is significantly higher.","url":"https://www.usatoday.com/story/news/nation/2019/04/19/fatty-liver-disease-latinos-mexican-and-central-americans-suffer/3519257002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/2bcf6729-7921-4ffa-94de-50d240facecf-fattyliver3.jpg?crop=1358,764,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T14:58:52Z","content":"Adrian Mejia and his mother, Saira Diaz, learned healthier eating habits through a study at the University of Southern California and Childrens Hospital Los Angeles. He gave up sugary drinks, lost some weight and joined a soccer team. Diaz joined the effort, … [+8407 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"College golfer in hijab out to blaze trail for Muslim girls","description":"Nebraska's Noor Ahmed wears hijab on golf course, hopes to be role model for Muslim girls","url":"https://www.usatoday.com/story/sports/golf/2019/04/19/college-golfer-in-hijab-out-to-blaze-trail-for-muslim-girls/39365923/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/2887f5d7d58a75a6437c45e987fd994202334aff/c=0-156-3000-1844/local/-/media/2019/04/19/USATODAY/usatsports/69dd6d468a0c481aa40780c1b4c8e843.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T07:07:08Z","content":"LINCOLN, Neb. (AP) Noor Ahmed outwardly lives her Muslim faith, and even growing up in a state as diverse as California she says she encountered hostility on the street, in school and on the golf course.\r\nOne of the top junior golfers in Northern California c… [+6423 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, John Fritze and David Jackson, USA TODAY","title":"Mueller report sets up fresh battle for Donald Trump as Democrats demand answers","description":"Democrats ramped up their rhetoric after Robert Mueller's report, kicking off a fresh fight over an investigation Donald Trump wants to leave behind.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/mueller-report-donald-trump-faces-fresh-battle-dems-demand-answers/3474091002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/15/USAT/17514e30-0d01-48ec-87ce-ced73a8d4a24-610603738_85541176.JPG?crop=3057,1720,x535,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T10:00:30Z","content":"House Intelligence Committee Chairman Adam Schiff says Attorney General William Barr did a \"grave disservice\" to the country by misrepresenting significant parts of special counsel Robert Mueller's report. (April 18)\r\n AP, AP\r\nStory Highlights\r\n\"If you were a… [+7424 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Bart Jansen, USA TODAY","title":"After months clamoring for Mueller's findings, Congress weighs what's next. First, a subpoena for everything","description":"Congress is wrestling with how to respond to revelations in special counsel Robert Mueller's report, but will start by seeking more information.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/congress-weighs-next-steps-after-mueller-sends-subpoena-for-full-report/3519575002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/cf826d86-cbff-4719-abbf-66f84a0aef73-EPA_epaselect_USA_TRUMP_MUELLER_REPORT.jpg?crop=5122,2881,x0,y289&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T17:44:44Z","content":"House Intelligence Committee Chairman Adam Schiff says Attorney General William Barr did a \"grave disservice\" to the country by misrepresenting significant parts of special counsel Robert Mueller's report. (April 18)\r\n AP, AP\r\nWASHINGTON Congress spent months… [+7761 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Jennifer Earl","title":"Great white shark reveals razor-like teeth as it attempts to chomp photographer's camera","description":"This time, it's personal.","url":"https://www.foxnews.com/science/great-white-shark-bites-photographers-camera","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rtxl60q.jpg","publishedAt":"2019-04-19T14:23:35Z","content":"This time, it's personal.\r\nA giant great white shark opened wide as it attempted to make a meal out of wildlife photographer Peter Kragh's camera. Kragh shared the jaw-dropping footage taken during a trip off Guadalupe Island in Mexico on social media last mo… [+2044 chars]"},{"source":{"id":null,"name":"Thecrimereport.org"},"author":"","title":"Big Pimping (2010)","description":"Why is it so hard to catch men who sell teen girls for sex? Like a lot of 14-year-old girls, all Shaquana wanted was a boyfriend. The skinny Brooklyn, N.Y. eighth-grader was on the honor roll at school, but unhappy at home. She hadn't seen her father in years…","url":"https://thecrimereport.org/2010/06/14/big-pimping/","urlToImage":"https://thecrimereport.org/wp-content/uploads/2016/02/screen_shot_2011-01-31_at_4.51.18_pm.png","publishedAt":"2019-04-19T11:09:23Z","content":"Why is it so hard to catch men who sell teen girls for sex?\r\nLike a lot of 14-year-old girls, all Shaquana wanted was a boyfriend. The skinny Brooklyn, N.Y. eighth-grader was on the honor roll at school, but unhappy at home. She hadn't seen her father in year… [+11979 chars]"},{"source":{"id":null,"name":"Aynuriev.com"},"author":null,"title":"How to register a comany in the USA: the most comprehensive guide for founders","description":"Read the most comprehensive guide on How to Register a Company in the USA for a sturtup. All the details that make an incorporation of a company smooth.","url":"http://aynuriev.com/how-to-register-company-usa/","urlToImage":"http://aynuriev.com/wp-content/uploads/2019/03/ein_template-740x1024.jpg","publishedAt":"2019-04-19T09:35:59Z","content":"I am sure that anyone who ended up here had spent much time already trying to figure out how to incorporate a company in the USA for their startups. At least it was my case as we were initially located in Russia. I personally read tens of articles, instructio… [+29222 chars]"},{"source":{"id":null,"name":"Scientificamerican.com"},"author":"Steven Moss","title":"Solar Energy Isn't Just for Electricity","description":"It can also provide carbon-free heat for a wide variety of industrial processes -- Read more on ScientificAmerican.com","url":"https://blogs.scientificamerican.com/observations/solar-energy-isnt-just-for-electricity/","urlToImage":"https://static.scientificamerican.com/blogs/cache/file/75BE28DF-3B4D-4DAC-B6C5FCE41438D004.jpg","publishedAt":"2019-04-19T16:00:00Z","content":"The industrial processes that underpin our global economy—manufacturing, fuel and chemical production, mining—are enormously complex and diverse. But they share one key input: they, as well as many others, require heat, and lots of it, which takes staggering … [+5012 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Tony Markovich","title":"Watch Ken Block's Ford F-150 Raptor SVC bum-rush Moab","description":"Filed under: Etc., Videos, Ford, Truck, Off-Road This guy can hoon anything. Continue reading Watch Ken Block's Ford F-150 Raptor SVC bum-rush Moab Watch Ken Block's Ford F-150 Raptor SVC bum-rush Moab originally appeared on Autoblog on Fri, 19 Apr 2019 16:05…","url":"https://www.autoblog.com/2019/04/19/ken-block-ford-f-150-raptor-svc-moab-video/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2048x1152+0+0/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-04/2fbf2450-62d6-11e9-afff-a84654f0f2b9","publishedAt":"2019-04-19T20:05:00Z","content":"Could Ken Block take a stock Ford F-150 and have a blast ripping it around the desert? Yes. Would that be the Hoonigan Ken Block way? Absolutely not. First, he needed more speed, more lights, more graphics and more custom off-roading gear.Block debuted this n… [+1589 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Reuters","title":"Automakers invest heavily in electric vehicles despite lagging demand","description":"Filed under: Green, New York Auto Show, Electric Continue reading Automakers invest heavily in electric vehicles despite lagging demand Automakers invest heavily in electric vehicles despite lagging demand originally appeared on Autoblog on Fri, 19 Apr 2019 1…","url":"https://www.autoblog.com/2019/04/19/automakers-invest-electric-vehicles-sales/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2500x1406+0+0/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-04/65107340-62cf-11e9-b1ec-357c5de77b6c","publishedAt":"2019-04-19T18:20:00Z","content":"NEW YORK — Demand for electric vehicles remains low in the U.S. market, but industry executives at the New York auto show this week said they are pushing ahead with billions of dollars in investments even while preaching patience.Officials said their companie… [+3459 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Zac Palmer","title":"Electric Ford Bronco from Zero Labs enters the restomod fray","description":"Filed under: Design/Style, Green, Green Driving, SUV, Truck, Electric, Off-Road It has a 190-mile range and is built on a restored Bronco chassis. Continue reading Electric Ford Bronco from Zero Labs enters the restomod fray Electric Ford Bronco from Zero Lab…","url":"https://www.autoblog.com/2019/04/19/zero-labs-ford-bronco-ev-restomod/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2500x1408+0+100/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-04/3bef5ed0-62d5-11e9-b5bf-997db31a4860","publishedAt":"2019-04-19T19:20:00Z","content":"Excitement over a new Ford Bronco from Ford has been feverish for awhile now, and that has only encouraged people to make original Broncos new again. There are a number of these projects out there, but today we get to tell you about one that is rather unique.… [+2904 chars]"},{"source":{"id":null,"name":"Food52.com"},"author":"Erin Alexander","title":"9 Breezy, Beautiful Airbnb Beach Homes for a Quick Weekend Getaway","description":"Happy Friday! We’re here to make it even happier with our mini-series, The Weekend Has Landed. All month long we’re sharing ideas to help you make the most of those precious 50-something hours. I've been dreaming of palm trees, sunshine, and warm, crystal-blu…","url":"https://food52.com/blog/24057-best-airbnb-beach-houses-weekend-getaway?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+food52-TheAandMBlog+%28The+A%2BM+Blog%29","urlToImage":"https://images.food52.com/chNEI2OR5B61HbvlRTcnMjV8HJw=/fit-in/1200x1200/d8f2c636-3701-4ec7-b9ad-83349f666d4a--19a38adc-f6c7-441b-b523-bd587ceee1c2.jpg","publishedAt":"2019-04-19T14:00:00Z","content":"Happy Friday! Were here to make it even happier with our mini-series, The Weekend Has Landed. All month long were sharing ideas to help you make the most of those precious 50-something hours.\r\nI've been dreaming of palm trees, sunshine, and warm, crystal-blue… [+3569 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Couple sentenced to life for severe child abuse","description":"A California couple who for years starved a dozen of their children and kept some shackled to beds were sentenced Friday to life in prison, ending a shocking case hidden by a veneer of suburban normalcy. (April 19)","url":"https://news.yahoo.com/couple-sentenced-life-severe-child-194917566.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/D7tXwjGPHV3Vy6gUJ4bUFA--~B/aD0zMDA7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/video/video.associatedpressfree.com/a732fe1b2a5145186cb972104b7e6cdc","publishedAt":"2019-04-19T19:49:17Z","content":"A California couple who for years starved a dozen of their children and kept some shackled to beds were sentenced Friday to life in prison, ending a shocking case hidden by a veneer of suburban normalcy. (April 19)"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Warren becomes first 2020 Democrat to call for impeachment","description":"WASHINGTON (AP) — Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of specia…","url":"https://news.yahoo.com/warren-calls-house-begin-impeachment-proceedings-202730326--election.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/zN9mWTaBX2gDTEq6qEWB_g--~B/aD0zMjAyO3c9NDgwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/9e5a3e2700234d3fb75d3b6c94dde56b.jpg","publishedAt":"2019-04-19T23:34:03Z","content":"WASHINGTON (AP) Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of special … [+2827 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump slams 'fabricated' testimony in Mueller report","description":"\"Statements are made about me by certain people in the Crazy Mueller Report, in itself written by 18 Angry Democrat Trump Haters, which are fabricated & totally untrue,\" the president tweeted. A 400-page document outlining the findings of Special Counsel Robe…","url":"https://news.yahoo.com/trump-slams-fabricated-testimony-mueller-report-003156356.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/AAZy_9KXP.210dFfVP_vGw--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/40960e9400026639a4b557c6cc3937cc7e3a5943.jpg","publishedAt":"2019-04-19T00:58:58Z","content":"Washington (AFP) - US President Donald Trump on Friday dismissed unfavorable testimony in the Mueller report on Russian election interference as \"fabricated\" and labelled the document \"crazy.\"\r\n\"Statements are made about me by certain people in the Crazy Muel… [+2753 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller drops obstruction dilemma on Congress","description":"WASHINGTON (AP) — It's now up to Congress to decide what to do with special counsel Robert Mueller's findings about President Donald Trump.","url":"https://news.yahoo.com/mueller-drops-obstruction-dilemma-congress-002806731--politics.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/u1Wkx7VdhgZDFmpRQh9qBg--~B/aD0zNTMyO3c9NTI5ODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/8a6e1675dea6404eaa26ffb0099229b0.jpg","publishedAt":"2019-04-19T01:18:52Z","content":"WASHINGTON (AP) It's now up to Congress to decide what to do with special counsel Robert Mueller's findings about President Donald Trump.\r\nWhile the special counsel declined to prosecute Trump on obstruction of justice, he did not exonerate him, all but leavi… [+6379 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"More arrests could be coming 'in the near future' in college admissions case, prosecutors say","description":"In the month since announcing charges against 50 people in Operation Varsity Blues, prosecutors have hinted in court filings at more charges to come.","url":"https://news.yahoo.com/more-charges-could-coming-apos-103422968.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/M7TFuc5clNlD5YHlXZ9yeA--~B/aD0zMzM7dz00OTk7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/usa_today_news_641/c6300202fe47d48befa2a0e3aeb9d6f0","publishedAt":"2019-04-19T13:24:11Z","content":"Federal prosecutors say more arrests could come soon in their investigation of a large-scale college admissions bribery and cheating ring, with a number of defendants already charged in a sealed complaint. \r\nHints about additional cases are sprinkled in vario… [+7024 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"MarketWatch","title":"NewsWatch: A ‘tired’ stock market is a reason for caution, says chart watcher","description":"Do stock-market bulls need a timeout? One chart watcher argues that the rally that’s seen the S&P 500 roar back from the verge of a bear market to the cusp of its all-time highs has left the stock market looking tired.","url":"https://www.marketwatch.com/story/a-tired-stock-market-is-a-reason-for-caution-says-chart-watcher-2019-04-19","urlToImage":"https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png","publishedAt":"2019-04-19T13:00:16Z","content":"Do stock-market bulls need a timeout? One chart watcher argues that the rally thats seen the S&amp;P 500 roar back from the verge of a bear market to the cusp of its all-time highs has left the stock market looking tired. See full story.\r\nHave nothing saved f… [+1091 chars]"},{"source":{"id":null,"name":"Nextavenue.org"},"author":"Steven N. Austad","title":"Next Avenue: The science behind why women survive longer than men","description":"What does biology tell us about gender and longevity?","url":"https://www.nextavenue.org/biology-gender-longevity/","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HH366_na_sur_ZG_20190410172953.jpg","publishedAt":"2019-04-19T09:01:55Z","content":"This article is reprinted by permission from NextAvenue.org.\r\nIn the late fall of 1846, 87 California-bound pioneers found themselves stranded in the deepening snows of the Sierra Nevada mountains with little food and inept leadership, and with winter coming … [+5429 chars]"},{"source":{"id":null,"name":"Psfk.com"},"author":"Dave Pinter, PSFK","title":"The Future Of Car Buying And Owning According To Acura Designers","description":"There’s plenty to contemplate about the near future of personal transportation. Electrification, autonomy, transitions away from ownership—these are a few of the high-level topics the auto industry is trying to solve simultaneously. The resulting next generat…","url":"https://www.psfk.com/2019/04/future-car-owning-buying-acura.html","urlToImage":"https://cdn1.psfk.com/wp-content/uploads/2019/04/acura_future_automotive_retail_psfk.jpg","publishedAt":"2019-04-19T16:58:37Z","content":"There’s plenty to contemplate about the near future of personal transportation. Electrification, autonomy, transitions away from ownershipthese are a few of the high-level topics the auto industry is trying to solve simultaneously. The resulting next generati… [+8842 chars]"},{"source":{"id":null,"name":"Sciencedaily.com"},"author":null,"title":"Study finds that quitting smoking during pregnancy lowers risk of preterm births","description":"A new study of more than 25 million pregnant women reports on rates of smoking cessation at the start of and during pregnancy and also examines the association of quitting cigarette smoking and the risk of preterm birth.","url":"https://www.sciencedaily.com/releases/2019/04/190419112334.htm","urlToImage":null,"publishedAt":"2019-04-19T15:23:34Z","content":"There is an important association between maternal cigarette smoking cessation during pregnancy and risk of preterm birth, according to a new Dartmouth-led study published in JAMA Network Open.The negative health impacts of cigarette smoking during pregnancy … [+3442 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Jason Torchinsky","title":"It's Time to Just Admit That the Honda Clarity Feels a Bit Like a Modern Citroën DS","description":"As you all know, it’s not easy to admit difficult truths to yourself. Sometimes you can remain in denial for as long as possible, until you find yourself confronted by cold, hard reality and you have no choice but to accept what’s right in front of your face.…","url":"https://jalopnik.com/its-time-to-just-admit-that-the-honda-clarity-feels-a-b-1834171714","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--6l31uGn9--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/mqvvqxe0e4pjhn6aduh5.png","publishedAt":"2019-04-19T21:22:00Z","content":"As you all know, its not easy to admit difficult truths to yourself. Sometimes you can remain in denial for as long as possible, until you find yourself confronted by cold, hard reality and you have no choice but to accept whats right in front of your face. A… [+2265 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Jake Rossen","title":"Paranormal Investigator Lorraine Warren, Whose Life Inspired The Conjuring Films, Has Died at 92","description":"The renowned paranormal investigator was portrayed by actress Vera Farmiga in a series of successful films.","url":"http://mentalfloss.com/article/580960/lorraine-warren-paranormal-investigator-dies","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_1123,w_2000,x_0,y_75/v1555702540/shape/mentalfloss/580960-jasonkempin-gettyimages-173518401.jpg?itok=rfYH8uF5","publishedAt":"2019-04-19T20:45:00Z","content":"If you cant picture actor Haruo Nakajimas face, thats because his most famous movie role had him hidden inside a monster costume. The Japanese performerwho played cinemas most famous reptilian beast, Godzilla, in both the 1954 original film and 11 sequelsdied… [+3865 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Garin Pirnia","title":"12 Soulful Facts About Aretha Franklin","description":"The documentary of Queen of Soul's legendary gospel album, 'Amazing Grace,' has finally been released—nearly 50 years after it was recorded.","url":"http://mentalfloss.com/article/580116/aretha-franklin-facts","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_1687,w_3012,x_0,y_128/v1555618320/shape/mentalfloss/580116-gettyimages-2637601.jpg?itok=Ad-X3VQX","publishedAt":"2019-04-19T20:00:00Z","content":"Before she was a global sensation, Aretha Louise Franklin was a young girl with a big voice. She was born in a tiny home in Memphis, Tennessee in 1942 to C.L. and Barbara Franklin. Her parents, a well-known Baptist minister and a talented singer and musician,… [+14314 chars]"},{"source":{"id":null,"name":"Hypebeast.com"},"author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","title":"Palace Unveils Another New Video for Its Upcoming Los Angeles Store","description":"London's Palace Skateboards latest project comes in the form of a new Los Angeles store which was teased earlier this week via billboards and a promotional surf video. Since opening its first retail location around four years ago in London, the skate brand ha…","url":"https://hypebeast.com/2019/4/palace-skateboards-los-angeles-store-address-promo-video","urlToImage":"https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2019%2F04%2Fpalace-los-angeles-blimp-tw.jpg?w=960&cbr=1&q=90&fit=max","publishedAt":"2019-04-19T11:09:12Z","content":"London’s Palace Skateboards latest project comes in the form of a new Los Angeles store which was teased earlier this week via billboards and a promotional surf video. Since opening its first retail location around four years ago in London, the skate brand ha… [+1095 chars]"},{"source":{"id":null,"name":"Krebsonsecurity.com"},"author":"BrianKrebs","title":"Marcus “MalwareTech” Hutchins Pleads Guilty to Writing, Selling Banking Malware","description":"Marcus Hutchins, a 24-year-old blogger and malware researcher arrested in 2017 for allegedly authoring and selling malware designed to steal online banking credentials, has pleaded guilty to criminal charges of conspiracy and to making, selling or advertising…","url":"https://krebsonsecurity.com/2019/04/marcus-malwaretech-hutchins-pleads-guilty-to-writing-selling-banking-malware/","urlToImage":null,"publishedAt":"2019-04-19T21:58:08Z","content":"Marcus Hutchins, a 24-year-old blogger and malware researcher arrested in 2017 for allegedly authoring and selling malware designed to steal online banking credentials, has pleaded guilty to criminal charges of conspiracy and to making, selling or advertising… [+3821 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Mike Wall","title":"SpaceX's Next Space Station Cargo Launch Delayed to April 30","description":"SpaceX has pushed back the launch of its next robotic resupply mission to the International Space Station by four days, to April 30.","url":"https://www.space.com/spacex-dragon-cargo-launch-delayed.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/ukj8Q6yq3e7GPZLVsXowq5-1200-80.jpg","publishedAt":"2019-04-19T19:02:18Z","content":"SpaceX has pushed back the launch of its next robotic resupply mission to the International Space Station (ISS) by four days, to April 30.\r\nThe California-based company's Dragon cargo capsule\r\n is now scheduled to lift off atop a Falcon 9 rocket at 4:22 a.m. … [+2000 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Ben Pearson","title":"Mickey and Minnie’s Runaway Railway, a New Mickey Mouse-Themed Attraction, Officially Coming to Disneyland","description":"During the 2017 D23 Expo, we learned that Mickey and Minnie’s Runaway Railway, the first-ever Mickey Mouse-themed ride-through theme park attraction, was coming to Walt Disney World. The ride was supposed to be ready by this fall to help with crowd management…","url":"https://www.slashfilm.com/mickey-and-minnies-runaway-railway-coming-to-disneyland/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Mickey-and-Minnies-Runaway-Railway-concept-art.jpg","publishedAt":"2019-04-19T19:00:00Z","content":"During the 2017 D23 Expo, we learned that Mickey and Minnie’s Runaway Railway, the first-ever Mickey Mouse-themed ride-through theme park attraction, was coming to Walt Disney World. The ride was supposed to be ready by this fall to help with crowd management… [+3142 chars]"},{"source":{"id":null,"name":"Gamasutra.com"},"author":"Staff","title":"Get a job: Insomniac Games, Deep Silver Volition, and more are hiring now!","description":"Here are just some of theÂ many, manyÂ positionsÂ being advertised right now on the Gamasutra Job Board....","url":"http://www.gamasutra.com/view/news/341138/Get_a_job_Insomniac_Games_Deep_Silver_Volition_and_more_are_hiring_now_.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29","urlToImage":"http://www.gamasutra.com/db_area/images/news/2019/Apr/341138/ig307.jpg","publishedAt":"2019-04-19T20:33:00Z","content":"Whether you're just starting out, looking for something new, or just seeing what's out there, the Gamasutra Job Board is the place where game developers move ahead in their careers.\r\nGamasutra's Job Board is the most diverse, most active, and most established… [+2453 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"dstrauss@politico.com (Daniel Strauss)","title":"Buttigieg plans aggressive fundraising push in California","description":"Buttigieg also held three fundraisers in New York City this week.","url":"https://www.politico.com/story/2019/04/19/buttigieg-fundraising-california-1282196","urlToImage":"https://static.politico.com/b2/52/dce464a54a308f81b08a3432bce5/19418-pete-buttigieg-gty-773.jpg","publishedAt":"2019-04-19T09:02:49Z","content":"The fundraisers range from more casual gatherings to a meeting of Pete Buttigieg's \"national investment circle,\" | Scott Olson/Getty Images\r\nDemocrat Pete Buttigieg is planning a series of 11 fundraisers over three days in California next month, as the rising… [+1917 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"gross@politico.com (Garrett Ross)","title":"POLITICO Playbook PM: Next up: Nadler’s subpoena","description":"And House Dems talk with the Justice Department about Robert Mueller testifying.","url":"https://www.politico.com/newsletters/playbook-pm/2019/04/19/next-up-nadlers-subpoena-426826","urlToImage":"https://static.politico.com/71/73/a426be6c4c1d861a480dcc79736d/gettyimages-1135937114.jpg","publishedAt":"2019-04-19T17:00:07Z","content":"House Judiciary Chairman Jerry Nadler (D-N.Y.) followed up the release of the redacted Mueller report with a subpoena for more. | Zach Gibson/Getty Images\r\nDEPT. OF ESCALATION Nadler subpoenas DOJ for full version of the Mueller report, by Caitlin Oprysko and… [+9666 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"lmihalik@politico.com (Lily Mihalik)","title":"27 times Trump can’t remember","description":"More than two dozen times, Trump’s answers to Mueller included phrases “I can’t remember” or “I do not recall.”","url":"https://www.politico.com/story/2019/04/18/mueller-trump-cant-remember-1282643","urlToImage":"https://static.politico.com/cd/95/faa6ddbe419b8ff1ab4a38075581/190418-donald-trump-forgets-gty-773.jpg","publishedAt":"2019-04-19T01:09:13Z","content":"President Donald Trump repeatedly said he had difficulty remembering when responding to questions by Special Counsel Robert Mueller, citing the stress of his campaign. | Adam Bettcher/Getty Images\r\nFollowing the release of the redacted Mueller report, Preside… [+11023 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Adam Wells","title":"Red Sox Trade Blake Swihart, Bonus-Pool Money to Diamondbacks for Marcus Wilson","description":"Three days after being designated for assignment by the  Boston Red Sox ,  Blake Swihart  has been traded to the  Arizona Diamondbacks ...","url":"https://bleacherreport.com/articles/2832207-red-sox-trade-blake-swihart-bonus-pool-money-to-diamondbacks-for-marcus-wilson","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/830/hi-res-89d75b6f02bc313193ce21e6f26d1916_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T23:20:44Z","content":"Maddie Meyer/Getty Images\r\nThree days after being designated for assignment by the Boston Red Sox, Blake Swihart has been traded to the Arizona Diamondbacks. \r\nThe Red Sox announced Friday they acquired minor league outfielder Marcus Wilson from Arizona for S… [+1129 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Scott Polacek","title":"NFL Draft 2019 Rumors: Bryce Love's Stiff Knee Has Raised Red Flag for Teams","description":"There are reportedly medical concerns about Stanford running back  Bryce Love 's knee leading up to Thursday's  NFL  draft...","url":"https://bleacherreport.com/articles/2832160-nfl-draft-2019-rumors-bryce-loves-stiff-knee-has-raised-red-flag-for-teams","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/770/hi-res-e8d2510a5497925451edbd622d1bc0ca_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T18:20:04Z","content":"Marcio Jose Sanchez/Associated Press\r\nThere are reportedly medical concerns about Stanford running back Bryce Love's knee leading up to Thursday's NFL draft.\r\nOn Friday, Tom Pelissero of NFL Network reported there are \"red flags\" about how stiff Love's knee i… [+1971 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Althea Legaspi","title":"Carly Rae Jepsen Pines For Haunting Love in New Song ‘Julien’","description":"\"'Julien' is the song that taught me the heart and direction of this album,\" Jepsen says of new Dedicated single","url":"https://www.rollingstone.com/music/music-news/carly-rae-jepsen-new-song-julien-listen-824597/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/9790130b.jpg","publishedAt":"2019-04-19T04:51:21Z","content":"Carly Rae Jepsen pines for a lover that haunts her on her new single, “Julien.” The song is slated to appear on Dedicated, which will be released on May 17th via School Boy/Interscope.\r\nAs a glitchy groove unfolds, Jepsen relays a day waking up in a funk abou… [+1329 chars]"},{"source":{"id":null,"name":"Rollingstone.com"},"author":"Charles Holmes","title":"It’s Finally Here","description":"Over the past few months, BoyBoy West Coast's \"Bottoms Up\" went from a snippet, to a meme, to a potential hit. It just got its official release, but its moment may have passed","url":"https://www.rollingstone.com/music/music-news/the-boyboy-west-coast-u-was-at-the-club-bottoms-up-824694/","urlToImage":"https://www.rollingstone.com/wp-content/uploads/2019/04/boyboy-west-coast.jpg","publishedAt":"2019-04-19T16:52:11Z","content":"Memes are acts of beautiful futility. They aren’t jokes, but they’re meant to be funny, and a great meme thrives through a lack of context — try to explain them, and they immediately become ineffective. Most importantly, all memes have a shelf life. The BoyBo… [+2753 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Chris O'Falt","title":"If Hollywood Takes a Stand for Abortion Rights, the ‘Heartbeat Bill’ Could Cost Millions","description":"Alyssa Milano’s call to boycott Georgia has not found support by studios, which rely on the state's unique and valuable tax incentives.","url":"https://www.indiewire.com/2019/04/georgia-heartbeat-bill-film-tv-boycott-could-cost-hollywood-millions-1202060572/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2019/01/InfinityWar5aa86b6fdaeb5.0.jpg","publishedAt":"2019-04-19T18:16:09Z","content":"Last month, both branches of the Georgia Legislature passed the “Heartbeat Bill,” which would ban abortions after six weeks, or when a doctor can detect a fetus’ heartbeat; it awaits Governor Brian Kemp’s signature before becoming law. Led by actress Alyssa M… [+5310 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Steve Greene","title":"Julia Louis-Dreyfus on 2020 Candidates: ‘Fan’ of Kamala Harris, Elizabeth Warren is a ‘Powerhouse’","description":"TV's best worst president expressed her support for a handful of women looking to help take the White House in next year's election.","url":"https://www.indiewire.com/2019/04/julia-louis-dreyfus-kamala-harris-elizabeth-warren-1202060714/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2019/03/da806000dba679d12a62c8384c2ca01c2c30d3987f9698a6140e9705fa3a38810393c1aaaf0aae1c392d25dc8399f0bd.jpg","publishedAt":"2019-04-19T19:11:38Z","content":"“Veep” has long been saddled with the unenviable task of creating a fictional world while dealing with developments in our own. But as the show leads up to its final episodes, star Julia Louis-Dreyfus is showing admiration for a few presidential candidates wh… [+2245 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Alaa Abdeldaiem","title":"Report: Tyronn Lue Meeting With Lakers About Head Coaching Vacancy","description":"Lue has been long considered a front-runner to replace Luke Walton.","url":"https://www.si.com/nba/2019/04/19/tyronn-lue-lakers-meeting-head-coaching-vacancy-lebron-james","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/tyronn-lue-meets-lakers.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T16:31:15Z","content":"Former Cleveland Cavaliers head coach Tyronn Lue is meeting with the Lakers on Friday, ESPN's Adrian Wojnarowski reported.\r\nAccording to Wojnarowski, Lue will meet Lakers general manager Rob Pelinka in Southern California to discuss the team's head coaching v… [+720 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Chris Mannix","title":"Jeanie Buss and the Lakers Must Go Big Game Hunting in Front Office Search","description":"After Magic Johnson's shocking exit, Jeanie Buss must avoid past mistakes in front office search. So who is the best candidate to run the team? The Lakers job is a complicated one.","url":"https://www.si.com/nba/2019/04/19/lakers-jeanie-buss-rob-pelinka-lebron-james-magic-johnson-front-office-search","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/jeanie-buss-lakers-front-office.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T15:55:20Z","content":"Setting aside the absurdity of how Magic Johnson exited the Lakers last weekhow does one sit through a three-hour organizational meeting a day before announcing an intention to leave an organization? Johnsons decision to quit as president of basketball operat… [+3825 chars]"},{"source":{"id":null,"name":"Refinery29.com"},"author":"Courtney E. Smith, written by Courtney E. Smith","title":"Lee Ann Womack Isn't A Happy Endings Person, But She Let \"Hollywood\" Have One Anway","description":"Welcome to The Drop, Refinery29's home for exclusive music video premieres. We want to shine the spotlight on women artists whose music inspires, excites, and (literally) moves us. This is where we'll champion their voices. What's real and what's fake? Lee An…","url":"https://www.refinery29.com/en-us/2019/04/230316/lee-ann-womack-hollywood-video-premiere","urlToImage":"https://s3.r29static.com//bin/entry/9b6/0,0,2000,1050/x,80/2165775/lee-ann-womack-isnt-a-2165775.jpg","publishedAt":"2019-04-19T14:00:00Z","content":"Skip navigation!We noticed you're in Canada, would you like to see your local site? Click on the flag above to switch.\r\nNow ReadingLee Ann Womack Gives \"Hollywood\" Ending \r\nWelcome toThe Drop, Refinery29's home for exclusive music video premieres. We want to … [+2319 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Kara Manke","title":"India could meet air quality standards by cutting household fuel use","description":"India could make a major dent in air pollution by curbing emissions from dirty household fuels such as wood, dung, coal and kerosene, shows a new analysis led by researchers at the University of California, Berkeley and the India Institute of Technology.","url":"https://phys.org/news/2019-04-india-air-quality-standards-household.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/11-airpollution.jpg","publishedAt":"2019-04-19T07:38:09Z","content":"India could make a major dent in air pollution by curbing emissions from dirty household fuels such as wood, dung, coal and kerosene, shows a new analysis led by researchers at the University of California, Berkeley and the India Institute of Technology.\r\nEli… [+5457 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Science X staff","title":"Things are stacking up for NASA's Mars 2020 spacecraft","description":"For the past few months, the clean room floor in High Bay 1 at NASA's Jet Propulsion Laboratory in Pasadena, California, has been covered in parts, components and test equipment for the Mars 2020 spacecraft, scheduled for launch toward the Red Planet in July …","url":"https://phys.org/news/2019-04-stacking-nasa-mars-spacecraft.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/thingsaresta.jpg","publishedAt":"2019-04-19T06:50:35Z","content":"For the past few months, the clean room floor in High Bay 1 at NASA's Jet Propulsion Laboratory in Pasadena, California, has been covered in parts, components and test equipment for the Mars 2020 spacecraft, scheduled for launch toward the Red Planet in July … [+4254 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Lila MacLellan","title":"There’s a new way to meditate at work","description":"No conference room required.","url":"https://qz.com/work/1597138/tap-in-is-a-new-app-for-live-meditation-at-work/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/Man-listening-to-headphones-during-break-e1555446170224.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-19T10:12:41Z","content":"Every weekday, just before 3 pm, my phone buzzes with a notification to tap in or check in or breathe together. Most days, I obey.\r\nI look for a comfortable place to sit, preferably stepping away from my desk, open the Tap In app on my mobile phone, put on my… [+6663 chars]"},{"source":{"id":null,"name":"Thetruthaboutcars.com"},"author":"Matthew Guy","title":"Rack ‘Em: Best Bike Racks for Your Vehicle","description":"Make it easier to bring your bike along for the ride. The post Rack ‘Em: Best Bike Racks for Your Vehicle appeared first on The Truth About Cars.","url":"https://www.thetruthaboutcars.com/2019/04/rack-em-best-bike-racks-for-your-vehicle/","urlToImage":"https://www.thetruthaboutcars.com/wp-content/uploads/2019/04/best-bike-racks-for-your-vehicle.jpg","publishedAt":"2019-04-19T19:30:54Z","content":"From time to time, TTAC will highlight automotive products we think may be of interest to our community. Plus, posts like this help to keep the lights on around here.Â Learn more about how this works.\r\nFor as much as a person may try, there does come the real… [+11001 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"James Risen","title":"William Barr Misled Everyone About the Mueller Report. Now Democrats Are Calling for His Resignation.","description":"Instead of an honest reading of the Mueller report, Trump’s attorney general distorted it. Now, Democrats are calling for his resignation. The post William Barr Misled Everyone About the Mueller Report. Now Democrats Are Calling for His Resignation. appeared …","url":"https://theintercept.com/2019/04/19/william-barr-mueller-report/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/GettyImages-1137873236-barr-1555696311-e1555696393190.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-19T22:39:12Z","content":"Attorney General\r\n William Barr is coming under increasing fire from congressional Democrats for statements he made before the release of the Mueller report. Critics say the remarks purposefully downplayed how damaging special counsel Robert Muellers report w… [+8112 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Contributor","title":"Wellness via Weed: How dosist Is Becoming the Apple of Cannabis","description":"I’ve had anxiety since before I knew what it meant. As a small child, I bit my nails, and on my 21st birthday — the last time I smoked weed, 10 years ago — I experienced my first panic attack. When you have anxiety, it grows with you: you age, you stress abou…","url":"https://www.highsnobiety.com/p/dosist-apple-of-cannabis-weed/","urlToImage":"https://static.highsnobiety.com/thumbor/QZxiSqwy53yFifUTmhcmgDmQ1n8=/fit-in/1000x600/smart/static.highsnobiety.com/wp-content/uploads/2019/04/18115246/dosist-apple-of-cannabis-weed-feat.jpg","publishedAt":"2019-04-19T09:21:10Z","content":"Ive had anxiety since before I knew what it meant. As a small child, I bit my nails, and on my 21st birthday the last time I smoked weed, 10 years ago I experienced my first panic attack.\r\nWhen you have anxiety, it grows with you: you age, you stress about he… [+4707 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Sydney Gore","title":"Meet the Buzzy Brands Blowing up the CBD Beverage Bubble","description":"Now that you’ve been properly educated about cannabidiol a.k.a. CBD through our extremely detailed guide on the subject, it’s time to elevate to the next level of this trending topic—beverages. Last summer, Dirty Lemon introduced a special cannabis blend to i…","url":"https://www.highsnobiety.com/p/cbd-beverages-guide/","urlToImage":"https://static.highsnobiety.com/thumbor/rsZgbLoKbVyFjcWz8fIRpWzBOPA=/fit-in/2250x1500/smart/static.highsnobiety.com/wp-content/uploads/2019/04/17213846/CBD-drinks-highsnobiety.jpg","publishedAt":"2019-04-19T15:42:44Z","content":"Now that you’ve been properly educated about cannabidiol a.k.a. CBD through our extremely detailed guide on the subject, it’s time to elevate to the next level of this trending topicbeverages. Last summer, Dirty Lemon introduced a special cannabis blend to it… [+12708 chars]"},{"source":{"id":null,"name":"Sfgirlbybay.com"},"author":"victoria","title":"friday finds.","description":"yay! it’s the weekend and the sun is out, but not too hot if you know what i mean (fellow Angelenos will feel me here). i’m planning on a little reading in my cowboy pool — ’tis already time for that around these parts. it’s also the long beach flea market th…","url":"https://www.sfgirlbybay.com/2019/04/19/friday-finds-206/","urlToImage":"http://www.sfgirlbybay.com/wp-content/uploads/2019/04/ff111-575x714.jpg","publishedAt":"2019-04-19T16:30:50Z","content":"yay! it’s the weekend and the sun is out, but not too hot if you know what i mean (fellow Angelenos will feel me here). i’m planning on a little reading in my cowboy pool — ’tis already time for that around these parts. it’s also the long beach flea market th… [+2164 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Frank Dale","title":"Freshmen Democrats lead the way on Trump impeachment talk following Mueller report","description":"Freshman Democrats are leading the charge on impeachment talks following the release of special counsel Robert Mueller’s redacted report on Russian interference in the 2016 U.S. election. The response is in contrast with high-ranking Democrats in the House, w…","url":"https://thinkprogress.org/donald-trump-impeachment-house-democrats-robert-mueller-report-a87f28340d60/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/DonaldTrumpImpeachmentHouseDemocratsRobertMuellerReportAlexandriaOcasioCortezRashidaTlaibAyannaPressleyIlhanOmar.jpg?w=1024&h=775&crop=1","publishedAt":"2019-04-19T16:51:13Z","content":"Freshman Democrats are leading the charge on impeachment talks following the release of special counsel Robert Mueller’s redacted report on Russian interference in the 2016 U.S. election.\r\nThe response is in contrast with high-ranking Democrats in the House, … [+3840 chars]"}]}