{"status":"ok","totalResults":572,"articles":[{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"KAREN ZRAICK","title":"2 Virginia Police Officers Are Fired Amid Allegations of Links to White Nationalists","description":"The actions came after online reports by an anti-fascist organization prompted investigations.","url":"https://www.nytimes.com/2019/04/18/us/white-nationalists-virginia-police.html","urlToImage":"https://static01.nyt.com/images/2019/04/18/us/18xp-virginia/07xp-vacop-facebookJumbo.jpg","publishedAt":"2019-04-19T03:29:26Z","content":"Sergeant Stamm was suspended after the group published its post. On Wednesday, Col. Anthony S. Pike, the Capitol Police chief, announced in a statement that Sergeant Stamm had been separated from his employment. He did not explain what had led to the firing.\r… [+892 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Sasha Lekach","title":"Audi's connected car feature barely helped me catch more green lights","description":"Audi's Green Light Optimized Speed Advisory (GLOSA) feature $199 for 6 months; $499 for 18 months; First 6 months free. View Product The Good Easy to toggle on and it seamlessly shows up on your display • Can pace you through most of the connected intersectio…","url":"https://mashable.com/review/audi-connected-car-green-light-optimized-speed-advisory/","urlToImage":"https://mondrian.mashable.com/2019%252F04%252F18%252F0a%252Ff580adaa6c2d4df6bc6f228f2ade1969.9e829.png%252F1200x630.png?signature=iewLKf4zp-EIcfz5vhE1vP2oTpU=","publishedAt":"2019-04-19T11:00:00Z","content":"Stopping at red lights can be super annoying when you're trying to get  somewhere fast but lucky for everyone, Audi may have come up with a solution. \r\nAudi released an update to its vehicle's \"smart\" dashboard earlier this year that connects with city infras… [+7050 chars]"},{"source":{"id":null,"name":"Cp24.com"},"author":"The Associated Press","title":"Private cargo ship brings Easter feast to the space station - CP24 Toronto's Breaking News","description":"Private cargo ship brings Easter feast to the space station CP24 Toronto's Breaking News A private cargo ship brought food galore to the International Space Station on Friday. View full coverage on Google News","url":"https://www.cp24.com/world/private-cargo-ship-brings-easter-feast-to-the-space-station-1.4386870","urlToImage":"https://www.cp24.com/polopoly_fs/1.4386871.1555671159!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","publishedAt":"2019-04-19T10:53:00Z","content":"CAPE CANAVERAL, Fla. -- A private cargo ship brought food galore to the International Space Station on Friday.\r\nSpace station astronaut Anne McClain used a robot arm to capture Northrop Grumman's Cygnus capsule as they soared 258 miles (415 kilometres) above … [+1324 chars]"},{"source":{"id":null,"name":"Ctvnews.ca"},"author":"Marcia Dunn","title":"Private cargo ship brings Easter feast to the space station - CTV News","description":"Private cargo ship brings Easter feast to the space station CTV News A private cargo ship brought the makings of an Easter feast to the International Space Station on Friday, along with mice and little flying robots. View full coverage on Google News","url":"https://www.ctvnews.ca/sci-tech/private-cargo-ship-brings-easter-feast-to-the-space-station-1.4386915","urlToImage":"https://www.ctvnews.ca/polopoly_fs/1.4386940.1555678775!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","publishedAt":"2019-04-19T13:00:00Z","content":"CAPE CANAVERAL, Fla. -- A private cargo ship brought the makings of an Easter feast to the International Space Station on Friday, along with mice and little flying robots.\r\nSpace station astronaut Anne McClain used a robot arm to capture Northrop Grumman's Cy… [+1855 chars]"},{"source":{"id":null,"name":"Globalnews.ca"},"author":null,"title":"NASA sends bison chili and other Canadian treats to David Saint-Jacques space in time for Easter - Global News","description":"NASA sends bison chili and other Canadian treats to David Saint-Jacques space in time for Easter Global News A private cargo ship brought the makings of an Easter feast - as well as some Canadian-made treats - to the International Space Station on Friday, alo…","url":"https://globalnews.ca/news/5185160/nasa-bison-chili-canadian-treats-david-saint-jacques/","urlToImage":"https://shawglobalnews.files.wordpress.com/2019/04/befunky-collage-4.png?w=720&h=379&crop=1","publishedAt":"2019-04-19T17:48:00Z","content":"A private cargo ship brought the makings of an Easter feast – as well as some Canadian-made treats – to the International Space Station on Friday, along with mice and little flying robots.\r\nAmerican astronaut Anne McClain and Canada’s David Saint-Jacques used… [+2319 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Xeni Jardin","title":"Thief sucked used Burger King grease into 1,600 gallon truck container to resell for biofuel","description":"Guess used Burger King grease is the new copper wires nowadays. The Associated Press social media editor who composed this little beauty below deserves some kind of a prize today. A whopper of a haul: Police say a Virginia man stole hundreds of gallons of use…","url":"https://boingboing.net/2019/04/19/thief-caught-sucking-used-burg.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/thieves.jpg","publishedAt":"2019-04-19T18:27:54Z","content":"Guess used Burger King grease is the new copper wires nowadays.\r\nThe Associated Press social media editor who composed this little beauty below deserves some kind of a prize today.\r\nA whopper of a haul: Police say a Virginia man stole hundreds of gallons of u… [+3520 chars]"},{"source":{"id":"time","name":"Time"},"author":"Katie Reilly","title":"He Was a New Teacher at Columbine During the Shooting 20 Years Ago. Here’s Why He Never Left.","description":"Columbine High School teacher Kiki Leyba remembers April 20, 1999 as a day of two life-altering extremes. He was a first-year Columbine teacher meeting with then-Principal Frank DeAngelis, who had just offered him a contract to continue teaching at the school…","url":"http://time.com/5572586/columbine-shooting-20th-anniversary-teacher/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/columbine-anniversary-02.jpg?quality=85","publishedAt":"2019-04-19T16:49:20Z","content":"Columbine High School teacher Kiki Leyba remembers April 20, 1999 as a day of two life-altering extremes. He was a first-year Columbine teacher meeting with then-Principal Frank DeAngelis, who had just offered him a contract to continue teaching at the school… [+7835 chars]"},{"source":{"id":"time","name":"Time"},"author":"Lily Rothman","title":"What a Watergate Expert Thinks of the Mueller Report","description":"\"I was just struck by how many echoes there were,\" Nixon historian Ken Hughes tells TIME","url":"http://time.com/5574419/mueller-report-nixon-history/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/mueller.jpeg?quality=85","publishedAt":"2019-04-19T21:33:24Z","content":"The release on Thursday of a redacted version of Robert Mueller’s full report on the Russia probe represents a major moment in the history of special counsels in the United States — but no use of that office looms as large in the American imagination as the i… [+7959 chars]"},{"source":{"id":"time","name":"Time"},"author":"Olivia B. Waxman","title":"The Surprising Link Between U.S. Marijuana Law and the History of Immigration","description":"As April 20 brings calls for marijuana legalization, experts explain what people get wrong about U.S. drug policy and immigration.","url":"http://time.com/5572691/420-marijuana-mexican-immigration/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/weed.jpeg?quality=85","publishedAt":"2019-04-19T20:20:44Z","content":"Whenever April 20 rolls around, as enthusiasts mark the 420 date by celebrating “Weed Day,” there are always calls for the U.S. federal government to legalize the recreational use of marijuana.\r\nBut the debate over marijuana’s legality in the United States ha… [+9120 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Sabrina Ionescu, Oregon lead Way-Too-Early Top 25 for 2019-20","description":"Oregon is one of three Pac-12 teams in the top six. Reigning NCAA champion Baylor checks in at No. 2, and UConn starts out at No. 7.","url":"http://www.espn.com/womens-college-basketball/story/_/id/26556334/sabrina-ionescu-oregon-lead-way-too-early-top-25-2019-20","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0405%2Fr525039_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T02:06:34Z","content":"Growing parity was the overarching theme of 2018-19 in women's college basketball. Next season could see even more balance. Oregon will be a favorite to return to the Final Four and Baylor should have a chance to defend its national championship, but everythi… [+14638 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Andy Campbell","title":"Virginia Officers Fired Over Ties To White Supremacist Groups","description":"Virginia Capitol Police Sgt. Robert A. Stamm and school resource officer Daniel Morley lost their jobs after anti-fascists connected them to racist groups.","url":"https://www.huffpost.com/entry/virginia-officers-fired-white-supremacist-groups_n_5cb9fc5be4b032e7ceb7f854","urlToImage":"https://img.huffingtonpost.com/asset/5c91015a200000ed0470fc6d.png?cache=sju5lpfblp&ops=1910_1000","publishedAt":"2019-04-19T18:33:15Z","content":"Two Virginia police officers have been fired over their ties to white supremacist groups.\r\nIn separate incidents, anti-fascist organizations revealed that Virginia Capitol Police Sgt. Robert A. Stamm and Daniel Morley, a school resource officer with the Chest… [+1773 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"AP","title":"Joe Biden Expected To Announce 2020 Campaign Next Week","description":"The former vice president has been teasing a presidential run for months.","url":"https://www.huffpost.com/entry/joe-biden-2020_n_5cb9c8dbe4b068d795cbb356","urlToImage":"https://img.huffingtonpost.com/asset/5cb9c95024000080094f6e47.jpeg?cache=tlsvttuvaa&ops=1910_1000","publishedAt":"2019-04-19T13:34:21Z","content":"WASHINGTON (AP) Former Vice President Joe Biden is expected to join the crowded 2020 Democratic presidential next week.\r\nThe decision answers one of the most significant outstanding questions of the early presidential primary season, which has already seen an… [+2921 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Max Golembo","title":"Severe weather outbreak hits East Coast just before long weekend","description":"Over the last two days, 18 tornadoes have been reported over five states.","url":"https://abcnews.go.com/US/severe-weather-outbreak-hits-east-coast-long-weekend/story?id=62503531","urlToImage":"https://s.abcnews.com/images/US/weather-2-ap-er-190414_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T10:29:55Z","content":"The major storm is moving east, leaving in its wake at least 18 tornadoes and more than 300 damaging storm reports over two days in five states, as the East Coast braces for severe weather.\r\nNine of those tornadoes, reported yesterday, were in Texas, Oklahoma… [+713 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"The 11 mass deadly school shootings that happened since Columbine","description":"The images of teenagers running from their school with their hands up – as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight.","url":"https://abcnews.go.com/US/11-mass-deadly-school-shootings-happened-columbine/story?id=62494128","urlToImage":"https://s.abcnews.com/images/US/GTY_columbine_jtm_141007_hpMain_5_16x9_992.jpg","publishedAt":"2019-04-19T13:46:35Z","content":"The images of teenagers running from their school with their hands up as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight at subsequent school shootings.\r\nAnd for many, including eventual school shooters, there was so… [+9433 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Editors, USA TODAY","title":"Good Friday, Passover, New York International Auto Show: 5 things to know Friday","description":"Good Friday and the start of Passover, the New York International Auto Show opens to the public and more things to start your Friday morning.","url":"https://www.usatoday.com/story/news/2019/04/19/good-friday-passover-new-york-international-auto-show/3490392002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/47cf4bae-c9c4-44e0-a778-e3f58b7b602c-EPA_EAST_TIMOR_BELIEF_GOOD_FRIDAY.JPG?crop=4623,2600,x0,y56&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T07:50:18Z","content":"Good Friday and start of Passover\r\nGood Friday, the Christian holiday that remembers the date of Jesus Christ's crucifixion, and the start of Passover, a nearly week-long commemoration of the Jews liberation from slavery, both take place Friday. Although it's… [+3853 chars]"},{"source":{"id":null,"name":"Cincinnati.com"},"author":"Cincinnati Enquirer, Terry DeMio, Cincinnati Enquirer","title":"Federal opioid pill bust reveals doctors trading pills for sex, dentists pulling good teeth","description":"They're all accused of illegally prescribing pain meds, but charges against these medical professionals are the most shocking from this week's sweep.","url":"https://www.cincinnati.com/story/news/2019/04/19/opioid-pain-pill-investigation-most-shocking-cases-ohio-kentucky-tennessee-alabama/3518191002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PCIN/cbc673ee-577b-4d26-b54e-fde6993d0db8-morepain..jpg?crop=399,224,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T21:35:12Z","content":"CINCINNATI - They were medical professionals but they traded prescription pain pills for sex, prosecutors say. Others let untrained office workers examine patients, leaving a blank prescription pad at the clinic, their indictments reveal. \r\nOne dentist extrac… [+6513 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Kevin Johnson and Kristine Phillips, USA TODAY","title":"Attorney General William Barr faces a political firestorm after release of the Mueller report","description":"President Trump's new attorney general is facing sharp criticism for his handling of the release of the special counsel's final Trump-Russia report.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/ag-barr-center-political-firestorm-after-mueller-report-release/3519319002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/cf826d86-cbff-4719-abbf-66f84a0aef73-EPA_epaselect_USA_TRUMP_MUELLER_REPORT.jpg?crop=5122,2881,x0,y289&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T20:50:05Z","content":"Attorney General Barr announced that the special counsel found that while Russia interfered in the 2016 election, there was \"no collusion\" by Trump.\r\n USA TODAY\r\nWASHINGTON  William Barr knew that he was stepping into a firestorm when he accepted President Do… [+10078 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Elaine Godfrey","title":"The Atlantic Politics & Policy Daily: Ready, Set, Joe","description":"Former Vice President Joe Biden is running (it's his third attempt). Plus: The real immigration crisis isn't asylum seekers on the southern border.","url":"https://www.theatlantic.com/politics/archive/2019/04/joe-biden-running-president-politics-daily/587632/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/AP_19108753486252/facebook.jpg?1555707774","publishedAt":"2019-04-19T21:28:37Z","content":"What We’re Following Today It’s Friday, April 19. (Michael Dwyer / AP) Done Biden His Time: Former Vice President Joe Biden is running for president, reports Edward-Isaac Dovere. He’ll make it official with a video next week. But the campaign is still making … [+3845 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Edward-Isaac Dovere","title":"Joe Biden Is Running for President","description":"The former vice president has finally decided he’s in, and he’s announcing in less than a week. Now he just has to finish putting a campaign together.","url":"https://www.theatlantic.com/politics/archive/2019/04/joe-biden-running-president/587560/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/Biden-1/facebook.jpg?1555645846","publishedAt":"2019-04-19T09:00:00Z","content":"Joe Biden is running. The former vice president will make his candidacy official with a video announcement next Wednesday, according to people familiar with the discussions who have been told about them by top aides. Seriously, he’s actually made a decision. … [+6732 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Annika Neklason","title":"The Columbine Blueprint","description":"As the first school shooting to become a nationwide media spectacle, Columbine shaped a generation of mass-consumed tragedies.","url":"https://www.theatlantic.com/education/archive/2019/04/columbines-20th-anniversary-mass-media-shooting/587359/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/Columbine-1/facebook.jpg?1555691753","publishedAt":"2019-04-19T16:43:52Z","content":"On that day two decades ago, news spread from Columbine quickly, and widely. By the time the killers concluded their shooting spree by turning their guns on themselves, less than an hour after firing their first shots, the attack had already become a media ev… [+12561 chars]"},{"source":{"id":null,"name":"Calculatedriskblog.com"},"author":"Calculated Risk","title":"BLS: Unemployment Rates at New Series Lows in North Dakota, Kentucky, Pennsylvania and Vermont","description":"From the BLS: Regional and State Employment and Unemployment Summary   Unemployment rates were lower in March in 6 states, higher in 3 state...","url":"https://www.calculatedriskblog.com/2019/04/bls-unemployment-rates-at-new-series.html","urlToImage":"https://4.bp.blogspot.com/-Dpmc305I3_E/XLnW4DMdI3I/AAAAAAAAx04/adAre6v8PuYjs5zGNH_kLYTAKTPDez7ewCLcBGAs/w1200-h630-p-k-no-nu/StateUnemployMar2019.PNG","publishedAt":"2019-04-19T14:11:00Z","content":"From the BLS: Regional and State Employment and Unemployment Summary\r\nUnemployment rates were lower in March in 6 states, higher in 3 states, and stable in 41 states and the District of Columbia, the U.S. Bureau of Labor Statistics reported today.... North Da… [+855 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller report: ‘Beyond implausible’ Trump team was unaware of Russian election interference, says legal expert","description":"With the release of the Mueller investigation on Thursday, albeit in lightly redacted form, there are now as many questions as there are answers.And while the investigation did not find evidence the Trump campaign colluded with Russia, it uncovered “multiple …","url":"https://news.yahoo.com/mueller-report-beyond-implausible-trump-073022320.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/0nBigqb22AjfUhK9drg9ng--~B/aD01Mzk7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/6579c2e6826493d355a596be5235bad9","publishedAt":"2019-04-19T07:30:22Z","content":"With the release of the Mueller investigation on Thursday, albeit in lightly redacted form, there are now as many questions as there are answers.\r\nAnd while the investigation did not find evidence the Trump campaign colluded with Russia, it uncovered multiple… [+8813 chars]"},{"source":{"id":null,"name":"Sciencedaily.com"},"author":null,"title":"Continuing impacts of Deepwater Horizon oil spill","description":"Nine years ago tomorrow -- April 20, 2010 -- crude oil began leaking from the Deepwater Horizon drilling rig into the Gulf of Mexico in what turned out to be the largest marine oil spill in history. A long-term study suggests the oil is still affecting the sa…","url":"https://www.sciencedaily.com/releases/2019/04/190419165528.htm","urlToImage":null,"publishedAt":"2019-04-19T20:55:28Z","content":"Nine years ago tomorrow -- April 20, 2010 -- crude oil began leaking from the Deepwater Horizon drilling rig into the Gulf of Mexico in what turned out to be the largest marine oil spill in history. A long-term study suggests the oil is still affecting the sa… [+5673 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Hanneke Weitering","title":"Make Your Own Gravitational Waves with 'BlackHoles@Home'","description":"Scientists want your help studying black holes — and you can do it from your own home!","url":"https://www.space.com/black-holes-at-home-gravitational-wave-simulations.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/VG6xVcisPgtg2a5meKBLgb-1200-80.jpg","publishedAt":"2019-04-19T11:00:03Z","content":"Scientists want your help studying black holes — and you can do it from your own home!\r\nWhen black holes collide, they disrupt the fabric of space-time and send ripples through the cosmos known as gravitational waves\r\n. By measuring those waves, scientists ca… [+3420 chars]"},{"source":{"id":null,"name":"Torrentfreak.com"},"author":"Ernesto","title":"EFF Backs Stream Rippers in Legal Battle Against Record Labels","description":"Digital rights group EFF has filed a brief in support of the stream-ripping sites FLVTO.biz and 2conv.com. The sites are involved in a legal battle with several record labels and appealed a district court decision to dismiss the case over a lack of jurisdicti…","url":"https://torrentfreak.com/eff-backs-stream-rippers-in-legal-battle-against-record-labels-190419/","urlToImage":"https://torrentfreak.com/images/court2-featured.jpg","publishedAt":"2019-04-19T16:06:27Z","content":"Digital rights group EFF has filed a brief in support of the stream-ripping sites FLVTO.biz and 2conv.com. The sites are involved in a legal battle with several record labels and appealed a district court decision to dismiss the case over a lack of jurisdicti… [+4548 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Chelsea Gohd","title":"Cygnus Cargo Spaceship Makes Easter Delivery to International Space Station","description":"This morning, Northrop Grumman Corp's Cygnus spacecraft arrived at the International Space Station to drop off thousands of pounds of cargo for the crew.","url":"https://www.space.com/cygnus-spacecraft-easter-cargo-delivery.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/28m2SXTvJE3ux9TyJDgEaf-1200-80.png","publishedAt":"2019-04-19T11:42:29Z","content":"This morning, astronauts on the International Space Station successfully grappled Northrop Grumman Corp.'s Cygnus spacecraft with the station's robotic arm, snagging 7,600 lbs (3,447 kilograms) of cargo, just in time for Easter. \r\nOn April 17, the spacecraft … [+2679 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Joe Rao","title":"April's Lyrid Meteors Peak Early this Week, But the Moon May Interfere","description":"One of the oldest known annual meteor showers, peaking early this week, may unfortunately be hindered by an almost-full moon.","url":"https://www.space.com/moonlit-lyrids-peak-this-weekend.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/5cdM7hbqDBsJUWM4MYNCei-1200-80.jpg","publishedAt":"2019-04-19T15:00:01Z","content":"One of the oldest known annual meteor showers, peaking early this week, may unfortunately be hindered by an almost-full moon.\r\nThe moon reaches full phase during the overnight hours of April 18-19, so many will likely dismiss this year's performance of the Ly… [+4853 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"bschreckinger@politico.com (Ben Schreckinger)","title":"Inside Trump's years-long campaign to stymie the Russia investigation","description":"Over more than two years, Trump tried to pressure law enforcement officials, back-channel to witnesses and deter inquiries into his murky relationship with Russia.","url":"https://www.politico.com/story/2019/04/19/trump-stymie-russia-investigation-1282652","urlToImage":"https://static.politico.com/d2/0f/8b1f7ed343a69bc7d918dd22a165/190418-donald-trump-flags-ap-773.jpg","publishedAt":"2019-04-19T05:16:33Z","content":"President Donald Trump | Andrew Harnik/AP Photo\r\nIn the summer of 2016, not long after WikiLeaks began releasing damaging material hacked by the Russian government from the servers of the Democratic National Committee, candidate Donald Trump was traveling to … [+20980 chars]"},{"source":{"id":null,"name":"Stereogum.com"},"author":"Chris DeVille","title":"Nicole Yun – “Tommie” & “Supernatural Babe”","description":"You may have heard Nicole Yun's voice out front of Eternal Summers, the dreamy Virginia indie rock combo that bequeathed us quite a few enjoyable records over the past decade. She'll soon release her debut solo album Paper Suit -- recorded with pals including…","url":"https://www.stereogum.com/2040529/nicole-yun-eternal-summers-tommie-supernatural-babe/music/","urlToImage":"https://static.stereogum.com/uploads/2019/04/Nicole-Yun-Paper-Suit-1555693384-608x608.jpg","publishedAt":"2019-04-19T17:13:26Z","content":"You may have heard Nicole Yun’s voice out front of Eternal Summers, the dreamy Virginia indie rock combo that bequeathed us quite a few enjoyable records over the past decade. She’ll soon release her debut solo album Paper Suit — recorded with pals including … [+722 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"The MMQB Staff","title":"2019 NFL Draft Position Rankings: Quarterbacks","description":"The four first-round candidates are followed by some interesting second-tier passers in the class of 2019.","url":"https://www.si.com/nfl/2019/04/17/draft-position-rankings-quarterbacks-kyler-murray-drew-lock-daniel-jones-dwayne-haskins","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/17/2019-nfl-draft-qb-rankings.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:02:12Z","content":"1. Kyler Murray, Oklahoma (Overall Rank: 9)Height: 5' 1018\" | Weight: 207 poundsMurray is an electrifying talent, breathtaking with the ball in his hands but also a strong-armed, cerebral passer who was able to negotiate throwing lanes within the pocket at th… [+7404 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Caleb Friedman","title":"Spring Game Guide: What to Watch as Georgia, Oregon and More Wrap Up Practice","description":"With Georgia and Oregon in action this weekend, here's what to watch as the last few playoff hopefuls wind down spring practice.","url":"https://www.si.com/college-football/2019/04/19/spring-game-guide-georgia-miami-oregon-ucla","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/jake-fromm-college-football-spring-game-schedule-uga-ucla.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:49:32Z","content":"The spring football season is coming to a close. Most programs have wrapped up spring practice, but there are still a few notable exhibition games left in the final two weekends of April. You cant learn everything about a team from its spring game, but you ca… [+5726 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"David Malmquist","title":"Study shows continuing impacts of Deepwater Horizon oil spill","description":"Nine years ago tomorrow—April 20, 2010—crude oil began leaking from the Deepwater Horizon drilling rig into the Gulf of Mexico in what turned out to be the largest marine oil spill in history. A long-term study suggests the oil is still affecting the salt mar…","url":"https://phys.org/news/2019-04-impacts-deepwater-horizon-oil.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/studyshowsco.jpg","publishedAt":"2019-04-19T19:48:13Z","content":"Nine years ago tomorrowApril 20, 2010crude oil began leaking from the Deepwater Horizon drilling rig into the Gulf of Mexico in what turned out to be the largest marine oil spill in history. A long-term study suggests the oil is still affecting the salt marsh… [+6231 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Rachel M. Cohen","title":"House Majority Leader Steny Hoyer Is Facing a Primary Challenge","description":"“I honestly don’t think in this environment anyone is safe, and certainly not Congressman Hoyer.” The post House Majority Leader Steny Hoyer Is Facing a Primary Challenge appeared first on The Intercept.","url":"https://theintercept.com/2019/04/19/steny-hoyer-primary-challenger/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/hoyer-wilkes-1555692376.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-19T16:51:42Z","content":"Mckayla Wilkes,\r\n a 28-year-old administrative assistant, part-time student, and mother of two, has had enough. In late March, she announced that she was mounting a bid for Marylands 5th Congressional District, aiming to unseat one of the oldest and most powe… [+10973 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Why it's so hard for some Americans to get high-speed internet","description":"Many Americans outside of cities can't get access to high-speed internet.","url":"https://finance.yahoo.com/news/american-broadband-internet-163409850.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/6WfZ0XoA8H2cxW975sKHiQ--~B/aD0zMDAwO3c9NDQ2MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5cb8ddd82300008903ea221f.jpeg","publishedAt":"2019-04-19T16:34:09Z","content":"The Federal Communications Commissions broadband map says Sharon Township, Mich., has a decent selection of choices for high-speed internet access. But people who live in that rural area, only half an hours drive west of Ann Arbor, disagree.\r\nWhere the FCC ma… [+6076 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Amanda Michelle Gomez","title":"Why are Republicans across the country pushing back against vaccine bills?","description":"In response to Washington state’s worst measles outbreak in more than two decades — 74 people have been infected so far — the state legislature moved to pass legislation to make it harder for parents to opt out of vaccinating their kids. The bill ultimately p…","url":"https://thinkprogress.org/republicans-across-the-country-push-back-against-vaccine-bills-amid-measles-outbreak-037e64253d49/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1135360291.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-19T17:05:03Z","content":"In response to Washington state’s worst measles outbreak in more than two decades — 74 people have been infected so far — the state legislature moved to pass legislation to make it harder for parents to opt out of vaccinating their kids. The bill ultimately p… [+5401 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"E.A. Crunden","title":"2020 Democratic contenders seize on opposition to offshore drilling in South Carolina","description":"Democratic presidential contenders are taking note of swelling opposition to offshore drilling in the Southeast, especially in the early primary state of South Carolina, where lawmakers are working to head off federal drilling efforts. The issue is emerging a…","url":"https://thinkprogress.org/offshore-drilling-warren-2020-south-carolina-trump-3cd0f9640132/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1133048933.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-19T17:08:41Z","content":"Democratic presidential contenders are taking note of swelling opposition to offshore drilling in the Southeast, especially in the early primary state of South Carolina, where lawmakers are working to head off federal drilling efforts.\r\nThe issue is emerging … [+6375 chars]"},{"source":{"id":null,"name":"Fivethirtyeight.com"},"author":"Adam Kelsey and Will Steakin, Adam Kelsey https://fivethirtyeight.com/contributors/adam-kelsey/ Adam.M.Kelsey@abc.com","title":"What The Potential 2020 Candidates Are Doing And Saying, Vol. 15","description":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 — Democrats and even some Republicans — we’re keeping tabs on the field as it develops. Each week, we’ll run…","url":"https://fivethirtyeight.com/features/what-the-potential-2020-candidates-are-doing-and-saying-vol-15/","urlToImage":"https://fivethirtyeight.com/wp-content/uploads/2019/04/2020roundup-0419-16x9.png?w=1600","publishedAt":"2019-04-19T09:59:29Z","content":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 Democrats and even some Republicans were keeping tabs on the field as it develops. Each week, well run throu… [+15151 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Sharon Lerner","title":"Starbucks Promised a Recyclable Drink Lid. Don’t Believe the Hype.","description":"The new Starbucks lid was supposed be a great green environmental milestone. But it’s very unlikely to be recycled. The post Starbucks Promised a Recyclable Drink Lid. Don’t Believe the Hype. appeared first on The Intercept.","url":"https://theintercept.com/2019/04/19/starbucks-plastic-lids-recyclable/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/GettyImages-994954600-crop-1555623334.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-19T13:42:43Z","content":"The new Starbucks\r\n coffee cup lid, which is being rolled out with great green fanfare in six cities this summer, was supposed be an environmental milestone. Starbucks promised that its latest design innovation, a clear, recyclable plastic drink cap that funn… [+4748 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Lou Whiteman)","title":"The Navy's Most Expensive New Ship Program Might Cost Even More Than Anticipated","description":"The GAO is poking holes in the Pentagon's estimates. What does that mean for the contractors banking on this program for growth?","url":"https://www.fool.com/investing/2019/04/19/the-navys-most-expensive-new-ship-program-might-co.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519029/gd-virginia-class-sub-at-electric-boat-ct-source-gd.jpg","publishedAt":"2019-04-19T16:17:00Z","content":"The forthcoming Columbia-class ballistic missile submarine, a key cog in the U.S. military's nuclear deterrence strategy and the nation's most expensive shipbuilding program to date, is likely to come in well over its $115 billion total construction budget, a… [+6313 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Eagle Bancorp Inc (EGBN) Q1 2019 Earnings Call Transcript","description":"EGBN earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/18/eagle-bancorp-inc-egbn-q1-2019-earnings-call-trans.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519699/featured-transcript-logo.png","publishedAt":"2019-04-19T01:19:17Z","content":"Image source: The Motley Fool.\r\nEagle Bancorp Inc  (NASDAQ:EGBN)Q1 2019 Earnings CallApril 18, 2019, 12:00 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood day, ladies and gentlemen, and welcome… [+40978 chars]"},{"source":{"id":null,"name":"Filmschoolrejects.com"},"author":"Christopher Campbell","title":"The Legacy of Terrence Malick’s ‘Badlands’","description":"The movies, music, books, and other things we wouldn't have if not for Terrence Malick's debut. The post The Legacy of Terrence Malick’s ‘Badlands’ appeared first on Film School Rejects.","url":"https://filmschoolrejects.com/badlands/","urlToImage":"https://filmschoolrejects.com/wp-content/uploads/2019/04/badlands.jpg","publishedAt":"2019-04-19T12:00:13Z","content":"In the summer of 1972, following a rough start as a screenwriter in Hollywood, Terrence Malick went into production on his low-budget first feature as a director, Badlands. The independently financed film stars Sissy Spacek and Martin Sheen as young lovers tu… [+7402 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Alexia Fernandez","title":"Suri Cruise is 13! Katie Holmes Treats Daughter to Dinner with Friends for Her Birthday","description":"How time flies! Katie Holmes’s daughter Suri celebrated her 13th birthday among friends at a special, low-key dinner Thursday night in New York City. The mother and daughter duo stepped out together in coats and were joined by two of Suri’s friends, according…","url":"https://people.com/movies/suri-cruise-13th-birthday-dinner-katie-holmes/","urlToImage":"https://peopledotcom.files.wordpress.com/2018/07/suri.jpeg?crop=8px%2C82px%2C2602px%2C1366px&resize=1200%2C630","publishedAt":"2019-04-19T18:24:13Z","content":"How time flies!\r\nKatie Holmes’s daughter Suri celebrated her 13th birthday among friends at a special, low-key dinner Thursday night in New York City.\r\nThe mother and daughter duo stepped out together in coats and were joined by two of Suris friends, accordin… [+1104 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Jordan Runtagh","title":"Pro Sports Teams Drop Kate Smith’s Version of ‘God Bless America’ After Racist Songs Resurface","description":"Kate Smith’s rendition of “God Bless America” has heralded the start of sporting events for generations, but now many professional teams are putting an end to the tradition after controversial songs have surfaced from the singer’s past. Both the MLB’s New Yor…","url":"https://people.com/music/kate-smith-god-bless-america-dropped-sports-teams-racist-songs/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/kate-smith.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630","publishedAt":"2019-04-19T17:15:27Z","content":"Kate Smith’s rendition of “God Bless America” has heralded the start of sporting events for generations, but now many professional teams are putting an end to the tradition after controversial songs have surfaced from the singer’s past.\r\nBoth the MLB’s New Yo… [+2221 chars]"},{"source":{"id":null,"name":"Putthison.com"},"author":"Pete Anderson","title":"Everyday American Style: 1970s Inspiration Via Documerica","description":"Denim jackets, Chucks, and pool cues go together like teenagers and delinquency. Robert Johnson in coal-mining town of Clothier, West... The post Everyday American Style: 1970s Inspiration Via Documerica appeared first on Put This On.","url":"https://putthison.com/everyday-american-style-1970s-inspiration-via-documerica/","urlToImage":"https://putthison.com/wp-content/uploads/2019/04/lee-jacket-1972.jpg","publishedAt":"2019-04-19T03:21:12Z","content":"Denim jackets, Chucks, and pool cues go together like teenagers and delinquency. Robert Johnson in coal-mining town of Clothier, West Virginia, 1974; from the Documerica project.\r\nOur collective understanding of the aesthetics of an era — how people looked, h… [+3772 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Yves Smith","title":"Making American Schools Less Great Again","description":"An on-the-ground report from a teacher in Beverton on how the war on schools' funding is leading teachers to strike.","url":"https://www.nakedcapitalism.com/2019/04/making-american-schools-less-great-again.html","urlToImage":"http://www.tomdispatch.com/images/managed/everybody_gologorsky.jpg","publishedAt":"2019-04-19T04:58:26Z","content":"Yves here. This is a personal vignette about setting up government for failure. A teacher describes how budget cuts to schools in her district produced predictable results: overcrowded classrooms, diminished attention to students, particularly ones who would … [+13446 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Kenny Gould, Contributor, Kenny Gould, Contributor https://www.forbes.com/sites/kennygould/","title":"The Nine Dankest Beers To Enjoy On 4/20","description":"Beer and weed... strange bedfellows or a match made in heaven?","url":"https://www.forbes.com/sites/kennygould/2019/04/19/cannabis-weed-beer/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkennygould%2Ffiles%2F2019%2F04%2FGreat-Notion-Lead-1200x804.jpg","publishedAt":"2019-04-19T12:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nDouble Stack from Great Notion in Portland, Oregon.\r\nPhoto by John Paradiso for @hopculturemag\r\nAlthough the IPA craze that has consumed the beer industry over the last two years is still going strong, e… [+11134 chars]"},{"source":{"id":null,"name":"Slashgear.com"},"author":"Chris Burns","title":"NASA finally launched bees into space","description":"Robotic bees, oh god! This is just like that time Homer Simpson brought a bag of chips on a space flight and crashed into an ant farm! Actually it’s not quite that intense – but it’s nearly that entertaining. What we’re looking at today is a pair of what NASA…","url":"https://www.slashgear.com/nasa-sent-astrobees-to-international-space-station-iss-19574181/","urlToImage":"https://edge.slashgear.com/wp-content/uploads/2019/04/beeflier.jpg","publishedAt":"2019-04-19T18:02:15Z","content":"Robotic bees, oh god! This is just like that time Homer Simpson brought a bag of chips on a space flight and crashed into an ant farm! Actually it’s not quite that intense – but it’s nearly that entertaining. What we’re looking at today is a pair of what NASA… [+2395 chars]"},{"source":{"id":null,"name":"Wbaltv.com"},"author":null,"title":"Tornado watch in effect in Maryland - WBAL TV Baltimore","description":"Tornado watch in effect in Maryland WBAL TV Baltimore Tornado watch issued for southwest, central Virginia WSLS 10 Virginia family finds American flag still flying in tornado wreckage WTVR CBS 6 News Tornado warning issued for western York County as storm bar…","url":"https://www.wbaltv.com/article/severe-storms-maryland-weather-april-19/27206229","urlToImage":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/tornado-watch-1555692685.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*","publishedAt":"2019-04-19T18:38:00Z","content":"BALTIMORE —Maryland is under an elevated risk for severe storms Friday with a tornado watch in effect until midnight.\r\nGet Alerts | Radar | Forecast\r\nAs of 2 p.m., storms in Virginia and Maryland were moving north-northeast at about 30 mph. They will produce … [+946 chars]"},{"source":{"id":null,"name":"Wvmetronews.com"},"author":"Jeff Jenkins","title":"Californian parents sentenced to life in prison after neglect children - WV MetroNews - West Virginia MetroNews","description":"Californian parents sentenced to life in prison after neglect children - WV MetroNews West Virginia MetroNews Couple Who Tortured 12 Children in Their California Home Are Sentenced to Life The New York Times The Turpins are sentenced to 25 years to life in pr…","url":"http://wvmetronews.com/2019/04/19/californian-parents-sentenced-to-life-in-prison-after-neglect-children/","urlToImage":"http://wvmetronews.com/wordpress/wp-content/uploads/2018/01/CaliforniaHostage.jpg","publishedAt":"2019-04-19T23:00:00Z","content":"RIVERSIDE, Calif. Two California parents were sentenced to life in prison after the mistreatment of more than a dozen of their children.\r\nDavid and Louise Turpin pleaded guilty in February to neglect and abuse.\r\nAuthorities discovered the couple had shackled … [+343 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Howard Cohen","title":"Storms are here, Florida drivers, and will be all day. Easter weekend will bring a change - Miami Herald","description":"Storms are here, Florida drivers, and will be all day. Easter weekend will bring a change Miami Herald LIVE: Tornado threat ramps up from Florida to Virginia after storms turn deadly in Deep South AccuWeather.com NC weather: Severe storms expected Friday, tor…","url":"https://www.miamiherald.com/news/local/article229454909.html","urlToImage":"https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557041001/a4876cf7-5e68-4a37-95ce-0319fafec598/ff933b0a-137b-4ae1-9f31-0e2e1c0b4c21/1280x720/match/image.jpg","publishedAt":"2019-04-19T12:06:00Z","content":"Storms are here, Florida drivers, and will be all day. Easter weekend will bring a change\r\n×\r\nEver heard of the term 'supercell' but didn't know what it was? Learn about these powerful storms responsible for most tornadoes in the United States and other thund… [+2607 chars]"},{"source":{"id":null,"name":"Hickoryrecord.com"},"author":"Emily Willis ewillis@hickoryrecord.com","title":"Tornado watch issued for Catawba County; flooding, winds also a concern - Hickory Daily Record","description":"Tornado watch issued for Catawba County; flooding, winds also a concern Hickory Daily Record Storm destroys 2 homes in Franklin County Roanoke Times Tornado watch continues for Upstate, Piedmont, North Carolina as severe storms move through region WYFF News 4…","url":"https://www.hickoryrecord.com/news/tornado-watch-issued-for-catawba-county-flooding-winds-also-a/article_54d5a336-62c2-11e9-ab8f-cbb531b621ad.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/hickoryrecord.com/content/tncms/assets/v3/editorial/5/4d/54d5a336-62c2-11e9-ab8f-cbb531b621ad/5cb9fb9815105.preview.jpg?crop=1678%2C944%2C0%2C145&resize=1120%2C630&order=crop%2Cresize","publishedAt":"2019-04-19T16:43:00Z","content":"The National Weather Service issued a tornado watch for Catawba County and surrounding areas until 5 p.m. today.\r\nScotty Powell, meteorologist with Carolina Weather Group, said damaging winds and flash flooding is the main concern for the Catawba Valley area.… [+480 chars]"},{"source":{"id":null,"name":"Wftv.com"},"author":"Irene Sans","title":"ORLANDO WEATHER: Hail, damaging winds, chance for tornadoes in Central Florida on Friday - WFTV Orlando","description":"ORLANDO WEATHER: Hail, damaging winds, chance for tornadoes in Central Florida on Friday WFTV Orlando LIVE: At least five fatalities confirmed as severe outbreak brings tornadoes, flooding from Florida to Virginia AccuWeather.com Weather NC: Severe storms exp…","url":"https://www.wftv.com/weather/oia-delays-cancellations-severe-threat-ends-for-central-florida-weekend-forecast/941592401","urlToImage":"https://mediaweb.wftv.com/photo/2019/04/19/radar_1555703142161_15064080_ver1.0_640_360.PNG","publishedAt":"2019-04-19T22:41:15Z","content":"ORLANDO, Fla. - After severe storms sweep over Central Florida, weather will continue to improve overnight. Jacket weather for the next few mornings, crisp and sunny afternoons. \r\nDownload our weather app: Receive watches and warning as soon as they are issue… [+6197 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"JOHN BOYER Richmond Times-Dispatch","title":"Severe storms on the way to the Richmond area this evening; tornado watch in effect until midnight - Richmond.com","description":"Severe storms on the way to the Richmond area this evening; tornado watch in effect until midnight Richmond.com LIVE: At least five fatalities confirmed as severe outbreak brings tornadoes, flooding from Florida to Virginia AccuWeather.com The Latest: Mississ…","url":"https://www.richmond.com/weather/storms-will-bring-widespread-heavy-rain-isolated-tornadoes-to-central/article_8b880d5f-bb86-502f-a004-ed6532a9e04c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/0/5e/05e74de6-608d-590a-977c-5bd61fd67476/5cba4d1a2bc22.image.png?resize=920%2C505","publishedAt":"2019-04-19T21:55:00Z","content":"Conditions are favorable for severe storms with damaging winds, brief tornadoes and flash flooding across Virginia this evening.\r\nReview your weather safety plan and be sure you can receive any warnings issued by the National Weather Service.\r\n6:45 p.m. updat… [+2397 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Deadly storms threatening several states - ABC News","description":"A strong storm system barreling through the South on Friday killed an 8-year-old girl in Florida and threatened to bring tornadoes to large parts of the Caro...","url":"https://www.youtube.com/watch?v=Q1MU4uIzHtY","urlToImage":"https://i.ytimg.com/vi/Q1MU4uIzHtY/maxresdefault.jpg","publishedAt":"2019-04-19T23:32:16Z","content":"A strong storm system barreling through the South on Friday killed an 8-year-old girl in Florida and threatened to bring tornadoes to large parts of the Carolinas and Virginia.\r\nWATCH THE FULL EPISODE OF 'WORLD NEWS TONIGHT':https://bit.ly/2KZJAsq\r\nWATCH OTHE… [+108 chars]"},{"source":{"id":null,"name":"Nbc12.com"},"author":"Tamia Mallory","title":"News to know for April 19: Severe storms with damaging winds; School closings and delays; Mail carrier killed - WWBT NBC12 News","description":"News to know for April 19: Severe storms with damaging winds; School closings and delays; Mail carrier killed WWBT NBC12 News LIVE: Rampage of deadly storms continues across Alabama, Florida, Georgia into Friday AccuWeather.com Severe storms expected across N…","url":"http://www.nbc12.com/2019/04/19/news-know-april-severe-storms-with-damaging-winds-school-closings-delays-mail-carrier-killed-crash/","urlToImage":"http://www.nbc12.com/resizer/87YAyNCJ6t6XgjHPSlG9k_-nfMM=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/GQVQO5HETZBSVAOUPZ4FXYQ7N4.JPG","publishedAt":"2019-04-19T10:37:00Z","content":"RICHMOND, VA (WWBT) - Friday is here, and the risk for severe weather in Central Virginia has increased.\r\nPortions of Central Virginia are now in a moderate risk of severe weather.\r\nFriday Forecast: Severe weather threat climbs for the afternoon and evening\r\n… [+1774 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Associated Press","title":"The Latest: Storm topples tree, kills girl in Florida - Fox News","description":"The Latest: Storm topples tree, kills girl in Florida Fox News The Latest on severe weather in the South (all times local): 9:40 a.m.. View full coverage on Google News","url":"https://www.foxnews.com/us/the-latest-storm-topples-tree-kills-girl-in-florida","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-715214aa0f614406ae9be93479029bdb.png","publishedAt":"2019-04-19T13:57:39Z","content":"ATLANTA The Latest on severe weather in the South (all times local):\r\n1:40 p.m.\r\nA storm system moving through the South is being blamed for the death of an 8-year-old girl in Florida.\r\nThe Leon County Sheriff's Office says a tree fell Friday into a house in … [+3995 chars]"},{"source":{"id":null,"name":"Wlos.com"},"author":"WLOS STAFF","title":"Friday Weather Update: Powerful storm system brings heavy rains, thunderstorms - WLOS","description":"The National Weather Service has issued a Tornado Watch for parts ofGeorgia, North Carolina, South Carolina and Virginia until 5 p. m. Friday.  The watch area includesAvery, Burke, McDowell, Polk and Rutherford counties in Western North Carolina.  There is al…","url":"http://wlos.com/news/local/friday-weather-update-powerful-storm-system-brings-heavy-rains-thunderstorms","urlToImage":"http://static-32.sinclairstoryline.com/resources/media/5c1abf09-9678-47bd-958e-7c1bab2d6ebb-large16x9_04.19floodwarning.JPG?1555696287908","publishedAt":"2019-04-19T11:01:00Z","content":null},{"source":{"id":null,"name":"Roanoke.com"},"author":"Tiffany Holland and Casey Fabris The Roanoke Times","title":"Multiple reports of damage in Franklin County after tornado hits - Fredericksburg.com","description":"Multiple reports of damage in Franklin County after tornado hits Fredericksburg.com Confirmed tornado in Reston, Va., area damages trees, homes WTOP House destroyed, trees down after tornado touches down in Reston, Va. WUSA9.com Severe weather threat for Tria…","url":"https://www.roanoke.com/news/local/franklin_county/multiple-reports-of-damage-in-franklin-county-after-tornado-hits/article_05196ea6-08ae-572b-af3e-573f2e599f4c.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/fredericksburg.com/content/tncms/assets/v3/editorial/b/19/b191bb2b-707b-50ea-90e1-33e43e67e1c5/5cba124692493.image.jpg?crop=1662%2C935%2C0%2C155&resize=1120%2C630&order=crop%2Cresize","publishedAt":"2019-04-19T18:15:00Z","content":"Several homes have been destroyed and multiple downed trees have been reported in Franklin County, where the National Weather Service says a tornado touched down Friday morning.\r\nThe tornado was reported at 10:35 a.m. over Sontag, just south of Rocky Mount, m… [+1594 chars]"},{"source":{"id":null,"name":"Weather.com"},"author":"","title":"Severe Weather Kills 3 as Tornadoes, Thunderstorms March Across South - The Weather Channel","description":"Severe Weather Kills 3 as Tornadoes, Thunderstorms March Across South The Weather Channel The latest impacts from a line of strong thunderstorms moving across the southern United States. View full coverage on Google News","url":"https://weather.com/news/news/2019-04-19-tornadoes-storms-deaths-south-mississippi-alabama","urlToImage":"https://s.w-x.co/damage_24.jpg","publishedAt":"2019-04-19T10:55:19Z","content":"At a Glance\r\nTwo people died in Mississippi, where nine tornadoes were reported.\r\nAn Alabama woman died after a tree fell on her home.\r\nDelta Airlines is allowing passengers flying through several major airports in the northeast on Friday to change their tick… [+4502 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":null,"title":"Bullies and black trench coats: The Columbine shooting’s most dangerous myths - The Washington Post","description":"Bullies and black trench coats: The Columbine shooting’s most dangerous myths The Washington Post High School Was Different Before Columbine The Atlantic Columbine shooting: 20 years on, here’s what America’s gun violence epidemic looks like, by the numbers T…","url":"https://www.washingtonpost.com/history/2019/04/19/bullies-black-trench-coats-columbine-shootings-most-dangerous-myths/","urlToImage":"https://www.washingtonpost.com/resizer/wh8neHwms5nGegMQ1jYSmpQz97c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NATZUTLPF5FXNPBVT6PDER32ME.jpg","publishedAt":"2019-04-19T16:17:12Z","content":"The headlines in major newspapers the day after the Columbine massacre were shocking and they were wrong:\r\nUp to 25 Die in Colorado School Shooting (The Washington Post)\r\nGunmen Stalk School, Killing Up to 25 and Wounding 20 (Los Angeles Times)\r\nHigh School M… [+8159 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter 7-round mock draft: Round 2 - NFL.com","description":"Chad Reuter 7-round mock draft: Round 2 NFL.com Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Yahoo Sports' top 2019 NFL draft prospects, No. 9: Michigan LB Devin Bush Jr. Yahoo Sports Devin Bus…","url":"http://www.nfl.com/news/story/0ap3000001027103/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-2","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/03/25/0ap3000001024136_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+6616 chars]"},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" This Pole Dancing Move Is Straight-Up Unbelievable via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_5c1496a5f19bfc5edd7643f8130db95a","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-19T21:57:09Z","content":"Tornado, Virginia, Elizabeth Warren, United States Senate, New Hampshire\r\nABC 33/40 in Birmingham, Alabama offers news, sports, and weather reporting for the surrounding communities including Tuscaloosa, Anniston,..."},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" Nusrat Rafi burnt to death for reporting sexual abuse: Police via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_5f1283cb5d0213bd971032a01f30d78a","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-19T21:57:09Z","content":"Tornado, Virginia, Elizabeth Warren, United States Senate, New Hampshire\r\nABC 33/40 in Birmingham, Alabama offers news, sports, and weather reporting for the surrounding communities including Tuscaloosa, Anniston,..."},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" Anti-vax parents lose in NY court, face steep fines for not vaccinating - Ars Technica via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_faf85e0e8afa86123ec240fd232b9305","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-19T21:57:09Z","content":"Tornado, Virginia, Elizabeth Warren, United States Senate, New Hampshire\r\nABC 33/40 in Birmingham, Alabama offers news, sports, and weather reporting for the surrounding communities including Tuscaloosa, Anniston,..."},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" Equalititty via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_9a336ad4c436bc63d90426069c54c012","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-19T21:57:09Z","content":"Tornado, Virginia, Elizabeth Warren, United States Senate, New Hampshire\r\nABC 33/40 in Birmingham, Alabama offers news, sports, and weather reporting for the surrounding communities including Tuscaloosa, Anniston,..."},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" The Surprises in the Mueller Report via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_5c1341dfa4c4d158aef2c924618471e5","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-19T21:57:09Z","content":"Tornado, Virginia, Elizabeth Warren, United States Senate, New Hampshire\r\nABC 33/40 in Birmingham, Alabama offers news, sports, and weather reporting for the surrounding communities including Tuscaloosa, Anniston,..."},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" Between 2011 and 2018, San Francisco's homeless population has remained pretty much constant. Public pooping incidents? You'd better... via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_21a0d7fb9a4826f3dfb5cbcb43d9f196","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-19T21:57:09Z","content":"Tornado, Virginia, Elizabeth Warren, United States Senate, New Hampshire\r\nABC 33/40 in Birmingham, Alabama offers news, sports, and weather reporting for the surrounding communities including Tuscaloosa, Anniston,..."},{"source":{"id":null,"name":"Abovethelaw.com"},"author":"Nicholas Alexiou","title":"One Year In","description":"Lessons learned after writing a column about career services at ATL for a year.","url":"https://abovethelaw.com/2019/04/one-year-in/","urlToImage":"https://abovethelaw.com/uploads/2016/08/anonymous-blogger-typist-keyboard-laptop-computer-300x200-1.jpg","publishedAt":"2019-04-19T19:44:05Z","content":"(Image via Getty)\r\nThis is the 52nd iteration of this weekly column, which if my limited mathematical skills have not failed me, means that I have hit the one-year mark here at Above the Law.  Granted, this weekly publication schedule has occasionally been mo… [+5590 chars]"},{"source":{"id":null,"name":"Marshallparthenon.com"},"author":"Trey Delida","title":"College of Business welcomes new business incubator space - MU The Parthenon","description":"As the Lewis College of Business and Brad D. Smith Schools of Business celebrate 50 years of the college this week, Marshall University welcomes the addition of a new business incubator space. Located in the Visual Arts Center, across from Pullman Square, the…","url":"https://marshallparthenon.com/20832/news/college-of-business-welcomes-new-business-incubator-space/","urlToImage":"https://marshallparthenon.com/wp-content/uploads/2017/11/Screen-Shot-2017-11-10-at-11.38.03-PM.jpg","publishedAt":"2019-04-19T23:25:51Z","content":"As the Lewis College of Business and Brad D. Smith Schools of Business celebrate 50 years of the college this week, Marshall University welcomes the addition of a new business incubator space.\r\nLocated in the Visual Arts Center, across from Pullman Square, th… [+1706 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By michael.daly@thedailybeast.com (Michael Daly)","title":"Robert Mueller Made One Mistake: He Trusted Bill Barr","description":"Photo Illustration by The Daily Beast/Getty Two days before the 50th anniversary of Robert Mueller being seriously wounded while leading his platoon against a numerically superior enemy in Vietnam, his latest service to the nation was released—in the form of …","url":"https://www.thedailybeast.com/mueller-made-one-mistake-he-trusted-bill-barr","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555643433/d_r6yyxj","publishedAt":"2019-04-19T08:41:00Z","content":"Two days before the 50th anniversary of Robert Mueller being seriously wounded while leading his platoon against a numerically superior enemy in Vietnam, his latest service to the nation was releasedin the form of the Special Counsels Report.\r\nIn a morning pr… [+8481 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By Tarpley.Hitt@thedailybeast.com (Tarpley Hitt)","title":"Inside Stacks House: The Terrible ‘Feminist’ Money Pop-Up Invading Los Angeles","description":"Courtesy of Stacks House LOS ANGELES—Tuesday afternoon, a handful of reporters trickled into a neon green warehouse in Los Angeles’ Arts District. A graffitied sign outside read: “You’re So Money.” This particular building isn’t a store—it’s an event space th…","url":"https://www.thedailybeast.com/inside-stacks-house-the-terrible-feminist-money-pop-up-invading-los-angeles","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555663658/190516-hitt-stacks-house-tease_ls47b5","publishedAt":"2019-04-19T08:50:01Z","content":"LOS ANGELESTuesday afternoon, a handful of reporters trickled into a neon green warehouse in Los Angeles Arts District. A graffitied sign outside read: Youre So Money. This particular building isnt a storeits an event space that reinvents itself semi-regularl… [+8209 chars]"},{"source":{"id":null,"name":"Vimeo.com"},"author":null,"title":"Nature's micro lessons on Diversity and colors","description":"Currently, there are two kinds of Americans. I am a part of the second kind who believes strongly in diversity. I do believe in Liberty and Justice for all People and, of course, for ALL Americans. Cast: Microdac Tags: Fall, 4K, nature, FZ1000, video, Beach, …","url":"https://vimeo.com/331492084","urlToImage":"https://i.vimeocdn.com/filter/overlay?src0=https%3A%2F%2Fi.vimeocdn.com%2Fvideo%2F776896707_1280x720.webp&src1=https%3A%2F%2Ff.vimeocdn.com%2Fimages_v6%2Fshare%2Fplay_icon_overlay.png","publishedAt":"2019-04-19T22:33:58Z","content":null},{"source":{"id":null,"name":"Snopes.com"},"author":"Associated Press","title":"Easter Feast Arrives at the Space Station","description":"There are three Americans living on the space station, as well as two Russians and one Canadian.","url":"https://www.snopes.com/ap/2019/04/19/easter-feast-arrives-at-the-space-station/","urlToImage":"https://www.snopes.com/tachyon/2019/04/AP19109414374404-e1555686290839.jpg?fit=1200,686","publishedAt":"2019-04-19T15:05:19Z","content":"CAPE CANAVERAL, Fla. (AP) A private cargo ship brought the makings of an Easter feast to the International Space Station on Friday, along with mice and little flying robots.\r\nSpace station astronaut Anne McClain used a robot arm to capture Northrop Grummans C… [+1872 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Rex Santus, VICE News","title":"Mayor Pete is dealing with homophobic attacks. He knew they were coming.","description":"“The good news is the condition of my soul is in the hands of God, but the Iowa caucuses are up to you,\" he said to one protester.","url":"https://news.vice.com/en_us/article/neav5g/mayor-pete-is-dealing-with-homophobic-attacks-he-knew-they-were-coming","urlToImage":"https://video-images.vice.com/articles/5cba218c14b60f0008bb85ef/lede/1555702190778-AP_19106780770924.jpeg?crop=1xw:0.8426xh;0xw,0.0663xh","publishedAt":"2019-04-19T19:34:00Z","content":"Pete Buttigieg, a 2020 candidate for president and the mayor of South Bend, Indiana, is, unsurprisingly, facing homophobic protests on the campaign trail. \r\n A man interrupted a recent Buttigieg rally in Iowa, for example, and shouted at the candidate: Rememb… [+5071 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Plenty of coaching changes around SEC during offseason","description":"Plenty of coaching changes around SEC during offseason even though no new head coaches","url":"https://www.foxsports.com/college-football/story/plenty-of-coaching-changes-around-sec-during-offseason-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/2d6a356a504d43af983e88f0a78bda19.vresize.1200.630.high.86.jpg","publishedAt":"2019-04-19T16:35:18Z","content":"KNOXVILLE, Tenn. (AP) — There has been plenty of coaching turnover in the Southeastern Conference this offseason, just not involving any head coaches.\r\nThis will be the first year since 2006 that the SEC begins a season with no new head coaches. But despite t… [+5269 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 of 14 Big Ten teams coming out of spring planning to continue quarterback auditions in preseason practices","url":"https://www.foxsports.com/college-football/story/7-big-ten-teams-will-extend-qb-competitions-into-preseason-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/c38cfc6b693c4045af601df963be3e3d.vresize.1200.630.high.90.jpg","publishedAt":"2019-04-19T15:16:09Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4876 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Associated Press","title":"Severe storms across the South kill a girl and bring tornado threats","description":"A strong storm system barreling through the South on Friday killed an 8-year-old girl in Florida and threatened to bring tornadoes to large parts of the Carolinas and southern Virginia. A tree fell onto a house in Woodville, Fla., south of Tallahassee, killin…","url":"https://www.latimes.com/nation/nationnow/la-na-southeast-storm-20190419-story.html","urlToImage":"https://www.latimes.com/resizer/RnQCV7PXV5O5BkcKCcT3VeTEQKo=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/DDGBIEJOKRCELO2ERE5Q7R7JAE.jpg","publishedAt":"2019-04-19T22:05:00Z","content":"A strong storm system barreling through the South on Friday killed an 8-year-old girl in Florida and threatened to bring tornadoes to large parts of the Carolinas and southern Virginia.\r\nA tree fell onto a house in Woodville, Fla., south of Tallahassee, killi… [+2153 chars]"},{"source":{"id":null,"name":"Thecut.com"},"author":"Kaitlin Menza","title":"A Peak-Foliage Wedding in the Catskills","description":"Since most guests were traveling, the couple planned a full weekend in the country, including a group trip to Storm King Art Center.","url":"http://www.thecut.com/2019/04/a-peak-foliage-wedding-in-the-catskills.html","urlToImage":"https://pixel.nymag.com/imgs/fashion/daily/2018/11/01/winter-weddings-2019/albums/peak-foliage/1.w1200.h630.jpg","publishedAt":"2019-04-19T20:00:00Z","content":"Channeling that moment of calm that comes when you exit the city for fresher air, Jessica Beck, 35, knew we had to do something upstate, she says. Her fiancé, Charlie Flexon, 40, had previously rock climbed in the Catskills and was partial to the area in late… [+1296 chars]"},{"source":{"id":null,"name":"247sports.com"},"author":"Evan Watkins","title":"2021 WR Tai Felton getting comfortable at Virginia Tech - 247Sports","description":"2021 WR Tai Felton getting comfortable at Virginia Tech 247Sports 2021 WR Tai Felton returned to Virginia Tech on Thursday.","url":"https://247sports.com/college/virginia-tech/Article/Tai-Felton-2021-wide-receiver-Stone-Bridge-Ashburn-Virginia-Tech-Hokies-Football-Recruiting-Update-131338913/","urlToImage":"https://s3media.247sports.com/Uploads/Assets/995/187/9187995.jpeg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630","publishedAt":"2019-04-19T11:26:27Z","content":"Virginia Tech was the first program to extend a scholarship offer to Ashburn (VA) Stone Bridge Class of 2021 wide receiver Tai Felton and..."},{"source":{"id":null,"name":"Nvdaily.com"},"author":"Melissa Topey The Northern Virginia Daily","title":"Triplett Tech students advance to National SkillsUSA | Nvdaily | nvdaily.com - Northern Virginia Daily","description":"Triplett Tech students advance to National SkillsUSA | Nvdaily | nvdaily.com Northern Virginia Daily Triplett Tech SkillsUSA students recently participated in the SkillsUSA State Leadership Conference, which was held on April 12-13 at the Virginia Beach...","url":"https://www.nvdaily.com/nvdaily/triplett-tech-students-advance-to-national-skillsusa/article_93ba23d5-2a25-5692-928b-7f9cd243f03f.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/nvdaily.com/content/tncms/custom/image/f49c34a0-9ca4-11e8-8115-4714fd783b28.png","publishedAt":"2019-04-19T04:00:00Z","content":"Triplett Tech SkillsUSA students recently participated in the SkillsUSA State Leadership Conference, which was held on April 12-13 at the Virginia Beach Convention Center.\r\nSeven of those students advanced to compete at the National SkillsUSA competition June… [+1476 chars]"},{"source":{"id":null,"name":"Roanoke.com"},"author":"Mike Niziolek mike.niziolek@roanoke.com 981-3126","title":"Virginia Tech kicker Jordan Stout enters NCAA transfer portal - Roanoke Times","description":"Virginia Tech kicker Jordan Stout enters NCAA transfer portal Roanoke Times BLACKSBURG — Virginia Tech kicker Jordan Stout has entered his name in the NCAA transfer. The news was first reported by 247Sports reporter Evan Watkins...","url":"https://www.roanoke.com/hokies/virginia-tech-kicker-jordan-stout-enters-ncaa-transfer-portal/article_877a4dbc-62c4-11e9-9fa0-d7d14c617a7f.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/01/60104df7-07fd-5b66-ac31-2525ddc6a9d2/5cb64b3ba1347.image.jpg?resize=532%2C630","publishedAt":"2019-04-19T16:59:00Z","content":"BLACKSBURG Virginia Tech kicker Jordan Stout has entered his name in the NCAA transfer. The news was first reported by 247Sports reporter Evan Watkins. A Tech spokesperson confirmed Stout's decision on Friday. \r\nStout had a strong performance in the spring ga… [+1155 chars]"},{"source":{"id":null,"name":"Ramblinwreck.com"},"author":null,"title":"Georgia Tech-Virginia Tech Game Postponed – Georgia Tech Yellow Jackets - Georgia Tech Official Athletic Site","description":"Georgia Tech-Virginia Tech Game Postponed – Georgia Tech Yellow Jackets Georgia Tech Official Athletic Site BLACKSBURG, Va. – Due to inclement weather in the area, Friday night's Game 2 between Georgia Tech baseball and Virginia Tech has been postponed.","url":"https://ramblinwreck.com/georgia-tech-virginia-tech-game-postponed/","urlToImage":"https://ramblinwreck.com/amt-media/327148","publishedAt":"2019-04-19T21:26:19Z","content":"BLACKSBURG, Va. Due to inclement weather in the area, Friday nights Game 2 between Georgia Tech baseball and Virginia Tech has been postponed.\r\nThe Yellow Jackets and Hokies will now play a doubleheader on Saturday, April 20, beginning at 11 a.m. at English F… [+275 chars]"},{"source":{"id":null,"name":"Techlunchpail.com"},"author":"Tim Thomas","title":"Virginia Tech Hosting Former Wofford Commit Hunter Cattoor on a Visit - Tech Lunch Pail","description":"Virginia Tech Hosting Former Wofford Commit Hunter Cattoor on a Visit Tech Lunch Pail Virginia Tech is hosting former Wofford commit Hunter Cattoor on an official visit this weekend. The 6'3'' combo guard has been released from his NLI.","url":"https://techlunchpail.com/2019/04/19/virginia-tech-hosting-former-wofford-hunter-cattoor-official-visit/","urlToImage":"https://techlunchpail.com/wp-content/uploads/2019/04/VT-Students-Miami-1-1024x683.jpg","publishedAt":"2019-04-19T06:00:00Z","content":"Former Wofford signee and 6’3” guard Hunter Cattoor is taking an official visit to Virginia Tech this weekend after the Hokies recently offered the former Terriers’ commit.\r\nThe Orlando, FL native received his release from the Terriers last week and arrived i… [+2444 chars]"},{"source":{"id":null,"name":"Yellowjackedup.com"},"author":"Dylan Callaghan-Croley","title":"Georgia Tech Baseball: Jacket drop series opener to Virginia Tech - Yellow Jacked Up","description":"Georgia Tech Baseball: Jacket drop series opener to Virginia Tech Yellow Jacked Up The Georgia Tech baseball team dropped their third straight series opener on Thursday, this time to the Virginia Tech Hokies.","url":"https://yellowjackedup.com/2019/04/19/georgia-tech-baseball-jacket-drop-series-opener-to-virginia-tech/","urlToImage":"https://imagesvc.timeincapp.com/v3/fan/image?url=https://yellowjackedup.com/wp-content/uploads/getty-images/2017/07/271478.jpeg&","publishedAt":"2019-04-19T16:07:30Z","content":"Georgia Tech baseball narrowly fell to the Virginia Tech Hokies on Thursday night in the first game of their three-game series over the holiday weekend. Xzavion Curry picked up his second loss of the season despite giving just three runs on the evening. The l… [+1539 chars]"},{"source":{"id":null,"name":"Sportswar.com"},"author":"Jake Lyman","title":"Virginia Tech Softball Ready for Big Series With UNC - TechSideline.com","description":"Virginia Tech Softball Ready for Big Series With UNC TechSideline.com Virginia Tech's softball team has experienced a historic rebirth this season, as the Hokies have the best record in the ACC.","url":"https://virginiatech.sportswar.com/article/2019/04/19/virginia-tech-softball-ready-for-unc/","urlToImage":"https://virginiatech.sportswar.com/wp-content/uploads/sites/15/2019/04/darby_trull_softball-1.jpg","publishedAt":"2019-04-19T10:32:00Z","content":"Darby Trull has been one of the ACC’s best hitters this season. (Photo by Virginia Tech)\r\nVirginia Techs softball team has experienced a historic rebirth this season. First-year head coach Pete DAmour has led the team to the best start in program history with… [+4288 chars]"},{"source":{"id":null,"name":"Roanoke.com"},"author":"The Roanoke Times","title":"In the region: Virginia Tech upsets No. 11 George Tech to open ACC baseball series - Roanoke Times","description":"In the region: Virginia Tech upsets No. 11 George Tech to open ACC baseball series Roanoke Times BLACKSBURG — Tanner Thomas hit a two-run homer in the bottom of the sixth inning and Virginia Tech (22-16, 7-12 ACC) held on to edge No. 11 Georgia...","url":"https://www.roanoke.com/hokies/sports/other/in-the-region-virginia-tech-upsets-no-george-tech-to/article_9e886375-e212-52dd-bbbd-c32e67aefb20.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-19T02:15:00Z","content":"BLACKSBURG Tanner Thomas hit a two-run homer in the bottom of the sixth inning and Virginia Tech (22-16, 7-12 ACC) held on to edge No. 11 Georgia Tech 3-2 to open a three game series on Thursday.\r\nCarson Taylor hit a solo homer in the bottom of the first.\r\nTh… [+8822 chars]"},{"source":{"id":null,"name":"Wtkr.com"},"author":"https://www.facebook.com/WTKR3/","title":"ODU’s BJ Stith & Virginia Tech’s Ahmed Hill make PIT debuts - WTKR News 3","description":"ODU’s BJ Stith & Virginia Tech’s Ahmed Hill make PIT debuts WTKR News 3 Stith struggled, while Hill made a couple of jumpers to compliment a steady night.","url":"https://wtkr.com/2019/04/18/odus-bj-stith-virginia-techs-ahmed-hill-make-pit-debuts/","urlToImage":"https://localtvwtkr.files.wordpress.com/2019/04/screen-shot-2019-04-18-at-11.42.23-pm.png","publishedAt":"2019-04-19T03:49:00Z","content":"PORTSMOUTH, Va. - It was a night to forget for ODU guard B.J. Stith at the Portsmouth Invitational Tournament.\r\nBJ Stith at the PIT\r\nStith, the Conference USA Player of the Year went 0-for-9 from the field with 0 points on Thursday night in his tournament deb… [+509 chars]"},{"source":{"id":null,"name":"Wsaz.com"},"author":"The Associated Press","title":"Casino operator suing tech company over sports betting outage - WSAZ-TV","description":"Casino operator suing tech company over sports betting outage WSAZ-TV CHARLESTON, W.Va. (AP) -- A casino operator is suing a tech company after a contract dispute shuttered its sports betting platform at two West Virginia casinos...","url":"https://www.wsaz.com/content/news/Casino-operator-suing-tech-company-over-sports-betting-outage-508820151.html","urlToImage":"https://media.graytvinc.com/images/gavel+mgn+210.jpg","publishedAt":"2019-04-19T21:20:32Z","content":"CHARLESTON, W.Va. (AP) -- A casino operator is suing a tech company after a contract dispute shuttered its sports betting platform at two West Virginia casinos ahead of the NCAA Tournament.\r\nA Friday news release from Delaware North says it's filed a civil su… [+542 chars]"},{"source":{"id":null,"name":"Cbslocal.com"},"author":null,"title":"Delaware North Files Civil Suit Against Tech Company - CBS Pittsburgh","description":"Delaware North Files Civil Suit Against Tech Company CBS Pittsburgh CHARLESTON, W.Va. (AP) – A casino operator is suing a tech company after a contract dispute shuttered its sports betting platform at two West Virginia casinos...","url":"https://pittsburgh.cbslocal.com/2019/04/19/delaware-north-tech-company-civil-suit/","urlToImage":"https://cbspittsburgh.files.wordpress.com/2018/05/sports-betting-gambling.jpg?w=1024","publishedAt":"2019-04-19T19:59:00Z","content":"CHARLESTON, W.Va. (AP) – A casino operator is suing a tech company after a contract dispute shuttered its sports betting platform at two West Virginia casinos ahead of the NCAA Tournament.\r\nA Friday news release from Delaware North says it’s filed a civil sui… [+677 chars]"},{"source":{"id":null,"name":"Dailypress.com"},"author":"Daily Press","title":"Thursday's regional sports roundup and results: Hokies upend No. 11 Georgia Tech in baseball - Daily Press","description":"Thursday's regional sports roundup and results: Hokies upend No. 11 Georgia Tech in baseball Daily Press Tanner Thomas' two-run home run in the sixth inning lifted Virginia Tech (22-16, 7-12) to a 3-2 victory over No. 11 Georgia Tech in an Atlantic Coast Conf…","url":"https://www.dailypress.com/sports/dp-spt-virginia-sports-roundup-20190419-story.html","urlToImage":"https://www.trbimg.com/img-544e4b85/turbine/dp-daily-press-default-fb-icon","publishedAt":"2019-04-19T04:20:00Z","content":"Tanner Thomas' two-run home run in the sixth inning lifted Virginia Tech (22-16, 7-12) to a 3-2 victory over No. 11 Georgia Tech in an Atlantic Coast Conference baseball series opener Thursday in Blacksburg.\r\nThe Hokies' bullpen, which tossed a combined 4 2/3… [+7389 chars]"},{"source":{"id":null,"name":"Ramblinwreck.com"},"author":null,"title":"Jackets Fall in Series Opener to VT – Baseball — Georgia Tech Yellow Jackets - Georgia Tech Official Athletic Site","description":"Jackets Fall in Series Opener to VT – Baseball — Georgia Tech Yellow Jackets Georgia Tech Official Athletic Site Georgia Tech looks to even series on Friday at 6 p.m..","url":"https://ramblinwreck.com/jackets-fall-in-series-opener-to-vt/","urlToImage":"https://ramblinwreck.com/amt-media/331590","publishedAt":"2019-04-19T02:31:45Z","content":"Box Score (.pdf)\r\nTHE FLATS A two-run home run in the sixth doomed Georgia Tech baseball as it dropped the series-opening game to Virginia Tech 3-2 on Thursday night at English Field.\r\nThe Yellow Jackets (25-13, 11-8 ACC) were held to just five hits overall o… [+1442 chars]"},{"source":{"id":null,"name":"Ramblinwreck.com"},"author":null,"title":"Tech Takes Commanding Lead at ACC Golf Championship - Georgia Tech Official Athletic Site","description":"Tech Takes Commanding Lead at ACC Golf Championship Georgia Tech Official Athletic Site No. 8 Yellow Jackets lead by 17 shots after 36 holes, Andy Ogletree on top of individual leaderboard.","url":"https://ramblinwreck.com/tech-takes-commanding-lead-at-acc-golf-championship/","urlToImage":"https://ramblinwreck.com/amt-media/332631","publishedAt":"2019-04-19T01:01:46Z","content":"Pairings and Live Scoring via Golfstat  |  Watch Online Saturday (1 p.m.)  |  Coach Heppler post-round audio\r\nNew London, N.C. Andy Ogletree fired rounds of 66 and 65 Thursday to take the individual lead and lift No. 8 Georgia Tech to a commanding 17-stroke a… [+3878 chars]"},{"source":{"id":null,"name":"Register-herald.com"},"author":"Jordan Nelson The Register-Herald","title":"Tuition spikes for nursing students at WVU Tech - Beckley Register-Herald","description":"Tuition spikes for nursing students at WVU Tech Beckley Register-Herald If you're looking to become part of the nursing program offered at WVU Tech in Beckley, be prepared for an increase in tuition, due to a vote last week from.","url":"https://www.register-herald.com/news/tuition-spikes-for-nursing-students-at-wvu-tech/article_483b8a51-815b-56ed-b32e-ce34e12d671a.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/register-herald.com/content/tncms/assets/v3/editorial/6/02/602e5326-e483-528b-9ec3-b6072082bc09/5c8d71eb6f9fb.image.jpg?resize=800%2C513","publishedAt":"2019-04-19T21:47:00Z","content":"If you're looking to become part of the nursing program offered at WVU Tech in Beckley, be prepared for an increase in tuition, due to a vote last week from the West Virginia University Board of Governors.\r\nThe vote not only increased tuition at WVU in Morgan… [+2226 chars]"},{"source":{"id":null,"name":"Kcbd.com"},"author":"","title":"No. 16 Tech Baseball’s Comeback Bid Falls Short in Extras - KCBD","description":"No. 16 Texas Tech baseball battled back from a 9-3 hole to send the game into extras before falling, 11-10, in 11 innings against No. 18 Baylor Thursday night at Rip Griffin Park in the first of a three-game series, presented by Texas Farm Bureau.","url":"http://www.kcbd.com/2019/04/19/no-tech-baseballs-comeback-bid-falls-short-extras/","urlToImage":"http://www.kcbd.com/resizer/CcDsuR9b6LLzByNo_XYOjXJp4_I=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/ZV7BBNB4ARG5BAE4VHVHHHYWGQ.jpg","publishedAt":"2019-04-19T11:49:00Z","content":"Information provided by Texas Tech Athletics\r\nLUBBOCK, Texas No. 16 Texas Tech baseball battled back from a 9-3 hole to send the game into extras before falling, 11-10, in 11 innings against No. 18 Baylor Thursday night at Rip Griffin Park in the first of a t… [+2613 chars]"},{"source":{"id":null,"name":"Amazon.com"},"author":"aws@amazon.com","title":"Amazon Transcribe is now available in Asia Pacific (Seoul) and EU (Frankfurt) with added language support for Spanish (ES)","description":"Amazon Transcribe is an automatic speech recognition (ASR) service that makes it easy for you to add speech-to-text capabilities to your applications. Starting today, Amazon Transcribe becomes available in two new AWS regions, Asia Pacific (Seoul) and EU (Fra…","url":"https://aws.amazon.com/about-aws/whats-new/2019/04/amazon-transcribe-is-now-available-in-asia-pacific-seoul-and-eu-frankfurt-with-added-language-support-for-spanish/","urlToImage":"https://a0.awsstatic.com/main/images/logos/aws_logo_smile_1200x630.png","publishedAt":"2019-04-19T23:39:14Z","content":"Amazon Transcribe enables organizations to increase the accessibility and discoverability of their audio and video content, serving a breadth of use cases. For instance, contact centers can convert call recordings into text and analyze the data for actionable… [+1047 chars]"},{"source":{"id":null,"name":"Juancole.com"},"author":"Belle Chesler","title":"De-Funding the Great American School System for the 1%","description":"(Tomdispatch.com) - Three weeks ago, I sat in a cramped conference room in the large public high school where I teach in Beaverton, Oregon. I was listening to the principal deliver a scripted PowerPoint presentation on the $35 million budget deficit our distr…","url":"https://www.juancole.com/2019/04/funding-american-school.html","urlToImage":"https://www.juancole.com/images/2019/04/de-funding-the-great-american-sc.jpg","publishedAt":"2019-04-19T04:07:58Z","content":"(Tomdispatch.com) – Three weeks ago, I sat in a cramped conference room in the large public high school where I teach in Beaverton, Oregon. I was listening to the principal deliver a scripted PowerPoint presentation on the $35 million budget deficit our distr… [+13647 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Lawsuit after 2 casinos couldn't take March Madness bets","description":"Lawsuit after 2 casinos couldn't take March Madness bets","url":"https://www.foxsports.com/other/story/lawsuit-after-2-casinos-couldn-t-take-march-madness-bets-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T19:47:03Z","content":"CHARLESTON, W.Va. (AP) — A casino operator is suing a tech company after a contract dispute shuttered its sports betting platform at two West Virginia casinos ahead of the NCAA Tournament.\r\nA Friday news release from Delaware North says it’s filed a civil sui… [+541 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Thursday Sports in Brief","description":"Thursday Sports in Brief","url":"https://www.foxsports.com/other/story/thursday-sports-in-brief-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T07:14:35Z","content":"COLLEGE BASKETBALL\r\nRALEIGH, N.C. (AP) — North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made “racially insensitive” comments and applied “undue influence” regarding players’ ability to compete throu… [+6475 chars]"},{"source":{"id":null,"name":"Spaceflightnow.com"},"author":null,"title":"Cygnus supply ship delivers 3.8-ton cargo load to International Space Station - Spaceflight Now","description":"Cygnus supply ship delivers 3.8-ton cargo load to International Space Station Spaceflight Now WATCH LIVE: Supply Arrival to Space Station #Astrobee #NorthropGrumman(NG11) @04:00 EST SPACE & UNIVERSE (Official) Private cargo ship brings Easter feast to the spa…","url":"https://spaceflightnow.com/2019/04/19/cygnus-supply-ship-delivers-3-8-ton-cargo-load-to-international-space-station/","urlToImage":null,"publishedAt":"2019-04-19T16:36:49Z","content":"The Cygnus spacecraft, christened the S.S. Roger Chaffee, is in the firm grasp of the space station’s Canadian-built robotic arm Friday after arrival. Credit: David Saint-Jacques/CSA/NASA\r\nNASA flight engineer Anne McClain grappled Northrop Grumman’s Cygnus s… [+13509 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Marcia Dunn","title":"Private cargo ship brings Easter feast to the space station - The Associated Press","description":"Private cargo ship brings Easter feast to the space station The Associated Press CAPE CANAVERAL, Fla. (AP) — A private cargo ship brought the makings of an Easter feast to the International Space Station on Friday, along with mice and... View full coverage on…","url":"https://www.apnews.com/08ef106c538c42b69d94a71e0eb98def","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:fc34c4837ecf4a6d87a7c13ed7632c93/3000.jpeg","publishedAt":"2019-04-19T10:18:45Z","content":"CAPE CANAVERAL, Fla. (AP) A private cargo ship brought the makings of an Easter feast to the International Space Station on Friday, along with mice and little flying robots.\r\nSpace station astronaut Anne McClain used a robot arm to capture Northrop Grummans C… [+1872 chars]"}]}