{"status":"ok","totalResults":59,"articles":[{"source":{"id":null,"name":"Venturebeat.com"},"author":"Kyle Wiggers","title":"GM’s Cruise is preparing for a self-driving future in the cloud","description":"We spoke with Cruise' Adrian Macneil about training cars synthetically, why Cruise is targeting San Francisco, and how it fits into the overall landscape.","url":"https://venturebeat.com/2019/04/20/gms-cruise-is-preparing-for-a-self-driving-future-in-the-cloud/","urlToImage":"https://venturebeat.com/wp-content/uploads/2019/01/GMCruiseAVIR02_crop-1.jpg?w=1200&strip=all","publishedAt":"2019-04-20T17:25:42Z","content":"According to marketing firm ABI, as many as 8 million driverless cars will be added to the road in 2025. Meanwhile, Research and Markets is predicting that in the U.S. alone, there will be some 20 million autonomous cars in operation by 2030.\r\nHow realistic a… [+17078 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller report: Elizabeth Warren becomes first 2020 candidate to call for Trump’s impeachment","description":"Elizabeth Warren has become the first 2020 election candidate to make a clear call for impeachment proceedings against Donald Trump following the release of special counsel Robert Mueller’s redacted report.The Massachusetts senator tweeted that it would be da…","url":"https://news.yahoo.com/mueller-report-elizabeth-warren-becomes-102635808.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/3gzFkT8QtBASbO_QhDdpyA--~B/aD01NzY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/08c8ee988e5afccf25e0abdda99f94f0","publishedAt":"2019-04-20T10:26:00Z","content":"Elizabeth Warren has become the first 2020 election candidate to make a clear call for impeachment proceedings against Donald Trump following the release of special counsel Robert Muellers redacted report.\r\nThe Massachusetts senator tweeted that it would be d… [+3305 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"Joe Biden expected to launch presidential campaign next week","description":"Joe Biden, 76, would be the most experienced politician in the race, and the second oldest, after 77-year-old Bernie Sanders.","url":"https://indianexpress.com/article/world/united-states-joe-biden-expected-to-launch-presidential-campaign-next-week-5685335/","urlToImage":"https://images.indianexpress.com/2019/04/joe-biden-759.jpg?w=759","publishedAt":"2019-04-20T01:38:20Z","content":"Former vice president Joe Biden talks with officials after speaking at a rally in support of striking Stop &amp; Shop workers in Boston, Thursday. (AP Photo)\r\nFormer Vice President Joe Biden is expected to join the crowded 2020 Democratic presidential field n… [+3659 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Hugh McIntyre, Contributor, Hugh McIntyre, Contributor https://www.forbes.com/sites/hughmcintyre/","title":"Khalid Owns Nine Spots On The Hot 100 This Week, Marking The Best Frame Of His Career","description":"Khalid has never filled this many spaces on the all-encompassing singles chart in the U.S. at one time.","url":"https://www.forbes.com/sites/hughmcintyre/2019/04/20/khalid-owns-nine-spots-on-the-hot-100-this-week-marking-the-best-frame-of-his-career/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_3113%2Fpt_3113_29437_o.jpg%3Ft%3D1555690502","publishedAt":"2019-04-20T16:10:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nLAS VEGAS, NEVADA - APRIL 07: Khalid performs onstage during the 54th Academy Of Country Music Awards at MGM Grand Garden Arena on April 07, 2019, in Las Vegas, Nevada. (Photo by Jeff Kravitz/ACMA2019/Fi… [+5086 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jay Ginsbach, Contributor, Jay Ginsbach, Contributor https://www.forbes.com/sites/jayginsbach/","title":"NFL Releases Week 1 Schedule And U.S. Sportsbooks Add Week 1 Betting Lines","description":"U.S. sportsbooks have released the NFL Week 1 betting lines for the 2019 season in advance of the April NFL draft. The NFL schedules are out, and the interest surrounding the NFL and sports betting market continues to soar.","url":"https://www.forbes.com/sites/jayginsbach/2019/04/20/nfl-releases-week-1-schedule-and-u-s-sportsbooks-add-week-1-betting-lines/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fc2a5b8e17e914b4e8585b11540ff2909%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-20T19:21:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nChicago Bears' Khalil Mack intercepts a pass and returns it for a touchdown during the first half of an NFL football game against the Green Bay Packers Sunday, Sept. 9, 2018, in Green Bay, Wis. (AP Photo… [+13660 chars]"},{"source":{"id":null,"name":"Abc7.com"},"author":null,"title":"Car connected to missing teen Alora Benitez, Carson murder investigation found in San Diego border town - KABC-TV","description":"Car connected to missing teen Alora Benitez, Carson murder investigation found in San Diego border town KABC-TV A car connected to a missing 15-year-old girl and a Carson murder investigation was found unoccupied in San Diego Friday, authorities said. View fu…","url":"https://abc7.com/car-linked-to-amber-alert-carson-murder-found-in-san-diego-/5260993/","urlToImage":"https://cdn.abcotvs.com/dip/images/5257274_041719-kabc-amber-alert-img.jpg?w=1600","publishedAt":"2019-04-20T07:24:32Z","content":"CARSON, Calif. (KABC) -- A car connected to a missing 15-year-old girl and a Carson murder investigation was found unoccupied in San Diego Friday, authorities said. The search continues for Alora Benitez, 15, who was last seen Wednesday morning in Torrance. S… [+1327 chars]"},{"source":{"id":"spiegel-online","name":"Spiegel Online"},"author":"Felix Hutt","title":"Avicii's Journey: The Untimely Death of a Superstar","description":"Tim Bergling, alias Avicii, produced hits that became the soundtrack of the Instagram generation. At the age of 28, he took his own life. A year later, his family and friends look back.","url":"https://www.spiegel.de/international/zeitgeist/avicii-s-journey-the-untimely-death-of-a-superstar-a-1263687.html","urlToImage":"https://cdn1.spiegel.de/images/image-1419011-860_poster_16x9-figb-1419011.jpg","publishedAt":"2019-04-20T06:16:16Z","content":"On a summer evening in Ibiza, ready to give them what they wanted one last time, Avicii was hunched down behind the DJ booth on stage. His fans at the outdoor club Ushuaïa weren't supposed to see him yet. They held up their smartphones, the displays glowing i… [+23114 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Brad Anderson","title":"Fancy A “Cheap” Rolls-Royce? This Phantom Drophead Coupe Might Be The One","description":"The highest bid for this one-owner Phantom Drophead Coupe currently sits at under $100k.","url":"https://www.carscoops.com/2019/04/fancy-a-cheap-rolls-royce-this-phantom-drophead-coupe-might-be-the-one/","urlToImage":"https://images.carscoops.com/2019/04/7a8a3c4f-rolls-royce-phantom-drophead-coupe-111.jpg","publishedAt":"2019-04-20T19:05:11Z","content":"If you want to drive around in something that shows not just your wealth, but also your excellent taste in cars, its hard to go wrong with a 2008 Rolls-Royce Phantom Drophead Coupe. \r\nThis Phantom Drophead Coupe, currently up for grabs on Bring A Trailer, has… [+1481 chars]"},{"source":{"id":null,"name":"Theblaze.com"},"author":"Caleb Howe","title":"Cory Booker beats fast retreat from impeachment talk, despite 'resistance' mobbing Hoyer","description":"Sen. Cory Booker is famous for (or wants to be famous for) his crusades, but following the release of the Mueller report on Thursday, the would-be Spartacus is retreating from his party's long flirtation with impeaching Trump. On Friday, Sen. Elizabeth Warren…","url":"https://www.theblaze.com/news/cory-booker-backs-out-of-his-impeachment-talk","urlToImage":"https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19407582%2F1200x600.jpg/2000%2C2000/KtkvaEJ3kIDjEpUm/img.jpg","publishedAt":"2019-04-20T18:00:15Z","content":"Sen. Cory Booker is famous for (or wants to be famous for) his crusades, but following the release of the Mueller report on Thursday, the would-be Spartacus is retreating from his party's long flirtation with impeaching Trump.\r\nOn Friday, Sen. Elizabeth Warre… [+2036 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"How Juventus won its 8th straight Serie A title","description":"When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult","url":"https://www.foxsports.com/soccer/story/how-juventus-won-its-8th-straight-serie-a-title-042019","urlToImage":"https://b.fssta.com/uploads/2019/04/5f33874f98764d2482b0dabcf02b2a3c.vresize.1200.630.high.5.jpg","publishedAt":"2019-04-20T19:10:48Z","content":"MILAN (AP) — When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult.\r\nAnd so it proved as Juventus and Cristiano Ronaldo continued breaking records.\r\nOn S… [+4860 chars]"},{"source":{"id":null,"name":"Rgj.com"},"author":"Duke Ritenhouse","title":"Pack roster keeps growing -- La. Tech transfer Jalen Harris will remain at Nevada - Reno Gazette Journal","description":"Pack roster keeps growing -- La. Tech transfer Jalen Harris will remain at Nevada Reno Gazette Journal Harris, a 6-foot-5 guard out of Duncanville, Texas, sat out the 2018-19 season after playing for parts of two seasons at Louisiana Tech.","url":"https://www.rgj.com/story/sports/2019/04/20/pack-roster-keeps-growing-la-tech-transfer-jalen-harris-remain-nevada/3529659002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/30edd841ab1af974787fc589e4ecb78e2b6d1336/c=0-0-1597-902/local/-/media/2017/11/14/LAGroup/Shreveport/636462447416923621-JHarris.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T19:41:00Z","content":"Jalen Harris, whon playing for Louisiana Tech, was a mid-year transfer to Nevada two seasons ago.\r\n (Photo: Donny Crow/LA Tech Communications)\r\nThe day-by-day process of rebuilding Nevada's basketball roster -- and it is literally day-by-day at this point -- … [+1620 chars]"},{"source":{"id":null,"name":"Tapinto.net"},"author":null,"title":"Code as a Second Language Institute Launches to Increase Latinos in Tech - TAPinto.net","description":"Code as a Second Language Institute Launches to Increase Latinos in Tech TAPinto.net NEWARK, NJ - As early as next year, more than half of all jobs will require technical skills. Yet, a majority of students still do not learn to code in or even outside...","url":"https://www.tapinto.net/towns/newark/articles/code-as-a-second-language-institute-launches-to-increase-latinos-in-tech","urlToImage":"http://tapinto-production.s3.amazonaws.com/uploads/articles/co/facebook_4fdef90dfe8d126a1213_CodingInstituteLaunch2.jpg","publishedAt":"2019-04-20T12:09:00Z","content":"NEWARK, NJ - As early as next year, more than half of all jobs will require technical skills. Yet, a majority of students still do not learn to code in or even outside of school.\r\nPanasonic Foundation and the Hispanic Heritage Foundation (HFF) have partnered … [+2430 chars]"},{"source":{"id":null,"name":"Cleantechnica.com"},"author":"Chanan Bos","title":"Tesla Nevada Gigafactory — Something Strange Is Going On, But It’s Not What You Think","description":"The Tesla Gigafactory is a technological marvel, is largely a mystery, and also happens to be the world’s biggest battery manufacturing facility. This article was originally going to be about the financing “freeze” and what might actually be going on, but now…","url":"https://cleantechnica.com/2019/04/20/tesla-nevada-gigafactory-something-strange-is-going-on-but-its-not-what-you-think/","urlToImage":"https://cleantechnica.com/files/2019/04/Gigafactory-Blueprints-570x403.jpg","publishedAt":"2019-04-20T20:50:24Z","content":"BatteriesPublished on April 20th, 2019 |\r\n by Chanan Bos\r\n0\r\nApril 20th, 2019 by Chanan Bos \r\nThe Tesla Gigafactory is a technological marvel, is largely a mystery, and also happens to be the worlds biggest battery manufacturing facility. This article was ori… [+11457 chars]"},{"source":{"id":null,"name":"Geekwire.com"},"author":"Tony Lystra","title":"Growing like weed: Pot tech startups see big growth as Pacific NW becomes hub for cannabis innovation","description":"If you happen to be searching for pot sales analytics today, look no further than the Pacific Northwest. Seattle startup Headset, a marijuana retail business data intelligence provider, knows that sales grew by 111 percent on this day last year. POSaBIT, a Ki…","url":"https://www.geekwire.com/2019/growing-like-weed-pot-tech-startups-see-big-growth-pacific-nw-becomes-hub-cannabis-innovation/","urlToImage":"","publishedAt":"2019-04-20T16:33:40Z","content":"An example of iUNUs computer vision technology for monitoring cannabis and other indoor agriculture operations. iUNUs cameras and AI monitors minute movements in plants to increase greenhouse efficiency. The company is based in Seattle. (iUNU Photo)\r\nIf you h… [+9257 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"","title":"Golden Knights try to secure series win over the Sharks","description":"The San Jose Sharks look to clinch the series over the Vegas Golden Knights in game six of the Western Conference first round","url":"https://www.foxsports.com/nhl/story/golden-knights-try-to-secure-series-win-over-the-sharks-042019","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-20T19:05:00Z","content":"San Jose Sharks (46-27-9, second in the Pacific Division during the regular season) vs. Vegas Golden Knights (43-32-7, third in the Pacific Division during the regular season)\r\nParadise, Nevada; Sunday, 1 p.m. EDT\r\nWESTERN CONFERENCE FIRST ROUND: Vegas leads … [+1368 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Laura Galvan","title":"Everything we know about Kanye West's Sunday service at Coachella - AOL","description":"Everything we know about Kanye West's Sunday service at Coachella AOL Everything We Know About Kanye West’s Sunday Service GQ The Evolution of Kanye West's Sunday Services, From Calabasas to Coachella Complex Coachella's second weekend attracts 'more serious …","url":"https://www.aol.com/article/entertainment/2019/04/19/everything-we-know-about-kanye-wests-sunday-service-at-coachella/23714611/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/644x423+23+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2019-04%2F493ac2c0-62d3-11e9-acaf-124385049b09","publishedAt":"2019-04-20T01:44:00Z","content":"Coachella attendees who were hoping to sleep in Sunday morning after Kid Cudis midnight set the night before are out of luck, at least if they want to attend Kanye Wests mysterious Easter Sunday Service.\r\nBut what is the Sunday Service? Music industry insider… [+17623 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump and impeachment: where Democrats stand after Mueller","description":"Elizabeth Warren and Rashida Tlaib have called for action, but many lawmakers say more information is needed firstElizabeth Warren was the first 2020 presidential candidate to call for impeachment. Photograph: Kristopher Radder/APLong before a redacted versio…","url":"https://news.yahoo.com/trump-impeachment-where-democrats-stand-183728709.html","urlToImage":null,"publishedAt":"2019-04-20T18:37:28Z","content":null},{"source":{"id":null,"name":"Securityaffairs.co"},"author":"Pierluigi Paganini","title":"Marcus Hutchins pleads guilty to two counts of banking malware creation","description":"British malware researcher Marcus Hutchins has pleaded guilty to developing and sharing the banking malware between July 2014 and July 2015. The popular British cybersecurity expert Marcus Hutchins has pleaded guilty to developing and sharing the Kronos banki…","url":"https://securityaffairs.co/wordpress/84260/cyber-crime/marcus-hutchins-pleads-guilty.html","urlToImage":"https://i0.wp.com/securityaffairs.co/wordpress/wp-content/uploads/2017/08/Marcus-Hutchins-3.jpg?resize=300%2C300&ssl=1","publishedAt":"2019-04-20T21:44:44Z","content":"The popular British cybersecurity expert Marcus Hutchins has pleaded guilty to developing and sharing the Kronos banking malwarebetween July 2014 and July 2015. \r\nMarcus Hutchins, also known as MalwareTech, made the headlines after discovering the kill switch… [+1815 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"HUNTER WOODALL","title":"Democratic hopefuls demur on pursuing Trump post-White House","description":"AMHERST, N.H. (AP) — Some Democratic presidential candidates aren’t saying whether they’d re-open investigations into President Donald Trump if they were to defeat him in 2020. Their fellow 2020 challenger, Elizabeth Warren, and some other liberals have incre…","url":"https://www.seattletimes.com/nation-world/nation/democratic-hopefuls-demur-on-pursuing-trump-post-white-house/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/urn-publicid-ap-org-cb6eb4e9a18945a6be1dc700fbde68c8Election_2020_Kamala_Harris_66392-1200x630.jpg","publishedAt":"2019-04-20T22:27:25Z","content":"AMHERST, N.H. (AP) Some Democratic contenders for president aren’t saying whether they would re-open investigations into President Donald Trump if they were to oust him from the White House in 2020.\r\nTheir reluctance comes as some liberals, including fellow 2… [+1755 chars]"},{"source":{"id":null,"name":"Lowkickmma.com"},"author":"Mike Straus, LowKick MMA","title":"Video: Conor McGregor Fights In Amateur Boxing Match - LowKick MMA","description":"Video: Conor McGregor Fights In Amateur Boxing Match LowKick MMA Video: Conor McGregor competes in exhibition boxing match in Dublin’s Crumlin Boxing Club Bloody Elbow Conor McGregor returned to fighting Friday (sort of) MMAjunkie Bodycam Footage Released Of …","url":"https://www.lowkickmma.com/video-conor-mcgregor-takes-part-in-boxing-match/","urlToImage":"https://www.lowkickmma.com/wp-content/uploads/2017/04/Conor-McGregor.jpg","publishedAt":"2019-04-20T00:49:00Z","content":"MMA superstar Conor McGregor returned to the boxing ring on Friday night to take part in an amateur boxing match at Crumlin Boxing Club, in Dublin.\r\nMcGregor, who just recently returned to train at his first boxing club in his home town, can be seen in the vi… [+1106 chars]"},{"source":{"id":null,"name":"Theroot.com"},"author":"Michael Harriot","title":"Go Green but Buy Black: 10 Black-Owned Cannabis Companies For 4/20","description":"It’s 4/20, so you know what that means! (Just in case my mother is reading this, April 20th is a day that we recreate the time God Facetimed Moses via a burning bush.) Read more...","url":"https://www.theroot.com/go-green-but-buy-black-10-black-owned-cannabis-compani-1834189450","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--8zSdCDA8--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/kskrnjiyskh1l4p0apzy.jpg","publishedAt":"2019-04-20T17:48:00Z","content":"Its 4/20, so you know what that means! (Just in case my mother is reading this, April 20th is a day that we recreate the time God Facetimed Moses via a burning bush.)\r\nAnd to celebrate this holy day, we have provided a list of 10 black-owned cannabis dispensa… [+4147 chars]"},{"source":{"id":null,"name":"Redstate.com"},"author":"davenj1","title":"Dispatches From the Democratic Clown Show- 2020","description":"news of the weird and ridiculous The post Dispatches From the Democratic Clown Show- 2020 appeared first on RedState.","url":"https://www.redstate.com/diary/davenj1/2019/04/20/dispatches-democratic-clown-show-2020/","urlToImage":"https://www.redstate.com/wp-content/uploads/2017/08/clowncar.jpg","publishedAt":"2019-04-20T11:27:23Z","content":"==================Promoted from the diaries by streiff. Promotion does not imply endorsement.==================\r\nThe big news on the Democratic campaign trail was the entry of two new candidates in the mix- Tim Ryan and Eric Swalwell.\r\nAll joking aside, the c… [+6273 chars]"},{"source":{"id":null,"name":"Norml.org"},"author":"Carly Wolf, NORML State Policies Coordinator","title":"Weekly Legislative Roundup 4/20/19","description":"Welcome to the 4/20 edition of NORML's Weekly Legislative Roundup!","url":"https://blog.norml.org/2019/04/20/weekly-legislative-roundup-4-20-19/","urlToImage":"https://blog.norml.org/wp-content/uploads/2019/04/action-center-map-b-900x450.png","publishedAt":"2019-04-20T20:20:21Z","content":"Weekly Legislative Roundup 4/20/19\r\nby Carly Wolf, NORML State Policies CoordinatorApril 20, 2019\r\nWelcome to the 4/20 edition of NORML’s Weekly Legislative Roundup! I’d like to wish everyone a very Happy Holidaze, and remember to consume responsibly!\r\nAt the… [+12885 chars]"},{"source":{"id":null,"name":"Lawyersgunsmoneyblog.com"},"author":"Erik Loomis","title":"Today in the Swamp","description":"Maybe serving on corporate boards of the mining companies he dedicated himself to serving will also provide him time to learn how to use a fishing pole so he can cosplay as a Real Man of the West more effectively. Zinke joins the board of Nevada-based U.S. Go…","url":"http://www.lawyersgunsmoneyblog.com/2019/04/today-in-the-swamp","urlToImage":"http://www.lawyersgunsmoneyblog.com/wp-content/uploads/2017/12/zinke-exploring-bears-ears_h.jpg","publishedAt":"2019-04-20T14:05:38Z","content":"Zinke joins the board of Nevada-based U.S. Gold Corp.\r\n“I am confident that my prior experience can add tremendous value to the company,” Zinke said. “I am excited to work closely with management and the Board to help make mining great again in America.” http… [+67 chars]"},{"source":{"id":null,"name":"Lawyersgunsmoneyblog.com"},"author":"Erik Loomis","title":"Warren and Race","description":"The only way to explain the fact that in the most diverse primary in Democratic Party history, the top 4 candidates are all white men, including 2 who have done absolutely nothing of note, is misogyny and racism among Democratic voters. This may not be overt;…","url":"http://www.lawyersgunsmoneyblog.com/2019/04/warren-and-race","urlToImage":"http://www.lawyersgunsmoneyblog.com/wp-content/uploads/2019/02/warren-elizabeth-1024x548.png","publishedAt":"2019-04-20T12:58:37Z","content":"The only way to explain the fact that in the most diverse primary in Democratic Party history, the top 4 candidates are all white men, including 2 who have done absolutely nothing of note, is misogyny and racism among Democratic voters. This may not be overt;… [+3209 chars]"},{"source":{"id":null,"name":"Nationalinterest.org"},"author":"Steve Weintz","title":"The Day a U.S. Navy Nuclear Powered Aircraft Carrier Almost Sunk Off California","description":"Steve Weintz Security, It almost happened in 1985. The drowned island tore a sixty-foot-long gash in the side of the Enterprise’s torpedo-resistant hull. Three of the four giant propellers were totaled and the port keel gone. Spend some time with Google Earth…","url":"https://nationalinterest.org/blog/buzz/day-us-navy-nuclear-powered-aircraft-carrier-almost-sunk-california-53562","urlToImage":"https://nationalinterest.org/sites/default/files/main_images/L9.jpeg","publishedAt":"2019-04-20T02:43:00Z","content":"The drowned island tore a sixty-foot-long gash in the side of the Enterprises torpedo-resistant hull. Three of the four giant propellers were totaled and the port keel gone.\r\nSpend some time with Google Earth, an atlas or a globe and you will see that Califor… [+5292 chars]"},{"source":{"id":null,"name":"Nationalinterest.org"},"author":"Dave Majumdar","title":"\"Fighting Mr. Invincible\": I Tried to Win a Dog Fight Against an F-22 Raptor","description":"Dave Majumdar Security, It did not end so well. Flying back to Langley, the experience was an eye-opener. I have been covering the Raptor and the F-35 since beginning of both programs. It is one thing to intellectually grasp the power of stealth, but seeing i…","url":"https://nationalinterest.org/blog/buzz/fighting-mr-invincible-i-tried-win-dog-fight-against-f-22-raptor-53542","urlToImage":"https://nationalinterest.org/sites/default/files/main_images/1000w_q95%20%281%29.jpeg","publishedAt":"2019-04-20T13:37:00Z","content":"Flying back to Langley, the experience was an eye-opener. I have been covering the Raptor and the F-35 since beginning of both programs. It is one thing to intellectually grasp the power of stealth, but seeing it in action makes one a believerour flight had n… [+8416 chars]"},{"source":{"id":null,"name":"Voanews.com"},"author":"webdesk@voanews.com (Associated Press)","title":"Warren Is First 2020 Democrat to Call for Impeachment","description":"Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of special counsel Robert M…","url":"https://www.voanews.com/a/warren-is-first-2020-democrat-to-call-for-impeachment-/4884080.html","urlToImage":"https://gdb.voanews.com/358E1A96-55C9-487B-81FE-5D408968F5D9_w1200_r1_s.jpg","publishedAt":"2019-04-20T01:07:13Z","content":"WASHINGTON  Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of special coun… [+2755 chars]"},{"source":{"id":null,"name":"Yourmileagemayvary.net"},"author":"Your Mileage May Vary","title":"Happy 420! So, Can You Fly With Weed Now, Or What?","description":"The rules regarding marijuana have been rapidly evolving so it can be confusing to understand the restrictions on flying with what may be a legal amount of weed from where you are leaving from. If you would have asked, “Can you fly with pot?” to a group of fr…","url":"https://yourmileagemayvary.net/2019/04/20/happy-420-so-can-you-fly-with-weed-now-or-what/","urlToImage":"https://yourmileagemayvary.net/wp-content/uploads/2019/04/marijuana-3801012_960_720.jpg","publishedAt":"2019-04-20T20:15:51Z","content":"The rules regarding marijuana have been rapidly evolving so it can be confusing to understand the restrictions on flying with what may be a legal amount of weed from where you are leaving from.\r\nIf you would have asked, “Can you fly with pot?” to a group of f… [+8175 chars]"},{"source":{"id":"newsweek","name":"Newsweek"},"author":"Dan Cancian","title":"Terence Crawford vs Amir Khan: Where to Watch, Live Stream Info and Odds for WBO Welterweight Title Bout","description":"The WBO welterweight title will be on the line at the Madison Square Garden on Saturday night.","url":"https://www.newsweek.com/terence-crawford-vs-amir-khan-wbo-welterweight-title-odds-tv-info-1397810","urlToImage":"https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2019/04/16/terence-crawford-amir-khan.jpg","publishedAt":"2019-04-20T10:00:02Z","content":"The WBO welterweight title will be on the line in New York City on Saturday night, when Terence Crawford takes former unified light-welterweight champion Amir Khan.\r\nArguably one of the best pound-for-pound boxer at the moment, the American is unbeaten since … [+2758 chars]"},{"source":{"id":null,"name":"Ctvnews.ca"},"author":"Hunter Woodall","title":"Democrats running for president divided on investigating Trump post-White House - CTV News","description":"Democrats running for president divided on investigating Trump post-White House CTV News Trump camp did no wrong by taking Russian help, lawyer Rudy Giuliani says The Globe and Mail Trump reached out to intelligence chiefs for help as probe began: Report Nati…","url":"https://www.ctvnews.ca/world/democrats-running-for-president-divided-on-investigating-trump-post-white-house-1.4387945","urlToImage":"https://www.ctvnews.ca/polopoly_fs/1.4388028.1555801233!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","publishedAt":"2019-04-20T23:01:00Z","content":"AMHERST, N.H. -- Some Democratic contenders for president aren't saying whether they would re-open investigations into U.S. President Donald Trump if they were to oust him from the White House in 2020.\r\nTheir reluctance comes as some liberals, including fello… [+1753 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Ashley Thomas","title":"Elizabeth Warren becomes first 2020 Democratic candidate to call for Trump's impeachment","description":"Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of special counsel Robert M…","url":"https://www.chicagotribune.com/news/nationworld/politics/ct-elizabeth-warren-trump-impeachment-20190419-story.html","urlToImage":"https://www.trbimg.com/img-5cba6353/turbine/ct-elizabeth-warren-trump-impeachment-20190419","publishedAt":"2019-04-20T00:03:00Z","content":"Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of special counsel Robert M… [+2806 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"Elizabeth Warren becomes first 2020 Democrat to call for impeachment of Trump","description":"Senator Elizabeth Warren has become the first 2020 Democratic presidential candidate to make a full-throated call for the House to begin impeachment proceedings against President Donald Trump.","url":"https://indianexpress.com/article/world/elizabeth-warren-becomes-first-2020-democrat-to-call-for-impeachment-of-trump-5685341/","urlToImage":"https://images.indianexpress.com/2019/01/warren_2020_2-1.jpg?w=759","publishedAt":"2019-04-20T01:27:52Z","content":"Sen. Elizabeth Warren speaks to potential supporters at Columbia College in Columbia, S.C., Jan. 23, 2019. (The New York Times: Travis Dove)\r\nSen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call … [+2865 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"How Juventus won its 8th straight Serie A title","description":"When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult","url":"https://www.usatoday.com/story/sports/soccer/2019/04/20/how-juventus-won-its-8th-straight-serie-a-title/39370709/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/9f586dec55eea5d4f02d4e4086420c4d5806f3ea/c=0-198-3800-2336/local/-/media/2019/04/20/USATODAY/usatsports/8dee9c3345404927ad0918bc77906299.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-20T19:10:35Z","content":"MILAN (AP) When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult.\r\nAnd so it proved as Juventus and Cristiano Ronaldo continued breaking records.\r\nOn Sat… [+5072 chars]"},{"source":{"id":null,"name":"Newyorker.com"},"author":"Eric Lach","title":"Bernie Sanders’s Electability Tour","description":"Eric Lach writes about Bernie Sanders’s tour through the Midwest—Wisconsin, Indiana, Ohio, Michigan, and Pennsylvania—as a Democratic candidate for the 2020 Presidential election.","url":"https://www.newyorker.com/news/dispatch/bernie-sanderss-electability-tour","urlToImage":"https://media.newyorker.com/photos/5cb75eb385215b2b2c37de32/16:9/w_1200,h_630,c_limit/Lach-BernieMidwestTour.jpg","publishedAt":"2019-04-20T09:00:00Z","content":"On a recent Friday afternoon in April, a large crowd gathered in a park on the shore of Lake Mendota, in downtown Madison, Wisconsin, for a Bernie Sanders rally. Spring hadnt yet fully settled on the Midwestit was overcast, with a cold wind blowingbut hundred… [+14868 chars]"},{"source":{"id":null,"name":"Hackernoon.com"},"author":"Ledgerback","title":"Genericide: Trademarking “Blockchain”","description":"By charles adjovu, Ledgerback, and Alex R","url":"https://hackernoon.com/genericide-trademarking-blockchain-67cf2ab49562","urlToImage":"https://cdn-images-1.medium.com/max/1200/1*DsM_YT2c2AdYSJOmDFW7YA.png","publishedAt":"2019-04-20T13:56:01Z","content":"Returning to the trademark implications of cryptocurrency, we need to consider how it is used in the industry and colloquially. Similar to the term blockchain, when cryptocurrency is used to refer to a specific project, it is not Cryptocurrency [Project], rat… [+7667 chars]"},{"source":{"id":null,"name":"Stripes.com"},"author":null,"title":"Final farewell for Nevada World War II veteran","description":"After his father, a Navy veteran, died 31 years ago, Gary Parisena's mother assured him there would be a proper funeral. Not until earlier this month did Parisena realize his father's remains had not been interred.","url":"https://www.stripes.com/news/us/final-farewell-for-nevada-world-war-ii-veteran-1.577684?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+starsandstripes%2Fgeneral+%28Stars+and+Stripes%29","urlToImage":"https://www.stripes.com/polopoly_fs/1.577685.1555737145!/image/image.jpg_gen/derivatives/landscape_490/image.jpg","publishedAt":"2019-04-20T05:14:01Z","content":"FERNLEY, Nev. Life aboard an aircraft carrier in the South Pacific provided its own grueling battle of survival, especially during the last two years of World War II when Japanese pilots and soldiers ramped up their attack on the approaching Americans.\r\nU.S. … [+4566 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Adam Forrest, Adam Forrest","title":"Mueller report: Elizabeth Warren becomes first 2020 candidate to call for Trump's impeachment","description":"Massachusetts senator urges elected officials to 'do their constitutional duty'","url":"https://www.independent.co.uk/news/world/americas/us-politics/mueller-report-trump-elizabeth-warren-democratic-impeachment-2020-a8878886.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/02/06/08/elizabeth-warren.jpg","publishedAt":"2019-04-20T10:26:35Z","content":"Elizabeth Warren has become the first 2020 election candidate to make a clear call for impeachment proceedings against Donald Trump following the release of special counsel Robert Muellers redacted report.\r\nThe Massachusetts senator tweeted that it would be d… [+12323 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Steve Appleford","title":"Whimsical, eccentric art is a serious part of the Coachella experience","description":"There’s no predicting how anyone might react to a huge piece of art, and right now a young man in khaki shorts is losing all composure on the top level of the Spectra tower at the Coachella Valley Music and Arts Festival in Indio. He’s pacing, stomping, shout…","url":"https://www.latimes.com/entertainment/music/la-et-ms-coachella-art-20190420-story.html","urlToImage":"https://www.latimes.com/resizer/XAGYqi00sP2B-GwlpwJaJOTunT8=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/OH6GWZFZ7FEG5BHEZT24ZIBWOE.jpg","publishedAt":"2019-04-20T18:35:00Z","content":"Theres no predicting how anyone might react to a huge piece of art, and right now a young man in khaki shorts is losing all composure on the top level of the Spectra tower at the Coachella Valley Music and Arts Festival in Indio. Hes pacing, stomping, shoutin… [+5870 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"Democratic hopefuls demur on pursuing Trump post-White House","description":"AMHERST, N.H. (AP) — Some Democratic contenders for president aren't saying whether they would re-open investigations into President Donald Trump if they were to oust him from the White House in 2020.                   Their reluctance comes as some liberals,…","url":"https://economictimes.indiatimes.com/news/international/world-news/democratic-hopefuls-demur-on-pursuing-trump-post-white-house/articleshow/68972732.cms","urlToImage":"https://img.etimg.com/photo/65498029.cms","publishedAt":"2019-04-20T22:42:05Z","content":"AMHERST, N.H. (AP) — Some Democratic contenders for president aren't saying whether they would re-open investigations into President Donald Trump if they were to oust him from the White House in 2020.\r\nTheir reluctance comes as some liberals, including fellow… [+1757 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By HUNTER WOODALL Associated Press","title":"Democratic hopefuls demur on pursuing Trump post-White House","description":"AMHERST, N.H. (AP) — Some Democratic contenders for president aren't saying whether they would re-open investigations into President Donald Trump if they were to oust him from the White House in 2020.","url":"https://apnews.com/cb6eb4e9a18945a6be1dc700fbde68c8","urlToImage":"https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/5/de/5dec5683-8e8e-5ff1-a89b-0d8886aca273/5cbba0f294bed.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize","publishedAt":"2019-04-20T22:38:31Z","content":"AMHERST, N.H. (AP) Some Democratic contenders for president aren't saying whether they would re-open investigations into President Donald Trump if they were to oust him from the White House in 2020.\r\nTheir reluctance comes as some liberals, including fellow 2… [+1884 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By DANIELLA MATAR Associated Press","title":"How Juventus won its 8th straight Serie A title","description":"MILAN (AP) — When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult.","url":"https://apnews.com/2faa07f576264f9690005c75af349ec7","urlToImage":"https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/7/27/72751766-c04c-5c6d-99cb-59da25807a4d/5cbb734fc9d91.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize","publishedAt":"2019-04-20T19:10:48Z","content":"MILAN (AP) When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult.\r\nAnd so it proved as Juventus and Cristiano Ronaldo continued breaking records.\r\nOn Sat… [+5066 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"NV Reno NV Zone Forecast","description":"NV Reno NV Zone Forecast for Friday, April 19, 2019","url":"https://www.richmond.com/news/ap/nv-reno-nv-zone-forecast/article_c9eb96e8-8417-57ed-8d3c-0c708355e120.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-20T10:36:15Z","content":"NV Reno NV Zone Forecast for Friday, April 19, 2019\r\n468 FPUS55 KREV 201032\r\nZFPREV\r\nWestern Nevada-Eastern Sierra-Northeast California Zone Forecast\r\nNational Weather Service Reno NV\r\n332 AM PDT Sat Apr 20 2019\r\nThis is an automatically generated product tha… [+5198 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"MO Springfield MO Zone Forecast","description":"MO Springfield MO Zone Forecast for Friday, April 19, 2019","url":"https://www.richmond.com/news/ap/mo-springfield-mo-zone-forecast/article_ad67c902-48f5-514b-bef1-f51e3b6692ce.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-20T07:56:10Z","content":"MO Springfield MO Zone Forecast for Friday, April 19, 2019\r\n956 FPUS53 KSGF 200752 AAA\r\nZFPSGF\r\nZone Forecasts for Missouri...UPDATED\r\nNational Weather Service Springfield MO\r\n252 AM CDT Sat Apr 20 2019\r\nMOZ090-200915-\r\nGreene-\r\nIncluding the city of Springfi… [+50321 chars]"},{"source":{"id":"the-hill","name":"The Hill"},"author":"Maria McFarland Sánchez-Moreno, Opinion Contributor","title":"Beyond 420, marijuana is not fun and games","description":"Marijuana prohibition ruins lives. People will smoke marijuana whether it’s legal or not. Legalization just allows black and brown communities to not be targeted for something that most white people can do without a second thought.","url":"https://thehill.com/blogs/congress-blog/judicial/439853-beyond-420-marijuana-is-not-fun-and-games","urlToImage":"https://thehill.com/sites/default/files/marijuana.jpg","publishedAt":"2019-04-20T17:15:09Z","content":"April 20 is national cannabis culture day. To people who love marijuana, its often a playful opportunity to celebrate. To the media, its often a time to make jokes or roll eyes.\r\nIts time to get real about marijuana policy, and the 650,000 people still arrest… [+4876 chars]"},{"source":{"id":null,"name":"Thestar.com"},"author":"Mitch Smith - The New York Times","title":"Still reeling from a massacre, Illinois city recoils as former member of ‘Ripper Crew’ moves in","description":"Thomas Kokoraleis is a convicted murderer, and, as of last month, a free man. But even after serving more than three decades in prison, Kokoraleis remains a pariah.","url":"https://www.thestar.com/news/world/2019/04/20/reeling-from-massacre-an-illinois-city-recoils-as-a-killer-moves-in.html","urlToImage":"https://images.thestar.com/b5EWw2KEz1Nx_IUau423dIejpV8=/1200x885/smart/filters:cb(1555795067540)/https://www.thestar.com/content/dam/thestar/news/world/2019/04/20/reeling-from-massacre-an-illinois-city-recoils-as-a-killer-moves-in/thomas_kokoraleis.jpg","publishedAt":"2019-04-20T20:59:54Z","content":"The arrival of Kokoraleis has raised questions about what authority, if any, local governments have to choose who lives in their midst. It has shown the complications of releasing prisoners at a time when there is a bipartisan push to reduce the country’s inm… [+6542 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Nevada revives wild horse birth control program","description":"RENO, Nev. (AP) — Nevada horse advocates are looking forward to getting back to their work in the field after the state agreed to resume a birth control project for a herd of free-roaming mustangs near Reno.","url":"https://apnews.com/16fbb45cb0034f0aa71293b15d0b9b9d","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T18:17:07Z","content":"RENO, Nev. (AP) Nevada horse advocates are looking forward to getting back to their work in the field after the state agreed to resume a birth control project for a herd of free-roaming mustangs near Reno.\r\nThe Reno Gazette-Journal reports the volunteers are … [+785 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Nevada Assembly against expanding Nellis range into refuge","description":"CARSON CITY, Nev. (AP) — The Nevada Assembly has gone on record as opposing proposed expansion of the Nellis Air Force Base testing and training range into the Desert National Wildlife Refuge.","url":"https://apnews.com/19491bac91154716adcce5449de97b8b","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T17:35:05Z","content":"CARSON CITY, Nev. (AP) The Nevada Assembly has gone on record as opposing proposed expansion of the Nellis Air Force Base testing and training range into the Desert National Wildlife Refuge.\r\nThe Nevada Appeal reported Thursday that Democratic Assemblywoman L… [+502 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Mail stolen several times from post offices in Henderson","description":"HENDERSON, Nev. (AP) — The U.S. Postal Service's law enforcement division says mail has been stolen from two post offices in Henderson in southern Nevada on multiple days in April.","url":"https://apnews.com/64f453ec67284f01a06276fdc538c176","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T22:49:31Z","content":"HENDERSON, Nev. (AP) The U.S. Postal Service's law enforcement division says mail has been stolen from two post offices in Henderson in southern Nevada on multiple days in April.\r\nPostal Inspector Liz Davis says the thefts of trays of mail apparently were con… [+582 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By BEN BOTKIN The Statesman Journal","title":"Law allowing salvage of roadkill proves popular","description":"SALEM, Ore. (AP) — Three months in, Oregonians have embraced a new law that lets them claim for food deer and elk killed along the state's highways.","url":"https://apnews.com/e9ab792908d4407cb22e47822cf35f82","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T14:05:28Z","content":"SALEM, Ore. (AP) Three months in, Oregonians have embraced a new law that lets them claim for food deer and elk killed along the state's highways.\r\nMore than 200 permits were issued by March 31, and primarily where expected: rural areas with an abundant suppl… [+6937 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"DANIELLA MATAR","title":"How Juventus won its 8th straight Serie A title","description":"MILAN (AP) — When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult. And so it proved as Juventus and Cristiano Ronaldo continued breaking records. On Sat…","url":"https://www.seattletimes.com/nation-world/how-juventus-won-its-8th-straight-serie-a-title/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-20T19:10:48Z","content":"MILAN (AP) When the best team in Italy signed possibly the best player in the world, preventing it from winning yet another Serie A title was always going to be difficult.\r\nAnd so it proved as Juventus and Cristiano Ronaldo continued breaking records.\r\nOn Sat… [+4938 chars]"},{"source":{"id":null,"name":"Stltoday.com"},"author":"By The Associated Press","title":"Golden Knights try to secure series win over the Sharks","description":"San Jose Sharks (46-27-9, second in the Pacific Division during the regular season) vs. Vegas Golden Knights (43-32-7, third in the Pacific Division during the regular season)","url":"https://www.stltoday.com/sports/hockey/golden-knights-try-to-secure-series-win-over-the-sharks/article_8cad1062-06e3-5731-9b51-88560f124179.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517","publishedAt":"2019-04-20T19:05:00Z","content":"San Jose Sharks (46-27-9, second in the Pacific Division during the regular season) vs. Vegas Golden Knights (43-32-7, third in the Pacific Division during the regular season)\r\nParadise, Nevada; Sunday, 1 p.m. EDT\r\nWESTERN CONFERENCE FIRST ROUND: Vegas leads … [+1626 chars]"},{"source":{"id":null,"name":"Stltoday.com"},"author":"By Stu Durando St. Louis Post-Dispatch","title":"Billikens transfer Mike Lewis II always wanted to be a Billiken","description":"Members of the previous coaching staff at St. Louis University were familiar to Mike Lewis II, who saw Jim Crews and his assistants when they were recruiting Lewis’ teammates at Chaminade.","url":"https://www.stltoday.com/sports/college/slu/billikens-transfer-mike-lewis-ii-always-wanted-to-be-a/article_c60e7ced-b32c-5a6b-b7ee-83cedcbaf6c9.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/d/56/d562ad00-eccb-524c-b917-3d065fe2f9e8/5cba78b3ee974.image.jpg?crop=1538%2C865%2C0%2C240&resize=1120%2C630&order=crop%2Cresize","publishedAt":"2019-04-20T03:05:00Z","content":"Members of the previous coaching staff at St. Louis University were familiar to Mike Lewis II, who saw Jim Crews and his assistants when they were recruiting Lewis teammates at Chaminade.\r\nThe targets were Jayson Tatum and Tyler Cook, but Lewis couldnt get th… [+3428 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"FerdiS","title":"Dividend Increases: April 8-19, 2019","description":"With earnings season picking up, several companies declared dividend increases in the past two weeks. I like to monitor dividend increases for stocks on my watc","url":"https://seekingalpha.com/article/4255533-dividend-increases-april-8minus-19-2019","urlToImage":"https://static.seekingalpha.com/uploads/2019/4/20/saupload_divgro-dividends-small.png","publishedAt":"2019-04-20T16:59:39Z","content":"One way to identify dividend growth stocks for further analysis is to monitor dividend increases. Companies can only raise their dividends regularly and sustainably if they grow earnings sufficiently.\r\nThe CCC List provides a good starting point, but I limit … [+14708 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"The Latest: Sen. Booker says impeachment talk is premature","description":"The Latest on New Jersey Sen. Cory Booker's visit to rural Nevada (all times local): 3:20 p.m. New Jersey Sen. Cory Booker says it's too soon to talk about impeaching … Click to Continue »","url":"https://www.charlotteobserver.com/news/politics-government/national-politics/article229478939.html#storylink=rss","urlToImage":"https://www.mcclatchy-wires.com/incoming/h260s7/picture229491579/alternates/LANDSCAPE_1140/Election_2020_Cory_Booker_Nevada_95176.jpg","publishedAt":"2019-04-20T00:20:24Z","content":"The Latest: Sen. Booker says impeachment talk is premature\r\nMINDEN, Nev.\r\n The Latest on New Jersey Sen. Cory Booker's visit to rural Nevada (all times local):\r\n3:20 p.m.\r\nNew Jersey Sen. Cory Booker says it's too soon to talk about impeaching President Donal… [+2369 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Megan Rose","title":"He helped wrongfully convict a man. Two decades later, his daughter worked on a law to make amends","description":"A college student learned that her dad, now a judge, had prosecuted a man who was later found innocent.","url":"https://www.salon.com/2019/04/20/he-helped-wrongfully-convict-a-man-two-decades-later-his-daughter-worked-on-a-law-to-make-amends_partner/","urlToImage":"https://media.salon.com/2018/03/prison-cell2.jpg","publishedAt":"2019-04-20T18:59:11Z","content":"If all goes as expected, this summer, the governor of Nevada will sign a bill that will compensate men and women wrongfully convicted in the state for the years they spent behind bars and grant them certificates of innocence.Inspired by recent high-profile ex… [+11023 chars]"},{"source":{"id":"rt","name":"RT"},"author":"RT","title":"Khabib in the house! UFC lightweight king watches octagon action in St. Petersburg","description":"UFC lightweight king Khabib Nurmagomedov was in attendance as the octagon hit Russia for UFC St. Petersburg on Saturday.","url":"https://www.rt.com/sport/457102-khabib-nurmagomedov-ufc-russia/","urlToImage":"https://cdni.rt.com/files/2019.04/article/5cbb588afc7e93697f8b45e0.jpg","publishedAt":"2019-04-20T17:42:03Z","content":"The event at Yubileyniy Palace in the north of Russia – the promotion’s second on the country – is being headlined by heavyweight veterans Alistair Overeem of the Netherlands and Russia’s Aleksei Oleinik.  \r\nREAD MORE: UFC St. Petersburg: Heavyweight veterans… [+1355 chars]"},{"source":{"id":null,"name":"11alive.com"},"author":null,"title":"Elizabeth Warren calls for impeachment proceedings against Trump","description":"Warren is the first Democratic 2020 candidate to call for the initiation of the impeachment process.","url":"https://www.11alive.com/article/news/elizabeth-warren-calls-for-house-to-begin-impeachment-proceedings/507-56ef113e-cc74-46a3-b952-cb91b7823010","urlToImage":"https://media.11alive.com/assets/CCT/images/63971f61-6cdd-446e-a2ef-1fc902c79935/63971f61-6cdd-446e-a2ef-1fc902c79935_1140x641.jpg","publishedAt":"2019-04-20T00:41:12Z","content":"WASHINGTON D.C., DC Sen. Elizabeth Warren on Friday became the first 2020 Democratic presidential candidate to make a full-throated call for the House of Representatives to begin impeachment proceedings against President Donald Trump after the release of spec… [+3279 chars]"},{"source":{"id":null,"name":"Lasvegasnow.com"},"author":"Sasha Loftis","title":"Two Las Vegas donor recipients share their stories in hope of helping others","description":"As thousands of people across the country wait for organ transplants to continue their quality of life, 8 News Now was able to speak with two donor recipients, as they share their stories to help others.","url":"https://www.lasvegasnow.com/news/local-news/two-las-vegas-donor-recipients-share-their-stories-in-hope-of-helping-others/1940379950","urlToImage":"https://media.lasvegasnow.com/nxsglobal/lasvegasnow/photo/2019/04/19/donor%203_1555732853607.jpg_83382910_ver1.0_1280_720.jpg","publishedAt":"2019-04-20T04:01:19Z","content":"LAS VEGAS (KLAS) -- As thousands of people across the country wait for organ transplants to continue their quality of life, 8 News Now was able to speak with two donor recipients, as they share their stories to help others. \r\n\"I could feel I was dying,\" donor… [+1731 chars]"}]}