{"status":"ok","totalResults":525,"articles":[{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MATT STEVENS","title":"Seth Moulton, Massachusetts Congressman, Is Running for President","description":"Representative Seth Moulton at the Barley House in Concord, N.H., last month. Mr. Moulton has entered a Democratic primary field already packed with contenders.","url":"https://www.nytimes.com/2019/04/22/us/politics/seth-moulton-president.html","urlToImage":"https://static01.nyt.com/images/2019/04/17/us/00Moulton/merlin_152187873_f6c01486-b5f2-4cd1-a99a-10fd1f709133-facebookJumbo.jpg","publishedAt":"2019-04-22T11:11:46Z","content":"[Learn where Seth Moulton stands on foreign policy, the environment and more.]\r\nDuring his time in Congress, Mr. Moulton, who represents a district in northeastern Massachusetts, has passed bills aimed at improving the way health care is delivered to veterans… [+1346 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"NEAL E. BOUDETTE","title":"Elon Musk Predicts Tesla Driverless Taxi Fleet Next Year","description":"A Tesla delivery site in Norway. Tesla’s chief executive, Elon Musk, says the company is on the verge of making cars that can drive themselves safely on any road.","url":"https://www.nytimes.com/2019/04/22/business/elon-musk-tesla-autopilot.html","urlToImage":"https://static01.nyt.com/images/2019/04/22/business/22tesla1/22tesla1-facebookJumbo.jpg","publishedAt":"2019-04-22T23:45:15Z","content":"Just last week, a parked Tesla caught fire at a service center near Pittsburgh. The car had previously caught fire in February, according to a local news report. In February, a man was killed in Florida when the Tesla he was driving crashed and was engulfed i… [+2181 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Scott Davis","title":"The Cardinals hold the keys to the NFL draft, and some think it is not a lock for them to draft Kyler Murray","description":"The Arizona Cardinals could hold the keys to the NFL draft with the No. 1 pick. The Cardinals are rumored to be interested in taking Oklahoma quarterback Kyler Murray with the top pick, but if they don't, it could create a scramble for quarterback-needy teams…","url":"https://www.businessinsider.com/nfl-draft-arizona-cardinals-qb-kyler-murray-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbdf5e6b14bf401584093c2-1334-667.jpg","publishedAt":"2019-04-22T18:07:46Z","content":"The NFL draft is just days away, and perhaps the most interesting plot revolves around what the Arizona Cardinals do with the No. 1 pick. \r\n To some, the debate is already over — the Cardinals will take Oklahoma quarterback Kyler Murray, who he knows and has … [+3128 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Frank Olito","title":"The 12 best amusement parks in the US that aren't Disney","description":"There are amusement parks all over the country that are great — and cheaper — alternatives to Disney parks. Cedar Point in Ohio, Silver Dollar City in Missouri, and Dollywood in Tennessee have thrilling rides that are comparable to those at Disney. Busch Gard…","url":"https://www.thisisinsider.com/underrated-cheap-amusement-parks-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbe35cf2730ca2444735769-750.jpg","publishedAt":"2019-04-22T21:44:16Z","content":"Although a trip to Disney is supposed to be filled with magic, sometimes it can just be expensive, crowded, and downright disappointing. \r\n But there are other amusement parks all over the country that have exciting rides and experiences at half the cost. Whi… [+289 chars]"},{"source":{"id":null,"name":"Profootballweekly.com"},"author":null,"title":"Greg Gabriel: 2019 NFL Mock Draft - Pro Football Weekly","description":"Greg Gabriel: 2019 NFL Mock Draft Pro Football Weekly Quinnen Williams about to fulfill a dream and his mother’s last request Tampa Bay Times Mock Draft: Three Alabama players expected first round 247Sports 2019 NFL Mock Draft: What happens when the Cardinals…","url":"https://www.profootballweekly.com/2019/04/22/greg-gabriel-2019-nfl-mock-draft/aof04kg/","urlToImage":"https://www.profootballweekly.com/_internal/cimg!0/6aanj62zcclsxfikecfb2kgn03kj3nu","publishedAt":"2019-04-22T14:18:00Z","content":"The 2019 NFL draft will be an interesting one because it will unfold much differently than in recent years. We have seen in the past few drafts a running back go in the top 10, which wont be the case this year. In fact, dont be surprised if a running back doe… [+7832 chars]"},{"source":{"id":null,"name":"Insidethestar.com"},"author":"Brian Martin","title":"Potential DE Prospects Dallas Cowboys Could Target in Each Round - Inside The Star","description":"Potential DE Prospects Dallas Cowboys Could Target in Each Round Inside The Star Mock drafts developing consensus on who 49ers should pick NBCSports.com Welcome To The Jon Gruden Show Deadspin Greg Gabriel: 2019 NFL Mock Draft Pro Football Weekly Report: Raid…","url":"https://insidethestar.com/potential-de-prospects-dallas-cowboys-could-target-in-each-round/","urlToImage":"https://i2.wp.com/insidethestar.com/wp-content/uploads/2019/04/bmartin_nfl-draft_potential-de-prospects-dallas-cowboys-could-target-in-each-round.jpg?resize=1000%2C600&ssl=1","publishedAt":"2019-04-22T15:23:12Z","content":"They've searched far and wide to get an understanding of this draft class in hopes of finding the best players possible for the 2019 season and beyond. The Dallas Cowboys, however, may find some of their best options right down the road in College Station.\r\nD… [+8403 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Ryan Grenoble","title":"Vermont Poised To Officially Replace Columbus Day With Indigenous Peoples’ Day","description":"“It is a time to reflect on our understanding of our country’s history, both the good and the bad,” a New Mexico lawmaker said earlier this year when his...","url":"https://www.huffpost.com/entry/vermont-indigenous-peoples-day-columbus_n_5cbdd04ae4b06605e3f15e8d","urlToImage":"https://img.huffingtonpost.com/asset/5cbddee62400000c03044ebf.jpeg?cache=4xgs28yuie&ops=1910_1000","publishedAt":"2019-04-22T16:15:53Z","content":"If all goes to plan in Vermont, the second Monday in October will soon officially be Indigenous Peoples Day instead of Columbus Day.\r\nLegislators in the state passed a bill to that effect last Wednesday, seeking to codify whats been a tradition since 2016, th… [+1216 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Country star, Titans coach talk about NFL draft in Nashville","description":"Country music star Tim McGraw watched as Philadelphia hosted the NFL draft in 2017 with more than 250,000 people on hand and immediately had a vision of how to make the three-day event even better","url":"https://www.usatoday.com/story/sports/nfl/2019/04/22/country-star-titans-coach-talk-about-nfl-draft-in-nashville/39377969/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/c2cf213d89c6e755a230da1db39edb36e819fed8/c=0-376-4224-2752/local/-/media/2019/04/22/USATODAY/usatsports/55c3224c7da4423ca22e101e53d16ba3.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T07:55:16Z","content":"NASHVILLE, Tenn. (AP) Country music star Tim McGraw watched as Philadelphia hosted the NFL draft in 2017 with more than 250,000 people on hand and immediately had a vision of how to make the three-day event even better.\r\nBring it to Nashville and add the Musi… [+6634 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Defense order of the day for 1st round of NFL draft","description":"We learned during the 2018 season that offense is beloved by NFL teams (and fans). Yet the Super Bowl score was 13-3.","url":"https://www.usatoday.com/story/sports/nfl/2019/04/22/defense-order-of-the-day-for-1st-round-of-nfl-draft/39380279/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/90eafae7388de3e3dc46c909fbe134d033f0717c/c=0-279-3702-2361/local/-/media/2019/04/22/USATODAY/usatsports/ba26619958484abb80ab3f26840dc7c0.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T21:12:24Z","content":"NASHVILLE, Tenn. (AP) We learned during the 2018 season that offense is beloved by NFL teams (and fans). We also learned that defense, as performed by the Patriots in the Super Bowl, carries away the Lombardi Trophy.\r\nThis year's draft, which begins Thursday … [+6249 chars]"},{"source":{"id":null,"name":"Indystar.com"},"author":"Indianapolis Star, Dana Hunsinger Benbow, Indianapolis Star","title":"The story behind why an NFL linebacker made a stop for a good Samaritan tire change","description":"This was no stranger that Indianapolis Colt Darius Leonard saw stranded on the side of the road. That was Ms. Isbell, his high school biology teacher.","url":"https://www.indystar.com/story/sports/2019/04/22/story-behind-darius-leonard-and-his-good-samaritan-tire-change/3538672002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/PIND/dada400e-8e9b-4871-91b0-13e0106d44d8-Leonard_tire.jpg?crop=719,404,x0,y14&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T22:54:09Z","content":"Leonard saw his high school biology teacher Martha Isbell on the side of the road Easter morning with her tire blown. She posted this video of him helping her out.\r\n Dana Hunsinger Benbow, dana.benbow@indystar.com\r\nThis was no stranger that Darius Leonard saw… [+3398 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Josh Hafner and Kirk A. Bado, USA TODAY","title":"They found 75 bomb detonators in a dump","description":"From the latest with the Sri Lanka bombings to Earth Day, here's Monday's top news.","url":"https://www.usatoday.com/story/news/2019/04/22/earth-day-sri-lanka-and-miguel-cabrera-heres-mondays-top-news/3359376002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/USAT/da405253-9df0-4adf-b33f-6733af4c7002-AFP_AFP_1FU2L2.JPG?crop=4410,2481,x0,y167&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T23:22:15Z","content":"A woman prays at St. Sebastian's Church in Negombo on April 22, 2019, a day after the building was hit as part of a series of bomb blasts targeting churches and luxury hotels in Sri Lanka.\r\n (Photo: JEWEL SAMAD, AFP/Getty Images)\r\nIt's a bleak Monday, friends… [+5042 chars]"},{"source":{"id":null,"name":"247wallst.com"},"author":"24/7 Wall Street, Samuel Stebbins, 24/7 Wall Street","title":"Viva Las Vegas, here's the fastest growing cities in each state and Sin City is among them","description":"Nearly every state has at least one city that has reported rapid population growth in recent years. Net migration and natural growth are the factors.","url":"https://247wallst.com/special-report/2019/04/18/the-fastest-growing-city-in-each-state-4?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2019/04/18/USATODAY/usatsports/gettyimages-946583362.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T10:00:07Z","content":"The U.S. population growth rate recently hit a low point not seen since 1937, when the country was in the thick of the Great Depression. The U.S. population grew by just 0.62% between July 2017 and July 2018, according to Census Bureau data. The slowing natio… [+13870 chars]"},{"source":{"id":null,"name":"Digitaltrends.com"},"author":"Bruce Brown","title":"Where to go when your EV is low: Rich neighborhoods have most charging stations","description":"If you're running low on juice in your electric vehicle, head for the rich part of town. A survey by Realtor.com found home prices are higher in areas with more electric vehicle charging stations. The median list price for homes in the 20 ZIP codes with the m…","url":"https://www.digitaltrends.com/cars/realtorcom-ev-charging-stations-zip-code-home-prices/","urlToImage":"https://icdn3.digitaltrends.com/image/volta_free_ev_charging_station_with_intercharge_logo-1-1200x630-c-ar1.91.jpg","publishedAt":"2019-04-22T13:15:38Z","content":"If you’re running low on juice in your electric car, truck, or SUV, head for the wealthiest part of town. An April survey by Realtor.com found that home prices in the top 20 areas in the U.S. with the most electric vehicle charging stations were more than two… [+2540 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Ashley Fetters","title":"When Families Feud Over Vaccines","description":"The question of whether vaccinations should be a duty or a choice has caused rifts between relatives.","url":"https://www.theatlantic.com/family/archive/2019/04/when-families-feud-over-vaccines/587629/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_95012012/facebook.jpg?1555946906","publishedAt":"2019-04-22T15:32:51Z","content":"Colleen Brown of Cleveland, Ohio, has been known to post on Facebook now and again about the dangers of not vaccinating kids—local news stories about schools closing because a student has been exposed to the measles, she says, that kind of thing. A few years … [+9012 chars]"},{"source":{"id":null,"name":"Thesunmagazine.org"},"author":null,"title":"The Great Work: Ralph Nader on Taking Back Power from the Corporate State","description":"Ralph Nader On Taking Back Power From The Corporate State","url":"https://www.thesunmagazine.org/issues/521/the-great-work","urlToImage":"http://www.thesunmagazine.org/files/2019-04/521-04-aguilar-preview.jpg","publishedAt":"2019-04-22T01:59:05Z","content":"Ralph Nader ran for president four times, but most people only remember when he ran against Al Gore and George W. Bush in 2000. As the Green Party nominee Nader got nearly 3 million votes, 97,421 of them in Florida — a pivotal state where, after a contentious… [+48946 chars]"},{"source":{"id":null,"name":"Sciencedaily.com"},"author":null,"title":"Was the restaurant really that bad -- Or was it just the rain?","description":"There are a few things that will result in poor customer reviews of a restaurant: bad service, bad food -- and bad weather. A study of 32 Florida restaurants found that customers left more negative remarks on comment cards on days when it was raining than on …","url":"https://www.sciencedaily.com/releases/2019/04/190422082243.htm","urlToImage":null,"publishedAt":"2019-04-22T12:22:43Z","content":"There are a few things that will result in poor customer reviews of a restaurant: bad service, bad food -- and bad weather.A study of 32 Florida restaurants found that customers left more negative remarks on comment cards on days when it was raining than on d… [+4283 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Ashley Reese on The Slot, shared by Ashley Reese to Jezebel","title":"Andrew Yang Wants to Be America's First Ex-Goth President","description":"When it comes to the fringe Democratic candidates of the 2020 election cycle, Andrew Yang might be one of the fringiest: the 44-year-old startup type, a former corporate lawyer and executive who founded a nonprofit to help recent college graduates also become…","url":"https://theslot.jezebel.com/andrew-yang-wants-to-be-americas-first-ex-goth-presiden-1834116197","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--Jv9-BXMe--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/pqnd2xsxbfn6oriluonq.png","publishedAt":"2019-04-22T16:00:00Z","content":"When it comes to the fringe Democratic candidates of the 2020 election cycle, Andrew Yang might be one of the fringiest: the44-year-old startup type, a former corporate lawyer and executive who founded a nonprofit to help recent college graduates also become … [+12325 chars]"},{"source":{"id":null,"name":"Avclub.com"},"author":"The A.V. Club on AUX, shared by Marnie Shure to The A.V. Club","title":"Who's actually as \"outdoorsy\" as they claim on Tinder, and who's lying? Outside/In investigates","description":"The return of HBO’s Game Of Thrones for its eighth and final season also marked the return of the myriad Game Of Thrones podcasts populating the iTunes store. A Cast Of Kings, hosted by Dave Chen (The /Filmcast) and Joanna Robinson (Vanity Fair), is easily on…","url":"https://aux.avclub.com/whos-actually-as-outdoorsy-as-they-claim-on-tinder-a-1834158114","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--7dx0lOJc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/iyln99bpaaoovdvesu0f.jpg","publishedAt":"2019-04-22T17:00:00Z","content":"The return of HBOs Game Of Thrones for its eighth and final season also marked the return of the myriad Game Of Thrones podcasts populating the iTunes store. A Cast Of Kings, hosted by Dave Chen (The /Filmcast) and Joanna Robinson (Vanity Fair), is easily one… [+15345 chars]"},{"source":{"id":null,"name":"Space.com"},"author":"Paul Sutter","title":"What Makes the Strong Force So Special?","description":"All four known forces of nature have their own unique place — and the strong nuclear force governs the very small.","url":"https://www.space.com/how-the-strong-force-works-physics.html","urlToImage":"https://cdn.mos.cms.futurecdn.net/aDZ3Qyck4fR9EqNRNpC4Bg-1200-80.jpg","publishedAt":"2019-04-22T11:35:41Z","content":"Paul M. Sutter is an astrophysicist at The Ohio State University, host of Ask a Spacemanand Space Radio, and author of Your Place in the Universe\r\n. Sutter contributed this article to Space.com's Expert Voices: Op-Ed &amp; Insights\r\n.\r\nAll four known forces o… [+6026 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Ella Nilsen","title":"Rep. Seth Moulton unsuccessfully tried to oust Nancy Pelosi. Now he’s running for president.","description":"Moulton plans to prioritize voting rights and veterans issues in his 2020 bid.","url":"https://www.vox.com/2019/4/22/18300323/seth-moulton-running-for-president","urlToImage":"https://cdn.vox-cdn.com/thumbor/Jq5rA0big5JOatf8eQRV8pK3m0c=/0x0:4928x2580/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16017052/GettyImages_626769350__1_.jpg","publishedAt":"2019-04-22T11:00:00Z","content":"Moulton plans to prioritize voting rights and veterans issues in his 2020 bid. Rep. Seth Moulton (D-MA) is the latest white male candidate to join the massive Democratic primary field for president, billing himself as a young outsider with fresh ideas and mil… [+4851 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"eschneider@politico.com (Elena Schneider)","title":"Klobuchar makes more top hires as she ramps up her presidential bid","description":"The Minnesota Democrat named five new staffers on Monday.","url":"https://www.politico.com/story/2019/04/22/klobuchar-presidential-campaign-hires-1284599","urlToImage":"https://static.politico.com/ef/a7/593309f54c088150419bf9c3dfc8/190422-klobuchar-gty-773.jpg","publishedAt":"2019-04-22T13:12:46Z","content":"Democratic presidential candidate Sen. Amy Klobuchar speaks to the media after holding a Health Care roundtable on April 16 in Miami, Florida. | Joe Raedle/Getty Images\r\nAmy Klobuchar rolled out additional top hires for her presidential bid, a sign of her int… [+2577 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Tansey","title":"2019 NFL Mock Draft: 1st-Round Predictions and Stock Watch for Hyped Prospects","description":"With a few days remaining until the 2019  NFL  draft begins, speculation is running rampant across the league...","url":"https://bleacherreport.com/articles/2832496-2019-nfl-mock-draft-1st-round-predictions-and-stock-watch-for-hyped-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/170/hi-res-87b13c937a29a07a92a9c6b99d5dfdbe_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T13:07:29Z","content":"Darron Cummings/Associated Press\r\nWith a few days remaining until the 2019 NFL draft begins, speculation is running rampant across the league. \r\nReports regarding which teams like which prospects the best and who could possibly be trade partners will flare up… [+5316 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Brent Sobleski","title":"2019 NFL Draft Features Historic Defensive Line Class","description":"The  NFL  has  never  seen anything quite like the 2019 defensive line class.    The \"Year of the Defensive Lineman\" isn't just a cute designation to drum up interest for the draft in Nashville, Tennessee...","url":"https://bleacherreport.com/articles/2832178-2019-nfl-draft-features-historic-defensive-line-class","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/788/hi-res-3279f370dce59f5266abd87837870df9_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T12:35:48Z","content":"Richard Shiro/Associated Press\r\nThe NFL has never seen anything quite like the 2019 defensive line class.\r\nThe \"Year of the Defensive Lineman\" isn't just a cute designation to drum up interest for the draft in Nashville, Tennessee. This incoming group is on t… [+8464 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Steve Silverman","title":"2019 NFL Draft Rumors: Latest Updates Entering Draft Week","description":"Kyler Murray is the sure-fire No. 1 pick in the upcoming  NFL  draft Thursday, according to the majority of mock drafts and key reports around the league. However, it may not be written in stone just yet...","url":"https://bleacherreport.com/articles/2832401-2019-nfl-draft-rumors-latest-updates-entering-draft-week","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/113/hi-res-44218904ce58dc67399a626815a1822f_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T14:10:19Z","content":"Kyler Murray's status as the No. 1 pick in the NFL draft has been questioned by CBS insider Pete Prisco.Michael Conroy/Associated Press\r\nKyler Murray is the sure-fire No. 1 pick in the upcoming NFL draft Thursday, according to the majority of mock drafts and … [+4723 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Dan Pompei","title":"What's the Story with Montez Sweat?","description":"He has gone from basketball standout to tight end prospect to defensive end force.               From Stephenson High to Michigan State to Copiah-Lincoln Community College to Mississippi State...","url":"https://bleacherreport.com/articles/2832503-whats-the-story-with-montez-sweat","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/173/451c8cfdaf41ad03a8ad3f21e0a43a84_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T12:35:48Z","content":"He has gone from basketball standout to tight end prospect to defensive end force.           \r\nFrom Stephenson High to Michigan State to Copiah-Lincoln Community College to Mississippi State.\r\nFrom Stone Mountain, Georgia, where he was raised by his grandpare… [+11323 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Albert Breer","title":"Mock Draft: Kyler Murray Goes No. 1, Then Five Players Stand Out From the Pack","description":"With just four days until the draft, some decisions are becoming clear while others remain closely guarded secrets. With not enough players deserving of first-round grades to go around, here's how we see Thursday night playing out. Plus, more analysis of Russ…","url":"https://www.si.com/nfl/2019/04/22/mock-draft-kyler-murray-arizona-cardinals-nick-bosa-dwayne-haskins","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/MMQB-4-22-kyler-murray-mike-mayock-russell-wilson.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T06:14:42Z","content":"The finish line is in sight. In under 100 hours, the Cardinals will take Kyler Murray with the first pick in the 2019 NFL Draft. Or they wont. And thats sort of the story for each of the four quarterbacks atop this years classtheres a wide range of outcomes t… [+38804 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Emily Caron","title":"The NBA Draft Decisions That Will Shape the 2019-20 College Basketball Landscape","description":"These 24 college teams have the most to gain or lose before the 2019 NBA draft's withdrawal deadline at the end of May.","url":"https://www.si.com/college-basketball/2019/04/22/nba-draft-decisions-ncaa-return-kentucky-michigan-kansas","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/22/nba-draft-decisions-2019-stay-or-go_0.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T21:46:04Z","content":"With Cassius Winston returning for Michigan State, the Spartans have their star player (and top spot in SIs way-too-early 201920 rankings) locked in. But with the new NBA draft rules allowing greater freedom for underclassmen to get a feel for their professio… [+28316 chars]"},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Allison Hussey","title":"Sad Planets: Akron, Ohio","description":"The Black Keys Patrick Carney and longtime indie-rock journeyman John Petkovic team up on a graceless, unsubtle pastiche of rock’n’roll indulgence.","url":"https://pitchfork.com/reviews/albums/sad-planets-akron-ohio/","urlToImage":"https://media.pitchfork.com/photos/5cb498da4eacca2dd1c46570/2:1/w_1000/SadPlanets_AkronOhio.jpg","publishedAt":"2019-04-22T05:00:00Z","content":"Over the past decade, Patrick Carney has cemented himself as the rhythmic core of the Black Keys. While Dan Auerbach ambled outward with woolly, blues-tinged guitar riffs, Carneys muscular pummeling rooted the songs with leaden precision. In the bands current… [+3926 chars]"},{"source":{"id":null,"name":"Deadline.com"},"author":"Greg Evans","title":"New Stage Works By Beth Henley, Tom Kitt Included In 35th Annual Powerhouse Season; Works-In-Progress Fest Gave Start To ‘Hamilton’, ‘The Humans’","description":"EXCLUSIVE: New plays and musicals by Pulitzer Prize winners Beth Henley (Crimes of the Heart) and Tom Kitt (Next To Normal) are among the works-in-progress set for this summer’s 35th edition of the prestigious Powerhouse Season of Vassar and New York Stage an…","url":"https://deadline.com/2019/04/powerhouse-season-beth-henley-tom-kitt-rachel-chavkin-hamilton-the-humans-1202599703/","urlToImage":"https://pmcdeadline2.files.wordpress.com/2019/04/henley-kitt.jpg?w=1024","publishedAt":"2019-04-22T18:18:32Z","content":"EXCLUSIVE: New plays and musicals by Pulitzer Prize winners Beth Henley (Crimes of the Heart) and Tom Kitt (Next To Normal) are among the works-in-progress set for this summer’s 35th edition of the prestigious Powerhouse Season of Vassar and New York Stage an… [+6425 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"2019 NFL draft features: In-depth stories on the top prospects","description":"Catch up on the stories behind the 2019 draft's best prospects and most interesting personalities.","url":"http://www.espn.com/nfl/draft2019/story/_/id/26378822/2019-nfl-draft-features-depth-stories-top-prospects","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0418%2Fquinnenwilliams1_ms_16x9.jpg","publishedAt":"2019-04-22T01:07:28Z","content":"As the 2019 NFL draft nears, ESPN.com over the next month is telling in-depth feature stories on several of the top prospects. Check back here throughout the month to read more.\r\nThe draft begins April 25 at 8 p.m. ET on ESPN, ABC and the ESPN App. Coverage c… [+24289 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Greg Hanlon","title":"Victim Accuses Ex-Ohio Teacher of Grooming Him for Sex at Age 12, Then Having His Baby","description":"A former Ohio teacher who sexually abused her student and had the teen’s baby is now being sued by him, PEOPLE confirms. In March 2018, Laura Lynn Cross, now 38, pleaded guilty to three counts of felony sexual battery against the student. Cleveland.com report…","url":"https://people.com/crime/victim-accuses-ex-ohio-teacher-grooming-him-sex-age-12-having-his-baby/","urlToImage":"https://peopledotcom.files.wordpress.com/2018/03/laura-lynn-cross.jpg?crop=0px%2C571px%2C1825px%2C957px&resize=1200%2C630","publishedAt":"2019-04-22T20:30:28Z","content":"A former Ohio teacher who sexually abused her student and had the teens baby is now being sued by him, PEOPLE confirms.\r\nIn March 2018, Laura Lynn Cross, now 38, pleaded guilty to three counts of felony sexual battery against the student. Cleveland.com report… [+2678 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Jen Juneau","title":"Supergirl Star Jeremy Jordan and Wife Ashley Spencer Welcome Daughter Clara Eloise","description":"Congratulations are in order for Jeremy Jordan and Ashley Spencer! The spouses of six years welcomed their first child together, a daughter named Clara Eloise Jordan, on Easter Sunday, the new dad announced on Instagram Monday alongside a photo slideshow of h…","url":"https://people.com/parents/jeremy-jordan-ashley-spencer-welcome-daughter-clara-eloise/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/jeremy-jordan-1.jpg?crop=0px%2C428px%2C1072px%2C564px&resize=1200%2C630","publishedAt":"2019-04-22T19:40:22Z","content":"Congratulations are in order for Jeremy Jordan and Ashley Spencer!\r\nThe spouses of six years welcomed their first child together, a daughter named Clara Eloise Jordan, on Easter Sunday, the new dad announced on Instagram Monday alongside a photo slideshow of … [+2481 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Lambert Strether","title":"2:00PM Water Cooler 4/22/2019","description":"By Lambert Strether of Corrente. Trade “China Isn’t Cheating on Trade” [Peter Beinart, The Atlantic]. “From Elizabeth Warren, who earlier this year claimed that China has “weaponized its economy,” to Marco Rubio, who last year tweeted that the Chinese aim to …","url":"https://www.nakedcapitalism.com/2019/04/200pm-water-cooler-4-22-2019.html","urlToImage":"https://www.nakedcapitalism.com/wp-content/uploads/2019/04/activists.jpg","publishedAt":"2019-04-22T18:00:48Z","content":"By Lambert Strether of Corrente.\r\nTrade\r\n“China Isn’t Cheating on Trade” [Peter Beinart, The Atlantic]. “From Elizabeth Warren, who earlier this year claimed that China has “weaponized its economy,” to Marco Rubio, who last year tweeted that the Chinese aim t… [+20270 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Brenda Richardson, Contributor, Brenda Richardson, Contributor https://www.forbes.com/sites/brendarichardson/","title":"It Pays To Be Green: Homes Near Electric-Vehicle Charging Stations Fetch Top Dollar","description":"A new realtor.com analysis finds that you’ll pay a premium to live in a metro area that accommodates electric vehicles.","url":"https://www.forbes.com/sites/brendarichardson/2019/04/21/it-pays-to-be-green-homes-near-electric-vehicle-charging-stations-fetch-top-dollar/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fbrendarichardson%2Ffiles%2F2019%2F04%2FAdobeStock_79022703-1-1200x800.jpeg","publishedAt":"2019-04-22T03:21:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nA new study shows a link between the prevalence of electric-vehicle charging stations and higher home prices.\r\nAdobe Stock\r\nClose proximity to electric-vehicle charging stations is becoming the new hardw… [+7565 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"John Dorfman, Contributor, John Dorfman, Contributor https://www.forbes.com/sites/johndorfman/","title":"Bargain Hunters: Walgreens, AT&T And 8 Other Cheapest Sector Stocks","description":"Here are the cheapest stock in each of the major stock market sectors.","url":"https://www.forbes.com/sites/johndorfman/2019/04/22/bargain-hunters-walgreens-att-and-8-other-cheapest-sector-stocks/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F612756058%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T13:12:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nWhat would happen if you bought the cheapest stock in each of the major stock market sectors?\r\nIve explored that question in 11 columns, from 2002 through 2006, and from 2013 to the present. I call this … [+9019 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"David Ching, Contributor, David Ching, Contributor https://www.forbes.com/sites/davidching/","title":"The SEC Could Be Poised To Set A New Record For NFL Draft Picks This Week","description":"The SEC set a modern-day NFL draft record with 63 players from the conference selected in the 2013 draft. Judging by prominent draft analysts' prospect rankings entering this week's NFL draft, it's entirely possible that the SEC could match, or surpass, its o…","url":"https://www.forbes.com/sites/davidching/2019/04/22/the-sec-could-be-poised-to-set-a-new-record-for-nfl-draft-picks-this-weekend/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F0f6643687143492ba72077f0236253b2%2F960x0.jpg%3FcropX1%3D298%26cropX2%3D3260%26cropY1%3D263%26cropY2%3D1929","publishedAt":"2019-04-22T12:00:00Z","content":"Auburn quarterback Jarrett Stidham and Mississippi State defensive end Montez Sweat are both among the SEC players who expect to be drafted by NFL teams this week in Nashville. (AP Photo/Rogelio V. Solis, File)\r\nASSOCIATED PRESS\r\nWere days away from the NFL d… [+7581 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Gary Stern, Contributor, Gary Stern, Contributor https://www.forbes.com/sites/garystern/","title":"Mission BBQ: Combining Tasty Barbecue With A Patriotic Mission Paying Off","description":"Adding over 20 restaurants a year, Mission BBQ is expanding quickly but it’s also dedicated to patriotism and serving its communities.","url":"https://www.forbes.com/sites/garystern/2019/04/22/mission-bbq-combining-tasty-barbecue-with-a-patriotic-mission-paying-off/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fgarystern%2Ffiles%2F2019%2F04%2FMISSION.doc_-1200x841.jpg","publishedAt":"2019-04-22T12:56:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nThe Mission BBQ located in Mason, Ohio\r\nCourtesty of Mission BBQ\r\nWhen close friends Bill Kraus and Steve Newton opened their first Mission BBQ in Glen Barrie, Maryland on September 11, 2011, they chose … [+11914 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Blake Morgan, Contributor, Blake Morgan, Contributor https://www.forbes.com/sites/blakemorgan/","title":"10 Examples of Over-The-Top Experiences In Customer Service","description":"The tougher the situation the customer is going through, the more important it is to step up for the customer at the point of need.  Let's look at how some employees take customer service to the next level by finding creative solutions to help customers.","url":"https://www.forbes.com/sites/blakemorgan/2019/04/22/10-examples-of-over-the-top-experiences-in-customer-service/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1142774728%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T14:36:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nThe tougher the situation the customer is going through, the more important it is to step up for the customer at the point of need. However often when customers are going through difficult situations, we… [+11029 chars]"},{"source":{"id":null,"name":"Cleveland.com"},"author":"Rich Exner, cleveland.com","title":"Why census citizenship question before Supreme Court Tuesday is a big deal, and what it could mean for Ohio - cleveland.com","description":"Why census citizenship question before Supreme Court Tuesday is a big deal, and what it could mean for Ohio cleveland.com Supreme Court to decide if Trump administration can ask about citizenship in 2020 census NBC News How a census question about citizenship…","url":"https://www.cleveland.com/datacentral/2019/04/why-citizenship-question-before-supreme-court-tuesday-is-a-big-deal-and-what-it-could-mean-for-ohio.html","urlToImage":"https://www.cleveland.com/resizer/cV8zk-3vkwSXut2wUD80sIeV9O0=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/3RADUR4ELNCUBFKGJEKNNJABZ4.jpg","publishedAt":"2019-04-22T21:29:00Z","content":"The U.S. Supreme Court on Tuesday will hear arguments in what has become a hotly contested political debate: Should the U.S. Census Bureau be permitted to add a question asking every household in the United States about citizenship?\r\nA lower court has said no… [+5137 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Paul Steinhauser","title":"Sanders tops Biden in New Hampshire poll, as Buttigieg surges - Fox News","description":"Sanders tops Biden in New Hampshire poll, as Buttigieg surges Fox News Trump Privately Praises Bernie Sanders, Even as He Publicly Calls Him Crazy The Daily Beast Pete Buttigieg compares Bernie supporters and Trump fans New York Post Bernie Sanders claims his…","url":"https://www.foxnews.com/politics/sanders-tops-biden-in-poll-buttigieg-surges","urlToImage":"https://media2.foxnews.com/BrightCove/694940094001/2019/04/16/694940094001_6026735365001_6026735084001-vs.jpg","publishedAt":"2019-04-22T17:25:50Z","content":"MANCHESTER, N.H. A new poll in the state that holds the first primary in the race for the White House shows Sen. Bernie Sanders of neighboring Vermont leading in the battle for the Democratic presidential nomination.\r\nThe University of New Hampshire Granite S… [+3963 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Samuel Chamberlain","title":"Kansas' new governor vetoes abortion 'reversal' rule, setting up showdown with GOP - Fox News","description":"Kansas' new governor vetoes abortion 'reversal' rule, setting up showdown with GOP Fox News Republicans see late-term abortion bills as a potent 2020 political issue Los Angeles Times View full coverage on Google News","url":"https://www.foxnews.com/politics/kansas-new-governor-vetoes-abortion-reversal-rule-setting-up-showdown-with-gop","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-c3519c81e57740029ec86688afaee59e.jpeg","publishedAt":"2019-04-22T20:28:24Z","content":"Kansas' new governor vetoed a bill Monday that would require doctors and abortion clinics to tell their patients about a disputed treatment meant to stop a medication abortion.\r\nThe veto from Gov. Laura Kelly, a Democrat, sets up a showdown with a Republican-… [+2583 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Fox News","title":"New details in Sri Lanka Easter Sunday bombings as death toll rises; Dems divided on impeaching Trump - Fox News","description":"New details in Sri Lanka Easter Sunday bombings as death toll rises; Dems divided on impeaching Trump Fox News Pres. Trump incorrectly tweets that millions have died in Sri Lanka bombing USA TODAY Donald and Melania Trump Retreat to Mar-a-Lago for Easter in t…","url":"https://www.foxnews.com/us/new-details-in-sri-lanka-easter-sunday-bombings-as-death-toll-rises-dems-divided-on-impeaching-trump","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/SriLanka042219.jpg","publishedAt":"2019-04-22T08:51:24Z","content":"Welcome to Fox News First. Not signed up yet? Click here.Developing now, Monday, April 22, 2019\r\nNEW DETAILS IN SRI LANKA BOMBINGS EMERGE AS DEATH TOLL RISES: The series of bombings that ripped through churches and hotels in Sri Lanka on Easter Sunday and lef… [+8712 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Paul Steinhauser","title":"Meet the 2020 spouses: The high-powered men and women behind the candidates - Fox News","description":"Meet the 2020 spouses: The high-powered men and women behind the candidates Fox News They're the better, but lesser-known, halves of the 2020 presidential candidates. But thanks to their time on the campaign trail, as well as cameos in magazine...","url":"https://www.foxnews.com/politics/meet-the-2020-spouses-the-high-powered-men-and-women-behind-the-candidates","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Dem-Couples-2.jpg","publishedAt":"2019-04-22T16:29:17Z","content":"They’re the better, but lesser-known, halves of the 2020 presidential candidates.\r\nBut thanks to their time on the campaign trail, as well as cameos in magazine profiles and social media livestreams, the spouses of the nearly two-dozen people running for pres… [+13705 chars]"},{"source":{"id":null,"name":"Theringer.com"},"author":"Danny Kelly","title":"The Five Biggest Questions Ahead of the NFL Draft - The Ringer","description":"The Five Biggest Questions Ahead of the NFL Draft The Ringer NFL Draft 2019 Rumors: Kyler Murray Won't Be Taken at No. 1 by Cardinals Bleacher Report Cardinals to hold final meeting discussing No. 1 pick NFL.com Peter King: Miami heavily investigating QB Josh…","url":"https://www.theringer.com/2019/4/22/18510172/nfl-draft-five-biggest-questions-kyler-murray-arizona-cardinals","urlToImage":"https://cdn.vox-cdn.com/thumbor/Sb15R4WDQeiiQyJbXl-hHC2_Tbs=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16181242/danny_kelly_draft_questions_getty_ringer.jpg","publishedAt":"2019-04-22T10:00:00Z","content":"The NFL draft remains one of the most unpredictable events in sports. Sifting through rumors and reports often only adds to the confusion, and the months-long run-up to Thursday nights big event hasnt provided many concrete answersonly more questions. With th… [+12849 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Dan Mihalascu","title":"Honda Slowing Accord, Civic U.S. Production Though Isn’t Giving Up On Sedans","description":"The automaker will idle the second shift at the Marysville, Ohio plant to retool it for future electrified vehicles.","url":"https://www.carscoops.com/2019/04/honda-slowing-accord-civic-u-s-production-though-isnt-giving-up-on-sedans/","urlToImage":"https://images.carscoops.com/2019/04/f7a367f0-2018-honda-accord-sport-2.0t-0.jpg","publishedAt":"2019-04-22T16:58:29Z","content":"Honda has announced it will temporarily idle a second-shift production line at the Marysville, Ohio assembly plant in August.\r\nThe company said the measure is necessary to prepare the facility for the production of future electrified vehicles. It will take se… [+1863 chars]"},{"source":{"id":null,"name":"Freep.com"},"author":"Ryan Ford","title":"Meet the Big Ten's NFL draft G.O.A.T.s (even beyond Tom Brady) - Detroit Free Press","description":"Meet the Big Ten's NFL draft G.O.A.T.s (even beyond Tom Brady) Detroit Free Press Montez Sweat fits the Buffalo Bills prototype at defensive end Buffalo Rumblings Jonah Williams' unique preparation could make him the NFL draft's top tackle ESPN 2019 Buccaneer…","url":"https://www.freep.com/story/sports/nfl/lions/2019/04/22/best-nfl-players-big-ten-conference/3532958002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2018/10/31/USAT/b72e49b0-bae3-43f3-a9a7-03044e9b3f53-AP_Fearsome_Players_Football_1.JPG?crop=1298,730,x312,y67&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T10:01:00Z","content":"Dave Birkett and Carlos Monarrez break down what they heard from the Detroit Lions on Tuesday, April 16, 2019, in Allen Park.\r\n Carlos Monarrez and Dave Birkett, Detroit Free Press\r\nIt’s NFL draft week once again and this year the draft is in Nashville, deep … [+17786 chars]"},{"source":{"id":null,"name":"Wtap.com"},"author":"Michael Tatar","title":"New Marietta pop culture shop opens after record business month for Ohio - WTAP-TV","description":"New Marietta pop culture shop opens after record business month for Ohio WTAP-TV Ohio saw a record number of new business filings in March.","url":"https://www.wtap.com/content/news/New-pop-culture-shop-opens-508920071.html","urlToImage":"https://media.graytvinc.com/images/n'oasis+retro+shop.jpg","publishedAt":"2019-04-22T23:23:11Z","content":"MARIETTA, Ohio (WTAP) - New small businesses are usually a good sign for the economy and last month, Ohio saw a record number of new business filings.\r\nA record 13, 747 new entities filed to do business in the Buckeye state in March. Filing doesn't assure a b… [+611 chars]"},{"source":{"id":null,"name":"Wvpublic.org"},"author":"West Virginia Public Broadcasting","title":"The Fight for Medical Marijuana Business in the Ohio Valley - West Virginia Public Broadcasting","description":"The Fight for Medical Marijuana Business in the Ohio Valley West Virginia Public Broadcasting In southeast Ohio, marijuana was once something officials tried to eliminate. Now officials hope medical marijuana can replace lost jobs and revenue.","url":"https://www.wvpublic.org/post/fight-medical-marijuana-business-ohio-valley","urlToImage":"https://www.wvpublic.org/sites/wvpn/files/styles/medium/public/201811/wvmorning-facebook.jpg","publishedAt":"2019-04-22T16:38:42Z","content":"In southeast Ohio, marijuana was once something officials tried to eliminate. Now officials hope medical marijuana can replace lost jobs and revenue.\r\nMedical marijuana is becoming more popular among voters and politicians around the Ohio Valley. And not just… [+777 chars]"},{"source":{"id":null,"name":"Newsobserver.com"},"author":null,"title":"State saw record number of new business filings in March - Raleigh News & Observer","description":"State saw record number of new business filings in March Raleigh News & Observer Ohio set a record last month for most new business filings in a single month.","url":"https://www.newsobserver.com/news/business/article229531429.html","urlToImage":null,"publishedAt":"2019-04-22T09:38:00Z","content":null},{"source":{"id":null,"name":"Bradenton.com"},"author":"The_Associated_Press, The Associated Press","title":"State saw record number of new business filings in March - Bradenton Herald","description":"State saw record number of new business filings in March Bradenton Herald Ohio set a record last month for most new business filings in a single month.","url":"https://www.bradenton.com/news/business/article229531429.html","urlToImage":"https://www.bradenton.com/wps/source/images/bradenton/facebook.jpg","publishedAt":"2019-04-22T09:38:00Z","content":"State saw record number of new business filings in March\r\nCOLUMBUS, Ohio\r\n Ohio set a record last month for most new business filings in a single month.\r\nRepublican Secretary of State Frank LaRose said 13,747 new entities filed to do business in the state in … [+555 chars]"},{"source":{"id":null,"name":"Sunherald.com"},"author":"The_Associated_Press, The Associated Press","title":"State saw record number of new business filings in March - Biloxi Sun Herald","description":"State saw record number of new business filings in March Biloxi Sun Herald Ohio set a record last month for most new business filings in a single month.","url":"https://www.sunherald.com/news/business/article229531429.html","urlToImage":"https://www.sunherald.com/wps/source/images/sunherald/facebook.jpg","publishedAt":"2019-04-22T09:38:00Z","content":"State saw record number of new business filings in March\r\nCOLUMBUS, Ohio\r\n Ohio set a record last month for most new business filings in a single month.\r\nRepublican Secretary of State Frank LaRose said 13,747 new entities filed to do business in the state in … [+555 chars]"},{"source":{"id":null,"name":"Wcpo.com"},"author":"https://www.wcpo.com/associated-press","title":"State saw record number of new business filings in March - WCPO","description":"State saw record number of new business filings in March WCPO Ohio set a record last month for most new business filings in a single month.","url":"https://www.wcpo.com/news/state/state-ohio/state-saw-record-number-of-new-business-filings-in-march","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/02ae0c1/2147483647/strip/true/crop/2276x1195+0+25/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F85%2F29%2F4ff5bbfd45cba57333d822b336cf%2Fgrand-opening.jpg","publishedAt":"2019-04-22T11:04:00Z","content":"COLUMBUS, Ohio (AP) Ohio set a record last month for most new business filings in a single month.\r\nRepublican Secretary of State Frank LaRose said 13,747 new entities filed to do business in the state in March. That was 848 more than the previous record, set … [+500 chars]"},{"source":{"id":null,"name":"Businessjournaldaily.com"},"author":null,"title":"The Growth of ME Supply Lumber Co. - businessjournaldaily.com","description":"The Growth of ME Supply Lumber Co. businessjournaldaily.com COLUMBIANA, Ohio -- Sales Manager, Cody Holmes walks us through the beginnings of the company and how trends brought on growth.","url":"https://businessjournaldaily.com/the-growth-of-m-e-supply-lumber-co/","urlToImage":"https://businessjournaldaily.com/wp-content/uploads/2019/04/featured-image-5.jpg","publishedAt":"2019-04-22T05:08:12Z","content":null},{"source":{"id":null,"name":"Idahostatesman.com"},"author":"The_Associated_Press, The Associated Press","title":"State saw record number of new business filings in March - Idaho Statesman","description":"State saw record number of new business filings in March Idaho Statesman Ohio set a record last month for most new business filings in a single month.","url":"https://www.idahostatesman.com/news/business/article229531429.html","urlToImage":"https://www.idahostatesman.com/wps/source/images/idahostatesman/facebook.jpg","publishedAt":"2019-04-22T09:38:00Z","content":"State saw record number of new business filings in March\r\nCOLUMBUS, Ohio\r\n Ohio set a record last month for most new business filings in a single month.\r\nRepublican Secretary of State Frank LaRose said 13,747 new entities filed to do business in the state in … [+555 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"The_Associated_Press, The Associated Press","title":"State saw record number of new business filings in March - Miami Herald","description":"State saw record number of new business filings in March Miami Herald Ohio set a record last month for most new business filings in a single month.","url":"https://www.miamiherald.com/news/business/article229531429.html","urlToImage":"https://www.miamiherald.com/wps/source/images/miamiherald/facebook.jpg","publishedAt":"2019-04-22T09:38:00Z","content":"State saw record number of new business filings in March\r\nCOLUMBUS, Ohio\r\n Ohio set a record last month for most new business filings in a single month.\r\nRepublican Secretary of State Frank LaRose said 13,747 new entities filed to do business in the state in … [+555 chars]"},{"source":{"id":null,"name":"Businessjournaldaily.com"},"author":null,"title":"Canfield Township Grows as a Business Hub - businessjournaldaily.com","description":"Canfield Township Grows as a Business Hub businessjournaldaily.com CANFIELD, Ohio – When Mike Naffah was growing up, he'd stand outside his home in Canfield Township and count the number of cars that passed by,...","url":"https://businessjournaldaily.com/canfield-township-grows-business-hub/","urlToImage":"https://businessjournaldaily.com/wp-content/uploads/2019/04/canfield-twp-dev1.jpg","publishedAt":"2019-04-22T09:07:11Z","content":"CANFIELD TOWNSHIP, Ohio When Mike Naffah was growing up on his family farm on the corner of U.S. Route 224 and Raccoon Road in Canfield, the corridor was a two-lane highway. Sometimes, he would stand outside waiting to see a car or truck drive by. Today, youd… [+6740 chars]"},{"source":{"id":null,"name":"Businessjournaldaily.com"},"author":null,"title":"Federal Frenzy Returns Downtown April 27 - businessjournaldaily.com","description":"YOUNGSTOWN, Ohio – Federal Frenzy, the downtown music festival hosted by Youngstown State University’s Penguin Productions, will return April 27, featuring more than 20 regional bands. The festival, scheduled 2 to 11 p.m., is free and open to the public. The …","url":"https://businessjournaldaily.com/federal-frenzy-returns-downtown-april-27/","urlToImage":"https://businessjournaldaily.com/wp-content/uploads/2019/04/fed-frenzy-crop.jpg","publishedAt":"2019-04-22T09:07:14Z","content":"YOUNGSTOWN, Ohio Federal Frenzy, the downtown music festival hosted by Youngstown State Universitys Penguin Productions, will return April 27, featuring more than 20 regional bands.\r\nThe festival, scheduled 2 to 11 p.m., is free and open to the public. The he… [+1825 chars]"},{"source":{"id":null,"name":"Businessjournaldaily.com"},"author":null,"title":"YSU Event Fosters Next Generation of Women Accountants - businessjournaldaily.com","description":"By Marah Morrison YOUNGSTOWN, Ohio – The fourth annual Women in Accounting event, which took place at Youngstown State University Friday, was born out of an overheard conversation.  Marsha Huber, a professor of accounting at YSU, said about five years ago, vo…","url":"https://businessjournaldaily.com/ysu-event-fosters-next-generation-of-women-accountants/","urlToImage":"https://businessjournaldaily.com/wp-content/uploads/2019/04/women-acctg1.jpg","publishedAt":"2019-04-22T09:07:19Z","content":"By Marah Morrison\r\nYOUNGSTOWN, Ohio The fourth annual Women in Accounting event, which took place at Youngstown State University Friday, was born out of an overheard conversation. \r\nMarsha Huber, a professor of accounting at YSU, said about five years ago, vo… [+3710 chars]"},{"source":{"id":null,"name":"Nbc4i.com"},"author":"Kristine Varkony","title":"Local apparel business befitting following CBJ playoff series win - NBC4i.com","description":"Local apparel business befitting following CBJ playoff series win NBC4i.com “The whole city is kind of on fire right now with the first playoff series win in 20 years. It's just really awesome right now. To be able to be part of it in some small...","url":"https://www.nbc4i.com/news/local-news/local-apparel-business-befitting-following-cbj-playoff-series-win/1944993750","urlToImage":"https://media.nbc4i.com/nxs-wcmhtv-media-us-east-1/photo/2019/04/22/Local_apparel_business_befitting_followi_9_83762676_ver1.0_1280_720.jpg","publishedAt":"2019-04-22T16:46:00Z","content":"“The whole city is kind of on fire right now with the first playoff series win in 20 years. It’s just really awesome right now. To be able to be part of it in some small way it’s really fantastic,” said co-owner of Where I'm From apparel Ryan Napier.\r\nNapier … [+2529 chars]"},{"source":{"id":null,"name":"Tribtoday.com"},"author":null,"title":"Business briefs | News, Sports, Jobs - Warren Tribune Chronicle","description":"Business briefs | News, Sports, Jobs Warren Tribune Chronicle COURTYARD CANFIELD GETS AWARD: The Courtyard by Marriott Youngstown-Canfield was honored by Marriott International with three awards for superior...","url":"http://www.tribtoday.com/news/business/2019/04/business-briefs-85/","urlToImage":"http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg","publishedAt":"2019-04-22T04:11:15Z","content":"COURTYARD CANFIELD GETS AWARD: The Courtyard by Marriott Youngstown-Canfield was honored by Marriott International with three awards for superior performance, including the prestigious Diamond Circle Award.Diamond Circle, given to seven of 1,071 Courtyard pro… [+3672 chars]"},{"source":{"id":null,"name":"Ohio.com"},"author":"Emily  Mills","title":"Businesses prepare for Howe Avenue construction - Akron Beacon Journal","description":"Businesses prepare for Howe Avenue construction Akron Beacon Journal CUYAHOGA FALLS — Businesses along Howe Avenue want shoppers to know they'll still be open.During the year-and-a-half-long, $5.9 million project to...","url":"https://www.ohio.com/article/20190421/NEWS/190429731","urlToImage":"https://www.ohio.com/storyimage/OH/20190421/NEWS/190429731/AR/0/AR-190429731.jpg","publishedAt":"2019-04-22T00:41:48Z","content":"CUYAHOGA FALLS — Businesses along Howe Avenue want shoppers to know they’ll still be open.\r\nDuring the year-and-a-half-long, $5.9 million project to reconstruct about 1 mile of Howe Avenue between state Route 8 and Buchholzer Boulevard, a portion of Howe Aven… [+5621 chars]"},{"source":{"id":null,"name":"Watchdog.org"},"author":"Tyler Arnold &#124; Watchdog.org","title":"Study: Holland, Michigan best small city to open up a business - Watchdog.org","description":"Study: Holland, Michigan best small city to open up a business Watchdog.org Holland, Michigan, is the best small city in the country to open up a business, according to a WalletHub study released Monday.","url":"https://www.watchdog.org/michigan/study-holland-michigan-best-small-city-to-open-up-a/article_8b5bcd10-654a-11e9-85cb-4f2015616a64.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/watchdog.org/content/tncms/assets/v3/editorial/c/31/c319aa72-3cb2-593b-889b-377f9433025b/5a15a28b49833.image.jpg?resize=949%2C630","publishedAt":"2019-04-22T22:33:00Z","content":"Holland, Michigan, is the best small city in the country to open up a business, according to a WalletHub study released Monday.\r\nThe study classified a small city as any city with a population between 25,000 and 100,000, and 1,261 American cities fit this cri… [+2347 chars]"},{"source":{"id":null,"name":"Ohio.com"},"author":"Beacon Journal/Ohio.com staff","title":"City doubles down on neighborhood business investments - News - Akron Beacon Journal","description":"City doubles down on neighborhood business investments - News Akron Beacon Journal The city is again budgeting more than $600000 in grants to improve storefront properties in struggling neighborhood business districts.Akron Mayor Dan...","url":"https://www.ohio.com/article/20190422/NEWS/190429526","urlToImage":"https://www.ohio.com/Global/images/head/nameplate/fb/ohio_og_fb_image.jpg","publishedAt":"2019-04-22T22:25:46Z","content":"The city is again budgeting more than $600,000 in grants to improve storefront properties in struggling neighborhood business districts.\r\nAkron Mayor Dan Horrigan launched the Great Streets Initiative last spring. The program, administered by the Office of In… [+2801 chars]"},{"source":{"id":null,"name":"News5cleveland.com"},"author":"https://www.news5cleveland.com/jordan-vandenberge","title":"Drivers brace for major road project in Summit Co. - News 5 Cleveland","description":"Drivers brace for major road project in Summit Co. News 5 Cleveland Ahead of a $6 million reconstruction project set to begin April 29, utility work has begun on Howe Avenue, a major roadway that services one of Summit County's...","url":"https://www.news5cleveland.com/news/local-news/oh-summit/businesses-drivers-brace-for-major-road-project-in-summit-co","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/e34cf71/2147483647/strip/true/rotate/180/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F01%2Fb3%2Fe3545f834db6925f2c960c65e9ca%2Fhowe-1.jpeg","publishedAt":"2019-04-22T20:30:00Z","content":"CUYAHOGA FALLS, Ohio Ahead of a $6 million reconstruction project set to begin April 29, utility work has begun on Howe Avenue, a major roadway that services one of Summit Countys busiest shopping centers. With more than 20,000 vehicles using Howe Ave. on a d… [+3113 chars]"},{"source":{"id":null,"name":"Twincities.com"},"author":"Pioneer Press","title":"Business People: Sunday, April 21 - St. Paul Pioneer Press","description":"Business People: Sunday, April 21 St. Paul Pioneer Press Arden Hills-based farmer co-op and dairy-goods brand Land O'Lakes announced that Pete Kappelman joined the company as senior vice president, member...","url":"https://www.twincities.com/2019/04/21/business-people-sunday-april-21/","urlToImage":"https://www.twincities.com/wp-content/themes/twincities/static/images/twincities.jpg","publishedAt":"2019-04-22T04:17:00Z","content":"AGRICULTURE\r\nArden Hills-based farmer co-op and dairy-goods brand Land O’Lakes announced that Pete Kappelman joined the company as senior vice president, member and government relations.\r\nCONSTRUCTION\r\nLS Black Constructors, St. Paul, announced the addition o… [+8351 chars]"},{"source":{"id":null,"name":"Heraldtribune.com"},"author":"Staff Report","title":"Business People: Promotions, awards and moves for Sarasota-Manatee professionals - Sarasota Herald-Tribune","description":"Business People: Promotions, awards and moves for Sarasota-Manatee professionals Sarasota Herald-Tribune Sarasota Title Services Inc. has hired Robin Eekhof as director of business development.Eekhof has more than 15 years of sales and marketing experience.","url":"https://www.heraldtribune.com/article/20190422/NEWS/190429895","urlToImage":"https://www.heraldtribune.com/storyimage/LK/20190422/NEWS/190429895/AR/0/AR-190429895.jpg","publishedAt":"2019-04-22T08:07:11Z","content":"Sarasota Title Services Inc. has hired Robin Eekhof as director of business development.\r\nEekhof has more than 15 years of sales and marketing experience. Her main focus at Sarasota Title Services Inc. will be expanding the company’s customer base and increas… [+9430 chars]"},{"source":{"id":null,"name":"Hogshaven.com"},"author":"Mark Tyler","title":"Why Dwayne Haskins Should be the Redskins Pick in Round One - Hogs Haven","description":"Why Dwayne Haskins Should be the Redskins Pick in Round One Hogs Haven Since the date that underclassmen could declare for the 2019 NFL Draft passed, I have had Ohio State's Dwayne Haskins ranked as the best quarterback in this... View full coverage on Google…","url":"https://www.hogshaven.com/2019/4/22/18510665/why-dwayne-haskins-should-be-the-redskins-pick-in-round-one","urlToImage":"https://cdn.vox-cdn.com/thumbor/Z0bDaobO7MvztfvRXT25g0UG15I=/0x712:3040x2304/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15976510/usa_today_12269030.jpg","publishedAt":"2019-04-22T20:29:53Z","content":"Since the date that underclassmen could declare for the 2019 NFL Draft passed, I have had Ohio States Dwayne Haskins ranked as the best quarterback in this draft class. Now, its been very close between him and Drew Lock for me, but the slight edge has always … [+2958 chars]"},{"source":{"id":null,"name":"Ninersnation.com"},"author":"Patrick Holloway","title":"NFL Draft rumors: 49ers looking edge rusher per Jay Glazer’s mailbag - Niners Nation","description":"NFL Draft rumors: 49ers looking edge rusher per Jay Glazer’s mailbag Niners Nation Mock drafts developing consensus on who 49ers should pick NBCSports.com 2019 NFL Draft Rumors: Raiders, Eagles, Colts Interested in RB Josh Jacobs Bleacher Report NFL Will the …","url":"https://www.ninersnation.com/2019/4/22/18510059/jay-glazer-mailbag-nfl-draft-rumors-edge-rusher","urlToImage":"https://cdn.vox-cdn.com/thumbor/FfI60Rin72MuW-hmPRbxlAkh_6M=/0x576:3360x2466/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/63650014/1126977225.jpg.0.jpg","publishedAt":"2019-04-22T13:32:00Z","content":"Its the worst kept secret that if the San Francisco 49ers stay in the top-five of the 2019 NFL Draft, theyll be going defense. Ohio State defensive end Nick Bosa seems the choice, unless the Arizona Cardinals decides to take him first. Theres also Alabama def… [+1371 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"McShay's 2019 NFL draft buzz - What I'm hearing on top prospects, teams, picks - ESPN","description":"McShay's 2019 NFL draft buzz - What I'm hearing on top prospects, teams, picks ESPN Alabama may have the most first-round picks for third consecutive draft NBC Sports Jaguars path to the draft | The case for DE Montez Sweat at No. 7 WJXT News4JAX Jonah Willia…","url":"http://www.espn.com/nfl/draft2019/insider/story/_/id/26575675/mcshay-2019-nfl-draft-buzz-hearing-top-prospects-teams-picks","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0422%2Fr532483_2_1296x729_16%2D9.jpg","publishedAt":"2019-04-22T12:27:16Z","content":"It's finally draft week. Which 2019 NFL draft prospects do teams with top picks like? Who is flying up draft boards? When should we expect the quarterbacks to be selected?\r\nWe won't know for sure which players will end up where until their names are called at… [+1556 chars]"},{"source":{"id":null,"name":"Theblaze.com"},"author":"Breck Dumas","title":"President Trump sues Democratic House chairman to block subpoena for private financial records","description":"President Donald Trump and several of his private organizations have sued House Committee on Oversight and Reform Chairman Rep. Elijah Cummings (D-Md.) and others in an attempt to block the committee's subpoena for 10 years' worth of documents relating to Tru…","url":"https://www.theblaze.com/news/trump-sues-to-stop-subpoena-of-financial-documents","urlToImage":"https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19410352%2F1200x600.jpg/2000%2C2000/FjU3gRc%2BZMBmzEmK/img.jpg","publishedAt":"2019-04-22T19:25:07Z","content":"President Donald Trump and several of his private organizations have sued House Committee on Oversight and Reform Chairman Rep. Elijah Cummings (D-Md.) and others in an attempt to block the committee's subpoena for 10 years' worth of documents relating to Tru… [+2142 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By Jay Michaelson","title":"This Week’s Supreme Court Case Could Decide the 2024 Election","description":"Photo Illustration by The Daily Beast/Photo Getty If the Trump administration succeeds in adding the question “Are you a U.S. Citizen?” to the 2020 census, the Census Bureau estimates that 6.5 million people won’t respond to the census at all. Most of those w…","url":"https://www.thedailybeast.com/department-of-commerce-v-new-york-supreme-court-case-could-decide-2024-election-9","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555893858/190421-michaelson-2024-tease_tavajf","publishedAt":"2019-04-22T08:45:33Z","content":"If the Trump administration succeeds in adding the question Are you a U.S. Citizen? to the 2020 census, the Census Bureau estimates that 6.5 million people wont respond to the census at all.\r\nMost of those will be Hispanics or people with immigrants in their … [+6765 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Country star, Titans coach talk about NFL draft in Nashville","description":"Country star, Titans coach talk about NFL draft in Nashville","url":"https://www.foxsports.com/nfl/story/country-star-titans-coach-talk-about-nfl-draft-in-nashville-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/55c3224c7da4423ca22e101e53d16ba3.vresize.1200.630.high.81.jpg","publishedAt":"2019-04-22T07:55:23Z","content":"NASHVILLE, Tenn. (AP) — Country music star Tim McGraw watched as Philadelphia hosted the NFL draft in 2017 with more than 250,000 people on hand and immediately had a vision of how to make the three-day event even better.\r\nBring it to Nashville and add the Mu… [+6364 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Jennifer Haberkorn","title":"Republicans see late-term abortion bills as a potent 2020 political issue","description":"Ahead of the 2020 election, Republicans in Washington and state capitals are honing in on one of the most emotionally charged parts of the abortion debate: those procedures conducted late in a pregnancy. Opponents of abortion hope that their effort will mobil…","url":"https://www.latimes.com/politics/la-na-pol-congress-abortion-politics-state-bans-supreme-court-2020-republicans-20190422-story.html","urlToImage":"https://www.latimes.com/resizer/ldT5xj9GmsugQyWFQ6m51je8f7s=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/EQ2HXHCFTNGDLPQZPUD7L6PTVM.jpg","publishedAt":"2019-04-22T12:00:00Z","content":"Ahead of the 2020 election, Republicans in Washington and state capitals are honing in on one of the most emotionally charged parts of the abortion debate: those procedures conducted late in a pregnancy.\r\nOpponents of abortion hope that their effort will mobi… [+8654 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Jazmine Ulloa","title":"These California bills would train nurses, judges and police how to spot their own biases","description":"California saw a decrease in the number of women who died giving birth in 2013, as the maternal mortality rate climbed across the country, according to state officials. But expectant black mothers across the state are still three to four times more likely to …","url":"https://www.latimes.com/politics/la-pol-ca-implicit-bias-legislation-california-20190422-story.html","urlToImage":"https://www.latimes.com/resizer/_y7rLH4444idMHoZd7mUbEnmfRo=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/HT4RYNOEIRGDFACD7625BBHM2Y.jpg","publishedAt":"2019-04-22T12:00:00Z","content":"California saw a decrease in the number of women who died giving birth in 2013, as the maternal mortality rate climbed across the country, according to state officials. But expectant black mothers across the state are still three to four times more likely to … [+8825 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Peter King","title":"Peter King: Kyler Murray will go No. 1 in NFL draft","description":"With the first pick in the 2019 NFL Draft, the Arizona Cardinals select ... . That's where Peter King begins his Football Morning in America column, with his first—and only—mock draft of the year. He also covers:\r\n\r\n• Four first-round trades are projected in …","url":"https://profootballtalk.nbcsports.com/2019/04/22/nfl-mock-draft-fmia-peter-king/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/fmia4.jpg?w=1200","publishedAt":"2019-04-22T06:19:35Z","content":"Interesting mock draft dropped Sunday morning in the Los Angeles Times. The papers redoubtable NFL beat man, Sam Farmer, had his annual sportswriter mock drafthes done it for 10 yearsin which he asks longtime NFL writers he trusts in the franchise cities to m… [+48449 chars]"},{"source":{"id":null,"name":"Insidehighered.com"},"author":"John Warner","title":"An Opportunity for Better Assessment","description":"Blog: Just Visiting As reported by Inside Higher Ed ’s Doug Lederman, at the recently held Academic Resource Conference, a panel of higher ed “assessment pros” had a “harsh take” on assessment. My response as a non-assessment pro was essentially, “Thank god, …","url":"http://www.insidehighered.com/blogs/just-visiting/opportunity-better-assessment","urlToImage":"https://www.insidehighered.com/sites/all/themes/ihecustom/images/facebook_icon_large.jpg","publishedAt":"2019-04-22T06:59:00Z","content":"As reported by Inside Higher Ed’s Doug Lederman, at the recently held Academic Resource Conference, a panel of higher ed “assessment pros” had a “harsh take” on assessment.\r\nMy response as a non-assessment pro was essentially, “Thank god, hallelujah, what’s n… [+7829 chars]"},{"source":{"id":null,"name":"Business2community.com"},"author":"Rachel Fausnaught","title":"The Ultimate Guide to Running Payroll for Small Business","description":"The challenges you face when first opening a small business often come as a surprise. It’s a learning process, and……","url":"https://www.business2community.com/small-business/the-ultimate-guide-to-running-payroll-for-small-business-02192221","urlToImage":"https://cdn.business2community.com/wp-content/uploads/2019/04/payroll_1555425526-900x600.jpg","publishedAt":"2019-04-22T17:00:10Z","content":"The challenges you face when first opening a small business often come as a surprise. Its a learning process, and you grow stronger with every move.\r\nArguably one of the toughest parts of running a business is managing the people who are supposed to help you … [+18379 chars]"},{"source":{"id":null,"name":"Cleveland.com"},"author":"Andrew J. Tobias, cleveland.com","title":"Ohio leaders in business, tech, and venture capital will advise new state innovation effort - cleveland.com","description":"Ohio leaders in business, tech, and venture capital will advise new state innovation effort cleveland.com Some of Ohio's most prominent names in business, tech and venture capital will advise Lt. Gov. Jon Husted's new state government innovation initiative.","url":"https://www.cleveland.com/open/2019/04/ohio-leaders-in-business-tech-and-venture-capital-will-advise-new-state-innovation-effort.html","urlToImage":"https://www.cleveland.com/resizer/hLifxi4ffQ63tLd7j4BMgnWa7h4=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/76CFQYJ3SZC2LHHZEXIL43MOGU.jpeg","publishedAt":"2019-04-22T19:44:00Z","content":"COLUMBUS, Ohio Some of Ohios most prominent names in business, tech and venture capital will advise Lt. Gov. Jon Husteds new state government innovation initiative.\r\nHusteds office on Monday launched the website for InnovateOhio, the expansive but poorly unde… [+2500 chars]"},{"source":{"id":null,"name":"Globenewswire.com"},"author":"Squirrels LLC","title":"Say Goodbye to HDMI: New Ditto Tech is the Key to a Wireless Workplace - GlobeNewswire","description":"Say Goodbye to HDMI: New Ditto Tech is the Key to a Wireless Workplace GlobeNewswire NORTH CANTON, Ohio, April 22, 2019 (GLOBE NEWSWIRE) -- Squirrels LLC today released all-in-one workplace screen mirroring technology that eliminates...","url":"https://globenewswire.com/news-release/2019/04/22/1807250/0/en/Say-Goodbye-to-HDMI-New-Ditto-Tech-is-the-Key-to-a-Wireless-Workplace.html","urlToImage":"http://www.globenewswire.com/Attachment/LogoDisplay/493799?filename=493799.jpg&size=1","publishedAt":"2019-04-22T11:58:00Z","content":"NORTH CANTON, Ohio, April 22, 2019 (GLOBE NEWSWIRE) -- Squirrels LLC today released all-in-one workplace screen mirroring technology that eliminates cables, adapters and unreliable tech from the places people meet.\r\nFour major product updates to Ditto\r\n, the … [+3592 chars]"},{"source":{"id":null,"name":"Heraldstaronline.com"},"author":null,"title":"JVS health tech students heading to June national competition in Florida | News, Sports, Jobs - The Steubenville Herald-Star","description":"JVS health tech students heading to June national competition in Florida | News, Sports, Jobs The Steubenville Herald-Star BLOOMINGDALE — Junior health technologies students Azrielle Pratko and Sam Shrock will represent the Jefferson County Joint Vocational S…","url":"http://www.heraldstaronline.com/news/community/2019/04/jvs-health-tech-students-heading-to-june-national-competition-in-florida/","urlToImage":"http://s3.amazonaws.com/ogden_images/www.heraldstaronline.com/images/2019/04/19142536/JVS-HOSA-Students-to-Nationals-web.jpg","publishedAt":"2019-04-22T05:11:04Z","content":"ON TO NATIONALS Junior health technologies students Sam Shrock and Azrielle Pratko will represent the Jefferson County Joint Vocational School in June when they head to Orlando, Fla., for the Health Occupations Students of America 42nd-annual International Le… [+2116 chars]"},{"source":{"id":null,"name":"Weirtondailytimes.com"},"author":null,"title":"JVS health tech students heading to June national competition in Florida - The Daily Times","description":"BLOOMINGDALE — Junior health technologies students Azrielle Pratko and Sam Shrock will represent the Jefferson County Joint Vocational School this June when they head to Orlando, Fla., for the Health Occupations Students of America’s 42nd-annual International…","url":"https://www.weirtondailytimes.com/news/community/2019/04/jvs-health-tech-students-heading-to-june-national-competition-in-florida/","urlToImage":"https://s3.amazonaws.com/ogden_images/www.weirtondailytimes.com/images/2019/04/19143253/JVS-HOSA-Students-to-Nationals-web.jpg","publishedAt":"2019-04-22T05:13:46Z","content":"ON TO NATIONALS Junior health technologies students Sam Shrock and Azrielle Pratko will represent the Jefferson County Joint Vocational School in June when they head to Orlando, Fla., for the Health Occupations Students of America 42nd-annual International Le… [+2116 chars]"},{"source":{"id":null,"name":"Cleveland.com"},"author":"John Benson, special to cleveland.com","title":"North Olmsted traffic signal upgrades project includes high-tech traffic control room - cleveland.com","description":"North Olmsted traffic signal upgrades project includes high-tech traffic control room cleveland.com Operational since Dec. 10, North Olmsted's brand-new, high-tech traffic control room recently passed its final inspection.","url":"https://www.cleveland.com/community/2019/04/north-olmsted-traffic-signal-upgrades-project-includes-high-tech-traffic-control-room.html","urlToImage":"https://www.cleveland.com/resizer/8l3TF72oHN8lZEah9PIK5ZUQSjo=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/XC4TE2YHYRE77PKA4LOJF6FG3E.jpg","publishedAt":"2019-04-22T11:25:00Z","content":"NORTH OLMSTED, Ohio -- Operational since Dec. 10, North Olmsteds brand-new, high-tech traffic control room recently passed its final inspection.\r\nNorth Olmsted Streets and Facilities Foreman Dave Demaline said the impetus for the modern monitoring station is … [+2946 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Squirrels LLC","title":"Say Goodbye to HDMI: New Ditto Tech is the Key to a Wireless Workplace - Associated Press","description":"Say Goodbye to HDMI: New Ditto Tech is the Key to a Wireless Workplace Associated Press Press release *content* from Globe Newswire. The AP news staff was not involved in its creation.","url":"https://www.apnews.com/Globe%20Newswire/d4df2fad8948bf119570c55bba497950","urlToImage":"https://apnews.com/images/PaidContent3.png","publishedAt":"2019-04-22T12:40:36Z","content":"NORTH CANTON, Ohio, April 22, 2019 (GLOBE NEWSWIRE) -- Squirrels LLC today released all-in-one workplace screen mirroring technology that eliminates cables, adapters and unreliable tech from the places people meet.\r\nFour major product updates to Ditto, the co… [+3530 chars]"},{"source":{"id":null,"name":"Dispatch.com"},"author":"Katy Smith","title":"Tech firm innovates insurance from within - The Columbus Dispatch","description":"Tech firm innovates insurance from within The Columbus Dispatch Columbus-based Bold Penguin is doing business with some of the largest insurance companies in the United States, including Nationwide and Liberty Mutual.","url":"https://www.dispatch.com/article/20190422/NEWS/190429695","urlToImage":"https://www.dispatch.com/storyimage/OH/20190422/NEWS/190429695/AR/0/AR-190429695.jpg","publishedAt":"2019-04-22T13:52:10Z","content":"Columbus-based Bold Penguin is doing business with some of the largest insurance companies in the United States, including Nationwide and Liberty Mutual. It was founded to make the process of buying and selling commercial insurance faster and easier, and unli… [+4861 chars]"},{"source":{"id":null,"name":"Amazon.com"},"author":"aws@amazon.com","title":"Amazon MSK expands its open preview into AP (Singapore) and AP (Sydney) AWS Regions","description":"Amazon Managed Streaming for Kafka (Amazon MSK) is now available in open preview in seven AWS regions: US East (N. Virginia and Ohio), US West (Oregon), EU (Ireland), and AP (Singapore, Sydney, and Tokyo).","url":"https://aws.amazon.com/about-aws/whats-new/2019/04/amazon_msk_expands_its_open_preview_into_ap_singapore_and_ap_sydney_aws_regions/","urlToImage":"https://a0.awsstatic.com/main/images/logos/aws_logo_smile_1200x630.png","publishedAt":"2019-04-22T13:17:38Z","content":"Amazon Web Services is Hiring.\r\nAmazon Web Services (AWS) is a dynamic, growing business unit within Amazon.com. We are currently hiring Software Development Engineers, Product Managers, Account Managers, Solutions Architects, Support Engineers, System Engine… [+188 chars]"},{"source":{"id":null,"name":"Queerty.com"},"author":"David Reddish","title":"Lawmaker wants to put an end to child drag performers by imprisoning and fining their parents","description":"Ohio Rep. Tim Schaffer wants to make child drag illegal after learning of a 9-year-old drag queen's performance.","url":"https://www.queerty.com/lawmaker-wants-put-end-child-drag-performers-imprisoning-fining-parents-20190422","urlToImage":"https://queerty-prodweb.s3.amazonaws.com/2019/04/jacob-measley1.jpg","publishedAt":"2019-04-22T18:40:10Z","content":"Dragging down both personal freedom and queer culture, an Ohio lawmaker wants to make child drag shows illegal.\r\nRepublican state Rep. Tim Schaffer has introduced a bill that would outlaw performances by “a child under eighteen years of age or a mentally or p… [+1523 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Wrestling coach accused of ignoring hazing pleads not guilty","description":"Wrestling coach accused of ignoring hazing pleads not guilty","url":"https://www.foxsports.com/other/story/wrestling-coach-accused-of-ignoring-hazing-pleads-not-guilty-042219","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-22T16:30:54Z","content":"FRANKLIN, Ohio (AP) — Police say a youth wrestling coach in Ohio accused of knowing about hazing among wrestlers but not stopping it has pleaded not guilty to charges of child endangerment and hazing.\r\nFranklin police say 58-year-old Bart Freidenberg turned h… [+524 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Defense order of the day for 1st round of NFL draft","description":"We learned during the 2018 season that offense is beloved by NFL teams (and fans). Yet the Super Bowl score was 13-3.","url":"https://www.foxsports.com/nfl/story/defense-order-of-the-day-for-1st-round-of-nfl-draft-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/c876ca7eb8434a938c9fd39ef0fc8c09-1.vresize.1200.630.high.84.jpg","publishedAt":"2019-04-22T21:12:30Z","content":"NASHVILLE, Tenn. (AP) — We learned during the 2018 season that offense is beloved by NFL teams (and fans). We also learned that defense, as performed by the Patriots in the Super Bowl, carries away the Lombardi Trophy.\r\nThis year’s draft, which begins Thursda… [+6095 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Cardinals being coy about No.1 pick","description":"Mock drafts have Murray but other suitors could be in play","url":"https://www.foxsports.com/arizona/story/cardinals-being-coy-about-no-1-pick-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/usatsi_10794232.vresize.1200.630.high.44.jpg","publishedAt":"2019-04-22T21:11:30Z","content":"TEMPE, Ariz. (AP) — The Arizona Cardinals used the 10th overall pick of the 2018 draft on Josh Rosen, hoping the former UCLA star would be their quarterback of the future.\r\nRosen had some ups and downs during his first season, as many rookies do, but did noth… [+3387 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Nives Dolsak and Aseem Prakash, Contributor, Nives Dolsak and Aseem Prakash, Contributor https://www.forbes.com/sites/prakashdolsak/","title":"The Notre Dame Fire, The Carbon Tax And Climate Policy","description":"What is the state of climate policy on 2019 Earth Day? Our sense is that while a carbon tax is facing political problems, climate policy is alive and kicking. The challenge for the climate movement is to show how it solves local problems of the common people …","url":"https://www.forbes.com/sites/prakashdolsak/2019/04/22/the-notre-dame-fire-the-carbon-tax-and-climate-policy/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fprakashdolsak%2Ffiles%2F2019%2F04%2Fclimate_change_earth_day.jpg","publishedAt":"2019-04-22T04:08:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nIs modern civilization ready to confront the climate challenge?\r\niStock\r\nHow should we assess the state of climate policy on Earth Day? Our sense is that while a carbon tax is facing political problems, … [+11636 chars]"},{"source":{"id":null,"name":"Complex.com"},"author":"Kyle Shokeye","title":"Ohio Mom Claims Her Kids Were Expelled From Christian School Because She’s Unmarried","description":"Summer Grant, mother of two, says she the school administrator told her she was \"committing adultery\" and going against the Ten Commandments.","url":"https://www.complex.com/life/2019/04/ohio-mom-claims-christian-school-expelled-kids-because-shes-unmarried","urlToImage":"https://images.complex.com/complex/images/c_fill,g_center,w_1200/fl_lossy,pg_1,q_auto/l69y0invqndp4swwp4yn/classroomdesksandchairs","publishedAt":"2019-04-22T19:10:06Z","content":"Summer Grant, a Ohio mother, is speaking out against Chapel Hill Christian School for kicking out her fourth grader, Summara-Rayn and her second grader, Summaia, despite being in good standing and with less than a month left in the school year, according to t… [+1477 chars]"},{"source":{"id":null,"name":"Bleedingcool.com"},"author":"Rich Johnston","title":"Wizard World Cancels SDCC-Clashing Boise Comic Con, Adds Los Angeles, Pittsburgh, Bay Area and Tulsa","description":"Wizard World Comic Con have announced four new shows to their 2019 schedule – and cancelled one. Wizard World Boise... Read More The post Wizard World Cancels SDCC-Clashing Boise Comic Con, Adds Los Angeles, Pittsburgh, Bay Area and Tulsa appeared first on Bl…","url":"https://www.bleedingcool.com/2019/04/22/wizard-world-cancels-sdcc-boise-comic-con-los-angeles-pittsburgh-bay-area-tulsa/","urlToImage":"https://mlpnk72yciwc.i.optimole.com/w:auto/h:auto/q:auto/https://www.bleedingcool.com/wp-content/uploads/2017/06/wizard-world-logo.jpg","publishedAt":"2019-04-22T12:30:29Z","content":"Wizard World Comic Con have announced four new shows to their 2019 schedule and cancelled one.\r\nWizard World Boise Comic Con was scheduled for July 19th to 21st. Which would have clashed with San Diego Comic-Con. Not anymore. Though they have told press they … [+1565 chars]"},{"source":{"id":null,"name":"Packagingoftheworld.com"},"author":"noreply@blogger.com (Derrick Lin)","title":"By Nature Pet Food","description":"Design: Kick Designer: Ariel Hung Creative Director: Stefan Hartung Project Type: Produced, Commercial Work Client: By Nature Pet Food Location: Minneapolis Packaging Contents: Dry Dog and Cat Food Packaging Substrate / Materials: Quad-seal Bag Printing Proce…","url":"https://www.packagingoftheworld.com/2019/04/by-nature-pet-food.html","urlToImage":"https://3.bp.blogspot.com/-S6bXYjaUhNo/XLmLPz06OjI/AAAAAAAFz-U/nogmJM39lBga6IzTtFu4Q_0qhF8SSId4ACLcBGAs/w1200-h630-p-k-no-nu/Kick_ByNature_Family_LifestyleShot-0.jpg","publishedAt":"2019-04-22T06:45:00Z","content":"16 April 2019 | Minneapolis, Minnesota — Creating an exclusive brand, whether for a distributor, individual retailer/chain or a specific channel can be a winning marketing strategy. The packaging must work just as hard to appeal to the consumer at shelf as a … [+3890 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1986 BMW 325e 5-Speed","description":"This 1986 BMW 325e is finished in black over a Cardinal Red leather interior and is powered by a 2.7L inline-six mated to a 5-speed manual transmission. The car was reportedly purchased new in Ohio and stored at the original owner's vacation home near Columbu…","url":"https://bringatrailer.com/listing/1986-bmw-325e-19/","urlToImage":null,"publishedAt":"2019-04-22T23:40:09Z","content":null},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1965 Ford Mustang Convertible","description":"This 1965 Ford Mustang is a C-code convertible finished in Silver Smoke Gray over a black vinyl interior and powered by a 289ci V8 paired with a 3-speed automatic transmission. The seller acquired the car approximately 14 years ago following a cosmetic and me…","url":"https://bringatrailer.com/listing/1965-ford-mustang-convertible-28/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/1965_ford_mustang_convertible_15557055343891c3e7bebd2IMG_3161-e1555714258249.jpg","publishedAt":"2019-04-22T17:40:15Z","content":"This 1965 Ford Mustang is a C-code convertible finished in Silver Smoke Gray over a black vinyl interior and powered by a 289ci V8 paired with a 3-speed automatic transmission. The seller acquired the car approximately 14 years ago following a cosmetic and me… [+1977 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1981 Fiat 2000 Turbo Spider","description":"This 1981 Fiat 2000 Turbo Spider is one of approximately 700 modified for Fiat North America by New York–based Legend Industries with unique manifolds and a turbocharger. The car reportedly was acquired by the selling dealer in 1998 and placed into long-term …","url":"https://bringatrailer.com/listing/1981-fiat-124-spider-10/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2018/12/1981_fiat_124_spider_1543877301ef66e7dff9f98764da1123181602b-2.jpg","publishedAt":"2019-04-22T15:30:14Z","content":"This 1981 Fiat 2000 Turbo Spider is one of approximately 700 modified for Fiat North America by New Yorkbased Legend Industries with unique manifolds and a turbocharger. The car reportedly was acquired by the selling dealer in 1998 and placed into long-term s… [+2170 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 2000 BMW 540i 6-Speed","description":"This 2000 BMW 540i is finished in Siena Red Metallic over Sand leather and shows 75k miles. Power is provided by a 4.4-liter M62 V8 paired with a 6-speed manual transmission, and factory options include 17\" alloy wheels and heated front seats. Originally leas…","url":"https://bringatrailer.com/listing/2000-bmw-540i-22/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/2000_bmw_540i_1555044590bae850c154711c6daIMG_5879.jpg","publishedAt":"2019-04-22T21:02:37Z","content":"This 2000 BMW 540i is finished in Siena Red Metallic over Sand leather and shows 75k miles. Power is provided by a 4.4-liter M62 V8 paired with a 6-speed manual transmission, and factory options include 17″ alloy wheels and heated front seats. Originally leas… [+2849 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Paul Steinhauser","title":"Seth Moulton, Massachusetts rep and Iraq War vet, jumps into 2020 presidential race - Fox News","description":"Seth Moulton, Massachusetts rep and Iraq War vet, jumps into 2020 presidential race Fox News Rep. Seth Moulton announces 2020 presidential run CNN Rep. Seth Moulton is latest Democrat to enter 2020 field NBC News Seth Moulton announces 2020 bid POLITICO Massa…","url":"https://www.foxnews.com/politics/seth-moulton-massachusetts-congressman-and-iraq-war-vet-jumps-into-2020-presidential-race","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/AP19112384845769.jpg","publishedAt":"2019-04-22T11:43:55Z","content":"Add Rep. Seth Moulton to the large list of Democrats running for the White House.\r\nThe congressman from Massachusetts and Marine veteran who served four tours of duty in Iraq announced his candidacy for president on Monday morning.\r\nBIDEN POISED TO ANNOUNCE 2… [+2479 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"https://www.facebook.com/lena.sun.90","title":"U.S. measles cases surge as officials scramble to stop near-record outbreak - Washington Post","description":"U.S. measles cases surge as officials scramble to stop near-record outbreak Washington Post Measles nears record in US as the disease spreads in New York CNBC New York Outbreaks Drive US Measles Count up to 626 U.S. News & World Report Measles outbreak prompt…","url":"https://www.washingtonpost.com/health/2019/04/22/us-measles-cases-surge-officials-scramble-stop-near-record-outbreak/","urlToImage":"https://www.washingtonpost.com/resizer/GtS0vYsmUAaipxCL3gfQ4EqwgJw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UIC6T24PXNHDNCLXFJJHM7SSYU.jpg","publishedAt":"2019-04-22T13:49:49Z","content":"The United States is on track to surpass the record number of measles cases in a single year since the disease was declared eliminated in 2000, according to figures reported Monday. For the fourth week in a row, health officials have added dozens of new cases… [+3234 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Charean Williams","title":"Doug Williams: Washington still could draft QB","description":"ESPN’s Adam Schefter lists the Giants, Dolphins and Chargers as the front runners for Josh Rosen. Not mentioned is Washington. Washington seems out of the running for Rosen, but not necessarily out of the quarterback market despite having traded for Case Keen…","url":"https://profootballtalk.nbcsports.com/2019/04/22/doug-williams-washington-still-could-draft-qb/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/gettyimages-1074741416-e1555958663387.jpg","publishedAt":"2019-04-22T18:44:35Z","content":"ESPN’s Adam Schefter lists the Giants, Dolphins and Chargers as the front runners for Josh Rosen. Not mentioned is Washington.\r\nWashington seems out of the running for Rosen, but not necessarily out of the quarterback market despite having traded for Case Kee… [+1383 chars]"}]}