{"status":"ok","totalResults":476,"articles":[{"source":{"id":null,"name":"Cnet.com"},"author":"Laura Hautala","title":"Patient names, treatments leak among millions of rehab records - CNET","description":"Exclusive: The exposed data affects nearly 150,000 people.","url":"https://www.cnet.com/news/patient-names-treatments-leak-among-millions-of-rehab-records/","urlToImage":"https://cnet1.cbsistatic.com/img/MAZ9NAogkUwJJ9pJuhlPhBSMDCE=/756x567/2019/02/27/4702fb3f-c033-4830-8433-be58226f6831/cybersecurity-hacking-11.jpg","publishedAt":"2019-04-19T16:41:57Z","content":"It's some of the most sensitive medical information a person could have. Records for potentially tens of thousands of patients seeking treatment at several addiction rehabilitation centers were exposed in an unsecured online database, an independent researche… [+3507 chars]"},{"source":{"id":null,"name":"Cnet.com"},"author":"Laura Hautala","title":"Millions of rehab records exposed on unsecured database - CNET","description":"Exclusive: The data included patient names and treatments.","url":"https://www.cnet.com/news/millions-of-rehab-records-leak-from-unsecured-database/","urlToImage":"https://cnet1.cbsistatic.com/img/MAZ9NAogkUwJJ9pJuhlPhBSMDCE=/756x567/2019/02/27/4702fb3f-c033-4830-8433-be58226f6831/cybersecurity-hacking-11.jpg","publishedAt":"2019-04-19T14:07:05Z","content":"It's some of the most sensitive medical information a person could have. Records for potentially thousands of patients seeking treatment at several addiction rehabilitation centers were exposed in an unsecured online database, an independent researcher reveal… [+3052 chars]"},{"source":{"id":null,"name":"Slashdot.org"},"author":"BeauHD","title":"Why Juul and Republican Lawmakers Want To Raise the Minimum Vaping Age To 21","description":"Senate Majority Leader Mitch McConnell announced a new bill today that would block all tobacco and vape purchases for Americans under 21 years old, citing widespread public health risks. Surprisingly, vaping companies don't appear to be too concerned, as Juul…","url":"https://politics.slashdot.org/story/19/04/18/2225211/why-juul-and-republican-lawmakers-want-to-raise-the-minimum-vaping-age-to-21","urlToImage":"https://a.fsdn.com/sd/topics/republicans_64.png","publishedAt":"2019-04-19T00:10:00Z","content":"Over the past year, Juul has come under the FDA's fire for its massive popularity among young people. So supporting a higher minimum age could help its image and take some of the regulatory pressure off. From an industry perspective, the move is fairly low ri… [+1302 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ryan Pickrell","title":"A hidden camera was found in a women's bathroom on a warship, and the US Navy is looking for answers","description":"A female Marine discovered a camera in the women's bathroom on the USS Arlington, an amphibious transport dock, NBC reported Friday. The Navy has been investigating the situation since March, when the device was first discovered. The Navy, like other military…","url":"https://www.businessinsider.com/a-hidden-camera-was-found-in-the-womens-bathroom-on-a-us-warship-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba38c8c2f70b493826e874-960-480.jpg","publishedAt":"2019-04-19T21:20:30Z","content":"The Navy is looking for answers after a female Marine discovered a camera in the women's bathroom on a deployed US warship, NBC reported, citing three military officials. \r\n The woman discovered the device aboard the USS Arlington, a San Antonio-class amphibi… [+2003 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Olivia Singh","title":"Pete Davidson says he got stuck paying the expensive bill from his dinner with Kanye West, Timothée Chalamet, and Kid Cudi","description":"During an appearance on NBC's \"Tonight Show Starring Jimmy Fallon\" on Thursday, Pete Davidson shared details about the dinner he had in late January with Kid Cudi, Kanye West, and Timothée Chalamet. Davidson said that he arrived at the dinner early and put do…","url":"https://www.thisisinsider.com/pete-davidson-kanye-west-kid-cudi-timothee-chalamet-dinner-expensive-bill-video-2019-4","urlToImage":"https://static.businessinsider.com/image/5cb9f95d2730ca089b3d638d-750.jpg","publishedAt":"2019-04-19T16:37:39Z","content":"Pete Davidson says that he got stuck paying the expensive bill from his dinner with Kanye West, Timothée Chalamet, and Kid Cudi. \r\n During an appearance on NBC's \"Tonight Show Starring Jimmy Fallon\" on Thursday, Davidson explained how he ended up at a restaur… [+2092 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Scott Davis","title":"The Raiders sent their scouts home 6 days before the draft because the new GM reportedly 'does not know who he can trust with his draft secrets'","description":"The Oakland Raiders sent home their scouts one week before the NFL draft because GM Mike Mayock does not know who to trust, according to a report. Some in the NFL argued that this is normal for a team with a new GM, but others suggested the report is still ab…","url":"https://www.businessinsider.com/raiders-nfl-draft-scouts-sent-home-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba18d0ac92a13da52ca063-1334-667.jpg","publishedAt":"2019-04-19T19:25:48Z","content":"With the NFL draft one week away, the Oakland Raiders are shrinking the size of their inner-circle, according to NFL Network's Ian Rapoport. \r\n On Friday, Rapoport reported that the Raiders new GM Mike Mayock and head coach Jon Gruden sent home their scouts f… [+2506 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joe Perticone","title":"The Mueller report changes nothing for Congress, which remains as fiercely divided as ever","description":"The release of the Mueller report has only hardened the previously-held stances Democrats and Republicans have on President Donald Trump. Democrats took issue with Attorney General William Barr's handling of the report's release. Republicans focused on part o…","url":"https://www.businessinsider.com/mueller-report-changes-nothing-fiercely-divided-congress-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb8a041d1a2f817dc5aa468-2732-1366.jpg","publishedAt":"2019-04-19T14:12:38Z","content":"WASHINGTON — The special counsel's final report released Thursday, revealing that no one in President Donald Trump's 2016 campaign colluded with the Russians to fix the election but left the question of obstruction of justice somewhat open-ended. \r\n For every… [+5295 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Jacob Shamsian","title":"A local TV station is receiving backlash for uncritically covering two anti-Muslim pundits","description":"A local CBS station is under criticism for a segment uncritically covering an event with Katie Hopkins and Elizabeth Sabaditsch-Wolff. The two are anti-Muslim conspiracy theorists, and the segment didn't contradict or push back against anything they said. Of …","url":"https://www.thisisinsider.com/local-cbs-station-katie-hopkins-elizabeth-sabaditsch-wolff-anti-muslim-segment-backlash-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba18ff2730ca0b901496ee-1334-667.jpg","publishedAt":"2019-04-19T18:48:30Z","content":null},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter seven-round mock draft - NFL.com","description":"Chad Reuter seven-round mock draft NFL.com Devin Bush on cusp of NFL with a style all his own: 'You won't break' him Detroit Free Press 2019 NFL Mock Draft: Falcons' blockbuster move into top five headlines nine projected trades CBS Sports Which Positions Do …","url":"http://www.nfl.com/news/story/0ap3000001027100/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-1","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/04/18/0ap3000001027062_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+7602 chars]"},{"source":{"id":null,"name":"Thestarphoenix.com"},"author":null,"title":"Fitness: Put a little step in your spring - County Weekly News","description":"Fitness: Put a little step in your spring County Weekly News As the snow melts, temperatures rise and the sun stays out longer, Canadians are taking to the sidewalks to walk off winter's cobwebs. But as natural as it is to...","url":"http://thestarphoenix.com/life/bridges/fitness-put-a-little-step-in-your-spring2","urlToImage":"https://postmediathestarphoenix2.files.wordpress.com/2018/12/cities-climate-plans-20181202.jpg","publishedAt":"2019-04-19T16:16:23Z","content":"As the snow melts, temperatures rise and the sun stays out longer, Canadians are taking to the sidewalks to walk off winter’s cobwebs. But as natural as it is to celebrate the change in weather by going for a stroll, there are more benefits to walking than we… [+4545 chars]"},{"source":{"id":null,"name":"Castanet.net"},"author":null,"title":"Flood warnings, heavy rain - Canada News - Castanet.net","description":"Flood warnings, heavy rain - Canada News Castanet.net Canadian Armed Forces to help Quebec with flooding Montreal Gazette Rainfall warnings issued throughout southern Quebec as waterways overflow CBC.ca Expect flooding as heavy rain falls on Greater Montreal:…","url":"https://www.castanet.net/news/Canada/254378/Feds-help-with-flood-prep","urlToImage":"https://www.castanet.net/content/2019/4/gmh112543217_p3382052_p3382054.jpg","publishedAt":"2019-04-19T15:40:00Z","content":"Canada  \r\nUPDATE: 10:15 a.m.\r\nThe parents of celebrated Austrian climber David Lama said Friday that he had \"lived his dream,\" as hopes he and two other top climbers survived an avalanche in the Canadian Rockies faded.\r\nLama, fellow Austrian Hansjorg Auer and… [+28846 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Cory Doctorow","title":"TSA admits that its pornoscanners flag Black women and others with curly hair for humiliating, invasive searches","description":"Black women have long complained that they get flagged for secondary screening at TSA checkpoints after passing through a full-body scanner; after years of complaints, the TSA has admitted that its scanners struggle to with curled hair, and are prone to flagg…","url":"https://boingboing.net/2019/04/19/racist-algorithms.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/SafeView_PS5MAR15rA_200.jpg","publishedAt":"2019-04-19T19:03:21Z","content":"Black women have long complained that they get flagged for secondary screening at TSA checkpoints after passing through a full-body scanner; after years of complaints, the TSA has admitted that its scanners struggle to with curled hair, and are prone to flagg… [+4711 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Karma Allen","title":"Man indicted after pretending to be missing 14-year-old","description":"Brian Michael Rini said he escaped kidnappers who sexually abused him.","url":"https://abcnews.go.com/US/ohio-man-indicted-pretending-missing-14-year-timmothy/story?id=62501122","urlToImage":"https://s.abcnews.com/images/US/brian-michael-rini-ap-jc-190405_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T11:38:44Z","content":"Authorities indicted an Ohio man on fresh charges Thursday for allegedly impersonating Timmothy Pitzen, a boy who vanished in 2011 at the age of 6.\r\nA federal grand jury indicted Brian Michael Rini, 23, on two counts of making false statements and one count o… [+2003 chars]"},{"source":{"id":null,"name":"Cincinnati.com"},"author":"Cincinnati Enquirer, Sarah Brookbank, Cincinnati Enquirer","title":"'I feel like I'm in my 20s': Ohio man's Lenten, beer-only fast comes to an end","description":"Del Hall said after his Lenten Fast that he needs less sleep, his mind is clear and he said he feels like there's no inflammation in his body.","url":"https://www.cincinnati.com/story/news/2019/04/18/beer-only-lent-fast-cincinnati-easter-sunday/3505689002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/12/PCIN/77d4de11-4ff9-4ec6-b2ba-2fb57e68f162-Del_Hall_1.jpg?crop=749,428,x0,y6&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T12:14:14Z","content":"Del Hall, director of sales at Fifty West Brewing Company, is giving up everything for his Lenten fast. Except beer. He plans to spend Lent fasting, using beer as his only calorie intake.\r\n (Photo: Provided/ Del Hall)\r\nCINCINNATI  Del Hall's first meal of the… [+5574 chars]"},{"source":{"id":null,"name":"Cincinnati.com"},"author":"Cincinnati Enquirer, Terry DeMio, Cincinnati Enquirer","title":"Federal opioid pill bust reveals doctors trading pills for sex, dentists pulling good teeth","description":"They're all accused of illegally prescribing pain meds, but charges against these medical professionals are the most shocking from this week's sweep.","url":"https://www.cincinnati.com/story/news/2019/04/19/opioid-pain-pill-investigation-most-shocking-cases-ohio-kentucky-tennessee-alabama/3518191002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PCIN/cbc673ee-577b-4d26-b54e-fde6993d0db8-morepain..jpg?crop=399,224,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T21:35:12Z","content":"CINCINNATI - They were medical professionals but they traded prescription pain pills for sex, prosecutors say. Others let untrained office workers examine patients, leaving a blank prescription pad at the clinic, their indictments reveal. \r\nOne dentist extrac… [+6513 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Frank Miles","title":"America’s first woman astronaut candidate dead at 88","description":"America’s first female astronaut candidate, pilot Jerrie Cobb, who pushed for equality in space but never reached its heights, has died.","url":"https://www.foxnews.com/science/americas-1st-woman-astronaut-candidate-dead-88","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Jerrie-Cobb-1.jpg","publishedAt":"2019-04-19T02:58:35Z","content":"America’s first female astronaut candidate who pushed for women in space but never reached its heights has died, reports said.\r\nPilot Jerrie Cobb died in Florida on March 18 following a brief illness. She was 88.\r\nNews of her death came Thursday from journali… [+2730 chars]"},{"source":{"id":null,"name":"Theregister.co.uk"},"author":"Kieren McCarthy","title":"Not one of the 12 steps: Rehab patients' details exposed in publicly visible database","description":"Researcher disturbed at availability of very personal data More than two years of billing records from a drug and alcohol rehabilitation center were made freely available on the internet, a security researcher has discovered.…","url":"https://www.theregister.co.uk/2019/04/19/rehab_patients_details_exposed/","urlToImage":"https://regmedia.co.uk/2018/08/29/wowshades.jpg","publishedAt":"2019-04-19T20:26:19Z","content":"More than two years of billing records from a drug and alcohol rehabilitation center were made freely available on the internet, a security researcher has discovered.\r\nJustin Paine has been scouring the internet for Elastic Search databases and has previously… [+1955 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Emily Alford","title":"Woman Leprechaun Shatters Green Glass Ceiling","description":"“Leprechauns are men,” someone, somewhere is surely saying right now. But women are equally capable of dressing in green suits and matching green Irish country hats to brandish blackthorn sticks at cheering crowds because leprechauns aren’t real and thus can …","url":"https://jezebel.com/woman-leprechaun-shatters-green-glass-ceiling-1834157598","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--bJhnvhbv--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xpnzee4nlvgig7nu1ltr.jpg","publishedAt":"2019-04-19T01:45:00Z","content":"Leprechauns are men, someone, somewhere is surely saying right now. But women are equally capable of dressing in green suits and matching green Irish country hats to brandish blackthorn sticks at cheering crowds because leprechauns arent real and thus can be … [+891 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Maria Sherman","title":"Eligible Bachelor Pete Davidson Is Currently Living in His Mom's Basement","description":"Saturday Night Live’s Pete Davidson is probably a pretty wealthy guy, which is why it strikes me as somewhat unusual that he lives with his mom post-Ariana Grande breakup, and yet, is still somehow desirable to seriously impressive women like Kate Beckinsale.…","url":"https://jezebel.com/eligible-bachelor-pete-davidson-is-currently-living-in-1834165135","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--tPyDCWoj--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/idmngkdun8wa2n05vr2o.jpg","publishedAt":"2019-04-19T14:00:00Z","content":"Saturday Night Lives Pete Davidson is probably a pretty wealthy guy, which is why it strikes me as somewhat unusual that he lives with his mom post-Ariana Grande breakup, and yet, is still somehow desirable to seriously impressive women like Kate Beckinsale. … [+3197 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Mike Chiari","title":"Image: LaMelo Ball Shows Off Enormous New Chest Tattoo","description":"LaMelo Ball has an enormous new chest tattoo.    As seen in the following photo, Ball's ink features his jersey number, angel wings and a halo:         According to  TMZ Sports , tattoo ...","url":"https://bleacherreport.com/articles/2832165-image-lamelo-ball-shows-off-enormous-new-chest-tattoo","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/776/hi-res-7feae070aeffed22522dae62ebc46a6b_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T19:25:57Z","content":"Cassy Athena/Getty Images\r\nLaMelo Ball has an enormous new chest tattoo.\r\nAs seen in the following photo, Ball's ink features his jersey number, angel wings and a halo:\r\nOvertime@overtimeLaMelo Ball got some NEW INK @MELOD1P (via @RockRollG) https://t.co/YeAi… [+1249 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Matt Miller","title":"Matt Miller's Scouting Notebook: Biggest Insider Rumors of the 2019 NFL Draft","description":"The week before the  NFL  draft kicks off is a madhouse. Every agent wants information on where their players will be drafted...","url":"https://bleacherreport.com/articles/2831952-matt-millers-scouting-notebook-biggest-insider-rumors-of-the-2019-nfl-draft","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/571/hi-res-721aabc9f766ac5b067c78b0492e19d5_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T12:42:54Z","content":"Jonathan Bachman/Getty Images\r\nThe week before the NFL draft kicks off is a madhouse. Every agent wants information on where their players will be drafted. Every team source you have wants to know what you're hearing other teams will dowhich is where informat… [+10596 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Steve Silverman","title":"Jordan Brand Classic 2019: Rosters, Live Stream Schedule and Preview","description":"The 18th annual Jordan Classic will be held in a new venue Saturday, as many of the nation's top high school seniors will descend on the T-Mobile Arena in Las Vegas with an opportunity ...","url":"https://bleacherreport.com/articles/2832082-jordan-brand-classic-2019-rosters-live-stream-schedule-and-preview","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/688/hi-res-525c30ae2921b4805854d0d3f64b3d7b_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T11:10:36Z","content":"James Wiseman will be competing in the Jordan Brand Classic Saturday in Las Vegas.Sam Forencich/Getty Images\r\nThe 18th annual Jordan Classic will be held in a new venue Saturday, as many of the nation's top high school seniors will descend on the T-Mobile Are… [+5847 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Chris O'Falt","title":"If Hollywood Takes a Stand for Abortion Rights, the ‘Heartbeat Bill’ Could Cost Millions","description":"Alyssa Milano’s call to boycott Georgia has not found support by studios, which rely on the state's unique and valuable tax incentives.","url":"https://www.indiewire.com/2019/04/georgia-heartbeat-bill-film-tv-boycott-could-cost-hollywood-millions-1202060572/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2019/01/InfinityWar5aa86b6fdaeb5.0.jpg","publishedAt":"2019-04-19T18:16:09Z","content":"Last month, both branches of the Georgia Legislature passed the “Heartbeat Bill,” which would ban abortions after six weeks, or when a doctor can detect a fetus’ heartbeat; it awaits Governor Brian Kemp’s signature before becoming law. Led by actress Alyssa M… [+5310 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Caleb Friedman","title":"Spring Game Guide: What to Watch as Georgia, Oregon and More Wrap Up Practice","description":"With Georgia and Oregon in action this weekend, here's what to watch as the last few playoff hopefuls wind down spring practice.","url":"https://www.si.com/college-football/2019/04/19/spring-game-guide-georgia-miami-oregon-ucla","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/jake-fromm-college-football-spring-game-schedule-uga-ucla.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:49:32Z","content":"The spring football season is coming to a close. Most programs have wrapped up spring practice, but there are still a few notable exhibition games left in the final two weekends of April. You cant learn everything about a team from its spring game, but you ca… [+5726 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"The MMQB Staff","title":"2019 NFL Draft Position Rankings: Quarterbacks","description":"The four first-round candidates are followed by some interesting second-tier passers in the class of 2019.","url":"https://www.si.com/nfl/2019/04/17/draft-position-rankings-quarterbacks-kyler-murray-drew-lock-daniel-jones-dwayne-haskins","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/17/2019-nfl-draft-qb-rankings.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:02:12Z","content":"1. Kyler Murray, Oklahoma (Overall Rank: 9)Height: 5' 1018\" | Weight: 207 poundsMurray is an electrifying talent, breathtaking with the ball in his hands but also a strong-armed, cerebral passer who was able to negotiate throwing lanes within the pocket at th… [+7404 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Justin Barrasso","title":"Lexi Kaufman Loves Playing ‘the Complete Opposite’ of Herself as Alexa Bliss","description":"The secret to her success is separating Alexa Bliss from Lexi Kaufman.","url":"https://www.si.com/wrestling/2019/04/19/wwe-alexa-bliss-interview-wrestlemania-champs-sports","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/wwe-alexa-bliss-interview-wrestlemania-champs-sports.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T16:51:08Z","content":"Alexa Bliss is the Marilyn Monroe of WWE.\r\nIn the moments leading up to WrestleMania 35, where she served as the shows host, witnesses caught Bliss pacing furiously in the backstage areas of MetLife Stadium. For those who were unaware, there was a transformat… [+6088 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Tim Rohan","title":"When the Canes Ruled the Draft: The Year Miami Had Six First-Rounders","description":"The story of Miami’s record six first-rounders in 2004 perfectly captures the unpredictability of the draft process.","url":"https://www.si.com/nfl/2019/04/19/miami-hurricanes-2004-nfl-draft-record-six-players-first-round","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/miami-2004-draft-class-pileup-big.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:42:09Z","content":"Toward the end of February 2004, the entire football world descended on the University of Miami for the Hurricanes pro day. Some estimate there were several hundred people in attendance, including coaches, executives, and scouts from every organization, it se… [+25631 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Laken Litman","title":"Gauging the Success Rate of College Football Head Coaches Who Are Also Alumni","description":"College football programs that hire alumni set up their school legends for rousing second acts ... but it doesn't always go according to plan.","url":"https://www.si.com/college-football/2019/04/19/alumni-head-coaches-jim-harbaugh-pat-fitzgerald","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/college-football-coaches-alumni-jim-harbaugh-pat-fitzgerald.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T17:07:19Z","content":"When Jim Harbaugh came home to Michigan, he told stories of sitting in Bo Schembechlers office with his feet propped up on his desk. When Scott Frost came home to Nebraska, Cornhuskers fans broke the spring game attendance record. When Kirby Smart came home t… [+15717 chars]"},{"source":{"id":null,"name":"Fivethirtyeight.com"},"author":"Adam Kelsey and Will Steakin, Adam Kelsey https://fivethirtyeight.com/contributors/adam-kelsey/ Adam.M.Kelsey@abc.com","title":"What The Potential 2020 Candidates Are Doing And Saying, Vol. 15","description":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 — Democrats and even some Republicans — we’re keeping tabs on the field as it develops. Each week, we’ll run…","url":"https://fivethirtyeight.com/features/what-the-potential-2020-candidates-are-doing-and-saying-vol-15/","urlToImage":"https://fivethirtyeight.com/wp-content/uploads/2019/04/2020roundup-0419-16x9.png?w=1600","publishedAt":"2019-04-19T09:59:29Z","content":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 Democrats and even some Republicans were keeping tabs on the field as it develops. Each week, well run throu… [+15151 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"S & T Bancorp Inc (STBA) Q1 2019 Earnings Call Transcript","description":"STBA earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/18/s-t-bancorp-inc-stba-q1-2019-earnings-call-transcr.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519702/featured-transcript-logo.png","publishedAt":"2019-04-19T01:49:44Z","content":"Image source: The Motley Fool.\r\nS &amp; T Bancorp Inc  (NASDAQ:STBA)Q1 2019 Earnings CallApril 18, 2019, 1:00 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGreetings, and welcome to the S&amp;T Ba… [+27286 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Lou Whiteman)","title":"The Navy's Most Expensive New Ship Program Might Cost Even More Than Anticipated","description":"The GAO is poking holes in the Pentagon's estimates. What does that mean for the contractors banking on this program for growth?","url":"https://www.fool.com/investing/2019/04/19/the-navys-most-expensive-new-ship-program-might-co.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519029/gd-virginia-class-sub-at-electric-boat-ct-source-gd.jpg","publishedAt":"2019-04-19T16:17:00Z","content":"The forthcoming Columbia-class ballistic missile submarine, a key cog in the U.S. military's nuclear deterrence strategy and the nation's most expensive shipbuilding program to date, is likely to come in well over its $115 billion total construction budget, a… [+6313 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Mary Elizabeth Williams","title":"Lake Bell on why New York and Nebraska need to laugh together over \"Bless This Mess\"","description":"\"This show by no means is going to cure the country of all ailments,\" the \"Bless This Mess\" co-creator tells Salon","url":"https://www.salon.com/2019/04/19/lake-bell-on-why-new-york-and-nebraska-need-to-laugh-together-over-bless-this-mess/","urlToImage":"https://media.salon.com/2019/04/lake-bell.jpg","publishedAt":"2019-04-19T16:00:21Z","content":"Lake Bell would like to meet you in the middle. The actor, director, producer and writer has long been a familiar face in the independent film world (\"Man Up,\"\"In a World,\"), but for her first network television show, she's teamed up with a sitcom veteran for… [+9715 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Lions trading up? GM Bob Quinn doesn't have the 'ammunition'","description":"It seems the Lions' general manager could be content at No. 8 or trading down in what he sees as a deep first round.","url":"http://www.espn.com/blog/detroit-lions/post/_/id/35390/lions-trading-up-this-year-bob-quinn-doesnt-have-the-ammunition","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0104%2Fr484675_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T06:00:41Z","content":"ALLEN PARK, Mich. – Bob Quinn has been very comfortable making trades throughout his tenure as general manager of the Detroit Lions. It can be in training camp or at the trade deadline, in the offseason or during the draft. He’s usually very willing to make a… [+3298 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Robin Hilton","title":"New Music Friday: Our Top 6 Albums Out April 19","description":"Our list of the best albums out this week includes Lizzo's long-awaited debut, the rousing, infectious anthems of Johnnyswim, new music from The Tallest Man On Earth, Loyle Carner and more.","url":"https://www.npr.org/sections/allsongs/2019/04/19/714781967/new-music-friday-our-top-6-albums-out-april-19","urlToImage":"https://media.npr.org/assets/img/2019/04/18/lizzo-new-press-image-luke-gilford_wide-3689c742b96c9ccb84313d8295070a3b82b4e714.jpg?s=1400","publishedAt":"2019-04-19T09:00:25Z","content":"We've been anxiously waiting for Lizzo to drop her debut full-length album ever since she dominated our South by Southwest showcase in 2017. Cuz I Love You is finally here and it's full of the kind of fearless swagger, unapologetic pride and boundless joy tha… [+1134 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"DANIEL J. WAKIN","title":"What They Left Behind: Legacies of the Recently Departed","description":"Mr. Westcott was the only person authorized to carry a camera at the Oak Ridge facilities.","url":"https://www.nytimes.com/2019/04/19/obituaries/what-they-left-behind-legacies-of-the-recently-departed.html","urlToImage":"https://static01.nyt.com/images/2019/04/18/obituaries/18lalanne1/17lalanne1-facebookJumbo.jpg","publishedAt":"2019-04-19T19:58:42Z","content":"Stanley Plumly was a poet inspired by the spirit of Keats. That predecessor was the subject of many of Mr. Plumlys poems as well as biographical essays. In all, he wrote 11 books of verse, in which his subject matter encompassed a poor rural childhood, an alc… [+564 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Hunter Harris","title":"Pete Davidson Lives With His Mom, But He Doesn’t Live With His Mom","description":"He lives with his mom.","url":"http://www.vulture.com/2019/04/pete-davidson-lives-with-his-mom-in-the-basement.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/19/19-pete-davidson.w1200.h630.jpg","publishedAt":"2019-04-19T14:47:09Z","content":"Like many millennials usually those with crippling college debt Pete Davidson lives with his mom. But its not really like what youre thinking they bought the house together. On The Tonight Show Thursday evening, Davidson explained the situation to Jimmy Fallo… [+425 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Jordan Runtagh","title":"Rapper Q-Money Charged with Murder in Fatal Shooting of Fellow Up-and-Coming Hip Hop Artist","description":"Up-and-coming Ohio rapper Qamar Akee Williams, better known as Q-Money, was arrested in Georgia on Thursday for allegedly shooting and killing fellow aspiring emcee Calvin Alexander Chappell. Chappell, 24, was fatally shot multiple times with a handgun on Mon…","url":"https://people.com/music/q-money-arrested-murder-calvin-chappell/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/q-money-2.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-19T17:20:35Z","content":"Up-and-coming Ohio rapper Qamar Akee Williams, better known as Q-Money, was arrested in Georgia on Thursday for allegedly shooting and killing fellow aspiring emcee Calvin Alexander Chappell.\r\nChappell, 24, was fatally shot multiple times with a handgun on Mo… [+1672 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Claudia Harmata","title":"Pete Davidson Jokes He's 'Lonely' While Opening Up About Living with His Mom","description":"Pete Davidson is trying to spruce up his “man cave” — starting with finding a new name for it. “So I was calling it the ‘man cave,’ but the Mulaneys told me that if I call it that, they will no longer be my friend,” Davidson explained. “So now I call it the B…","url":"https://people.com/tv/pete-davidson-lonely-opening-up-about-living-with-mom-fallon/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/pete-davidson-2-2000.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630","publishedAt":"2019-04-19T12:36:01Z","content":"Pete Davidson is trying to spruce up his “man cave” starting with finding a new name for it.\r\n“So I was calling it the ‘man cave,’ but the Mulaneys [John and Annamarie] told me that if I call it that, they will no longer be my friend,” Davidson explained. “So… [+2027 chars]"},{"source":{"id":null,"name":"Putthison.com"},"author":"Pete Anderson","title":"Everyday American Style: 1970s Inspiration Via Documerica","description":"Denim jackets, Chucks, and pool cues go together like teenagers and delinquency. Robert Johnson in coal-mining town of Clothier, West... The post Everyday American Style: 1970s Inspiration Via Documerica appeared first on Put This On.","url":"https://putthison.com/everyday-american-style-1970s-inspiration-via-documerica/","urlToImage":"https://putthison.com/wp-content/uploads/2019/04/lee-jacket-1972.jpg","publishedAt":"2019-04-19T03:21:12Z","content":"Denim jackets, Chucks, and pool cues go together like teenagers and delinquency. Robert Johnson in coal-mining town of Clothier, West Virginia, 1974; from the Documerica project.\r\nOur collective understanding of the aesthetics of an era — how people looked, h… [+3772 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Kenny Gould, Contributor, Kenny Gould, Contributor https://www.forbes.com/sites/kennygould/","title":"The Nine Dankest Beers To Enjoy On 4/20","description":"Beer and weed... strange bedfellows or a match made in heaven?","url":"https://www.forbes.com/sites/kennygould/2019/04/19/cannabis-weed-beer/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkennygould%2Ffiles%2F2019%2F04%2FGreat-Notion-Lead-1200x804.jpg","publishedAt":"2019-04-19T12:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nDouble Stack from Great Notion in Portland, Oregon.\r\nPhoto by John Paradiso for @hopculturemag\r\nAlthough the IPA craze that has consumed the beer industry over the last two years is still going strong, e… [+11134 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Adam Millsap, Contributor, Adam Millsap, Contributor https://www.forbes.com/sites/adammillsap/","title":"State Nuclear Subsidies Not Needed","description":"Since 2010, several nuclear plants around the country have closed and economic conditions, particularly low natural gas prices, are often cited as a factor. Now the nuclear industry is seeking government assistance to stay afloat, but state lawmakers should b…","url":"https://www.forbes.com/sites/adammillsap/2019/04/19/state-nuclear-subsidies-not-needed/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fadammillsap%2Ffiles%2F2019%2F04%2Fnuclear-power-plant-1200x736.jpg","publishedAt":"2019-04-19T14:48:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nNuclear power plant\r\nhttps://pixabay.com/\r\nNatural gas has become the dominant source of electricity generation in the United States and this is creating some financial issues for the nuclear industry. S… [+15061 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Bill Whalen, Contributor, Bill Whalen, Contributor https://www.forbes.com/sites/billwhalen/","title":"Now That Bernie Has Discovered Fox News, Will He Further Explore Red-State America?","description":"Now that he's conquered the beast that is Fox News -- more the holding his own in a town hall event earlier this week -- what's the next move for Bernie Sanders if he wants to learn more about red-state America? Try: dining at Chick-fil-A, attending a \"megach…","url":"https://www.forbes.com/sites/billwhalen/2019/04/18/now-that-bernie-has-discovered-fox-news-will-he-further-explore-red-state-america/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fa0a315e402db4935ae25025ce8fe640f%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T02:22:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nSen. Bernie Sanders did something unusual for a Democratic presidential hopeful: a town hall interview with Fox News anchors Bret Baier and Martha MacCallum. (Photo: Matt Rourke/Associated Press)\r\nIn new… [+12783 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Evan Dammarell, Contributor, Evan Dammarell, Contributor https://www.forbes.com/sites/evandammarell/","title":"The Pistons' Situation Should Serve As A Cautionary Tale For The Cavaliers","description":"The Detroit Pistons were once a storied franchise, but have become the model of mediocrity. But, their current tale of inefficiency should be a cautionary one for the future of the Cleveland Cavaliers, who almost ended up like their division rivals.","url":"https://www.forbes.com/sites/evandammarell/2019/04/19/the-pistons-situation-should-serve-as-a-cautionary-tale-for-the-cavaliers/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_5999%2Fpt_5999_458_o.jpg%3Ft%3D1555671616","publishedAt":"2019-04-19T11:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nCLEVELAND, OHIO - MARCH 18: Wayne Ellington #20 of the Detroit Pistons celebrates after scoring over David Nwaba #12 of the Cleveland Cavaliers during the second half at Quicken Loans Arena on March 18, … [+13137 chars]"},{"source":{"id":null,"name":"Atlasobscura.com"},"author":"Reina Gattuso","title":"Texas Chainsaw Massacre Gas Station in Bastrop, Texas","description":"If you've ever watched a vintage horror film involving a cannibalistic chainsaw-wielding murder and thought, That's my ideal dining experience, Bastrop, Texas, has the spot for you. The original gas-station-cum-barbecue-joint featured in the cult classic The …","url":"https://www.atlasobscura.com/places/texas-chainsaw-massacre-gas-station","urlToImage":"https://assets.atlasobscura.com/media/W1siZiIsInVwbG9hZHMvcGxhY2VfaW1hZ2VzLzdkMWFjY2YyLTg1NmYtNDRjZC05MWYxLTYzODAzNjE1YzNhZWZlMTE4ODI5OTBkNmE3ZWQ5Nl9XZSBTbGF1Z2h0ZXIgQmFyYmVjdWUuanBnIl0sWyJwIiwiY29udmVydCIsIiJdLFsicCIsImNvbnZlcnQiLCItcXVhbGl0eSA4MSAtYXV0by1vcmllbnQiXSxbInAiLCJ0aHVtYiIsIjYwMHg-Il1d/We%20Slaughter%20Barbecue.jpg","publishedAt":"2019-04-19T21:05:00Z","content":"If youve ever watched a vintage horror film involving a cannibalistic chainsaw-wielding murder and thought, Thats my ideal dining experience, Bastrop, Texas, has the spot for you. The original gas-station-cum-barbecue-joint featured in the cult classic The Te… [+1659 chars]"},{"source":{"id":null,"name":"Cbslocal.com"},"author":null,"title":"Body Of Missing 14-Year-Old Boy Found Buried On Ohio Farm - CBS Pittsburgh","description":"Body Of Missing 14-Year-Old Boy Found Buried On Ohio Farm CBS Pittsburgh Missing Ohio teen Jonathon Minard found dead on a farm NBC News Body of missing Ohio teen found in shallow grave near farm Fox News Body of missing Ohio teen found buried in shallow grav…","url":"https://pittsburgh.cbslocal.com/2019/04/19/missing-ohio-teen-buried-shallow-grave/","urlToImage":"https://cbspittsburgh.files.wordpress.com/2019/04/jonathon-minard.jpg?w=1024","publishedAt":"2019-04-19T22:14:00Z","content":"CARROLLTON, Ohio (AP) – Authorities say the body of a 14-year-old boy reported missing Sunday has been found in a shallow grave on a northeast Ohio farm.\r\nThe Carroll County sheriff, prosecutor and coroner didn’t provide any details at a news conference Frida… [+754 chars]"},{"source":{"id":null,"name":"10news.com"},"author":"","title":"Man who pretended to be Timmothy Pitzen pleads not guilty - 10News","description":"Man who pretended to be Timmothy Pitzen pleads not guilty 10News Man who claimed to be Timmothy Pitzen pleads not guilty to federal charges CNN Man accused of impersonating Timmothy Pitzen pleads not guilty WLWT Cincinnati New Charges For Man Accused Of Timmo…","url":"https://www.10news.com/news/national/man-who-pretended-to-be-missing-boy-timmothy-pitzen-pleads-not-guilty","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/87f0150/2147483647/strip/true/crop/4800x2520+0+90/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F8c%2F07%2F24d41e1545ffa4684b70696a2fca%2Fimage-from-ios.jpg","publishedAt":"2019-04-19T22:18:00Z","content":"The Ohio man who allegedly claimed to be Timmothy Pitzen, a boy who disappeared in 2011, pleaded not guilty Friday to federal charges of making false statements to federal agents.\r\nBrian Michael Rini, 23, of Medina appeared in federal court, where he entered … [+1797 chars]"},{"source":{"id":null,"name":"Tmj4.com"},"author":"","title":"Man who pretended to be Timmothy Pitzen faces new charges - WTMJ-TV","description":"Man who pretended to be Timmothy Pitzen faces new charges WTMJ-TV Man who claimed to be Timmothy Pitzen pleads not guilty to federal charges CNN Man accused of impersonating Timmothy Pitzen pleads not guilty WLWT Cincinnati New Charges For Man Accused Of Timm…","url":"https://www.tmj4.com/news/local-news/man-who-pretended-to-be-missing-boy-timmothy-pitzen-faces-new-charges","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/6331ac2/2147483647/strip/true/crop/900x473+0+101/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fcc%2F93%2F9d28fcdb4becab8615b224f3969b%2Fwcpo-brian-rini.jpg","publishedAt":"2019-04-19T02:07:00Z","content":"The man who pretended to be missing boy Timmothy Pitzen faces additional charges according to the United States Department of Justice. \r\nBrian Michael Rini, 23, is now charged with two counts of making false statements and one count of aggravated identity the… [+765 chars]"},{"source":{"id":null,"name":"Abc13.com"},"author":null,"title":"Man indicted after pretending to be missing 14-year-old - KTRK-TV","description":"Man indicted after pretending to be missing 14-year-old KTRK-TV Man who claimed to be Timmothy Pitzen pleads not guilty to federal charges CNN Man accused of impersonating Timmothy Pitzen pleads not guilty WLWT Cincinnati New Charges For Man Accused Of Timmot…","url":"https://abc13.com/man-indicted-after-pretending-to-be-missing-14-year-old/5259820/","urlToImage":"https://s.abcnews.com/images/US/brian-michael-rini-ap-jc-190405_hpMain_16x9_608.jpg?w=1600","publishedAt":"2019-04-19T14:05:09Z","content":"Authorities indicted an Ohio man on fresh charges Thursday for allegedly impersonating Timmothy Pitzen, a boy who vanished in 2011 at the age of 6. A federal grand jury indicted Brian Michael Rini, 23, on two counts of making false statements and one count of… [+2009 chars]"},{"source":{"id":null,"name":"Q92radio.com"},"author":null,"title":"BREAKING: Missing 14-year-old found buried in shallow grave - q92radio.com","description":"BREAKING: Missing 14-year-old found buried in shallow grave q92radio.com UPDATE: Jonathon Minard found dead in shallow grave Canton Repository Missing Ohio teen Jonathon Minard found dead on a farm NBC News Body of missing 14-year-old Carroll County boy found…","url":"https://www.q92radio.com/6254-2/","urlToImage":"https://d5ufkx8libmbn.cloudfront.net/wp-content/uploads/sites/9/2019/04/19204733/maxresdefault-300x300.jpg","publishedAt":"2019-04-19T20:49:53Z","content":"April 19, 2019\r\nCARROLL COUNTY, Ohio  The body of a missing 14-year-old from Carroll County was found buried in a shallow grave on a farm in Washington Township on Friday.\r\nNew conference in Carroll County concerning the disappearance of a 14-year-old boy\r\nPo… [+305 chars]"},{"source":{"id":null,"name":"Abc7chicago.com"},"author":null,"title":"Brian Michael Rini indicted, accused of pretending to be missing Illinois boy Timmothy Pitzen - WLS-TV","description":"Brian Michael Rini indicted, accused of pretending to be missing Illinois boy Timmothy Pitzen WLS-TV Man who claimed to be Timmothy Pitzen pleads not guilty to federal charges CNN Timmothy Pitzen case: More charges for man accused of claiming to be missing ch…","url":"https://abc7chicago.com/man-accused-of-pretending-to-be-missing-illinois-boy-indicted-/5258144/","urlToImage":"https://cdn.abcotvs.com/dip/images/5258882_041819-wls-rini-grand-jury-6p-vid.jpg?w=1600","publishedAt":"2019-04-19T00:00:00Z","content":"CINCINNATI, OH -- A federal grand jury on Wednesday indicted an Ohio man who is accused of pretending to be a missing boy from Illinois, federal officials said. RELATED: TIMMOTHY PITZEN CASE: Brian Rini, man accused of claiming to be missing Aurora boy, charg… [+2261 chars]"},{"source":{"id":null,"name":"News5cleveland.com"},"author":"https://www.news5cleveland.com/drew-scofield, https://www.news5cleveland.com/ian-cross","title":"Missing 14-year-old boy found dead after days of searching - News 5 Cleveland","description":"Missing 14-year-old boy found dead after days of searching News 5 Cleveland Body of missing 14-year-old Carroll County boy found buried on farm in Washington Township WJW FOX 8 News Cleveland Carroll County Sheriff holds news conference on missing teen found …","url":"https://www.news5cleveland.com/news/local-news/oh-carroll/missing-14-year-old-carroll-county-boy-found-dead-after-days-of-searching-authorities-say","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/2edc5c0/2147483647/strip/true/crop/900x473+0+101/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9e%2Ff6%2F5955c19e4e3ba4aaaca476dab812%2Fjonathon-minard.jpg","publishedAt":"2019-04-19T20:02:00Z","content":"CARROLL COUNTY, Ohio The Carroll County Sheriffs Office has confirmed the death of Jonathon Minard, a 14-year-old boy who went missing over the weekend.\r\nSheriff Dale Williams said Jonathon was found buried in a shallow grave at a farm in Washington Township … [+1439 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Joel Huerto","title":"Kellyanne Conway's husband calls for impeachment: 'Trump is a cancer on the presidency' - AOL","description":"Kellyanne Conway's husband calls for impeachment: 'Trump is a cancer on the presidency' AOL Kellyanne Conway calls Mueller probe \"a political proctology exam,\" says it's \"time to move on\" CBS News Kellyanne Conway reiterates call for Adam Schiff's resignation…","url":"https://www.aol.com/article/news/2019/04/18/george-conway-calls-for-impeachment-trump-is-a-cancer-on-the-presidency/23714246/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/1028x675/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2Fdad739a0-624e-11e9-bff7-9a7aab0317e6","publishedAt":"2019-04-19T02:58:10Z","content":"George Conway, husband of White House counselor Kellyanne Conway, believes the evidence collected by special counsel Robert Mueller is so damning for President Trump, he should be impeached immediately.\r\nWhat the Mueller report disturbingly shows, with crysta… [+11426 chars]"},{"source":{"id":null,"name":"Wkyc.com"},"author":null,"title":"Missing 14-year-old Carroll County boy found dead on farm; investigation ongoing - WKYC.com","description":"Missing 14-year-old Carroll County boy found dead on farm; investigation ongoing WKYC.com Missing Ohio teen Jonathon Minard found dead on a farm NBC News Body of missing 14-year-old Carroll County boy found buried on farm in Washington Township WJW FOX 8 News…","url":"https://www.wkyc.com/article/news/carroll-county-sheriff-to-hold-news-conference-this-afternoon-regarding-missing-14-year-old-boy/95-40f4e3d1-ad04-45bb-8c98-0f0a51a39dad","urlToImage":"https://media.wkyc.com/assets/WKYC/images/15ba942a-5e64-48d1-87cb-1b84e3ca4958/15ba942a-5e64-48d1-87cb-1b84e3ca4958_1140x641.jpg","publishedAt":"2019-04-19T17:53:00Z","content":"Officials from Carroll County have confirmed the body of Jonathon Minard, a 14-year-old boy who had been missing for six days, was found Friday morning.\r\nSheriff Dale Williams says Minard's corpse was located in a shallow grave on a farm in Washington Townshi… [+765 chars]"},{"source":{"id":null,"name":"Dawgpounddaily.com"},"author":"Randy Gurzi","title":"Cleveland Browns: 7-Round NFL mock draft, the week before - FanSided","description":"Cleveland Browns: 7-Round NFL mock draft, the week before FanSided Trade option? Johnson has 'vital' role for Browns NFL.com Colin Cowherd dampens Browns expectations & breaks down easiest, hardest schedules | NFL | THE HERD The Herd with Colin Cowherd NFL sc…","url":"https://dawgpounddaily.com/2019/04/19/cleveland-browns-final-2019-7-round-mock-draft/","urlToImage":"https://imagesvc.timeincapp.com/v3/fan/image?url=https://dawgpounddaily.com/wp-content/uploads/getty-images/2017/07/1128642196-1.jpeg&","publishedAt":"2019-04-19T11:00:00Z","content":"ARLINGTON, TX APRIL 26: A video board displays the text ON THE CLOCK for the Cleveland Browns during the first round of the 2018 NFL Draft at AT\r\nThe 2019 NFL Draft is nearly here as the Cleveland Browns will begin making their draft moves in one week. There … [+1421 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter 7-round mock draft: Round 2 - NFL.com","description":"Chad Reuter 7-round mock draft: Round 2 NFL.com Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Yahoo Sports' top 2019 NFL draft prospects, No. 9: Michigan LB Devin Bush Jr. Yahoo Sports Devin Bus…","url":"http://www.nfl.com/news/story/0ap3000001027103/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-2","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/03/25/0ap3000001024136_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+6616 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Rachel Kleinman","title":"Nancy Pelosi plans Monday meeting on Mueller report: 'Congress will not be silent' - AOL","description":"Nancy Pelosi plans Monday meeting on Mueller report: 'Congress will not be silent' AOL Mueller Hands Dems a Gift and They're Already Fumbling It The Daily Beast Alexandria Ocasio-Cortez, George Conway Back Impeachment Proceedings Against Trump As #ImpeachTrum…","url":"https://www.aol.com/article/news/2019/04/19/nancy-pelosi-plans-monday-meeting-on-mueller-report-congress-will-not-be-silent/23714400/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2734x1792+0+399/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2F43a504f0-6298-11e9-bf07-23f8dfd13ecc","publishedAt":"2019-04-19T11:43:28Z","content":"House Speaker Nancy Pelosi (D-Calif.) organized a meeting with House Democrats scheduled after the Easter weekend to discuss what to do next in response to the release of Robert Muellers long-awaited redacted report.\r\nPelosi asked for the conference call to t… [+13016 chars]"},{"source":{"id":"the-telegraph","name":"The Telegraph"},"author":"Charlotte Krol","title":"The National, Royal Festival Hall, review: Elder statesmen of indie take risks with new material","description":"Nearly an hour&rsquo;s worth of unheard material by The National was performed to devoted fans inside London&rsquo;s Royal Festival Hall on Thursday.","url":"https://www.telegraph.co.uk/music/what-to-listen-to/national-review-royal-festival-hall-elder-statesmen-indie-take/","urlToImage":"https://www.telegraph.co.uk/content/dam/music/2019/04/19/TELEMMGLPICT000194641204-xlarge_trans_NvBQzQNjv4BqeoMPseA8rXxS7fV2a1a45TlaTMTxUhlzF8Rkw038U-A.jpeg","publishedAt":"2019-04-19T13:09:15Z","content":"Nearly an hours worth of unheard material by The National was performed to devoted fans inside Londons Royal Festival Hall on Thursday. It was a daring, potentially alienating move by the Ohio five-piece who, for more than a decade, lingered little known on t… [+441 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Cristian Gnaticov","title":"Jeep Gladiator Visiting Europe This Summer, Sales Begin In 2020","description":"The Gladiator will be present at the 2019 Jeep Camp event and will launch in EMEA markets next year.","url":"https://www.carscoops.com/2019/04/jeep-gladiator-visiting-europe-this-summer-sales-begin-in-2020/","urlToImage":"https://images.carscoops.com/2019/04/12428230-2020-jeep-gladiator-0.jpg","publishedAt":"2019-04-19T08:50:45Z","content":"The vehicle that marks Jeeps return to the pickup truck segment, the Gladiator, will officially touch down in Europe this summer for the first time during the 2019 Camp Jeep.\r\nThe event will take place in San Martino di Castrozza, Italy, between July 12 and 1… [+1502 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"https://facebook.com/WGR550","title":"CAPACCIO: 2019 Mock Draft No. 2 - WBEN","description":"CAPACCIO: 2019 Mock Draft No. 2 WBEN Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Cardinals Can't and Won't Pass on QB Kyler Murray at No. 1 in 2019 NFL Draft Bleacher Report NFL New York Giant…","url":"https://wgr550.radio.com/articles/opinion/capaccio-2019-mock-draft-no-2","urlToImage":"https://s3.amazonaws.com/s3.wgr550.com/Irv.jpg","publishedAt":"2019-04-19T04:05:39Z","content":"Let me be upfront and clear about this mock draft.  I changed the top pick for the sake of it possibly happening.  Even though I still beleieve, as of right now, that the Arizona Cardinals will take Oklahoma QB Kyler Murray first overall, that certainly isn't… [+4468 chars]"},{"source":{"id":null,"name":"Businessjournaldaily.com"},"author":null,"title":"Gilbert's Risk Solutions Adds Pituch to Staff - businessjournaldaily.com","description":"Colleen Pituch has joined Gilbert’s Risk Solutions in Sharon, Pa., as a business risk adviser. Pituch brings more than 20 years of industry experience to Gilbert’s Risk Solutions. She is “known for creating not just relationships, but trusted partnerships,” t…","url":"https://businessjournaldaily.com/gilberts-risk-solutions-adds-pituch-to-staff/","urlToImage":"https://bizjournal.wpengine.com/wp-content/uploads/2017/11/BJ-Logo-small2.jpg","publishedAt":"2019-04-19T13:34:27Z","content":"Colleen Pituch has joined Gilbert’s Risk Solutions in Sharon, Pa., as a business risk adviser. Pituch brings more than 20 years of industry experience to Gilbert’s Risk Solutions. She is “known for creating not just relationships, but trusted partnerships,” t… [+466 chars]"},{"source":{"id":null,"name":"Nbc4i.com"},"author":"NBC4 Staff","title":"Thieves wanted for crashing SUV into Gahanna business - NBC4i.com","description":"Thieves wanted for crashing SUV into Gahanna business NBC4i.com Gahanna police are searching for suspects who allegedly drove a SUV into the front of a business.","url":"https://www.nbc4i.com/news/local-news/thieves-wanted-for-crashing-suv-into-gahanna-business/1938324037","urlToImage":"https://media.nbc4i.com/nxs-wcmhtv-media-us-east-1/photo/2019/04/19/Gahanna%20Burglary_1555674518250.jpg_83249005_ver1.0_1280_720.jpg","publishedAt":"2019-04-19T10:21:00Z","content":"GAHANNA, Ohio (WCMH) - Gahanna police are searching for a suspect who allegedly drove a SUV into the front of a business wearing plastic Nixon-like president's mask.\r\nThe front doors were pushed off the hinges and glass along the storefront of Fastenal, 845 C… [+869 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"","title":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up - CBS Sports","description":"2019 NFL Draft: These 24 prospects are first-round locks, plus a look at the next guys up CBS Sports Five NFL General Managers Under the Most Pressure on Draft Day Sports Illustrated 2019 NFL Draft: late-round targets who are just as good as early-round prosp…","url":"https://www.cbssports.com/nfl/news/2019-nfl-draft-the-24-prospects-who-are-locks-for-the-first-round-plus-a-look-at-the-next-guys-up/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/19/dadb3583-ec12-4d9c-80bc-7dffe95d12a6/thumbnail/770x433/9dc26e1b036a62e0e201173f8b6f21cc/irv.jpg","publishedAt":"2019-04-19T14:15:00Z","content":"In most years, there are about 20-24 players in a draft who represent a safe bet to be first-round picks. The exact number can certainly vary by the year, but you can usually identify 75 percent of the players who will eventually comprise the top 32 picks.\r\nT… [+6291 chars]"},{"source":{"id":null,"name":"Cleveland.com"},"author":"Terry Pluto, The Plain Dealer","title":"Cleveland Browns Scribbles: John Dorsey looking for more from (2018) draft – Terry Pluto - cleveland.com","description":"Cleveland Browns Scribbles: John Dorsey looking for more from (2018) draft – Terry Pluto cleveland.com Trade option? Johnson has 'vital' role for Browns NFL.com Week-by-week predictions for the Browns' 2019 season | NFL Live ESPN Cleveland Browns: 7-Round NFL…","url":"https://www.cleveland.com/browns/2019/04/cleveland-browns-scribbles-john-dorsey-looking-for-more-from-2018-draft-terry-pluto.html","urlToImage":"https://www.cleveland.com/resizer/2BHLUg2O_FiKX-OqtbVDaewZBGg=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/APE7WNOFFNBRVPOSWLE26KA6AU.JPG","publishedAt":"2019-04-19T11:54:00Z","content":"CLEVELAND, Ohio -- Scribbles in my Cleveland Browns notebook while listening to John Dorseys pre-draft press conference:\r\n1. The Browns dont draft until the 49th pick thats the second round. Who knows what theyll do with that pick, other than Dorsey has an in… [+4465 chars]"},{"source":{"id":null,"name":"Cleveland.com"},"author":"Doug Lesmerises, cleveland.com","title":"Passing on the chance to draft Carson Wentz: Transforming the Cleveland Browns, Decision No. 7 - cleveland.com","description":"Passing on the chance to draft Carson Wentz: Transforming the Cleveland Browns, Decision No. 7 cleveland.com Colin Cowherd dampens Browns expectations & breaks down easiest, hardest schedules | NFL | THE HERD The Herd with Colin Cowherd Browns' John Dorsey: N…","url":"https://www.cleveland.com/browns/2019/04/passing-on-the-chance-to-draft-carson-wentz-transforming-the-cleveland-browns-decision-no-7.html","urlToImage":"https://www.cleveland.com/resizer/jBXIJPbtky2SBtACgpchsItcf9E=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/LSH533DHU5C4HDQVC7FXNPP6QM.jpg","publishedAt":"2019-04-19T09:06:00Z","content":"CLEVELAND, Ohio -- Whether you liked it or hated it in the moment (and many of you hated it), the move that set the Browns on this current path has to rank high on this list. If the Browns had drafted their franchise quarterback at No. 2 in the 2016 NFL Draft… [+6247 chars]"},{"source":{"id":null,"name":"Fantasypros.com"},"author":null,"title":"NFL Mock Draft 2019 – First Round (2.0) - FantasyPros","description":"NFL Mock Draft 2019 – First Round (2.0) FantasyPros With the NFL Draft just days away I am excited to release my final mock draft of the season. There are quite a bit few changes from my first mock from back in... View full coverage on Google News","url":"https://www.fantasypros.com/2019/04/nfl-mock-draft-2019-first-round-2-0/","urlToImage":"https://www.fantasypros.com//cdn.fantasypros.com/wp-content/uploads/full_193666.jpg","publishedAt":"2019-04-19T13:20:50Z","content":"With the NFL Draft just days away I am excited to release my final mock draft of the season. There are quite a bit few changes from my first mock from back in February. The first wide receiver taken has changed. Numerous players have dropped out of the first … [+26088 chars]"},{"source":{"id":null,"name":"Crooksandliars.com"},"author":"Aliza Worthington","title":"Stockton, CA Mayor Schools MSNBC Host: Not All 'Working Class' Voters Are White And Living In Ohio","description":"Here's what I hate. These voter-on-the-street interviews we will be having all-day/every-day until the damn election in 2020. I hate them because for some reason, the only voters TV journalists seem to find are white people who will vote for Trump no matter w…","url":"https://crooksandliars.com/2019/04/mayor-michael-tubbs-schools-stephanie","urlToImage":"https://crooksandliars.com/files/mediaposters/2019/04/42055.jpg","publishedAt":"2019-04-19T16:44:31Z","content":"Here's what I hate. These voter-on-the-street interviews we will be having all-day/every-day until the damn election in 2020. I hate them because for some reason, the only voters TV journalists seem to find are white people who will vote for Trump no matter w… [+5429 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 of 14 Big Ten teams coming out of spring planning to continue quarterback auditions in preseason practices","url":"https://www.foxsports.com/college-football/story/7-big-ten-teams-will-extend-qb-competitions-into-preseason-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/c38cfc6b693c4045af601df963be3e3d.vresize.1200.630.high.90.jpg","publishedAt":"2019-04-19T15:16:09Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4876 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"14 Big Ten football players poised to break out in the fall","description":"14 Big Ten football players poised to break out in the fall","url":"https://www.foxsports.com/college-football/story/14-big-ten-football-players-poised-to-break-out-in-the-fall-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/0c81b75d5fd54efe9a1bfdf83b3e61a4.vresize.1200.630.high.50.jpg","publishedAt":"2019-04-19T15:16:44Z","content":"A look at football players in the Big Ten this spring who are poised to have standout seasons this fall:\r\nEAST DIVISION\r\nINDIANA\r\nWRs Nick Westbrook and Donovan Hale, seniors. Westbrook, who missed 2017 with an ACL tear, showed glimpses of his pre-injury tale… [+2066 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP                                                    \n                            FOX Sports Ohio","title":"Joey Votto hits 1st career leadoff homer in Reds' 4-1 win over Padres","description":"Tucker Barnhart and Jesse Winker also went deep for the Reds, who got strong bullpen work and 5.1 solid innings from Tanner Roark.","url":"https://www.foxsports.com/ohio/story/joey-votto-first-career-leadoff-home-run-cincinnati-reds-san-diego-padres-nl-national-league-tucker-barnhart-jesse-winker-tanner-roark-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/usatsi_12557272-cropped.vresize.1200.630.high.64.jpg","publishedAt":"2019-04-19T06:28:24Z","content":"SAN DIEGO (AP) Joey Votto didn’t wait long to make an impact as the Cincinnati Reds’ leadoff batter Thursday night.\r\nVotto drove rookie Chris Paddack’s third pitch of the game over the fence in right-center field for his first career leadoff homer, sparking t… [+4340 chars]"},{"source":{"id":null,"name":"Thecut.com"},"author":"Kaitlin Menza","title":"A Peak-Foliage Wedding in the Catskills","description":"Since most guests were traveling, the couple planned a full weekend in the country, including a group trip to Storm King Art Center.","url":"http://www.thecut.com/2019/04/a-peak-foliage-wedding-in-the-catskills.html","urlToImage":"https://pixel.nymag.com/imgs/fashion/daily/2018/11/01/winter-weddings-2019/albums/peak-foliage/1.w1200.h630.jpg","publishedAt":"2019-04-19T20:00:00Z","content":"Channeling that moment of calm that comes when you exit the city for fresher air, Jessica Beck, 35, knew we had to do something upstate, she says. Her fiancé, Charlie Flexon, 40, had previously rock climbed in the Catskills and was partial to the area in late… [+1296 chars]"},{"source":{"id":null,"name":"Wdtn.com"},"author":"WDTN.com Staff","title":"Sinclair Tech Prep Showcase highlights best in Career Technical Education - WDTN.com","description":"Sinclair Tech Prep Showcase highlights best in Career Technical Education WDTN.com They created projects in many different fields including nursing, transportation, business, and more. The students then had their presentations critiqued by...","url":"https://www.wdtn.com/news/local-news/sinclair-tech-prep-showcase-highlights-best-in-career-technical-education/1937610986","urlToImage":"https://media.wdtn.com/nxs-wdtntv-media-us-east-1/photo/2019/04/18/Sinclair_tech_prep_1_83195921_ver1.0_1280_720.jpg","publishedAt":"2019-04-19T02:08:00Z","content":"DAYTON, Ohio (WDTN) – Nearly a thousand students across the area took part in the Sinclair Tech Prep Showcase on Thursday.\r\nThey created projects in many different fields including nursing, transportation, business, and more. The students then had their prese… [+638 chars]"},{"source":{"id":null,"name":"Techlunchpail.com"},"author":"Tim Thomas","title":"Virginia Tech Hosting Former Wofford Commit Hunter Cattoor on a Visit - Tech Lunch Pail","description":"Virginia Tech Hosting Former Wofford Commit Hunter Cattoor on a Visit Tech Lunch Pail Virginia Tech is hosting former Wofford commit Hunter Cattoor on an official visit this weekend. The 6'3'' combo guard has been released from his NLI.","url":"https://techlunchpail.com/2019/04/19/virginia-tech-hosting-former-wofford-hunter-cattoor-official-visit/","urlToImage":"https://techlunchpail.com/wp-content/uploads/2019/04/VT-Students-Miami-1-1024x683.jpg","publishedAt":"2019-04-19T06:00:00Z","content":"Former Wofford signee and 6’3” guard Hunter Cattoor is taking an official visit to Virginia Tech this weekend after the Hokies recently offered the former Terriers’ commit.\r\nThe Orlando, FL native received his release from the Terriers last week and arrived i… [+2444 chars]"},{"source":{"id":null,"name":"Dlisted.com"},"author":"Mieka","title":"Pete Davidson Says He’s Living With His Mom","description":"It sounds like Kate Beckinsale is learning the hard way what it’s like having to deal with a barely post-adolescent man-child, and is probably thanking her lucky stars she had a girl instead of a boy. And Pete Davidson’s mom is probably wishing the same thing…","url":"http://dlisted.com/2019/04/19/pete-davidson-says-hes-living-with-his-mom/","urlToImage":"http://dlisted.com/wp-content/uploads/2019/04/Screenshot-2019-04-19-10.22.37.jpg","publishedAt":"2019-04-19T18:45:35Z","content":"It sounds like Kate Beckinsale is learning the hard way what its like having to deal with a barely post-adolescent man-child, and is probably thanking her lucky stars she had a girl instead of a boy. And Pete Davidsons mom is probably wishing the same thing r… [+2133 chars]"},{"source":{"id":null,"name":"Lifehacker.com.au"},"author":"Kate Taylor","title":"Everything We Know About McDonald's Mysterious 'McGold' Card","description":"The McDonald's McGold Card is a food-redemption ticket that provides the owner with free, unlimited McDonald's for life. The existence of the card gained international attention after actor Rob Lowe flashed his on Jimmy Kimmel Live in 2015. Since then, it has…","url":"https://www.lifehacker.com.au/2019/04/the-true-story-behind-mcdonalds-mysterious-mcgold-cards/","urlToImage":"https://edge.alluremedia.com.au/m/l/2018/07/McDonalds-Gold-Card-768x432.jpg","publishedAt":"2019-04-19T02:45:30Z","content":"The McDonald's McGold Card is a food-redemption ticket that provides the owner with free, unlimited McDonald's for life. The existence of the card gained international attention after actor Rob Lowe flashed his on Jimmy Kimmel Live in 2015. Since then, it has… [+4980 chars]"},{"source":{"id":null,"name":"Amazon.com"},"author":"aws@amazon.com","title":"Amazon Transcribe is now available in Asia Pacific (Seoul) and EU (Frankfurt) with added language support for Spanish (ES)","description":"Amazon Transcribe is an automatic speech recognition (ASR) service that makes it easy for you to add speech-to-text capabilities to your applications. Starting today, Amazon Transcribe becomes available in two new AWS regions, Asia Pacific (Seoul) and EU (Fra…","url":"https://aws.amazon.com/about-aws/whats-new/2019/04/amazon-transcribe-is-now-available-in-asia-pacific-seoul-and-eu-frankfurt-with-added-language-support-for-spanish/","urlToImage":"https://a0.awsstatic.com/main/images/logos/aws_logo_smile_1200x630.png","publishedAt":"2019-04-19T23:39:14Z","content":"Amazon Transcribe enables organizations to increase the accessibility and discoverability of their audio and video content, serving a breadth of use cases. For instance, contact centers can convert call recordings into text and analyze the data for actionable… [+1047 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Thursday Sports in Brief","description":"Thursday Sports in Brief","url":"https://www.foxsports.com/other/story/thursday-sports-in-brief-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T07:14:35Z","content":"COLLEGE BASKETBALL\r\nRALEIGH, N.C. (AP) — North Carolina women’s basketball coach Sylvia Hatchell has resigned after an external review found she had made “racially insensitive” comments and applied “undue influence” regarding players’ ability to compete throu… [+6475 chars]"},{"source":{"id":null,"name":"Reason.com"},"author":"C.J. Ciaramella","title":"The Future of Marijuana Expungements is Automation","description":"Experiments in California show that the government can quickly and efficiently expunge thousands of marijuana convictions. There's no reason it shouldn't.","url":"https://reason.com/2019/04/20/the-future-of-marijuana-expungements-is-automation/","urlToImage":"https://reason.com/wp-content/uploads/2019/04/cannabis-leaves-4-MIS-Photography-1200x630.jpg","publishedAt":"2019-04-19T17:51:51Z","content":"Everyone loves to hate algorithms. Companies mine your data to sell you more dumb tchotchkes. Governments use them to develop secretive and dystopian-sounding \"predictive policing\" tools.\r\nBut in one corner of the country, algorithms are being used to erase t… [+4768 chars]"},{"source":{"id":null,"name":"Sportsnaut.com"},"author":null,"title":"Giants concerned about Josh Rosen's personality, unlikely to trade for QB - Yardbarker","description":"Giants concerned about Josh Rosen's personality, unlikely to trade for QB Yardbarker 2019 NFL Mock Draft Roundup: Who should the Redskins draft in the first round? Hogs Haven NFL draft rumors: Cardinals will not take Kyler Murray with No. 1 pick Yahoo Sports …","url":"https://sportsnaut.com/2019/04/giants-concerned-about-josh-rosens-personality-unlikely-to-trade-for-qb/","urlToImage":"https://www.yardbarker.com/media/2/5/25514b0807b4e1271f92cd66cd95d7b93ad96ade/thumb_16x9/11920070.jpg","publishedAt":"2019-04-19T21:25:17Z","content":"The New York Giants have suddenly been linked to quarterbacks a whole lot over the past several days. \r\nA recent reports suggests that they are eyeing either Ohio States Dwayne Haskins or Dukes Daniel Jones with the sixth pick in next weeks NFL Draft.\r\nThe Gi… [+1275 chars]"},{"source":{"id":null,"name":"Americanthinker.com"},"author":null,"title":"How to Defeat the National Popular Vote Interstate Compact","description":"A key difference between conservatives and liberals is the way in which they handle a presidential election loss.","url":"https://www.americanthinker.com/articles/2019/04/how_to_defeat_the_national_popular_vote_interstate_compact.html","urlToImage":"https://www.americanthinker.com/images/bucket/2019-03/212642.jpg","publishedAt":"2019-04-19T05:00:00Z","content":"It is obvious why liberals, whose political philosophy and preferences are anathema to much of the nation, would want to do this.  Eliminating the Electoral College means Democratic presidential candidates never having to say they're sorry to, or consider the… [+14391 chars]"},{"source":{"id":null,"name":"Upenn.edu"},"author":"Knowledge@Wharton","title":"Want to Build a Smart City? Here Are Some Strategies That Work","description":"Collaborative platforms, sustainability, public-private partnerships and data analytics are critical for developing smart and inclusive cities, notes TCS’s Seeta Hariharan.","url":"https://knowledge.wharton.upenn.edu/article/want-to-build-a-smart-city-here-are-some-strategies-that-work/","urlToImage":"https://knowledge.wharton.upenn.edu/wp-content/uploads/2018/02/Smart-City-Pioneers.jpg","publishedAt":"2019-04-19T19:11:35Z","content":"The global smart-city movement, which has been around for more than two decades, has gone through three phases of evolution. It initially focused on technology-led solutions to challenges. Then came a citizen-centric, collaborative approach in the second phas… [+25251 chars]"},{"source":{"id":null,"name":"Infowars.com"},"author":"Dan Lyman","title":"US Launches Study to Find Ways to Reduce Opioid Overdose Deaths","description":"Over 47,000 opioid deaths in 2017","url":"https://www.infowars.com/us-launches-study-to-find-ways-to-reduce-opioid-overdose-deaths/","urlToImage":"https://www.infowars.com/wp-content/uploads/2019/04/Homeless.jpg","publishedAt":"2019-04-19T12:10:09Z","content":"U.S. health officials on Thursday said they will spend $350 million in four states to study ways to best deal with the nation’s opioid crisis on the local level, with a goal of reducing opioid-related overdose deaths by 40 percent over three years in selected… [+726 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 7k-Mile 1996 Chevrolet Corvette Grand Sport","description":"This Chevrolet Corvette is one of 810 Grand Sport coupes built to commemorate the end of C4 production in 1996, and was purchased new by the seller. The car is finished in Admiral Blue with white and red stripes over black factory wheels, and power is from a …","url":"https://bringatrailer.com/listing/1996-chevrolet-corvette-29/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/03/1996_chevrolet_corvette_1553825985495d565ef66e0319191524b-e1555547454541.jpg","publishedAt":"2019-04-19T01:40:02Z","content":"This Chevrolet Corvette is one of 810 Grand Sport coupes built to commemorate the end of C4 production in 1996, and was purchased new by the seller. The car is finished in Admiral Blue with white and red stripes over black factory wheels, and power is from a … [+1703 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Christopher Brito","title":"Giant \"lion\" fossil found inside drawer at Kenyan museum","description":"If it were standing today, the beast would be larger than a polar bear","url":"https://www.cbsnews.com/news/giant-lion-fossil-found-inside-drawer-at-kenyan-museum-2019-04-19/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/19/2dc90bca-3d82-4aaa-a074-d30662ad40ce/thumbnail/1200x630/7c86dea26b6ba99e8fb64f1b82da33a6/198729-web.jpg","publishedAt":"2019-04-19T23:26:32Z","content":"An extinct species of giant mammal has been identified after researchers discovered fossils left inside a drawer at a Kenyan museum. The species roamed east Africa 22 million years ago and was one of the most fearsome predators in its era, according to a stud… [+1923 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Caitlin O'Kane","title":"Mom says kids kicked out of school because she's unmarried","description":"The mother alleges a school administrator blamed her \"adultery\" as one reason her daughters were being dismissed from school","url":"https://www.cbsnews.com/news/ohio-mother-says-christian-school-expelled-her-kids-because-shes-unmarried-and-they-have-different-fathers/","urlToImage":"https://cbsnews1.cbsistatic.com/hub/i/r/2019/04/19/d23aea73-151e-45a1-8e1d-d748188dcada/thumbnail/1200x630/61dc1a9e6ca6eb47110ac0c0537dfebd/screen-shot-2019-04-19-at-1-38-21-pm.png","publishedAt":"2019-04-19T18:02:05Z","content":"A single mother of two from Akron, Ohio, says a Christian school expelled her children because she is not married and her kids have different fathers. The mother, Summer Grant, wrote a lengthy post on Facebook defending herself after Chapel Hill Christian Sch… [+4111 chars]"},{"source":{"id":null,"name":"Justjared.com"},"author":"Just Jared","title":"Pete Davidson Reveals On 'Fallon' That He's 'Kinda' Living With His Mom - Watch Here!","description":"Pete Davidson stopped by The Tonight Show Starring Jimmy Fallon on Thursday (April 18) and revealed that he and his mom bought a house together. “So I live with my mom… well we bought a house together, but nobody believes that,” the 25-year-old actor-comedian…","url":"http://www.justjared.com/2019/04/19/pete-davidson-reveals-on-fallon-that-hes-kinda-living-with-his-mom-watch-here/","urlToImage":"http://cdn01.cdn.justjared.com/wp-content/uploads/headlines/2019/04/davidson-living-mom.jpg","publishedAt":"2019-04-19T12:40:01Z","content":"Pete Davidson stopped by The Tonight Show Starring Jimmy Fallon on Thursday (April 18) and revealed that he and his mom bought a house together. \r\n“So I live with my mom… well we bought a house together, but nobody believes that,” the 25-year-old actor-comedi… [+726 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Associated Press","title":"Boy, 14, missing since weekend found buried on Ohio farm - Fox News","description":"Boy, 14, missing since weekend found buried on Ohio farm Fox News Authorities say the body of a 14-year-old boy reported missing Sunday has been found in a shallow grave on a northeast Ohio farm. View full coverage on Google News","url":"https://www.foxnews.com/us/boy-14-missing-since-weekend-found-buried-on-ohio-farm","urlToImage":"https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png","publishedAt":"2019-04-19T21:57:48Z","content":"CARROLLTON, Ohio Authorities say the body of a 14-year-old boy reported missing Sunday has been found in a shallow grave on a northeast Ohio farm.\r\nThe Carroll County sheriff, prosecutor and coroner didn't provide any details at a news conference Friday after… [+544 chars]"},{"source":{"id":null,"name":"Nj.com"},"author":"Ryan Dunleavy | NJ Advance Media for NJ.com","title":"NFL Draft 2019: Giants make Duke's Daniel Jones No. 1 QB on board? Sorry, Dwayne Haskins, Kyler Murray, Drew Lock - NJ.com","description":"NFL Draft 2019: Giants make Duke's Daniel Jones No. 1 QB on board? Sorry, Dwayne Haskins, Kyler Murray, Drew Lock NJ.com I don't trust Giants GM Dave Gettleman in the NFL draft – Max Kellerman | First Take ESPN NFL Mock Draft 5.0: Giants trade up for Drew Loc…","url":"https://www.nj.com/giants/2019/04/nfl-draft-2019-giants-make-dukes-daniel-jones-no-1-qb-on-board-sorry-dwayne-haskins-kyler-murray-drew-lock.html","urlToImage":"https://www.nj.com/resizer/NS8p4Bayu1HUt1_oilzW3qz22S0=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/INTOVQKJAVFBZGCZHPHTA4V2QA.JPG","publishedAt":"2019-04-19T21:11:00Z","content":"Move over, Kyler Murray.\r\nAt least one NFL team has Dukes Daniel Jones as the No. 1 quarterback on its Draft board, according to Yahoos Charles Robinson. While Robinson did not reveal the team, he suggested it is obvious.\r\nAnd nobody fits the bill like the Gi… [+2418 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Darin Gantt","title":"One team apparently ranks Daniel Jones as top quarterback","description":"The amount and order of the quarterbacks chosen in the first round of the 2019 NFL Draft will be the thing that scrambles most of the mock drafts. And as we enter the final week, there’s still plenty of time for surprises. According to Charles Robinson of Yah…","url":"https://profootballtalk.nbcsports.com/2019/04/19/one-team-apparently-ranks-daniel-jones-as-top-quarterback/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/gettyimages-1057007360-2-e1555702858977.jpg","publishedAt":"2019-04-19T19:41:16Z","content":"The amount and order of the quarterbacks chosen in the first round of the 2019 NFL Draft will be the thing that scrambles most of the mock drafts.\r\nAnd as we enter the final week, there’s still plenty of time for surprises.\r\nAccording to Charles Robinson of Y… [+619 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Millie Bull, Millie Bull","title":"The world this week: Scientific discoveries and natural disasters","description":"Millie Bull trawls the archives for the key events and notable deaths from this week in history","url":"https://www.independent.co.uk/news/world-science-discoveries-natural-disaster-hitler-chernobyl-nepal-a8875056.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2015/04/17/18/22-planet-nasa.jpg","publishedAt":"2019-04-19T17:54:47Z","content":"The world this week...\r\n22 April\r\nSeduction was made unlawful in Ohio in 1886. The law covered all men over the age of 18 who worked or instructed women. Punishment for breaking this law ranged from two to 10 years in prison. \r\nWell tell you whats true. You c… [+7147 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"'I feel like I'm in my 20s': Ohio man's Lenten, beer-only fast comes to an end","description":"Del Hall said after his Lenten Fast that he needs less sleep, his mind is clear and he said he feels like there's no inflammation in his body.","url":"https://news.yahoo.com/apos-feel-apos-m-20s-121414938.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/MWpv0jJCe0ZiQ.DPxQJ9KQ--~B/aD0xNTMyO3c9MjcyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/usa_today_news_641/f01a5d6fc16a59fd24c06896f662a7d4","publishedAt":"2019-04-19T12:14:14Z","content":"CINCINNATI  Del Hall's first meal of the day Wednesday was a yuzu ginger sour.\r\nMore than 40 days into his beer-only Lenten fast, Hall says his pallet is incredible. The Cincinnati man describes the yuzu, a citrus popular in Asia, as delicate and the first si… [+5078 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"Jane De Suza","title":"Elections 2019: five tips from across the world on sweeping the votes","description":"This election season, we go behind the scenes to share every political party’s secret plan to bring in the votes and draw a crowd to the polls","url":"https://www.thehindu.com/society/how-to-sweep-the-votes-this-election-season/article26886582.ece","urlToImage":"https://www.thehindu.com/society/elqlox/article26886580.ece/ALTERNATES/LANDSCAPE_615/mpcandidateREV","publishedAt":"2019-04-19T08:13:32Z","content":"While talking heads and headlines go hysterical counting votes, heres the checklist every political party secretly has. Bringing it to you, the people, for the first time:\r\n1 Build a voter base\r\nShape them, mould them, even create them if they dont exist. Cha… [+2826 chars]"},{"source":{"id":"msnbc","name":"MSNBC"},"author":"Steve Benen","title":"Friday's Mini-Report, 4.19.19","description":"Today's edition of quick hits.","url":"http://www.msnbc.com/rachel-maddow-show/fridays-mini-report-41919","urlToImage":"http://www.msnbc.com/sites/msnbc/files/styles/ratio--1_91-1--1200x630/public/maddow_theminireport_general.png?itok=yLUr4wsw","publishedAt":"2019-04-19T21:30:25Z","content":"Today’s edition of quick hits:\r\n* The due date is May 1: House Judiciary Committee Chairman Jerrold Nadler, D-N.Y., on Friday subpoenaed the Justice Department for the full, unredacted version of special counsel Robert Mueller’s report as well as the underlyi… [+1622 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Nick Bosa is following in his family's footsteps","description":"Yahoo Sports' Amanda Borges talks to former Ohio State defensive end Nick Bosa as we count down the final days until the NFL draft.  The likely top three pick, discusses the role his family has played in getting him to this point, his Buckeyes quarterback Dwa…","url":"https://sports.yahoo.com/nick-bosa-following-familys-footsteps-072436091.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/v3noL0LyUuejIMOXZTsACA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-04/2411de70-6274-11e9-bd6f-3e5b0027870f","publishedAt":"2019-04-19T07:24:36Z","content":"Yahoo Sports' Amanda Borges talks to former Ohio State defensive end Nick Bosa as we count down the final days until the NFL draft. The likely top three pick, discusses the role his family has played in getting him to this point, his Buckeyes quarterback Dway… [+66 chars]"},{"source":{"id":null,"name":"Silverandblackpride.com"},"author":"Silver And Black Pride","title":"Silver Mining 4/19: NFL executive would 'love a redo' after major mistake with Raiders, Buccaneers schedule","description":"2019 NFL schedule: Exec would 'love a re-do' for Raiders, Buccaneers The Buccaneers and Raiders both face six-week stretches in which they play on the road four times and lack a true home game. NFL schedule: Raiders, Bucs will go 49 without home games, fans u…","url":"https://www.silverandblackpride.com/2019/4/19/18507507/silver-mining-4-19-nfl-exec-would-love-a-redo-after-major-mistake-with-raiders-buccaneers-schedule","urlToImage":"https://cdn.vox-cdn.com/thumbor/SA2gXJJAuURS8GIW337YOeCLu_A=/0x606:5472x3471/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16177197/830916788.jpg.jpg","publishedAt":"2019-04-19T05:00:00Z","content":"2019 NFL schedule: Exec would 'love a re-do' for Raiders, BuccaneersThe Buccaneers and Raiders both face six-week stretches in which they play on the road four times and lack a true home game.\r\nNFL schedule: Raiders, Bucs will go 49 without home games, fans u… [+3293 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"WGR 550 SportsRadio","title":"CAPACCIO: 2019 Mock Draft No. 2","description":"Let me be upfront and clear about this mock draft. I changed the top pick for the sake of it possibly happening. Even though I still beleieve, as of right now, that the Arizona Cardinals will take Oklahoma QB Kyler Murray first overall, that certainly isn't a…","url":"https://wgr550.radio.com/articles/opinion/capaccio-2019-nfl-mock-draft-no-2","urlToImage":"https://s3.amazonaws.com/s3.wgr550.com/Irv.jpg","publishedAt":"2019-04-19T04:05:39Z","content":"Let me be upfront and clear about this mock draft. I changed the top pick for the sake of it possibly happening. Even though I still believe, as of right now, that the Arizona Cardinals will take Oklahoma quarterback Kyler Murray first overall, that certainly… [+4495 chars]"},{"source":{"id":null,"name":"Freep.com"},"author":"Detroit Free Press","title":"NFL mock draft 4.0: Detroit Lions get the trade down they desire","description":"Dave Birkett, Carlos Monarrez debate takeaways from Bob Quinn's predraft Q&A, guess which player Lions will draft at No. 8. Filmed April 18, 2019. Detroit Lions general manager Bob Quinn's desire to trade down in Round 1 is real, so I thought I'd try and inco…","url":"https://www.freep.com/story/sports/nfl/lions/2019/04/19/nfl-mock-draft-detroit-lions/3516601002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/0718e83113651d4c86a6bf8e49b0e1d5ed22dc11/c=0-412-4776-3098/local/-/media/2019/02/05/USATODAY/usatsports/usatsi_11966306.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T13:27:08Z","content":"Dave Birkett, Carlos Monarrez debate takeaways from Bob Quinn's predraft Q&amp;A, guess which player Lions will draft at No. 8. Filmed April 18, 2019.\r\n Dave Birkett and Carlos Monarrez, Detroit Free Press\r\nDetroit Lions general manager Bob Quinn’s desire to … [+7897 chars]"},{"source":{"id":null,"name":"Silverandblackpride.com"},"author":"Silver And Black Pride","title":"Raiders to play in three NFL 100th Anniversary Games of the Week","description":"The NFL was founded in 1920, which would make this the 100th Anniversary of the NFL. The league is planning a season-long celebration of its success and commitment to not knowing what a catch is, and part of that is the Games of the Week. Each week during the…","url":"https://www.silverandblackpride.com/2019/4/18/18502130/raiders-to-play-in-three-nfl-100th-anniversary-games-of-the-week","urlToImage":"https://cdn.vox-cdn.com/thumbor/yCt55JxuSdOKmqqKuF3jrKT52_E=/0x0:3894x2039/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16173704/usa_today_11125616.jpg","publishedAt":"2019-04-19T00:27:14Z","content":"The NFL was founded in 1920, which would make this the 100th Anniversary of the NFL. The league is planning a season-long celebration of its success and commitment to not knowing what a catch is, and part of that is the Games of the Week.\r\nEach week during th… [+2565 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":"ESPN.com","title":"What will a real (not a mock) Mike Mayock NFL draft look like for the Raiders?","description":"Paul Gutierrez ESPN Staff Writer Close Covered Oakland Raiders for CSNBayArea.com and Sacramento Bee for eight years Member of Pro Football Writers Association Previously worked at Los Angeles Times, Las Vegas Review-Journal and Sports Illustrated Follow on T…","url":"http://www.espn.com/blog/oakland-raiders/post/_/id/22987/what-will-a-real-not-a-mock-mike-mayock-nfl-draft-look-like-for-the-raiders","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1231%2Fr483607_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:00:38Z","content":"ALAMEDA, Calif. -- We already know that Mike Mayock likes “Bubble Butts” and “Dancing Bears” who are “Natural Benders” and “High Motor Guys” with plenty of “Get-Off” that can serve as a “Road Grader” if he’s not already a “Dancing Bear.”\r\nStudying Mayock and … [+7365 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":"ESPN.com","title":"What will a real (not a mock) Mike Mayock NFL draft look like for the Raiders?","description":"Paul Gutierrez ESPN Staff Writer Close Covered Oakland Raiders for CSNBayArea.com and Sacramento Bee for eight years Member of Pro Football Writers Association Previously worked at Los Angeles Times, Las Vegas Review-Journal and Sports Illustrated Follow on T…","url":"http://www.espn.com/blog/nflnation/post/_/id/296173/what-will-a-real-not-a-mock-mike-mayock-nfl-draft-look-like-for-the-raiders","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1231%2Fr483607_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:00:38Z","content":"ALAMEDA, Calif. -- We already know that Mike Mayock likes “Bubble Butts” and “Dancing Bears” who are “Natural Benders” and “High Motor Guys” with plenty of “Get-Off” that can serve as a “Road Grader” if he’s not already a “Dancing Bear.”\r\nStudying Mayock and … [+7365 chars]"},{"source":{"id":null,"name":"Gazettenet.com"},"author":"Daily Hampshire Gazette","title":"Giants have 2 first rounders: expect beef and maybe a QB","description":"EAST RUTHERFORD, N.J. — After trading offensive catalyst Odell Beckham Jr. and sacks leader Olivier Vernon to Cleveland and losing perennial leading tackler Landon Collins to free agency, the New York Giants are rebuilding heading into the NFL draft. The ques…","url":"https://www.gazettenet.com/Giants-have-2-first-rounders-expect-beef-and-maybe-a-QB-24966914","urlToImage":"http://www.gazettenet.com/getattachment/93acba36-9a75-4efe-871e-82e9ef79a7a5/5bed153298a54a0d97b61b3bd5c9f42f.jpg","publishedAt":"2019-04-19T00:28:13Z","content":"EAST RUTHERFORD, N.J. After trading offensive catalyst Odell Beckham Jr. and sacks leader Olivier Vernon to Cleveland and losing perennial leading tackler Landon Collins to free agency, the New York Giants are rebuilding heading into the NFL draft.\r\nThe quest… [+3995 chars]"}]}