{"status":"ok","totalResults":236,"articles":[{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Jung lovers: BTS delve into psychology on their album, Map Of The Soul","description":"The Swiss psychologist's theories of ego, persona and the psyche underpin the band's latest lyrics.","url":"https://www.bbc.co.uk/news/entertainment-arts-47965524","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/13433/production/_106499887_bts_jung_promo_976.jpg","publishedAt":"2019-04-19T00:03:41Z","content":"Image caption\r\n BTS's album, Map Of The Soul: Persona, is heading for number one on both sides of the Atlantic\r\nAlmost 30 years ago, in a classroom in the Jung Institute of Evanston, Illinois, Dr Murray Stein delivered a series of lectures that have had an un… [+7842 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Nicole Einbinder","title":"This Illinois police officer stopped a man with expired plates. Instead of giving him a ticket, he drove him to his job interview.","description":"Illinois officer Roger Gemoules is being praised for helping 22-year-old Ka'Shawn Baldwin make it on time to a job interview, after he pulled him over for allegedly having expired plates on his car. Instead of giving Baldwin a ticket, Gemoules drove him to th…","url":"https://www.thisisinsider.com/illinois-police-officer-drove-man-to-job-interview-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9e61a2730ca057454806c-640-320.jpg","publishedAt":"2019-04-19T15:15:13Z","content":"Ka'Shawn Baldwin, a 22-year-old man from Illinois, desperately needed to get to his job interview. The only problem: the plates on his car were allegedly expired and his driver's license was suspended. \r\n On Wednesday, Baldwin was pulled over in Cahokia, Illi… [+1215 chars]"},{"source":{"id":null,"name":"Greenentrepreneur.com"},"author":"Scott McGovern","title":"Pay Attention to These 6 Cannabis Industry Trends","description":"The weed businesses that thrived four years ago don't necessarily yield big profits today as new cannabis industry trends dictate the market.","url":"https://www.greenentrepreneur.com/article/332348","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190418180609-GettyImages-899527610-crop.jpeg","publishedAt":"2019-04-19T12:00:00Z","content":"April\r\n19, 2019\r\n7 min read\r\nOpinions expressed by Green Entrepreneur contributors are their own.\r\nCannabis industry trends evolve faster than most markets. Not only haven’t regulations been finalized, but methods of consumption, investment and the geography … [+7350 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Karma Allen","title":"Man indicted after pretending to be missing 14-year-old","description":"Brian Michael Rini said he escaped kidnappers who sexually abused him.","url":"https://abcnews.go.com/US/ohio-man-indicted-pretending-missing-14-year-timmothy/story?id=62501122","urlToImage":"https://s.abcnews.com/images/US/brian-michael-rini-ap-jc-190405_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T11:38:44Z","content":"Authorities indicted an Ohio man on fresh charges Thursday for allegedly impersonating Timmothy Pitzen, a boy who vanished in 2011 at the age of 6.\r\nA federal grand jury indicted Brian Michael Rini, 23, on two counts of making false statements and one count o… [+2003 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"The 11 mass deadly school shootings that happened since Columbine","description":"The images of teenagers running from their school with their hands up – as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight.","url":"https://abcnews.go.com/US/11-mass-deadly-school-shootings-happened-columbine/story?id=62494128","urlToImage":"https://s.abcnews.com/images/US/GTY_columbine_jtm_141007_hpMain_5_16x9_992.jpg","publishedAt":"2019-04-19T13:46:35Z","content":"The images of teenagers running from their school with their hands up as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight at subsequent school shootings.\r\nAnd for many, including eventual school shooters, there was so… [+9433 chars]"},{"source":{"id":null,"name":"Autoblog.com"},"author":"Jonathon Ramsey","title":"Rivian opens up about its mid-term plans","description":"Filed under: Green, New York Auto Show, Misc. Automakers, SUV, Truck, Electric, Future, Luxury, Off-Road Six products by 2025, one of them 'not necessarily a vehicle.' Continue reading Rivian opens up about its mid-term plans Rivian opens up about its mid-ter…","url":"https://www.autoblog.com/2019/04/19/rivian-plans-new-electric-vehicles-products/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/800x450+0+0/resize/800x450!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-04/b573c6d0-62bf-11e9-bbe7-f258ad405651","publishedAt":"2019-04-19T17:00:00Z","content":"At the New York Auto Show, Rivian founder R.J. Scaringe was more forthcoming about where the EV automaker startup is headed. By 2025 the pickup truck and SUV maker plans to have six products on offer, and at the moment none of them are sedans. Scaringe told B… [+1888 chars]"},{"source":{"id":null,"name":"Gamasutra.com"},"author":"Staff","title":"Get a job: Insomniac Games, Deep Silver Volition, and more are hiring now!","description":"Here are just some of theÂ many, manyÂ positionsÂ being advertised right now on the Gamasutra Job Board....","url":"http://www.gamasutra.com/view/news/341138/Get_a_job_Insomniac_Games_Deep_Silver_Volition_and_more_are_hiring_now_.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GamasutraFeatureArticles+%28Gamasutra+Feature+Articles%29","urlToImage":"http://www.gamasutra.com/db_area/images/news/2019/Apr/341138/ig307.jpg","publishedAt":"2019-04-19T20:33:00Z","content":"Whether you're just starting out, looking for something new, or just seeing what's out there, the Gamasutra Job Board is the place where game developers move ahead in their careers.\r\nGamasutra's Job Board is the most diverse, most active, and most established… [+2453 chars]"},{"source":{"id":null,"name":"Indiewire.com"},"author":"Chris O'Falt","title":"If Hollywood Takes a Stand for Abortion Rights, the ‘Heartbeat Bill’ Could Cost Millions","description":"Alyssa Milano’s call to boycott Georgia has not found support by studios, which rely on the state's unique and valuable tax incentives.","url":"https://www.indiewire.com/2019/04/georgia-heartbeat-bill-film-tv-boycott-could-cost-hollywood-millions-1202060572/","urlToImage":"https://www.indiewire.com/wp-content/uploads/2019/01/InfinityWar5aa86b6fdaeb5.0.jpg","publishedAt":"2019-04-19T18:16:09Z","content":"Last month, both branches of the Georgia Legislature passed the “Heartbeat Bill,” which would ban abortions after six weeks, or when a doctor can detect a fetus’ heartbeat; it awaits Governor Brian Kemp’s signature before becoming law. Led by actress Alyssa M… [+5310 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Kara Manke","title":"India could meet air quality standards by cutting household fuel use","description":"India could make a major dent in air pollution by curbing emissions from dirty household fuels such as wood, dung, coal and kerosene, shows a new analysis led by researchers at the University of California, Berkeley and the India Institute of Technology.","url":"https://phys.org/news/2019-04-india-air-quality-standards-household.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/11-airpollution.jpg","publishedAt":"2019-04-19T07:38:09Z","content":"India could make a major dent in air pollution by curbing emissions from dirty household fuels such as wood, dung, coal and kerosene, shows a new analysis led by researchers at the University of California, Berkeley and the India Institute of Technology.\r\nEli… [+5457 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"James Risen","title":"William Barr Misled Everyone About the Mueller Report. Now Democrats Are Calling for His Resignation.","description":"Instead of an honest reading of the Mueller report, Trump’s attorney general distorted it. Now, Democrats are calling for his resignation. The post William Barr Misled Everyone About the Mueller Report. Now Democrats Are Calling for His Resignation. appeared …","url":"https://theintercept.com/2019/04/19/william-barr-mueller-report/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/GettyImages-1137873236-barr-1555696311-e1555696393190.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-19T22:39:12Z","content":"Attorney General\r\n William Barr is coming under increasing fire from congressional Democrats for statements he made before the release of the Mueller report. Critics say the remarks purposefully downplayed how damaging special counsel Robert Muellers report w… [+8112 chars]"},{"source":{"id":null,"name":"Webmd.com"},"author":"HealthDay","title":"Heart Patients Pay the Price When Nearby Pharmacy Closes","description":"Nearly 24% of patients whose pharmacies closed failed to refill their statin prescription during 12 months of follow-up, compared with nearly 13%  of those whose pharmacies remained open, the findings showed.","url":"https://www.webmd.com/heart-disease/news/20190419/heart-patients-at-risk-when-local-pharmacy-closes","urlToImage":"https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/slideshows/things_affect_hiv_medication_slideshow/650x350_things_affect_hiv_medication_slideshow.jpg","publishedAt":"2019-04-19T18:07:51Z","content":"FRIDAY, April 19, 2019 (HealthDay News) -- When a neighborhood pharmacy shuts down, it could have dire repercussions for heart patients living nearby, new research suggests.\r\nThat's because such closures could mean patients skip or stop taking the prescriptio… [+2081 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Igor Derysh","title":"Mueller: Russians breached a Florida county's computer system ahead of 2016 election","description":"Former Sen. Bill Nelson's 2018 warning on Russian cyberattacks might not have deserved those \"Pinocchios\"","url":"https://www.salon.com/2019/04/19/mueller-russians-breached-a-florida-countys-computer-system-ahead-of-2016-election/","urlToImage":"https://media.salon.com/2018/11/florida-recount.jpg","publishedAt":"2019-04-19T18:10:45Z","content":"Russia’s military intelligence agency gained access to at least one Florida county government’s computer system in a sweeping cyberattack targeting Florida election officials, special counsel Robert Mueller revealed in his final report.\r\nAccording to Mueller’… [+3655 chars]"},{"source":{"id":"cbc-news","name":"CBC News"},"author":"CBC Radio","title":"This trio of eagles — 1 female and 2 males — are raising a family together","description":"\"The current birds in the nest have all mated together at one point or another, so they're in an actual intimate relationship together and they all share parenting duties,\" says reporter who wrote about the birds for the National Audubon Society conservation …","url":"https://www.cbc.ca/radio/asithappens/as-it-happens-friday-edition-1.5105193/this-trio-of-eagles-1-female-and-2-males-are-raising-a-family-together-1.5103757","urlToImage":"https://i.cbc.ca/1.5104305.1555616577!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/eagles-two-dads-one-mom.jpg","publishedAt":"2019-04-19T17:55:00Z","content":"An unconventional family of bald eagles in Illinois have become an internet sensation.\r\nTwo males and one female are nesting together and raising three eaglets along the Upper Mississippi River near Fulton, Ill., and thousands of people are watching online th… [+4004 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Fiona Tapp, Contributor, Fiona Tapp, Contributor https://www.forbes.com/sites/fionatapp/","title":"These Are The 12 Best Easter Egg Hunts Happening This Weekend","description":"It's not too late to organize a fun Easter weekend away. Check out these Easter egg hunts across the country and beyond.","url":"https://www.forbes.com/sites/fionatapp/2019/04/19/these-are-the-12-best-easter-egg-hunts-happening-this-weekend/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1141777395%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T17:09:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nEaster. Two little girls with a bunny ears and colorful eggs have fun in the meadow\r\nGetty\r\nThe best Easter childhood memories center around chocolate, a big dandy bunny and of course an exciting Easter … [+14406 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Bill Whalen, Contributor, Bill Whalen, Contributor https://www.forbes.com/sites/billwhalen/","title":"Now That Bernie Has Discovered Fox News, Will He Further Explore Red-State America?","description":"Now that he's conquered the beast that is Fox News -- more the holding his own in a town hall event earlier this week -- what's the next move for Bernie Sanders if he wants to learn more about red-state America? Try: dining at Chick-fil-A, attending a \"megach…","url":"https://www.forbes.com/sites/billwhalen/2019/04/18/now-that-bernie-has-discovered-fox-news-will-he-further-explore-red-state-america/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fa0a315e402db4935ae25025ce8fe640f%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T02:22:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nSen. Bernie Sanders did something unusual for a Democratic presidential hopeful: a town hall interview with Fox News anchors Bret Baier and Martha MacCallum. (Photo: Matt Rourke/Associated Press)\r\nIn new… [+12783 chars]"},{"source":{"id":null,"name":"Abc7chicago.com"},"author":null,"title":"Brian Michael Rini indicted, accused of pretending to be missing Illinois boy Timmothy Pitzen - WLS-TV","description":"Brian Michael Rini indicted, accused of pretending to be missing Illinois boy Timmothy Pitzen WLS-TV Man who claimed to be Timmothy Pitzen pleads not guilty to federal charges CNN Timmothy Pitzen case: More charges for man accused of claiming to be missing ch…","url":"https://abc7chicago.com/man-accused-of-pretending-to-be-missing-illinois-boy-indicted-/5258144/","urlToImage":"https://cdn.abcotvs.com/dip/images/5258882_041819-wls-rini-grand-jury-6p-vid.jpg?w=1600","publishedAt":"2019-04-19T00:00:00Z","content":"CINCINNATI, OH -- A federal grand jury on Wednesday indicted an Ohio man who is accused of pretending to be a missing boy from Illinois, federal officials said. RELATED: TIMMOTHY PITZEN CASE: Brian Rini, man accused of claiming to be missing Aurora boy, charg… [+2261 chars]"},{"source":{"id":null,"name":"Abc13.com"},"author":null,"title":"Man indicted after pretending to be missing 14-year-old - KTRK-TV","description":"Man indicted after pretending to be missing 14-year-old KTRK-TV Man who claimed to be Timmothy Pitzen pleads not guilty to federal charges CNN Man accused of impersonating Timmothy Pitzen pleads not guilty WLWT Cincinnati New Charges For Man Accused Of Timmot…","url":"https://abc13.com/man-indicted-after-pretending-to-be-missing-14-year-old/5259820/","urlToImage":"https://s.abcnews.com/images/US/brian-michael-rini-ap-jc-190405_hpMain_16x9_608.jpg?w=1600","publishedAt":"2019-04-19T14:05:09Z","content":"Authorities indicted an Ohio man on fresh charges Thursday for allegedly impersonating Timmothy Pitzen, a boy who vanished in 2011 at the age of 6. A federal grand jury indicted Brian Michael Rini, 23, on two counts of making false statements and one count of… [+2009 chars]"},{"source":{"id":null,"name":"Boston25news.com"},"author":"EndPlay","title":"Boy thrown from Mall of America balcony making 'small steps' toward healing - Boston 25 News","description":"Boy thrown from Mall of America balcony making 'small steps' toward healing Boston 25 News Child who plunged from Mall of America balcony showing \"real signs of recovery\" CBS News Boy, 5, thrown from mall balcony 'showing real signs of recovery' UPI News 5-ye…","url":"https://www.boston25news.com/news/trending-now/boy-thrown-from-mall-of-america-balcony-making-small-steps-toward-healing/941718774","urlToImage":"https://media-ncd.cmgdigital.com/photo/2019/04/19/Boy_Thrown_from_Third_Floor_Balcony_of_M_0_15064503_ver1.0_640_360.jpg","publishedAt":"2019-04-19T18:11:42Z","content":"BLOOMINGTON, Minn. - The family of a 5-year-old boy thrown from a third-floor balcony at the Mall of America last week says he is making “small steps” as he recovers from his devastating injuries.\r\nLanden Hoffman was shopping with his mother and friends aroun… [+9113 chars]"},{"source":{"id":null,"name":"Dailyherald.com"},"author":"Madhu Krishnamurthy","title":"Police focus investigation on missing Crystal Lake boy's house - Chicago Daily Herald","description":"Police focus investigation on missing Crystal Lake boy's house Chicago Daily Herald Police: ‘No indication’ missing Crystal Lake boy was abducted WGN TV Chicago Armed with warrant, cops raid home of missing Crystal Lake boy. Parents make plea for his return. …","url":"https://www.dailyherald.com/news/20190419/police-focus-investigation-on-missing-crystal-lake-boys-house","urlToImage":"https://www.dailyherald.com/storyimage/DA/20190419/NEWS/190418804/AR/0/AR-190418804.jpg&updated=201904191722&imageversion=Facebook&exactH=630&exactW=1200&exactfit=crop&noborder","publishedAt":"2019-04-19T17:37:30Z","content":"Authorities investigating the disappearance of a 5-year-old boy from Crystal Lake said Friday there is no indication he was abducted or even left his house.\r\nThe search for Andrew \"AJ\" Freund has slowed with no signs of police activity Friday morning in the n… [+3670 chars]"},{"source":{"id":null,"name":"Propublica.org"},"author":"by Logan Jaffe","title":"Zero Tolerance: Inside the Secretive Network of Immigrant Youth Shelters in Illinois","description":"by Logan Jaffe This week, ProPublica’s reporting on the Trump administration’s zero-tolerance policy was named a finalist for the Pulitzer Prize for public service journalism (and ProPublica reporter Hannah Dreier won a Pulitzer for her amazing feature report…","url":"https://www.propublica.org/article/zero-tolerance-illinois-immigrant-youth-shelters-reporting-propublica-illinois","urlToImage":"https://assets.propublica.org/images/articles/20180905-chicago-shelters-children1-1200x630.jpg","publishedAt":"2019-04-19T09:00:00Z","content":"This week, ProPublicas reporting on the Trump administrations zero-tolerance policy was named a finalist for the Pulitzer Prize for public service journalism (and ProPublica reporter Hannah Dreier won a Pulitzer for her amazing feature reporting on MS-13).\r\nW… [+5846 chars]"},{"source":{"id":null,"name":"Wpsdlocal6.com"},"author":null,"title":"Orange is the New Green: Local inmates learn about farming, business - WPSD Local 6","description":"Orange is the New Green: Local inmates learn about farming, business WPSD Local 6 VIENNA, IL — It's teaching farming skills, business skills and even life skills. A program at Vienna Correctional Center is preparing inmates for life after prison...","url":"https://www.wpsdlocal6.com/2019/04/18/orange-is-the-new-green-local-inmates-learn-about-farming-business/","urlToImage":"https://images.wpsdlocal6.com/wp-content/uploads/2019/04/orange-is-the-new-green-1.jpg","publishedAt":"2019-04-19T04:06:23Z","content":"VIENNA, IL — It’s teaching farming skills, business skills and even life skills. A program at Vienna Correctional Center is preparing inmates for life after prison while benefiting the community.\r\nThe program, called Orange is the New Green is open to inmates… [+3948 chars]"},{"source":{"id":null,"name":"Telegraphherald.com"},"author":"TH wire services","title":"Business news in brief | Business - telegraphherald.com","description":"Business news in brief | Business telegraphherald.com NEW YORK — The National Enquirer is being sold to the former head of the airport newsstand company Hudson News following a rocky year in which the...","url":"http://www.telegraphherald.com/news/business/article_921fe24a-660e-5b9c-9be9-2aed9e3d6fe1.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/telegraphherald.com/content/tncms/custom/image/646a89a2-fd9d-11e5-9db5-4b01910bfaa0.jpg","publishedAt":"2019-04-19T05:30:00Z","content":"National Enquirer will have new owner\r\nNEW YORK The National Enquirer is being sold to the former head of the airport newsstand company Hudson News following a rocky year in which the tabloid was accused of burying stories that could have hurt Donald Trumps 2… [+2665 chars]"},{"source":{"id":null,"name":"Bakemag.com"},"author":"John Unrein","title":"Growing your Hispanic bakery business | 2019-04-19 - bake Magazine","description":"Growing your Hispanic bakery business | 2019-04-19 bake Magazine Alfredo Sanchez, owner of Azteca Bakery, says that bakery sales continue to grow in step with the rising popularity of authentic breads and indulgent cakes,...","url":"https://www.bakemag.com/articles/12000-growing-your-hispanic-bakery-business","urlToImage":"https://www.bakemag.com/ext/resources/images/2019/4/PanaderiaBakery.jpg?height=635&t=1555680553&width=1200","publishedAt":"2019-04-19T13:39:17Z","content":"Alfredo Sanchez, owner of Azteca Bakery, says that bakery sales continue to grow in step with the rising popularity of authentic breads and indulgent cakes, particularly among both Hispanic and non-Hispanic customers who are seeking out new flavors.\r\nOne of 1… [+8310 chars]"},{"source":{"id":null,"name":"Snopes.com"},"author":"Bethania Palma","title":"Were Razor Blades Found in Gas-Pump Handles in Michigan?","description":"Hoaxes and reality sometimes overlap.","url":"https://www.snopes.com/fact-check/razor-blades-gas-pump-michigan/","urlToImage":"https://www.snopes.com/tachyon/2018/06/gas_pump.jpg?fit=1200,628","publishedAt":"2019-04-19T22:04:41Z","content":"On 16 April 2019, local news stations in Coloma Township, Michigan, began reporting that razor blades had been found in the handles of gas pumps there.\r\nHistorically we have found an overlap between real reports of sharp objects placed in mundane items, like … [+1591 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 of 14 Big Ten teams coming out of spring planning to continue quarterback auditions in preseason practices","url":"https://www.foxsports.com/college-football/story/7-big-ten-teams-will-extend-qb-competitions-into-preseason-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/c38cfc6b693c4045af601df963be3e3d.vresize.1200.630.high.90.jpg","publishedAt":"2019-04-19T15:16:09Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4876 chars]"},{"source":{"id":null,"name":"Startlandnews.com"},"author":null,"title":"Most-funded tech startups: $100M-plus investment puts PayIt on the map with C2FO - Startland News","description":"Most-funded tech startups: $100M-plus investment puts PayIt on the map with C2FO Startland News Midwest companies are making major plays for investment dollars, according to CB Insights, with KC's PayIt and C2FO earning spots on the latest map of the...","url":"https://www.startlandnews.com/2019/04/kansas-city-startup-funding-payit-c2fo/","urlToImage":"https://www.startlandnews.com/app/uploads/2019/04/Funded_Tech_Startups_Main.png","publishedAt":"2019-04-19T20:06:00Z","content":"Companies in the Midwest and South are making major plays for investment dollars, according to CB Insights, with Kansas Citys PayIt and C2FO earning spots on the latest map of the nations most well-funded tech startups.\r\nThe tech boom has diffused beyond the … [+2176 chars]"},{"source":{"id":null,"name":"Dailypress.com"},"author":"Daily Press","title":"Thursday's regional sports roundup and results: Hokies upend No. 11 Georgia Tech in baseball - Daily Press","description":"Thursday's regional sports roundup and results: Hokies upend No. 11 Georgia Tech in baseball Daily Press Tanner Thomas' two-run home run in the sixth inning lifted Virginia Tech (22-16, 7-12) to a 3-2 victory over No. 11 Georgia Tech in an Atlantic Coast Conf…","url":"https://www.dailypress.com/sports/dp-spt-virginia-sports-roundup-20190419-story.html","urlToImage":"https://www.trbimg.com/img-544e4b85/turbine/dp-daily-press-default-fb-icon","publishedAt":"2019-04-19T04:20:00Z","content":"Tanner Thomas' two-run home run in the sixth inning lifted Virginia Tech (22-16, 7-12) to a 3-2 victory over No. 11 Georgia Tech in an Atlantic Coast Conference baseball series opener Thursday in Blacksburg.\r\nThe Hokies' bullpen, which tossed a combined 4 2/3… [+7389 chars]"},{"source":{"id":null,"name":"A16z.com"},"author":"frank","title":"Five Open Problems for the Blockchain Computer","description":"Do you sometimes wish you had been born in a different decade so you could have worked on the fundamental building blocks of modern computing? How fun, challenging, and fulfilling would it have been to work on semiconductors in the …","url":"https://a16z.com/2019/04/19/five-open-problems-blockchain-computer/","urlToImage":"http://img.youtube.com/vi/13QLbaxWXmA/0.jpg","publishedAt":"2019-04-19T12:00:50Z","content":"Do you sometimes wish you had been born in a different decade so you could have worked on the fundamental building blocks of modern computing? How fun, challenging, and fulfilling would it have been to work on semiconductors in the 1950s or Unix in the 1960s … [+1502 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Dave Heller                                    \n                        @dave_heller                     \n                                                    \n                            FOX Sports Wisconsin","title":"Former Badgers DT Sagapolu aims to show off athleticism in NFL","description":"Former Wisconsin Badgers defensive lineman Olive Sagapolu hopes to be selected in the 2019 NFL Draft.","url":"https://www.foxsports.com/wisconsin/story/wisconsin-badgers-olive-sagapolu-athleticism-2019-nfl-draft-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/pi-fsw-badgers-olive-sagapolu-041719.vresize.1200.630.high.55.jpg","publishedAt":"2019-04-19T17:00:09Z","content":"Olive Sagapolu knew something was wrong right when it happened. It was the severity, though, which surprised him.\r\nPlaying against Northwestern last October, the Wisconsin Badgers defensive tackle injured his shoulder. “As soon as it happened it felt pretty u… [+3844 chars]"},{"source":{"id":null,"name":"Americanthinker.com"},"author":null,"title":"Why Do Most People in This Country Work, while Others Never Will?","description":"A tourist checks out Chicago.","url":"https://www.americanthinker.com/articles/2019/04/why_do_most_people_in_this_country_work_while_others_never_will.html","urlToImage":"https://www.americanthinker.com/images/bucket/2019-04/213216.jpg","publishedAt":"2019-04-19T05:00:00Z","content":"Visiting the areas around The Loop, the Magnificent Mile, and the neighborhoods located directly north of Downtown, we were impressed by the large numbers of young professional people that have made Chicago their home. For these selected few young educated el… [+13840 chars]"},{"source":{"id":null,"name":"Upenn.edu"},"author":"Knowledge@Wharton","title":"Want to Build a Smart City? Here Are Some Strategies That Work","description":"Collaborative platforms, sustainability, public-private partnerships and data analytics are critical for developing smart and inclusive cities, notes TCS’s Seeta Hariharan.","url":"https://knowledge.wharton.upenn.edu/article/want-to-build-a-smart-city-here-are-some-strategies-that-work/","urlToImage":"https://knowledge.wharton.upenn.edu/wp-content/uploads/2018/02/Smart-City-Pioneers.jpg","publishedAt":"2019-04-19T19:11:35Z","content":"The global smart-city movement, which has been around for more than two decades, has gone through three phases of evolution. It initially focused on technology-led solutions to challenges. Then came a citizen-centric, collaborative approach in the second phas… [+25251 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 38k-Mile 1999 Mercedes-Benz S320 at No Reserve","description":"This 1999 Mercedes-Benz S320 shows just 38k miles and is finished in Smoke Silver Metallic over Parchment leather. Power comes from a 3.2L inline-six paired with a 5-speed automatic transmission. The car was recently acquired by the seller, and subsequent ser…","url":"https://bringatrailer.com/listing/1999-mercedes-benz-s-320-2/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/1999_mercedes-benz_s_320_15556205747401f0611b9IMG_3356.jpg","publishedAt":"2019-04-19T03:40:14Z","content":"This 1999 Mercedes-Benz S320 shows just 38k miles and is finished in Smoke Silver Metallic over Parchment leather. Power comes from a 3.2L inline-six paired with a 5-speed automatic transmission. The car was recently acquired by the seller, and subsequent ser… [+1825 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1983 Porsche 911SC","description":"This 1983 Porsche 911SC was purchased by the current owner 19 years ago and has been modified for track use and PCA club racing. Power comes from an air-cooled 3.0L flat-six paired with a 5-speed 915 manual transaxle. The car is finished in light bronze metal…","url":"https://bringatrailer.com/listing/1983-porsche-911sc-30/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/03/1983_porsche_911sc_15553481631776980e42aIMG_0540-e1555596020331.jpg","publishedAt":"2019-04-19T18:21:03Z","content":"This 1983 Porsche 911SC was purchased by the current owner 19 years ago and has been modified for track use and PCA club racing. Power comes from an air-cooled 3.0L flat-six paired with a 5-speed 915 manual transaxle. The car is finished in light bronze metal… [+2480 chars]"},{"source":{"id":"the-american-conservative","name":"The American Conservative"},"author":"Patrick J. Buchanan","title":"Bernie Steals the ‘No More Wars’ Issue From Trump","description":"He's condemning the war on Yemen, which could leave Trump standing with the War Party's torch.","url":"https://www.theamericanconservative.com/buchanan/bernie-steals-the-no-more-wars-issue-from-trump/","urlToImage":"https://www.theamericanconservative.com/wp-content/uploads/2019/04/shutterstock_259200638.jpg","publishedAt":"2019-04-19T00:56:44Z","content":"“The president has said that he does not want to see this country involved in endless wars…. I agree with that,” Bernie Sanders told the Fox News audience at Monday’s town hall meeting in Bethlehem, Pennsylvania.\r\nThen, turning and staring straight into the c… [+4935 chars]"},{"source":{"id":null,"name":"Nasaspaceflight.com"},"author":null,"title":"NG-11 Cygnus, SS Roger Chaffee, brings the science to ISS - NASASpaceflight.com","description":"NG-11 Cygnus, SS Roger Chaffee, brings the science to ISS NASASpaceflight.com Cygnus Spacecraft Heads to Space Station With 40 Mice, Satellites ExtremeTech Private cargo ship brings Easter feast to the space station The Associated Press NASA launches 'time-cr…","url":"https://www.nasaspaceflight.com/2019/04/ng-11-cygnus-brings-science-iss/","urlToImage":null,"publishedAt":"2019-04-19T09:26:58Z","content":"Roughly 37 hours after launching from the Mid-Atlantic Regional Spaceport (MARS) in Virginia, Northrop Grummans NG-11 Cygnus spacecraft has arrived at the International Space Station with 7,600 lbs (3,442 kg) of supplies.\r\nGrappled by Station astronauts Anne … [+8513 chars]"},{"source":{"id":null,"name":"Chron.com"},"author":"Houston Chronicle","title":"Texans GM Brian Gaine expects Matt Kalil to compete with Julién Davenport for starting LT job","description":"Caption Close Although it remains unclear if the Texans will land their left tackle of the future in the draft next week, their current offensive line configuration leads to one thing: Competition. Texans general manager Brian Gaine anticipates former Pro Bow…","url":"https://www.chron.com/sports/texans/article/Texans-GM-Brian-Gaine-expects-Matt-Kalil-to-13779735.php","urlToImage":"https://s.hdnux.com/photos/01/01/63/73/17252075/3/rawImage.jpg","publishedAt":"2019-04-19T03:54:33Z","content":"PHOTOS: Texans' 2019 schedule\r\nMatt Kalil #75 of the Carolina Panthers drops back to pass block during a game against the Chicago Bears at Soldier Field on October 22, 2017 in Chicago, Illinois. The Bears defeated the Panthers 17-3. (Photo by Wesley Hitt/Gett… [+2337 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"NOT REAL NEWS: A look at what didn't happen this week","description":"A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these is legit, even though they were shared widely on social media. The Associated Press checked these out. Here are the real facts:","url":"https://news.yahoo.com/not-real-news-look-didnt-happen-week-191728628.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/CJLoQxDAT5_h_t33YxvG8A--~B/aD0zNTU4O3c9NTAyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/8fdcfcef9404459d88392ac406bb1390.jpg","publishedAt":"2019-04-19T20:11:30Z","content":"A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these is legit, even though they were shared widely on social media. The Associated Press checked these out. Here are the real facts:\r\n__\r\nCLAIM: Man who thre… [+5009 chars]"},{"source":{"id":null,"name":"Motorauthority.com"},"author":"feedback@highgearmedia.com (Viknesh Vijayenthiran), Viknesh Vijayenthiran","title":"2020 BMW M3, Qiantu K50, Rivian future plans: Car News Headlines","description":"BMW introduced a redesigned 3-Series last year. That means a new M3 should be just around the corner. Our latest spy shots show a tester for the upcoming sport sedan, which rumor has it will come with available all-wheel drive and close to 500 horsepower. Chi…","url":"https://www.motorauthority.com/news/1121381_2020-bmw-m3-qiantu-k50-rivian-future-plans-car-news-headlines","urlToImage":"https://images.hgmsites.net/hug/2020-bmw-m3-spy-shots--image-via-s-baldauf-sb-medien_100699454_h.jpg","publishedAt":"2019-04-19T15:00:00Z","content":"BMW introduced a redesigned 3-Series last year. That means a new M3 should be just around the corner. Our latest spy shots show a tester for the upcoming sport sedan, which rumor has it will come with available all-wheel drive and close to 500 horsepower.\r\nCh… [+1086 chars]"},{"source":{"id":null,"name":"Motorauthority.com"},"author":"feedback@highgearmedia.com (Viknesh Vijayenthiran), Viknesh Vijayenthiran","title":"US EV startup Rivian plans 6 models by 2025","description":"Rivian presented concepts for an electric pickup truck and related SUV last November at the 2018 Los Angeles Auto Show, but the EV startup plans to follow them up with even more models, and quickly. In an interview with Bloomberg published Wednesday, Rivian C…","url":"https://www.motorauthority.com/news/1122700_us-ev-startup-rivian-plans-6-models-by-2025","urlToImage":"https://images.hgmsites.net/hug/rivian-r1t_100699476_h.jpg","publishedAt":"2019-04-19T14:00:00Z","content":"Rivian presented concepts for an electric pickup truck and related SUV last November at the 2018 Los Angeles Auto Show, but the EV startup plans to follow them up with even more models, and quickly.\r\nIn an interview with Bloomberg published Wednesday, Rivian … [+1802 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Pam Fessler","title":"Mueller Report Raises New Questions About Russia's Hacking Targets In 2016","description":"The special counsel's report said the FBI believes Russian military intelligence was able to gain access to at least one Florida county government's computer network during the 2016 campaign.","url":"https://www.npr.org/2019/04/19/714890832/mueller-report-raises-new-questions-about-russias-hacking-targets-in-2016","urlToImage":"https://media.npr.org/assets/img/2019/04/18/gettyimages-621758822_wide-c0f4957d35d11bbb7349ac16a7c6fc7ace3c78ec.jpg?s=1400","publishedAt":"2019-04-19T09:00:55Z","content":"Voters casting ballots at voting machines at a high school in North Las Vegas on Election Day, Nov. 8, 2016. The newly-released Mueller report detailed more about Russia's efforts to hack election-related systems.\r\nEthan Miller/Getty Images\r\nWhile the headlin… [+6138 chars]"},{"source":{"id":null,"name":"Spacewar.com"},"author":null,"title":"GenDyn awarded $125M for MK80, BLU-109 bomb components","description":"Washington (UPI) Apr 18, 2019 General Dynamics has received a $125 million contract for MK80 general purpose and BLU-109 Tritonal bomb components, including for Iraq, Bahrain and Singapore. The contract is for domestic and foreign military sales, the Defense …","url":"http://www.spacewar.com/reports/GenDyn_awarded_125M_for_MK80_BLU-109_bomb_components_999.html","urlToImage":"http://www.spxdaily.com/images-bg/general-dynamics-logo-600-bg.jpg","publishedAt":"2019-04-19T09:08:12Z","content":"General Dynamics has received a $125 million contract for MK80 general purpose and BLU-109 Tritonal bomb components, including for Iraq, Bahrain and Singapore.\r\nThe contract is for domestic and foreign military sales, the Defense Department announced Wednesda… [+2587 chars]"},{"source":{"id":null,"name":"Sciencedaily.com"},"author":null,"title":"People with heart disease at risk when pharmacies close","description":"New research shows that when pharmacies close, people stop taking widely used heart medications -- like statins, beta-blockers and oral anticoagulants -- that have known cardiovascular and survival benefits.","url":"https://www.sciencedaily.com/releases/2019/04/190419112324.htm","urlToImage":null,"publishedAt":"2019-04-19T15:23:24Z","content":"New research from the University of Illinois at Chicago shows that when pharmacies close, people stop taking widely used heart medications -- like statins, beta-blockers and oral anticoagulants -- that have known cardiovascular and survival benefits.The resea… [+4126 chars]"},{"source":{"id":null,"name":"Rawstory.com"},"author":"Bob Brigham","title":"Illinois state worker quits $77,000 a year job after he is busted for racist emails about the Obamas: report","description":"The Illinois Office of Executive Inspector General revealed on Friday that a state worker quit his job after being confronted with sexist and racist emails he had sent, the Chicago Tribune reported. Donald R. Johnson, 76, “immediately expressed his desire to …","url":"https://www.rawstory.com/2019/04/illinois-state-worker-quits-77000-year-job-busted-racist-emails-obamas-report/","urlToImage":"https://www.rawstory.com/wp-content/uploads/2016/01/President-Barack-Obama-L-and-first-lady-Michelle-800x430.jpg","publishedAt":"2019-04-19T23:38:12Z","content":"The Illinois Office of Executive Inspector General revealed on Friday that a state worker quit his job after being confronted with sexist and racist emails he had sent, the Chicago Tribunereported.\r\n# p #1_8 # ad skipped = NULL #\r\nDonald R. Johnson, 76, “imme… [+1848 chars]"},{"source":{"id":null,"name":"Starwars.com"},"author":"Kelly Knox","title":"Fans Were Out in Full Force at Star Wars Celebration Chicago","description":"Meet some fellow Star Wars fans and hear their Celebration stories!","url":"https://www.starwars.com/news/fans-were-out-in-full-force-at-star-wars-celebration-chicago","urlToImage":"https://starwarsblog.starwars.com/wp-content/uploads/2019/04/swcc-fans-tall.jpg","publishedAt":"2019-04-19T12:50:59Z","content":"Fans came to Star Wars Celebration Chicago from all over the world. Some live just a couple of hours away in a town in Illinois, some made the trek from the east and west coasts of the United States, and some even settled in for hours on a plane from places a… [+5207 chars]"},{"source":{"id":null,"name":"Dailycaller.com"},"author":"Virginia Kruta","title":"Kim Foxx Officials Flee Office After Decision To Drop Charges Against Jussie Smollett","description":"Two officials have resigned from their positions in the office of State's Attorney Kim Foxx in the wake of her decision to drop charges against Jussie Smollett.","url":"https://dailycaller.com/2019/04/19/people-flee-kim-foxx-office-smollett/","urlToImage":"https://cdn01.dailycaller.com/wp-content/uploads/2019/04/kim-foxx-e1555684206933.png","publishedAt":"2019-04-19T14:44:23Z","content":"Two officials have resigned from their positions in the office of Cook County, Illinois, State’s Attorney Kim Foxx in the wake of her decision to drop charges against disgraced “Empire” actor Jussie Smollett.\r\nApril Perry, Foxx’s chief ethics officer, and Con… [+1133 chars]"},{"source":{"id":null,"name":"Kwqc.com"},"author":"KWQC","title":"Police searching for missing 5-year-old boy in Illinois - KWQC-TV6","description":"Police searching for missing 5-year-old boy in Illinois KWQC-TV6 Police raid home of missing Crystal Lake boy as parents make plea for his return, brother placed in DCFS custody Chicago Tribune FBI, Crystal Lake police search for missing 5-year-old boy WGN TV…","url":"https://www.kwqc.com/content/news/Police-searching-for-missing-5-year-old-boy-in-Illinois-508808581.html","urlToImage":"https://media.graytvinc.com/images/559*315/missingboyincrystalake.JPG","publishedAt":"2019-04-19T16:43:09Z","content":"CRYSTAL LAKE, Ill. (CNN) - A 5-year-old boy in Illinois has vanished. The missing boy, Andrew Freund, is also called A.J. \r\nHis parents say they last saw him Wednesday when he went to bed at the family home in Crystal Lake. \r\nPolice say he was reported missin… [+330 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Neil Genzlinger","title":"Gene Wolfe, acclaimed science fiction writer, dies at 87","description":"Mr. Wolfe’s works, full of inventive language, mysteries and subtly conveyed themes, are considered to be among the genre’s finest.","url":"https://www.bostonglobe.com/metro/obituaries/2019/04/19/gene-wolfe-acclaimed-science-fiction-writer-dies/wJlFTsvm7b47UqVt4hpV5H/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-19T22:54:54Z","content":"Gene Wolfe, a prolific science fiction and fantasy writer whose best works, full of inventive language, mysteries and subtly conveyed themes, are considered to be among the genre’s finest, died Sunday in Peoria, Illinois. He was 87.\r\nHis daughter Therese Goul… [+5972 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":null,"title":"The Ticket: What’s happening in the local arts world","description":"This week’s picks from Globe critics.","url":"https://www.bostonglobe.com/arts/2019/04/18/the-ticket-what-happening-local-arts-world/O05wfIZCl2TOkdKLHt4r9N/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/18/BostonGlobe.com/ReceivedContent/Images/GettyImages-1127490617.jpg","publishedAt":"2019-04-19T00:24:20Z","content":"MUSIC\r\nPop &amp; Rock\r\nBIG BOI OutKast’s brawnier half heads up this showcase for the legendary Atlanta hip-hop collective The Dungeon Family, which includes the smoothed-out singer-producer Sleepy Brown and Cee Lo Green’s hip-hop band Goodie Mob. April 25, 7… [+14168 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"WellNow Urgent Care Opens First Facility in Cook County","description":"CRESTWOOD, Ill.--(BUSINESS WIRE)--lt;a href=&quot;https://twitter.com/hashtag/GetWellNow?src=hash&quot; target=&quot;_blank&quot;gt;#GetWellNowlt;/agt;--WellNow Urgent Care – one of New York State's fastest-growing urgent care providers – has opened its first…","url":"https://www.businesswire.com/news/home/20190419005015/en/WellNow-Urgent-Care-Opens-Facility-Cook-County","urlToImage":"https://mms.businesswire.com/media/20190419005015/en/717127/23/WellNow_Crestwood_Opening_.jpg","publishedAt":"2019-04-19T10:41:53Z","content":"CRESTWOOD, Ill.--(BUSINESS WIRE)--Today, WellNow \r\n Urgent CareSM one of New York States \r\n fastest-growing urgent care providers opened its first facility in the \r\n state of Illinois. Located in Crestwood at 13448 S. Cicero Avenue, \r\n Crestwood, IL 60445, it… [+3083 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"From The State Capitols: Conn. Lawmakers Fret Over Price Tag For Covering Undocumented Children; Washington’s Long-Term Care Benefits Measure Gains Momentum","description":"News from state legislatures comes out of Connecticut, Washington, Arizona, Maryland, California and Florida.","url":"https://khn.org/morning-breakout/from-the-state-capitols-conn-lawmakers-fret-over-price-tag-for-covering-undocumented-children-washingtons-long-term-care-benefits-measure-gains-momentum/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-19T12:44:41Z","content":"News from state legislatures comes out of Connecticut, Washington, Arizona, Maryland, California and Florida. \r\nThe CT Mirror:\r\nLawmakers: $53 Million Price Tag On Health Coverage For Undocumented Children Too HighDespite early enthusiasm and a brawny push fr… [+3750 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"First Edition: April 19, 2019","description":"Today's early morning highlights from the major news organizations.","url":"https://khn.org/morning-breakout/first-edition-april-19-2019/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-19T10:25:59Z","content":"Today's early morning highlights from the major news organizations.\r\nKaiser Health News:\r\nLiver Illness Strikes Latino Children Like A Silent TsunamiSaira Diaz uses her fingers to count the establishments selling fast food and sweets near the South Los Angele… [+15886 chars]"},{"source":{"id":null,"name":"Insidehighered.com"},"author":"Doug Lederman","title":"New presidents or provosts: Beaver Bloomfield Bucknell Clarke Goldey-Beacom John Carroll Modesto Norfolk Paterson St. Francis Southwestern","description":"Javaune Adams-Gaston, senior vice president for student life at Ohio State University, has been chosen as president of Norfolk State University, in Virginia. Thom D. Chesney, president of Brookhaven College, part of the Dallas County Community College Distric…","url":"http://www.insidehighered.com/news/2019/04/19/new-presidents-or-provosts-beaver-bloomfield-bucknell-clarke-goldey-beacom-john","urlToImage":"https://www.insidehighered.com/sites/all/themes/ihecustom/images/facebook_icon_large.jpg","publishedAt":"2019-04-19T07:00:00Z","content":"{* #emailNewsletterEnrollmentForm *}\r\n{* signInEmailAddress *}\r\nNewsletters\r\n{* optInDailyNewsUpdate *}\r\nNews, opinion and jobs in higher education - delivered each weekday. View a sample &gt;&gt;\r\n{* optInWeeklyNewsUpdate *}\r\nYour need-to-know digest of the … [+7716 chars]"},{"source":{"id":null,"name":"Plos.org"},"author":"Josefine Starnberg, Mikael Norman, Björn Westrup, Magnus Domellöf, Staffan K. Berglund","title":"Cardiometabolic risk factors in children born with marginally low birth weight: A longitudinal cohort study up to 7 years-of-age","description":"Introduction Low birth weight (LBW, <2500 g) may predict an increased risk of an adverse cardiometabolic profile later in life, but long-term effects in different populations and birth weight strata are still unclear. We explored laboratory markers of cardiom…","url":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0215866","urlToImage":"https://journals.plos.org/plosone/article/figure/image?id=10.1371/journal.pone.0215866.g002&size=inline","publishedAt":"2019-04-19T17:56:38Z","content":"Abstract\r\nIntroduction\r\nLow birth weight (LBW, &lt;2500 g) may predict an increased risk of an adverse cardiometabolic profile later in life, but long-term effects in different populations and birth weight strata are still unclear. We explored laboratory mark… [+33598 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"2019 NFL Draft: Plan B options for teams that miss on marquee prospects like Quinnen Williams or Nick Bosa","description":"If teams can't land some of the elite prospects in the first round, here are some logical replacements","url":"https://www.cbssports.com/nfl/draft/news/2019-nfl-draft-plan-b-options-for-teams-that-miss-on-marquee-prospects-like-quinnen-williams-or-nick-bosa/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/20/aee60fa7-8c04-4247-b006-12b5eff4587a/thumbnail/770x433/e0a94b39fac9da6dc9bcba07bd1f86ce/david-long-michigan.jpg","publishedAt":"2019-04-19T20:57:01Z","content":"Ed Oliver, Nick Bosa, Quinnen Williams, Devin White, and D.K. Metcalf are among the premier, first-round talents in the 2019 NFL Draft, but what should a team do if it misses out on them?\r\nOn the second day, look for a comparable \"Plan B,\" a lesser but simila… [+6913 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"NFL Draft 2019 superlatives: The immediate force, the breakout late-round receiver and more prospect awards","description":"Who'll live up to the hype like Quenton Nelson? Which late-round receiver could be the next Antonio Brown?","url":"https://www.cbssports.com/nfl/draft/news/nfl-draft-2019-superlatives-the-immediate-force-the-breakout-late-round-receiver-and-more-prospect-awards/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/11/02/bcb8e5ff-398b-459b-aa68-8935b9217282/thumbnail/770x433/19911d287d47e93aca8ebdc5b052b5c9/quinnen.jpg","publishedAt":"2019-04-19T21:11:38Z","content":"Yes, you totally should've won \"most likely to succeed.\" The best part of our high school yearbooks -- superlatives.\r\nWith that in mind, it's time to hand out some superlatives for the 2019 NFL Draft class.\r\nAs for the actual draft, you'll be able to stream o… [+13191 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"R.J. White","title":"Seven-round 2019 NFL Mock Draft: 34 trades and full breakdowns for all 32 teams, all the picks","description":"What might your team do in every round of the 2019 NFL Draft? Here's a look","url":"https://www.cbssports.com/nfl/draft/news/seven-round-2019-nfl-mock-draft-34-trades-and-full-breakdowns-for-all-32-teams-all-the-picks/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2017/04/28/7fea5bb6-1fb8-4222-8765-90baf91fe781/thumbnail/770x433/c87b5ba8d3d54f8bd0b11fe81b7bad7e/rogergoodell.jpg","publishedAt":"2019-04-19T21:24:32Z","content":"Seven-round mock drafts? You've seen them. Seven-round mock drafts broken down by team? You may have even seen those. But have you seen a seven-round mock draft broken down by team that includes trades?  \r\nRight here, that's what you're getting. I've taken th… [+71170 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Smart antioxidant-containing polymer responds to body chemistry, environment","description":"Oxidants found within living organisms are byproducts of metabolism and are essential to wound-healing and immunity. However, when their concentrations become too high, inflammation and tissue damage can occur. University of Illinois engineers have developed …","url":"http://feedproxy.google.com/~r/NoticiasDeLaCienciaYLaTecnologia/~3/1K8OrEAId2c/smart-antioxidant-containing-polymer-responds-to-body-chemistry-environment","urlToImage":null,"publishedAt":"2019-04-19T07:00:47Z","content":null},{"source":{"id":null,"name":"Reason.com"},"author":"John Ross","title":"Short Circuit: A Roundup of Recent Federal Court Decisions","description":"Please enjoy the latest edition of Short Circuit, a weekly feature from the Institute for Justice. Last month, federal auditors revealed...","url":"https://reason.com/2019/04/19/short-circuit-a-roundup-of-recent-federal-court-decisions/","urlToImage":null,"publishedAt":"2019-04-19T18:43:56Z","content":"Please enjoy the latest edition of Short Circuit, a weekly feature from the Institute for Justice.\r\nLast month, federal auditors revealed the DEA had secretly spied on Americans who bought money counters. With a reach so expansive it alarmed even the FBI, thi… [+6654 chars]"},{"source":{"id":null,"name":"Channelnewsasia.com"},"author":"CNA","title":"Sears sues Lampert, claiming he looted assets and drove it into bankruptcy","description":"Sears Holdings Corp sued longtime Chairman Eddie Lampert, his hedge fund ESL Investments, and former directors including Treasury Secretary Steven Mnuchin, accusing them of allowing the retailer to be looted of billions of dollars before its October 2018 bank…","url":"https://www.channelnewsasia.com/news/business/sears-sues-lampert--claiming-he-looted-assets-and-drove-it-into-bankruptcy-11460174","urlToImage":"https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/11460172/16x9/991/557/e6094f0be2fb15e0de1c14e3217af281/YJ/a-dismantled-sign-sits-leaning-outside-a-sears-department-store-in-nanuet-1.jpg","publishedAt":"2019-04-19T04:14:19Z","content":"NEW YORK: Sears Holdings Corp sued longtime former Chairman Eddie Lampert, his hedge fund ESL Investments and others like Treasury Secretary Steven Mnuchin, claiming they illegally siphoned billions of dollars of assets from the retailer before it went bankru… [+4181 chars]"},{"source":{"id":null,"name":"Chicagoreader.com"},"author":"Emily McTavish","title":"Mahjong is experiencing a renaissance downtown","description":"It’s like Crazy Rich Asians except way less intense. The climax of last summer's hit movie Crazy Rich Asians featured a tense exchange between two characters over a round of the Chinese tile game of mahjong. Mahjong games here in Chicago, though—at least thos…","url":"https://www.chicagoreader.com/chicago/mahjong-meetup-debbie-turner/Content?oid=69667668","urlToImage":"https://media1.fdncms.com/chicago/imager/u/slideshow/69690164/teaser.jpg","publishedAt":"2019-04-19T19:38:00Z","content":"The climax of last summer's hit movie Crazy Rich Asians featured a tense exchange between two characters over a round of the Chinese tile game of mahjong. Mahjong games here in Chicago, thoughat least those organized by Debbie Turnerare more congenial and les… [+4224 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter 7-round mock draft: Round 3 - NFL.com","description":"Chad Reuter 7-round mock draft: Round 3 NFL.com Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Yahoo Sports' top 2019 NFL draft prospects, No. 9: Michigan LB Devin Bush Jr. Yahoo Sports Devin Bus…","url":"http://www.nfl.com/news/story/0ap3000001027105/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-3","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/04/11/0ap3000001026129_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+6980 chars]"},{"source":{"id":null,"name":"Inspirationfeed.com"},"author":"Igor Ovsyannykov","title":"50 Inspirational Oprah Winfrey Quotes on Success, Life, and Relationships","description":"You may not have noticed this but we have become accustomed to a culture where every minute or so, someone pops out of nowhere and becomes a hit, a sensation. And although they become successful in their stint, most, if not all, don’t really last long. For th…","url":"https://inspirationfeed.com/oprah-winfrey-quotes/","urlToImage":null,"publishedAt":"2019-04-19T03:58:57Z","content":"You may not have noticed this but we have become accustomed to a culture where every minute or so, someone pops out of nowhere and becomes a hit, a sensation. And although they become successful in their stint, most, if not all, dont really last long.\r\nFor th… [+10402 chars]"},{"source":{"id":null,"name":"Thestripe.com"},"author":"grace at the stripe","title":"A Day in Her Life: Molly Farrell.","description":"Today’s Day in Her Life feature is incredibly inspiring. After suffering a spinal cord injury 17 years ago, Molly Farrell was paralyzed from the neck down. Doctors gave her a less than 1% chance of walking. But here she is today, walking! Molly has dedicated …","url":"https://thestripe.com/a-day-in-her-life-molly-farrell/","urlToImage":"https://thestripe.com/wp-content/uploads/2019/04/molly-social.jpg","publishedAt":"2019-04-19T10:00:17Z","content":"Today’s Day in Her Life feature is incredibly inspiring. After suffering a spinal cord injury 17 years ago, Molly Farrell was paralyzed from the neck down. Doctors gave her a less than 1% chance of walking. But here she is today, walking! Molly has dedicated … [+8805 chars]"},{"source":{"id":"cnbc","name":"CNBC"},"author":"Mike Memoli","title":"Joe Biden set to announce presidential run next week","description":"Discussions about the exact timing of the former VP's entry in the crowded field is ongoing and subject to change, advisers told NBC.","url":"https://www.cnbc.com/2019/04/19/biden-set-to-announce-presidential-run-next-week.html","urlToImage":"https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/12/105788779-1552398562987ap_19059839365014.1910x1000.jpg","publishedAt":"2019-04-19T14:36:00Z","content":"Advisers to former Vice President Joe Biden are finalizing plans for the launch of his presidential campaign next week, ending months of suspense that has hung over the Democratic nominating race.\r\nDiscussions among his core group of advisers about the exact … [+3959 chars]"},{"source":{"id":null,"name":"Newgeography.com"},"author":"Pete Saunders","title":"A What If - The Chicago White Sox and Armour Field","description":"(In the mid-1980's the Chicago White Sox were struggling on many levels -- to win on the field, to excite a fan base, and to upgrade their old home ballpark. That spurred them to push for a stadium deal either in the Chicago area or elsewhere. The Sox nearly …","url":"http://www.newgeography.com/content/006279-a-what-if-the-chicago-white-sox-and-armour-field?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Newgeography+%28Newgeography.com+-+Economic%2C+demographic%2C+and+political+commentary+about+places%29","urlToImage":null,"publishedAt":"2019-04-19T05:33:38Z","content":"(In the mid-1980's the Chicago White Sox were struggling on many levels -- to win on the field, to excite a fan base, and to upgrade their old home ballpark. That spurred them to push for a stadium deal either in the Chicago area or elsewhere. The Sox nearly … [+9721 chars]"},{"source":{"id":null,"name":"Insurancejournal.com"},"author":"Joshua Brustein","title":"Car Sharing Lobbyists Battle Car Renting Lobbyists, Driving State Lawmakers Crazy","description":"The bill that turned Illinois into the focal point of a bitter debate over car-sharing last year started as a proposal about what happens when a rental car is stolen. The legislation, which would allow rental companies to punish customers …","url":"https://www.insurancejournal.com/news/national/2019/04/19/524219.htm","urlToImage":"https://www.insurancejournal.com/app/uploads/2015/04/Ridesharing-Car-rental.jpg","publishedAt":"2019-04-19T05:00:48Z","content":"The bill that turned Illinois into the focal point of a bitter debate over car-sharing last year started as a proposal about what happens when a rental car is stolen. The legislation, which would allow rental companies to punish customers if they don’t return… [+7939 chars]"},{"source":{"id":null,"name":"Esquire.com"},"author":"Charles P. Pierce","title":"Any Democratic Candidate Worth Their Salt Should Double Down on This Story","description":"Montana farmers are finding out how easy trade wars are to win.","url":"https://www.esquire.com/news-politics/politics/a27198082/montana-farmers-trade-war-donald-trump/","urlToImage":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-1079949556.jpg?crop=1.00xw:0.752xh;0,0.248xh&resize=1200:*","publishedAt":"2019-04-19T20:24:00Z","content":"(Permanent Musical Accompaniment To This Post)\r\nBeing our semi-regular, weekly survey of what's goin' down in the several states where, as we know, the real work of governmentin' gets done and where dogs run free, so why not me?\r\nWe begin in Montana, where th… [+7913 chars]"},{"source":{"id":null,"name":"Rd.com"},"author":"Kelly Bryant","title":"The Scary Reason You Shouldn’t Reuse Cooking Oil","description":"A recent study on the effects of reheated cooking oil on the body draws an alarming conclusion. You may never respond to the alluring aroma of fast food French fries the same way again. The post The Scary Reason You Shouldn’t Reuse Cooking Oil appeared first …","url":"https://www.rd.com/health/healthy-eating/dont-reuse-cooking-oil/","urlToImage":"https://www.rd.com/wp-content/uploads/2019/04/shutterstock_320193203-1024x683.jpg","publishedAt":"2019-04-19T15:43:39Z","content":"Whiteaster/Shutterstock\r\nA research team at the University of Illinois at Urbana-Champaign set out to test the effects of thermally abused frying oil (that’s the fancy term for cooking oil that has been raised to high temperatures repeatedly) on laboratory mi… [+2228 chars]"},{"source":{"id":null,"name":"Geekdad.com"},"author":"Joey L. Mills","title":"Convention Connection: Geek Culture Conventions for Week 16 2019","description":"Convention Connection for Week 16 2019 includes events in Salt Lake City, Boston, Jacksonville, Seattle, and around the world. Find a convention near you this week! Click through to read all of \" Convention Connection: Geek Culture Conventions for Week 16 201…","url":"https://geekdad.com/2019/04/convention-connection-geek-culture-conventions-for-week-16-2019/","urlToImage":"https://i2.wp.com/geekdad.com/wp-content/uploads/sites/3/2019/04/Fan-X-Spring-2019.png?fit=1200%2C675&ssl=1","publishedAt":"2019-04-19T12:00:29Z","content":"Reading Time: 3minutes\r\nOur spotlight convention in the Convention Connection for this holiday weekend is FanX Salt Lake Comic Convention 2019. The event takes place in Salt Lake City, Utah on Friday, April 19 and Saturday, April 20. The event features a numb… [+4826 chars]"},{"source":{"id":null,"name":"Counterpunch.org"},"author":"Jeffrey St. Clair","title":"Roaming Charges: Time is Blind, Man is Stupid","description":"Some names always seem to resurface in American political scandals, so it was no surprise to stumble across \"Ledeen\" on page 63 of Mueller's Report, highlighting a scheme by Barbara Ledeen (wife of Iran/contra figure and Mike Flynn pal Michael) to track down …","url":"https://www.counterpunch.org/2019/04/19/time-is-blind-man-is-stupid/","urlToImage":"https://www.counterpunch.org/wp-content/dropzone/2018/06/cp-og-logo.png","publishedAt":"2019-04-19T09:00:11Z","content":"Drone footage of Notre Dame aflame.\r\nVictor Hugo: “The church of Notre-Dame de Paris is still no doubt, a majestic and sublime edifice. But, beautiful as it has been preserved in growing old, it is difficult not to sigh, not to wax indignant, before the numbe… [+28916 chars]"},{"source":{"id":null,"name":"Counterpunch.org"},"author":"Matthew Stevenson","title":"Pacific Odyssey: Guadalcanal and Bloody Ridge, Solomon Islands","description":"This article is Part XI of a series that describes a journey from the Philippines to Papua New Guinea and the Solomon Islands. For Part I, please click here. To see the rest of the Guadalcanal battle sites, I hired a car and driver, much as I had in summer 19…","url":"https://www.counterpunch.org/2019/04/19/pacific-odyssey-guadalcanal-and-bloody-ridge-solomon-islands/","urlToImage":"https://www.counterpunch.org/wp-content/dropzone/2018/06/cp-og-logo.png","publishedAt":"2019-04-19T08:46:26Z","content":"This article is Part XI of a series that describes a journey from the Philippines to Papua New Guinea and the Solomon Islands. For Part I, please click here.\r\nBloody Ridge, on Guadalcanal, Solomon Islands, looking south toward the Lunga River. In the desperat… [+33869 chars]"},{"source":{"id":null,"name":"Curbed.com"},"author":"Sara Freund","title":"6 ways to celebrate Earth Day in Chicago","description":"Park clean-ups, recycle events, design lectures, film festivals, and more.","url":"https://chicago.curbed.com/2019/4/19/18507899/earth-day-chicago-events-2019","urlToImage":"https://cdn.vox-cdn.com/thumbor/4J2yWK6Dit9pinMRenj1n-AtXso=/0x278:3888x2314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16178454/shutterstock_684865354.jpg","publishedAt":"2019-04-19T22:09:30Z","content":"Clean up your neighborhood park, recycle old electronics, learn about green design, and more First celebrated on April 22 in 1970, Earth Day is the one time of the year where people all over the world stop and think about their relationship with the planet. S… [+4152 chars]"},{"source":{"id":null,"name":"Atwonline.com"},"author":"Kurt Hofmann","title":"Kenya Airways, Delta codeshare to open 15 North American routes","description":"Kenya Airways and Atlanta-based Delta Air Lines have signed a codeshare agreement that will open connectivity to 11 US and four Canadian cities. read more","url":"http://atwonline.com/airports-routes/kenya-airways-delta-codeshare-open-15-north-american-routes","urlToImage":"https://atwonline.com/site-files/atwonline.com/files/uploads/2019/04/kenya-airways-boeing-787-8-jnb-rf-img9259.jpg","publishedAt":"2019-04-19T11:35:00Z","content":"Kenya Airways and Atlanta-based Delta Air Lines have signed a codeshare agreement that will open connectivity to 11 US and four Canadian cities.\r\nBoth airlines are SkyTeam alliance members.\r\nKenya Airways Group managing director and CEO Sebastian Mikosz said … [+1383 chars]"},{"source":{"id":"mirror","name":"Mirror"},"author":"Lewis Knight","title":"Star Wars Episode 9 theories: How Emperor Palpatine could return","description":"Star Wars: The Rise of Skywalker will see the return of the villainous Emperor Palpatine - but how?","url":"https://www.mirror.co.uk/film/star-wars-episode-9-theories-14431843","urlToImage":"https://i2-prod.mirror.co.uk/incoming/article6803094.ece/ALTERNATES/s1200/Emperor-Palpatine.jpg","publishedAt":"2019-04-19T07:48:54Z","content":"\"Your feeble skills are no match for the power of the dark side...\"\r\nYep, arch-villain of the Star Wars franchise Emperor Palpatine (Ian McDiarmid) is making his big comeback in The Rise of Skywalker, the ninth episode of the Skywalker saga.\r\nThe news was con… [+4169 chars]"},{"source":{"id":null,"name":"Theybf.com"},"author":"_YBF","title":"Jussie Smollett CUT From Broadway Musical, Prosecutor Kim Foxx Calls Him A 'Washed Up Celeb' & Goes In On R.Kelly Too","description":"We've got updates on Jussie Smollett and R. Kelly. Get the latest inside... <!--break--><!--break-->Jussie Smollett is currently living it up in Hawaii ( smoking mysterious cigarettes) with his family. You know, taking a break from all of the drama following …","url":"https://theybf.com/2019/04/19/jussie-smollett-cut-from-broadway-musical-prosecutor-kim-foxx-calls-him-a-washed-up-celeb","urlToImage":"http://theybf.com/sites/default/files/jussiekimteaser.png","publishedAt":"2019-04-19T18:26:20Z","content":"We've got updates on Jussie Smollett and R. Kelly. Get the latest inside...\r\nJussie Smollett is currently living it up in Hawaii (smoking mysterious cigarettes) with his family. You know, taking a break from all of the drama following his \"hate crime\" fiasco.… [+4245 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Christen A. Johnson","title":"How do you tell the group at dinner that you don't want to split the check?","description":"Q: You're out to dinner with a group, and everyone orders drinks, appetizers and entrees. You know the group will want to split the check, but you only had water and don't want to pay for someone else’s booze. How do you say you don't want to split the bill e…","url":"https://www.chicagotribune.com/lifestyles/sc-fam-social-graces-not-splitting-check-0423-story.html","urlToImage":"https://www.trbimg.com/img-5cb9eccd/turbine/sc-fam-social-graces-not-splitting-check-0423","publishedAt":"2019-04-19T15:40:00Z","content":"Q: You're out to dinner with a group, and everyone orders drinks, appetizers and entrees. You know the group will want to split the check, but you only had water and don't want to pay for someone elses booze. How do you say you don't want to split the bill ev… [+2737 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Dawn Reiss","title":"My legs were bandaged up to my knees in 7 layers of gauze. What it’s like to have a disease no one understands","description":"I was seven months pregnant when a woman in a children’s toy store stopped me while I was browsing a few books. “I know what you have,” she said very loudly looking at my legs that were bandaged up to my knees in seven layers of gauze and blue medical boots o…","url":"https://www.chicagotribune.com/lifestyles/sc-fam-dont-understand-disease-essay-0507-story.html","urlToImage":"https://www.trbimg.com/img-5cba176f/turbine/sc-fam-dont-understand-disease-essay-0507","publishedAt":"2019-04-19T17:50:00Z","content":"I was seven months pregnant when a woman in a childrens toy store stopped me while I was browsing a few books.\r\nI know what you have, she said very loudly looking at my legs that were bandaged up to my knees in seven layers of gauze and blue medical boots on … [+7260 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Karen Berkowitz","title":"Popular site for Highwood festivals, Everts Park, could receive a makeover","description":"A park in downtown Highwood that draws festivalgoers each summer could receive a makeover in the coming years, if Highwood officials are able to piece together grants and other funds to finance the overhaul. City officials are hoping to address the financial …","url":"https://www.chicagotribune.com/suburbs/highland-park/news/ct-hpn-highwood-park-master-plan-tl-0425-story.html","urlToImage":"https://www.trbimg.com/img-5cba13c4/turbine/ct-hpn-highwood-park-master-plan-tl-0425","publishedAt":"2019-04-19T18:10:00Z","content":"A park in downtown Highwood that draws festivalgoers each summer could receive a makeover in the coming years, if Highwood officials are able to piece together grants and other funds to finance the overhaul.\r\nCity officials are hoping to address the financial… [+2224 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Zak Koeske","title":"Markham junior high teacher arrested after bringing loaded gun to school, superintendent says","description":"A teacher at Prairie-Hills Junior High School in Markham was arrested Tuesday after a loaded handgun allegedly was found inside a duffel bag he brought into the school, district officials said. The teacher, whose name has not been released, faces Class B misd…","url":"https://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-markham-teacher-arrested-st-0421-story.html","urlToImage":"https://www.trbimg.com/img-5cba54a7/turbine/ct-sta-markham-teacher-arrested-st-0421","publishedAt":"2019-04-19T22:30:00Z","content":"A teacher at Prairie-Hills Junior High School in Markham was arrested Tuesday after a loaded handgun allegedly was found inside a duffel bag he brought into the school, district officials said.\r\nThe teacher, whose name has not been released, faces Class B mis… [+2392 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Tony Baranek","title":"Mother McAuley girls basketball coach Ashley Luke Clanton leaving after seven 'wonderful' seasons","description":"As girls basketball coach and assistant athletic director, Ashley Luke Clanton had a career at Mother McAuley she will never forget. “Seven wonderful years,” Luke Clanton said. “A lot of hard work.” And a gratifying ending. Luke Clanton confirmed Friday she i…","url":"https://www.chicagotribune.com/suburbs/daily-southtown/sports/ct-sta-spt-girls-basketball-mother-mcauley-ashley-luke-clanton-st-042119-story.html","urlToImage":"https://www.trbimg.com/img-5cba6180/turbine/ct-sta-spt-girls-basketball-mother-mcauley-ashley-luke-clanton-st-042119","publishedAt":"2019-04-20T00:00:00Z","content":"As girls basketball coach and assistant athletic director, Ashley Luke Clanton had a career at Mother McAuley she will never forget.\r\nSeven wonderful years, Luke Clanton said. A lot of hard work.\r\nAnd a gratifying ending.\r\nLuke Clanton confirmed Friday she is… [+2635 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Becky Jacobs","title":"Gun violence took her brothers' lives. She dreams of stopping bullets by opening a youth center in Gary.","description":"Aaliyah Stewart returned to her living room holding a large teddy bear wearing a basketball jersey and a pair of black and pink tennis shoes. The basketball jersey belonged to her older brother, James Anderson, while her other older brother, Anthony S. White …","url":"https://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-merrillville-youth-initiative-st-0412-story.html","urlToImage":"https://www.trbimg.com/img-5cba320f/turbine/ct-ptb-merrillville-youth-initiative-st-0412","publishedAt":"2019-04-19T18:40:00Z","content":"Aaliyah Stewart returned to her living room holding a large teddy bear wearing a basketball jersey and a pair of black and pink tennis shoes.\r\nThe basketball jersey belonged to her older brother, James Anderson, while her other older brother, Anthony S. White… [+6508 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Josh Noel","title":"A decade of Daisy: How Half Acre's iconic Daisy Cutter pale ale changed Chicago beer culture","description":"There’s nothing revolutionary about Daisy Cutter pale ale anymore. But 10 years ago, it was a game changer. Half Acre Beer Co. introduced Daisy Cutter in 2009, as just the second beer made at its original brewery on Lincoln Avenue. Daisy Cutter was intended t…","url":"https://www.chicagotribune.com/dining/ct-food-daisy-cutter-pale-ale-half-acre-10-years-old-20190415-story.html","urlToImage":"https://www.trbimg.com/img-5cb92f92/turbine/ct-food-daisy-cutter-pale-ale-half-acre-10-years-old-20190415","publishedAt":"2019-04-19T12:00:00Z","content":"Theres nothing revolutionary about Daisy Cutter pale ale anymore.\r\nBut 10 years ago, it was a game changer.\r\nHalf Acre Beer Co. introduced Daisy Cutter in 2009, as just the second beer made at its original brewery on Lincoln Avenue. Daisy Cutter was intended … [+15719 chars]"},{"source":{"id":null,"name":"Curbed.com"},"author":"Jay Koziarz","title":"$1.3B TIF for Lincoln Yards violates state law, says lawsuit","description":"The North Branch megadevelopment is facing a legal challenge from a pair of local activist groups","url":"https://chicago.curbed.com/2019/4/19/18507728/lincoln-yards-lawsuit-tif-district","urlToImage":"https://cdn.vox-cdn.com/thumbor/w5WFVOKUcZ9szdOPdL7LjlPRvTA=/0x0:1100x576/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16177684/lincoln_yards.jpg","publishedAt":"2019-04-19T17:00:45Z","content":"While last weeks City Council approval represented the final legislative vote for Lincoln Yards, the battle over the controversial $6 billion North Branch megadevelopment is still heating up. This week, a coalition of activists led by the Grassroots Collabora… [+3346 chars]"},{"source":{"id":null,"name":"Minx.cc"},"author":"Ace of Spades","title":"Kim Foxx's Top Ethics Officer and Conviction Integrity Officer Resign in Wake of Corrupt Smollett Whitewash","description":"The article doesn't say they resigned in protest of that corrupt swindle-- but it's hard to avoid that conclusion. Two officials have resigned from their positions in the office of Cook County, Illinois, States Attorney Kim Foxx in the wake...","url":"http://minx.cc/?post=380949","urlToImage":null,"publishedAt":"2019-04-19T19:04:27Z","content":null},{"source":{"id":null,"name":"Comicbook.com"},"author":"Patrick Cavanaugh","title":"'Avengers: Endgame' Opening Night Fan Event Special Coin Revealed","description":"For most Marvel fans, the opening of Avengers: Endgame can't come fast enough, as it has been described as the culmination of a journey that began back in 2008 with Iron Man. Luckily, the wait is almost over, as the film will be landing in theaters in less th…","url":"https://comicbook.com/marvel/2019/04/19/avengers-endgame-opening-night-fan-event-collectible-coin/","urlToImage":"https://media.comicbook.com/2019/04/avengers-endgame-1167705-640x320.jpeg","publishedAt":"2019-04-19T16:51:00Z","content":"For most Marvel fans, the opening of Avengers: Endgame can't come fast enough, as it has been described as the culmination of a journey that began back in 2008 with Iron Man. Luckily, the wait is almost over, as the film will be landing in theaters in less th… [+2249 chars]"},{"source":{"id":null,"name":"Antiwar.com"},"author":"Patrick J. Buchanan","title":"Is Bernie Stealing Trump’s ‘No More Wars’ Issue?","description":"\"The president has said that he does not want to see this country involved in endless wars… I agree with that,\" Bernie Sanders told the Fox News audience at Monday’s town hall meeting in Bethlehem, Pennsylvania. Then turning and staring straight into the came…","url":"https://original.antiwar.com/buchanan/2019/04/18/is-bernie-stealing-trumps-no-more-wars-issue/","urlToImage":null,"publishedAt":"2019-04-19T04:00:56Z","content":"\"The president has said that he does not want to see this country involved \r\n in endless wars… I agree with that,\" Bernie Sanders told the Fox News \r\n audience at Monday’s town hall meeting in Bethlehem, Pennsylvania.\r\nThen turning and staring straight into t… [+5151 chars]"},{"source":{"id":null,"name":"Antiwar.com"},"author":"Reese Erlich","title":"Can WikiLeaks’ Julian Assange Get a Fair Trial?","description":"British police dragged WikiLeaks founder Julian Assange out of the Ecuadorian Embassy in London on April 11, witnessed by a scrum of international media. Authorities in the United Kingdom and US then tried to drag Assange’s reputation through the mud. The off…","url":"https://original.antiwar.com/reese_erlich/2019/04/18/can-wikileaks-julian-assange-get-a-fair-trial/","urlToImage":null,"publishedAt":"2019-04-19T04:00:37Z","content":"British police dragged WikiLeaks founder Julian Assange out of the Ecuadorian \r\n Embassy in London on April 11, witnessed \r\n by a scrum of international media. Authorities in the United Kingdom and US \r\n then tried to drag Assanges reputation through the mud.… [+6751 chars]"},{"source":{"id":null,"name":"Firstthings.com"},"author":"John Wilson","title":"Heaven is Real","description":"During Holy Week I sometimes think of the Woman in the Bus. The bus in question went up and down Los Robles Avenue in Pasadena, California, where Wendy and I lived for roughly twenty years. Much of the time, I walked to downtown Pasadena, but sometimes—especi…","url":"https://www.firstthings.com/web-exclusives/2019/04/heaven-is-real","urlToImage":"https://www.firstthings.com/uploads/article_5cb94bd373487.jpg","publishedAt":"2019-04-19T10:00:00Z","content":"During Holy Week I sometimes think of the Woman in the Bus. The bus in question went up and down Los Robles Avenue in Pasadena, California, where Wendy and I lived for roughly twenty years. Much of the time, I walked to downtown Pasadena, but sometimes—especi… [+3230 chars]"},{"source":{"id":null,"name":"Nydailynews.com"},"author":"New York Daily News","title":"College football recruiting tracker: Notre Dame gets a commitment from the No. 1 prospect in Hawaii","description":"Notre Dame added the top-rated player in Hawaii to its 2020 recruiting class when four-star linebacker Jordan Botelho announced his commitment in a short video posted on Twitter. The 6-foot-3, 230-pound Botelho attends St. Louis School in Honolulu. Washington…","url":"https://www.nydailynews.com/national-sports/sns-college-football-recruiting-tracker-notre-dame-gets-a-commitment-from-the-no-1-prospect-in-hawaii-20190419-story.html","urlToImage":"https://www.nydailynews.com/resizer/ml-AtmmKenV4R8L7T93KtVyL-oY=/1200x0/www.trbimg.com/img-5cb9d97d/turbine/sns-college-football-recruiting-tracker-notre-dame-gets-a-commitment-from-the-no-1-prospect-in-hawaii-20190419","publishedAt":"2019-04-19T14:22:03Z","content":"Notre Dame added the top-rated player in Hawaii to its 2020 recruiting class when four-star linebacker Jordan Botelho announced his commitment in a short video posted on Twitter.\r\nThe 6-foot-3, 230-pound Botelho attends St. Louis School in Honolulu. He's the … [+4233 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Charlotte Observer","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 Big Ten teams will extend QB competitions into preseason The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday. First-year coach Ryan Da…","url":"https://www.charlotteobserver.com/sports/article229459659.html?src=rss","urlToImage":"https://www.mcclatchy-wires.com/incoming/7pxqzh/picture229459614/alternates/LANDSCAPE_1140/Big_Ten_Spring_Wrap_Football_67272.jpg","publishedAt":"2019-04-19T15:16:00Z","content":"7 Big Ten teams will extend QB competitions into preseason\r\nFILE - In this March 6, 2019, file photo, Ohio State quarterback Justin Fields, left, and wide receiver K.J. Hill run through a drill during the NCAA college football team's practice in Columbus, Ohi… [+5596 chars]"},{"source":{"id":null,"name":"Orlandosentinel.com"},"author":"Orlando Sentinel","title":"College Football Rankings: No. 128 UConn stuck at bottom of American Athletic Conference","description":"UConn has suffered through a stretch of mediocrity that stretches back to the program's appearance in the Fiesta Bowl in 2010. Even the return of Randy Edsall, who spent more than a decade leading the program to success from 2000-10, has done little to spark …","url":"https://www.orlandosentinel.com/sports/college-gridiron-365/os-sp-college-football-rankings-uconn-0419-story.html","urlToImage":"https://www.trbimg.com/img-5cb9e7b8/turbine/os-sp-college-football-rankings-uconn-0419","publishedAt":"2019-04-19T14:00:00Z","content":"UConn has suffered through a stretch of mediocrity that stretches back to the programs appearance in the Fiesta Bowl in 2010. Even the return of Randy Edsall, who spent more than a decade leading the program to success from 2000-10, has done little to spark t… [+4101 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"ABC News","title":"7 Big Ten teams will extend QB competitions into preseason","description":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday. First-year coach Ryan Day of defending conference champion Ohio State insisted afte…","url":"https://abcnews.go.com/Sports/wireStory/big-ten-teams-extend-qb-competitions-preseason-62509417","urlToImage":"https://s.abcnews.com/images/Sports/WireAP_e33734d9f6db407b81ef587f13a4e62c_16x9_992.jpg","publishedAt":"2019-04-19T15:17:55Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4965 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"The Associated Press","title":"14 Big Ten football players poised to break out in the fall","description":"A look at football players in the Big Ten this spring who are poised to have standout seasons this fall:","url":"https://sports.yahoo.com/14-big-ten-football-players-poised-break-fall-151828298--ncaaf.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/AF4FGfxxfqoG_iyaP0f4fw--~B/aD0zNDY7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201904190601216998244","publishedAt":"2019-04-19T15:18:28Z","content":"A look at football players in the Big Ten this spring who are poised to have standout seasons this fall:\r\nEAST DIVISION\r\nINDIANA\r\nWRs Nick Westbrook and Donovan Hale, seniors. Westbrook, who missed 2017 with an ACL tear, showed glimpses of his pre-injury tale… [+4586 chars]"},{"source":{"id":null,"name":"Chron.com"},"author":"Houston Chronicle","title":"7 Big Ten teams will extend QB competitions into preseason","description":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday. \n First-year coach Ryan Day of defending conference champion Ohio State insisted af…","url":"https://www.chron.com/sports/college/article/7-Big-Ten-teams-will-extend-QB-competitions-into-13780500.php","urlToImage":"https://s.hdnux.com/photos/01/01/64/22/17253507/3/rawImage.jpg","publishedAt":"2019-04-19T15:16:09Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+6797 chars]"},{"source":{"id":null,"name":"Crossway.org"},"author":"R. Kent Hughes","title":"The Gospel in 1 Timothy","description":"The thrust of 1 Timothy is that godliness is central to the Christian’s continuing in the gospel and the church’s proclamation of the gospel.","url":"https://www.crossway.org/articles/the-gospel-in-1-timothy/","urlToImage":"https://static.crossway.org/articles/images/gospel-in-1-Timothy.jpg","publishedAt":"2019-04-19T11:00:00Z","content":"This article is part of the Christ in All of Scripture series.\r\nGodliness and the Gospel\r\nThe thrust of 1 Timothy is that godliness is central to the Christians continuing in the gospel and the churchs proclamation of the gospel. Words relating to godliness o… [+4005 chars]"},{"source":{"id":"national-review","name":"National Review"},"author":"Victor Davis Hanson","title":"Inquisitio Requiescat in Pace","description":"The variously dubbed dream team/all stars/hunter-killer/army of Mueller’s lawyers, after 22 months, $30 million, and 400 pages plus of legalese did not find “Russian collusion,” the original reason…","url":"https://www.nationalreview.com/corner/inquisitio-requiescat-in-pace/","urlToImage":"https://s0.wp.com/i/blank.jpg","publishedAt":"2019-04-19T17:21:05Z","content":"The variously dubbed dream team/all stars/hunter-killer/army of Muellers lawyers, after 22 months, $30 million, and 400 pages plus of legalese did not find Russian collusion, the original reason to be of their investigation. At what early point the team reali… [+3060 chars]"},{"source":{"id":null,"name":"Buckys5thquarter.com"},"author":"Bucky's 5th Quarter","title":"Recapping Wisconsin spring visitors in the past week","description":"With spring football wrapping up in just about a week, the Wisconsin Badgers still see high school prospects coming to Madison to watch practice and take in the sights and sounds of Camp Randall Stadium. On Saturday, many braved the chilly and windy day insid…","url":"https://www.buckys5thquarter.com/2019/4/19/18507531/wisconsin-football-recruiting-rylie-mills-nolan-rucci-bryan-sanborn","urlToImage":"https://cdn.vox-cdn.com/thumbor/XLH9AUW87It-6_e9K5a0DyMK_b8=/0x266:4970x2868/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16177379/usa_today_11584542.jpg","publishedAt":"2019-04-19T05:00:00Z","content":"With spring football wrapping up in just about a week, the Wisconsin Badgers still see high school prospects coming to Madison to watch practice and take in the sights and sounds of Camp Randall Stadium.\r\nOn Saturday, many braved the chilly and windy day insi… [+2215 chars]"},{"source":{"id":null,"name":"Orlandosentinel.com"},"author":"OrlandoSentinel.com","title":"7 Big Ten teams will extend starting QB competitions into preseason","description":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday. First-year coach Ryan Day of defending conference champion Ohio State insisted afte…","url":"https://www.orlandosentinel.com/sports/college-gridiron-365/os-sp-big-ten-0420-story.html","urlToImage":"https://www.trbimg.com/img-5cba576c/turbine/os-sp-big-ten-0420","publishedAt":"2019-04-19T22:00:00Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4855 chars]"},{"source":{"id":null,"name":"Cbslocal.com"},"author":"CBS Baltimore","title":"14 Big Ten Football Players Poised To Break Out In The Fall","description":"BALTIMORE (AP) — A look at football players in the Big Ten this spring who are poised to have standout seasons this fall: EAST DIVISION WRs Nick Westbrook and Donovan Hale, seniors. Westbrook, who missed 2017 with an ACL tear, showed glimpses of his pre-injur…","url":"https://baltimore.cbslocal.com/2019/04/19/14-big-ten-football-players-poised-to-break-out-in-the-fall/","urlToImage":"https://cbsbaltimore.files.wordpress.com/2019/04/gettyimages-1064896762.jpg?w=1500","publishedAt":"2019-04-19T18:39:33Z","content":"BALTIMORE (AP) — A look at football players in the Big Ten this spring who are poised to have standout seasons this fall:\r\nEAST DIVISION\r\nINDIANA\r\nWRs Nick Westbrook and Donovan Hale, seniors. Westbrook, who missed 2017 with an ACL tear, showed glimpses of hi… [+4498 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Miami Herald","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 Big Ten teams will extend QB competitions into preseason The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday. First-year coach Ryan Da…","url":"https://www.miamiherald.com/sports/article229459659.html?src=rss","urlToImage":"https://www.mcclatchy-wires.com/incoming/7pxqzh/picture229459614/alternates/LANDSCAPE_1140/Big_Ten_Spring_Wrap_Football_67272.jpg","publishedAt":"2019-04-19T15:16:59Z","content":"7 Big Ten teams will extend QB competitions into preseason\r\nFILE - In this March 6, 2019, file photo, Ohio State quarterback Justin Fields, left, and wide receiver K.J. Hill run through a drill during the NCAA college football team's practice in Columbus, Ohi… [+5596 chars]"}]}