{"status":"ok","totalResults":508,"articles":[{"source":{"id":null,"name":"Gizmodo.com"},"author":"Maddie Stone on Earther, shared by Andrew Couts to Gizmodo","title":"Turns Out, Meal Kits Might Not Suck for the Planet","description":"For the past few years, I’ve watched the rising popularity of meal kits from companies like Blue Apron and HelloFresh with deepening skepticism. Stuffed with refrigerator packs and individually wrapped ingredients, festooned with farm-to-table marketing and r…","url":"https://earther.gizmodo.com/turns-out-meal-kits-might-not-suck-for-the-planet-1834172440","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--mBW1vPEc--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/oqtqni4gvn2nhklagy9w.jpg","publishedAt":"2019-04-22T14:30:00Z","content":"For the past few years, Ive watched the rising popularity of meal kits from companies like Blue Apron and HelloFresh with deepening skepticism. Stuffed with refrigerator packs and individually wrapped ingredients, festooned with farm-to-table marketing and re… [+5713 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Jonathan Lambert","title":"Meal Kits Have Smaller Carbon Footprint Than Grocery Shopping, Study Says","description":"While it may seem that heaps of plastic from meal kit delivery services make them less environmentally friendly than traditional grocery shopping, a new study suggests that's not necessarily true.","url":"https://www.npr.org/sections/thesalt/2019/04/22/716010599/meal-kits-have-smaller-carbon-footprint-than-grocery-shopping-study-says","urlToImage":"https://media.npr.org/assets/img/2019/04/22/gettyimages-628556204_wide-dde55907e42ae512f2a85ac59fa1e333f41bbabb.jpg?s=1400","publishedAt":"2019-04-22T18:35:29Z","content":"While it may seem that heaps of plastic from meal kit delivery services like Blue Apron makes them less environmentally friendly than traditional grocery shopping, a new study says the kits actually produce less food waste.\r\nDerek Davis/Portland Press Herald … [+7456 chars]"},{"source":{"id":null,"name":"Aa.com.tr"},"author":null,"title":"US nears record number of measles cases - Anadolu Agency","description":"US nears record number of measles cases Anadolu Agency New York Measles Outbreaks Drive US Cases Up to 626 TIME Measles nears record in US as the disease spreads in New York CNBC El Al Flight Attendant in Deep Coma After Contracting Measles on NY to TLV Journ…","url":"https://www.aa.com.tr/en/americas/us-nears-record-number-of-measles-cases/1460031","urlToImage":"https://cdnuploads.aa.com.tr/uploads/Contents/2019/04/22/thumbs_b_c_1022f602f85530fb4a8b74a633985214.jpg?v=183722","publishedAt":"2019-04-22T15:39:16Z","content":"WASHINGTON\r\nThe number of measles cases in the U.S. is approaching its highest since the disease was declared eliminated in 2000, the Centers for Disease Control (CDC) said Monday.\r\nSo far in 2019, 626 cases have been reported, 41 less than the current record… [+943 chars]"},{"source":{"id":null,"name":"Courthousenews.com"},"author":"KEVIN KOENINGER","title":"Sixth Circuit Rules Against 'Chalking' of Parked Cars - Courthouse News Service","description":"Sixth Circuit Rules Against 'Chalking' of Parked Cars Courthouse News Service Federal appeals court says tire-chalking by parking enforcement officers is unconstitutional The Washington Post Chalking tires to enforce parking rules is unconstitutional, court f…","url":"https://www.courthousenews.com/sixth-circuit-rules-against-chalking-of-parked-cars/","urlToImage":"https://www.courthousenews.com/wp-content/uploads/2018/10/ParkingTire-300x225.jpg","publishedAt":"2019-04-22T17:11:00Z","content":"CINCINNATI (CN) A Michigan citys practice of chalking tires to enforce parking regulations is an unreasonable search, a Sixth Circuit panel ruled Monday. \r\nAlison Taylor, who was issued 15 parking citations over a period\r\nof three years, sued the city of Sagi… [+3051 chars]"},{"source":{"id":null,"name":"Profootballweekly.com"},"author":null,"title":"Greg Gabriel: 2019 NFL Mock Draft - Pro Football Weekly","description":"Greg Gabriel: 2019 NFL Mock Draft Pro Football Weekly Quinnen Williams about to fulfill a dream and his mother’s last request Tampa Bay Times Mock Draft: Three Alabama players expected first round 247Sports 2019 NFL Mock Draft: What happens when the Cardinals…","url":"https://www.profootballweekly.com/2019/04/22/greg-gabriel-2019-nfl-mock-draft/aof04kg/","urlToImage":"https://www.profootballweekly.com/_internal/cimg!0/6aanj62zcclsxfikecfb2kgn03kj3nu","publishedAt":"2019-04-22T14:18:00Z","content":"The 2019 NFL draft will be an interesting one because it will unfold much differently than in recent years. We have seen in the past few drafts a running back go in the top 10, which wont be the case this year. In fact, dont be surprised if a running back doe… [+7832 chars]"},{"source":{"id":"time","name":"Time"},"author":"MARK SHERMAN / AP","title":"Supreme Court Will Decide Whether Employment Discrimination Laws Apply to LGBT Community","description":"The Supreme Court will decide whether the main federal civil rights law that prohibits employment discrimination applies to LGBT people.","url":"http://time.com/5575299/supreme-court-lgbt-gay-job-discrimination/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/supreme-court-lgbt-job-discrimination.jpg?quality=85","publishedAt":"2019-04-22T14:34:45Z","content":"(WASHINGTON) — The Supreme Court will decide whether the main federal civil rights law that prohibits employment discrimination applies to LGBT people.\r\nThe justices say Monday they will hear cases involving people who claim they were fired because of their s… [+2084 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Devin Dwyer","title":"Supreme Court takes on LGBT employment discrimination","description":"The U.S. Supreme Court announced Monday that it will hear three high-profile cases involving employment discrimination against LGBT Americans.","url":"https://abcnews.go.com/Politics/supreme-court-takes-lgbt-employment-discrimination/story?id=62551787","urlToImage":"https://s.abcnews.com/images/Politics/supreme-court-ap-jpo-190402_hpMain_2_16x9_992.jpg","publishedAt":"2019-04-22T14:15:47Z","content":"The U.S. Supreme Court announced Monday that it will hear three high-profile cases involving employment discrimination against LGBT Americans. Together, the court will determine whether federal civil rights protections extend to include sexual orientation and… [+1033 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"Measles cases 'likely' to break yearly record in just 4 months","description":"The Centers for Disease Control reports that there have been 626 confirmed cases of measles so far this year, marking an increase of 71 new cases since last week.","url":"https://abcnews.go.com/Health/measles-cases-break-yearly-record-months/story?id=62552978","urlToImage":"https://s.abcnews.com/images/US/washington-measles-02-rtr-jc-190418_hpMain_16x9_992.jpg","publishedAt":"2019-04-22T16:59:36Z","content":"The number of measles cases in the U.S. so far this year is approaching the record for the decade -- and in just four months time, according to new data.\r\nThe Centers for Disease Control and Prevention reports that there have been 626 confirmed cases of measl… [+1724 chars]"},{"source":{"id":null,"name":"Freep.com"},"author":"Detroit Free Press, Aleanna Siacon, Detroit Free Press","title":"'Zombie' deer disease will be 'virtually impossible' to get rid of if not kept in check, experts warn","description":"If chronic wasting disease in Michigan deer isn't kept in check it could be 'virtually impossible' to get rid of, experts warn.","url":"https://www.freep.com/story/news/local/michigan/2019/04/22/michigan-zombie-deer-disease-cwd/3536952002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/PDTF/fc879ee6-da3f-41b0-aa8c-eadad9d939d1-IMG_636639919660631751_d_1_.JPG?crop=4529,2554,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T20:04:28Z","content":"CWD is a deer-killing disease that leaves their brains full of holes. What is this always-fatal condition and how do people fight its spread?\r\n Wochit\r\nDETROIT - Michigan is raising the stakes in its battle to fight chronic wasting disease in deer, a neurolog… [+5474 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Ryan W. Miller, USA TODAY","title":"71 additional measles cases confirmed as CDC warns record levels nearing","description":"A total of 626 measles cases in 22 states have been confirmed since Jan. 1, the Centers for Disease Control and Prevention said.","url":"https://www.usatoday.com/story/news/health/2019/04/22/measles-outbreak-71-additional-cases-22-states-confirmed-cdc/3536904002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/09/USAT/ad431b1a-d42b-4898-844c-a02391972c95-AP_Measles_Vaccine.JPG?crop=5211,2931,x1,y440&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T14:09:32Z","content":"Outbreaks across the U.S. have forced officials to declare emergencies. Why are we starting to see the rise of these outbreaks? It dates back to the anti-vax movement.\r\n Just the FAQs, USA TODAY\r\nAn additional 71 measles cases were reported across the United … [+1642 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Defense order of the day for 1st round of NFL draft","description":"We learned during the 2018 season that offense is beloved by NFL teams (and fans). Yet the Super Bowl score was 13-3.","url":"https://www.usatoday.com/story/sports/nfl/2019/04/22/defense-order-of-the-day-for-1st-round-of-nfl-draft/39380279/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/90eafae7388de3e3dc46c909fbe134d033f0717c/c=0-279-3702-2361/local/-/media/2019/04/22/USATODAY/usatsports/ba26619958484abb80ab3f26840dc7c0.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T21:12:24Z","content":"NASHVILLE, Tenn. (AP) We learned during the 2018 season that offense is beloved by NFL teams (and fans). We also learned that defense, as performed by the Patriots in the Super Bowl, carries away the Lombardi Trophy.\r\nThis year's draft, which begins Thursday … [+6249 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Josh Hafner and Kirk A. Bado, USA TODAY","title":"They found 75 bomb detonators in a dump","description":"From the latest with the Sri Lanka bombings to Earth Day, here's Monday's top news.","url":"https://www.usatoday.com/story/news/2019/04/22/earth-day-sri-lanka-and-miguel-cabrera-heres-mondays-top-news/3359376002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/USAT/da405253-9df0-4adf-b33f-6733af4c7002-AFP_AFP_1FU2L2.JPG?crop=4410,2481,x0,y167&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T23:22:15Z","content":"A woman prays at St. Sebastian's Church in Negombo on April 22, 2019, a day after the building was hit as part of a series of bomb blasts targeting churches and luxury hotels in Sri Lanka.\r\n (Photo: JEWEL SAMAD, AFP/Getty Images)\r\nIt's a bleak Monday, friends… [+5042 chars]"},{"source":{"id":null,"name":"247wallst.com"},"author":"24/7 Wall Street, Samuel Stebbins, 24/7 Wall Street","title":"Viva Las Vegas, here's the fastest growing cities in each state and Sin City is among them","description":"Nearly every state has at least one city that has reported rapid population growth in recent years. Net migration and natural growth are the factors.","url":"https://247wallst.com/special-report/2019/04/18/the-fastest-growing-city-in-each-state-4?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2019/04/18/USATODAY/usatsports/gettyimages-946583362.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T10:00:07Z","content":"The U.S. population growth rate recently hit a low point not seen since 1937, when the country was in the thick of the Great Depression. The U.S. population grew by just 0.62% between July 2017 and July 2018, according to Census Bureau data. The slowing natio… [+13870 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"A baseball branding bonanza, and 2 guys helping it happen","description":"Branded: Minor league ball teams get help finding identity","url":"https://www.usatoday.com/story/sports/mlb/2019/04/22/a-baseball-branding-bonanza-and-2-guys-helping-it-happen/39377963/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-22T06:05:41Z","content":"ALLENTOWN, Pa. (AP) On a spring evening in eastern Pennsylvania, upon a bluff overlooking the Lehigh Valley, a carnival of baseball and pork products is at hand.\r\nFrom loudspeakers, swine-like sounds reverberate. Vendors roam the stands in clothing festooned … [+10138 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Ashley Fetters","title":"When Families Feud Over Vaccines","description":"The question of whether vaccinations should be a duty or a choice has caused rifts between relatives.","url":"https://www.theatlantic.com/family/archive/2019/04/when-families-feud-over-vaccines/587629/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_95012012/facebook.jpg?1555946906","publishedAt":"2019-04-22T15:32:51Z","content":"Colleen Brown of Cleveland, Ohio, has been known to post on Facebook now and again about the dangers of not vaccinating kids—local news stories about schools closing because a student has been exposed to the measles, she says, that kind of thing. A few years … [+9012 chars]"},{"source":{"id":null,"name":"Popsci.com"},"author":"Kat Eschner, Kat Eschner","title":"Meal kits are full of wasteful packaging—but they might still beat the grocery store","description":"Environment Don't subscribe just yet. A meal kit full of wasteful packaging isn't good for the planet. But the food you buy in a grocery store can be even worse.","url":"https://www.popsci.com/meal-kit-food-waste","urlToImage":"https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/04/depositphotos_201073122_xl-2015.jpg?itok=iDI4NdWz","publishedAt":"2019-04-22T19:30:00Z","content":"If youve ever listened to a podcast, youve probably heard of Blue Apron. Its just one of the many meal kit delivery services that have sprung up over the last seven years, delivering preassembled meal kits to the homes of their subscribers. Think of them as L… [+6540 chars]"},{"source":{"id":null,"name":"Scientificamerican.com"},"author":"Maxine Joselow, E&E News","title":"Why Are Electric Vehicle Sales Low? Psychology Provides Clues","description":"Social norms and a lack of information on financial benefits have hampered U.S. EV adoption -- Read more on ScientificAmerican.com","url":"https://www.scientificamerican.com/article/why-are-electric-vehicle-sales-low-psychology-provides-clues/","urlToImage":"https://static.scientificamerican.com/sciam/cache/file/6B94991D-E261-4939-9C6218587D5A9E4E.jpg","publishedAt":"2019-04-22T18:00:00Z","content":"At the Washington Auto Show this month, automakers prominently displayed dozens of electric vehicles.\r\nAudi showcased the e-tron, its first electric SUV. Elsewhere in the massive showroom, Chevrolet exhibited a bright lime-green Bolt.\r\nBut the prevalence of E… [+6988 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"New Mexico Border Militia Leader Allegedly Said Group Planned to Assassinate Obama, Clinton","description":"PAUL RATJEThe border militia leader who was arrested in New Mexico over the weekend on weapons charges allegedly said that his far-right group was training to kill prominent Democratic figures because of their “support of Antifa.”According to an arrest warran…","url":"https://news.yahoo.com/mexico-border-militia-leader-allegedly-194913052.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Je42D2i1R2jIT6hreUHwmQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/007df1c1da6b7949a042c54635551ea1","publishedAt":"2019-04-22T19:49:13Z","content":"The border militia leader who was arrested in New Mexico over the weekend on weapons charges allegedly said that his far-right group was training to kill prominent Democratic figures because of their support of Antifa.\r\nAccording to an arrest warrant for Larr… [+2539 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Armed border group's leader said to have assassination plans","description":"LAS CRUCES, N.M. (AP) — The leader of an armed group that has been detaining asylum-seeking families from Central America near the Mexican border said two years ago that he was training supporters to assassinate Hillary Clinton, Barack Obama and billionaire D…","url":"https://news.yahoo.com/member-civilian-border-group-facing-firearms-charges-170414502.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/rokZRtxoj077sdcG6pvA7g--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/video/video.associatedpressfree.com/776943bb8124792bfb3fd11d7adda9dc","publishedAt":"2019-04-22T23:14:14Z","content":"LAS CRUCES, N.M. (AP) The leader of an armed group that has been detaining asylum-seeking families from Central America near the Mexican border said two years ago that he was training supporters to assassinate Hillary Clinton, Barack Obama and billionaire Dem… [+3279 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Robert Schroeder","title":"Capitol Report: Warren aside, 2020 Democrats in no rush to impeach Trump","description":"Democrats running for president aren’t in any rush to impeach President Donald Trump in the wake of the Mueller report.","url":"https://www.marketwatch.com/story/warren-aside-2020-democrats-in-no-rush-to-impeach-trump-2019-04-22","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI045_trump__ZG_20190422141746.jpg","publishedAt":"2019-04-22T19:41:22Z","content":"President Donald Trump says hes not worried about impeachment, as few Democrats press to remove him from office after the Mueller report. \r\nDemocrats running for president arent in any rush to impeach President Donald Trump in the wake of the Mueller report. … [+2375 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Ashley Reese on The Slot, shared by Ashley Reese to Jezebel","title":"Andrew Yang Wants to Be America's First Ex-Goth President","description":"When it comes to the fringe Democratic candidates of the 2020 election cycle, Andrew Yang might be one of the fringiest: the 44-year-old startup type, a former corporate lawyer and executive who founded a nonprofit to help recent college graduates also become…","url":"https://theslot.jezebel.com/andrew-yang-wants-to-be-americas-first-ex-goth-presiden-1834116197","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--Jv9-BXMe--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/pqnd2xsxbfn6oriluonq.png","publishedAt":"2019-04-22T16:00:00Z","content":"When it comes to the fringe Democratic candidates of the 2020 election cycle, Andrew Yang might be one of the fringiest: the44-year-old startup type, a former corporate lawyer and executive who founded a nonprofit to help recent college graduates also become … [+12325 chars]"},{"source":{"id":null,"name":"Jalopnik.com"},"author":"Erik Shilling","title":"Detroit May Have Screwed Itself Out of Generation Z Sales","description":"The kids aren’t into the cars, Tesla’s making big claims about self-driving, Carlos Ghosn is in more trouble and so much more for The Morning Shift of Monday, April 22, 2019. Read more...","url":"https://jalopnik.com/detroit-may-have-screwed-itself-out-of-generation-z-sal-1834211828","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--y-ole2nB--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/xqubs5lpq5hpiydhwwsr.png","publishedAt":"2019-04-22T14:15:00Z","content":"The kids arent into the cars, Teslas making big claims about self-driving, Carlos Ghosn is in more trouble and so much more for The Morning Shift of Monday, April 22, 2019.\r\n1st Gear: Generation Z Is Too Busy and Poor to Be Bothered With Cars\r\nToday if youre … [+10561 chars]"},{"source":{"id":null,"name":"Thesimpledollar.com"},"author":"Trent Hamm","title":"Questions About Practical Gifts, Low Cost of Living Cities, Custmer Rewards, Debt Collection, and More!","description":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question. 1. Car loan versus retirement savings? 2. Moving to cheaper city? 3. “Custome…","url":"https://www.thesimpledollar.com/questions-about-practical-gifts-low-cost-of-living-cities-custmer-rewards-debt-collection-and-more/","urlToImage":"https://cdn.thesimpledollar.com/wp-content/uploads/2015/08/letters-mailbag.jpg.webp","publishedAt":"2019-04-22T14:00:38Z","content":"What’s inside? Here are the questions answered in today’s reader mailbag, boiled down to summaries of five or fewer words. Click on the number to jump straight down to the question.1. Car loan versus retirement savings?2. Moving to cheaper city?3. “Customer r… [+21732 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Dan Pompei","title":"What's the Story with Montez Sweat?","description":"He has gone from basketball standout to tight end prospect to defensive end force.               From Stephenson High to Michigan State to Copiah-Lincoln Community College to Mississippi State...","url":"https://bleacherreport.com/articles/2832503-whats-the-story-with-montez-sweat","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/173/451c8cfdaf41ad03a8ad3f21e0a43a84_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T12:35:48Z","content":"He has gone from basketball standout to tight end prospect to defensive end force.           \r\nFrom Stephenson High to Michigan State to Copiah-Lincoln Community College to Mississippi State.\r\nFrom Stone Mountain, Georgia, where he was raised by his grandpare… [+11323 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Steve Silverman","title":"2019 NFL Draft Rumors: Latest Updates Entering Draft Week","description":"Kyler Murray is the sure-fire No. 1 pick in the upcoming  NFL  draft Thursday, according to the majority of mock drafts and key reports around the league. However, it may not be written in stone just yet...","url":"https://bleacherreport.com/articles/2832401-2019-nfl-draft-rumors-latest-updates-entering-draft-week","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/113/hi-res-44218904ce58dc67399a626815a1822f_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T14:10:19Z","content":"Kyler Murray's status as the No. 1 pick in the NFL draft has been questioned by CBS insider Pete Prisco.Michael Conroy/Associated Press\r\nKyler Murray is the sure-fire No. 1 pick in the upcoming NFL draft Thursday, according to the majority of mock drafts and … [+4723 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Tansey","title":"2019 NFL Mock Draft: 1st-Round Predictions and Stock Watch for Hyped Prospects","description":"With a few days remaining until the 2019  NFL  draft begins, speculation is running rampant across the league...","url":"https://bleacherreport.com/articles/2832496-2019-nfl-mock-draft-1st-round-predictions-and-stock-watch-for-hyped-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/170/hi-res-87b13c937a29a07a92a9c6b99d5dfdbe_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T13:07:29Z","content":"Darron Cummings/Associated Press\r\nWith a few days remaining until the 2019 NFL draft begins, speculation is running rampant across the league. \r\nReports regarding which teams like which prospects the best and who could possibly be trade partners will flare up… [+5316 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Brent Sobleski","title":"2019 NFL Draft Features Historic Defensive Line Class","description":"The  NFL  has  never  seen anything quite like the 2019 defensive line class.    The \"Year of the Defensive Lineman\" isn't just a cute designation to drum up interest for the draft in Nashville, Tennessee...","url":"https://bleacherreport.com/articles/2832178-2019-nfl-draft-features-historic-defensive-line-class","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/788/hi-res-3279f370dce59f5266abd87837870df9_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T12:35:48Z","content":"Richard Shiro/Associated Press\r\nThe NFL has never seen anything quite like the 2019 defensive line class.\r\nThe \"Year of the Defensive Lineman\" isn't just a cute designation to drum up interest for the draft in Nashville, Tennessee. This incoming group is on t… [+8464 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"The MMQB Staff","title":"2019 NFL Draft Position Rankings: Linebackers","description":"Devin White and Devin Bush are first-round locks, but the rest of this year's LB draft class is full of question marks.","url":"https://www.si.com/nfl/2019/04/22/draft-position-rankings-linebackers-devin-white-devin-bush-mack-wilson","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/22/devin-white-lsu.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T15:56:27Z","content":"1. Devin White, LSU (Overall Rank: 8)Height: 6' 0\" | Weight: 237 poundsHe doesnt quite have the instincts of last years top linebacker prospect, Bears rising star Roquan Smith, but White brings similar athleticism. Hes still learning the positionhe was consid… [+3946 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Emily Caron","title":"The NBA Draft Decisions That Will Shape the 2019-20 College Basketball Landscape","description":"These 24 college teams have the most to gain or lose before the 2019 NBA draft's withdrawal deadline at the end of May.","url":"https://www.si.com/college-basketball/2019/04/22/nba-draft-decisions-ncaa-return-kentucky-michigan-kansas","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/22/nba-draft-decisions-2019-stay-or-go_0.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T21:46:04Z","content":"With Cassius Winston returning for Michigan State, the Spartans have their star player (and top spot in SIs way-too-early 201920 rankings) locked in. But with the new NBA draft rules allowing greater freedom for underclassmen to get a feel for their professio… [+28316 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Albert Breer","title":"Mock Draft: Kyler Murray Goes No. 1, Then Five Players Stand Out From the Pack","description":"With just four days until the draft, some decisions are becoming clear while others remain closely guarded secrets. With not enough players deserving of first-round grades to go around, here's how we see Thursday night playing out. Plus, more analysis of Russ…","url":"https://www.si.com/nfl/2019/04/22/mock-draft-kyler-murray-arizona-cardinals-nick-bosa-dwayne-haskins","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/MMQB-4-22-kyler-murray-mike-mayock-russell-wilson.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T06:14:42Z","content":"The finish line is in sight. In under 100 hours, the Cardinals will take Kyler Murray with the first pick in the 2019 NFL Draft. Or they wont. And thats sort of the story for each of the four quarterbacks atop this years classtheres a wide range of outcomes t… [+38804 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Tom Krisher","title":"Five reasons why autonomous cars aren't coming anytime soon","description":"In the world of autonomous vehicles, Pittsburgh, Phoenix and Silicon Valley are bustling hubs of development and testing. But ask those involved in self-driving vehicles when we might actually see them carrying passengers in every city, and you'll get an almo…","url":"https://phys.org/news/2019-04-autonomous-cars-anytime.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2018/1-cars.jpg","publishedAt":"2019-04-22T20:54:02Z","content":"In the world of autonomous vehicles, Pittsburgh, Phoenix and Silicon Valley are bustling hubs of development and testing. But ask those involved in self-driving vehicles when we might actually see them carrying passengers in every city, and you'll get an almo… [+6131 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Science X staff","title":"Those home-delivered meal kits are greener than you thought, new study concludes","description":"Meal kit services, which deliver a box of pre-portioned ingredients and a chef-selected recipe to your door, are hugely popular but get a bad environmental rap due to perceived packaging waste.","url":"https://phys.org/news/2019-04-home-delivered-meal-kits-greener-thought.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/meal.jpg","publishedAt":"2019-04-22T14:49:28Z","content":"Meal kit services, which deliver a box of pre-portioned ingredients and a chef-selected recipe to your door, are hugely popular but get a bad environmental rap due to perceived packaging waste.\r\nBut a new study from University of Michigan researchers found th… [+6956 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Independent Bank Corp Michigan (IBCP) Q1 2019 Earnings Call Transcript","description":"IBCP earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/22/independent-bank-corp-michigan-ibcp-q1-2019-earnin.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519970/featured-transcript-logo.png","publishedAt":"2019-04-22T18:59:35Z","content":"Image source: The Motley Fool.\r\nIndependent Bank Corp Michigan  (NASDAQ:IBCP)Q1 2019 Earnings CallApril 22, 2019, 11:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator --\r\nGood day, and welcome to th… [+36532 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Old National Bancorp (ONB) Q1 2019 Earnings Conference Call Transcript","description":"ONB earnings call for the period ending December 31, 2018.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/22/old-national-bancorp-onb-q1-2019-earnings-conferen.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519938/featured-transcript-logo.png","publishedAt":"2019-04-22T16:02:18Z","content":"Image source: The Motley Fool.\r\nOld National Bancorp  (NASDAQ:ONB)Q1 2019 Earnings Conference CallApril 22, 2019, 8:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nWelcome to the Old National Ban… [+32712 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"TCF Financial Corporation (TCF) Q1 2019 Earnings Conference Call Transcript","description":"TCF earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/22/tcf-financial-corporation-tcf-q1-2019-earnings-con.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519963/featured-transcript-logo.png","publishedAt":"2019-04-22T18:22:05Z","content":"Image source: The Motley Fool.\r\nTCF Financial Corporation  (NYSE:TCF)Q1 2019 Earnings Conference CallApril 22, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning and welcome to… [+55278 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Lincoln Electric Holdings Inc (LECO) Q1 2019 Earnings Call Transcript","description":"LECO earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/22/lincoln-electric-holdings-inc-leco-q1-2019-earning.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519969/featured-transcript-logo.png","publishedAt":"2019-04-22T18:55:49Z","content":"Image source: The Motley Fool.\r\nLincoln Electric Holdings Inc  (NASDAQ:LECO)Q1 2019 Earnings CallApril 22, 2019, 10:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGreetings, and welcome to the L… [+48284 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Devin White, Drew Lock are Giants' most likely picks in first round","description":"With 12 picks, including two in the first round, the Giants are in position to land a defensive playmaker and their future starting QB on Thursday.","url":"http://www.espn.com/blog/new-york-giants/post/_/id/58877/devin-white-drew-lock-are-giants-most-likely-picks-in-first-round","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1015%2Fr447484_1296x729_16%2D9.jpg","publishedAt":"2019-04-22T12:37:57Z","content":"EAST RUTHERFORD, N.J. -- The New York Giants are rich in terms of draft capital. They have the goods in the first round of the NFL draft with the No. 6 and No. 17 overall picks.\r\nWhich direction will they go?\r\nLet's try to dissect it all with an exercise that… [+8983 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"2019 NFL draft features: In-depth stories on the top prospects","description":"Catch up on the stories behind the 2019 draft's best prospects and most interesting personalities.","url":"http://www.espn.com/nfl/draft2019/story/_/id/26378822/2019-nfl-draft-features-depth-stories-top-prospects","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0418%2Fquinnenwilliams1_ms_16x9.jpg","publishedAt":"2019-04-22T01:07:28Z","content":"As the 2019 NFL draft nears, ESPN.com over the next month is telling in-depth feature stories on several of the top prospects. Check back here throughout the month to read more.\r\nThe draft begins April 25 at 8 p.m. ET on ESPN, ABC and the ESPN App. Coverage c… [+24289 chars]"},{"source":{"id":null,"name":"Grist.org"},"author":"Oliver Milman","title":"Trump issues Earth Day message without mentioning climate change","description":"How does Trump celebrate Earth Day? He pats himself on the back for the U.S.'s \"strong market economy.\"","url":"http://grist.org/article/trump-issues-earth-day-message-without-mentioning-climate-change/","urlToImage":"https://grist.files.wordpress.com/2019/04/gettyimages-626377824-e1555961139244.jpg?w=1200&h=675&crop=1","publishedAt":"2019-04-22T19:42:22Z","content":"Thisstory was originally published by The Guardian and is reproduced here as part of theClimate Desk collaboration.\r\nDonald Trump issued on Monday an Earth Day proclamation that omitted any mention of climate change or the cavalcade of environmental threats p… [+3779 chars]"},{"source":{"id":null,"name":"People.com"},"author":"KC Baker","title":"Mich. Dad Allegedly Shot 2-Year-Old Son in Face with Shotgun During Argument with Mom","description":"A 2-year-old Michigan boy is fighting for his life after his father allegedly shot him in the face with a shotgun intentionally during an argument with the child’s mother, say prosecutors. Michael Glance, 32, of Blackman Township is charged with three counts …","url":"https://people.com/crime/michigan-dad-allegedly-shot-son-face-shotgun-during-argument-mom/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/baby-ryker.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630","publishedAt":"2019-04-22T16:41:12Z","content":"A 2-year-old Michigan boy is fighting for his life after his father allegedly shot him in the face with a shotgun intentionally during an argument with the child’s mother, say prosecutors.\r\nMichael Glance, 32, of Blackman Township is charged with three counts… [+2710 chars]"},{"source":{"id":null,"name":"Nakedcapitalism.com"},"author":"Lambert Strether","title":"2:00PM Water Cooler 4/22/2019","description":"By Lambert Strether of Corrente. Trade “China Isn’t Cheating on Trade” [Peter Beinart, The Atlantic]. “From Elizabeth Warren, who earlier this year claimed that China has “weaponized its economy,” to Marco Rubio, who last year tweeted that the Chinese aim to …","url":"https://www.nakedcapitalism.com/2019/04/200pm-water-cooler-4-22-2019.html","urlToImage":"https://www.nakedcapitalism.com/wp-content/uploads/2019/04/activists.jpg","publishedAt":"2019-04-22T18:00:48Z","content":"By Lambert Strether of Corrente.\r\nTrade\r\n“China Isn’t Cheating on Trade” [Peter Beinart, The Atlantic]. “From Elizabeth Warren, who earlier this year claimed that China has “weaponized its economy,” to Marco Rubio, who last year tweeted that the Chinese aim t… [+20270 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Robin Seaton Jefferson, Contributor, Robin Seaton Jefferson, Contributor https://www.forbes.com/sites/robinseatonjefferson/","title":"Americans Over 65 'Probably Aren't Going To Get The Measles,' But Geriatrician Says Check Anyway","description":"If you’re an older adult and unsure about your vaccination status, especially if you live in or are planning to travel to a high-risk area, it’s important to talk to your doctor.","url":"https://www.forbes.com/sites/robinseatonjefferson/2019/04/22/americans-over-65-probably-arent-going-to-get-the-measles-but-geriatrician-says-check-anyway/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1133827018%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T19:35:00Z","content":"Even with the United States edging toward a record number of measles cases in a single year since the disease was declared eliminated in 2000, one physician says seniors likely have little to worry about.The Centers for Disease Control and Prevention (CDC) to… [+7443 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jeff Kart, Contributor, Jeff Kart, Contributor https://www.forbes.com/sites/jeffkart/","title":"New Foundation Raising Funds To Keep Glass Bottles Out Of Landfills","description":"Glass can be endlessly recycled. But too many glass bottles end up in landfills. The first-of-its-kind Glass Recycling Foundation plans to help fund city programs to increase glass recycling.","url":"https://www.forbes.com/sites/jeffkart/2019/04/22/new-foundation-raising-funds-to-keep-glass-bottles-out-of-landfills/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fjeffkart%2Ffiles%2F2019%2F04%2Ffile-4-1200x900.jpeg","publishedAt":"2019-04-22T21:14:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nNew glass bottles on the production line which were produced with recycled glass.\r\nStrategic Materials\r\nGlass has value. It doesn't belong in landfills. If residents want to recycle glass in their commun… [+6615 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Fernando Alfonso III, Contributor, Fernando Alfonso III, Contributor https://www.forbes.com/sites/fernandoalfonso/","title":"Revisiting The Childhood Classic 'The True Story Of The 3 Little Pigs!' 30 Years Later","description":"Published in 1989, “The True Story of the 3 Little Pigs!” has sold more than 4 million copies thanks to its whimsical tale and surreal illustrations.","url":"https://www.forbes.com/sites/fernandoalfonso/2019/04/22/revisiting-the-childhood-classic-the-true-story-of-the-3-little-pigs-30-years-later/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Ffernandoalfonso%2Ffiles%2F2019%2F04%2Fpigs-book-1200x900.jpg","publishedAt":"2019-04-22T13:55:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nPublished in 1989, The True Story of the 3 Little Pigs!&amp;nbsp;has sold more than 4 million copies thanks to its whimsical tale and surreal illustrations.\r\nFernando Alfonso III\r\nToward the end of The T… [+9322 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"JJ Kinahan, Contributor, JJ Kinahan, Contributor https://www.forbes.com/sites/jjkinahan/","title":"As Earnings Season Rolls On, Many Companies Have Beaten Expectations","description":"Lots of big-name earnings are on tap this week, as well as the government’s first crack at GDP.","url":"https://www.forbes.com/sites/jjkinahan/2019/04/22/as-earnings-season-rolls-on-many-companies-have-beaten-expectations/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fjjkinahan%2Ffiles%2F2019%2F04%2FCapture.png","publishedAt":"2019-04-22T13:58:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAfter returning from a long weekend, investors and traders appear to be gearing up for a busy week on the earnings front as they continue awaiting a potential trade deal between the United States and Chi… [+13119 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Kate Harrison, Contributor, Kate Harrison, Contributor https://www.forbes.com/sites/kateharrison/","title":"Earth Day Spotlight: Interview With The Founder And CEO Of Happy Family Organics","description":"Happy Baby is a leader in the organic baby food space. How did they do it while sticking to their values?","url":"https://www.forbes.com/sites/kateharrison/2019/04/22/earth-day-spotlight-interview-with-the-founder-and-ceo-of-happy-family-organics/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1129729233%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T18:30:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nhappy baby and mother at dinnertime\r\nGetty\r\nFor years my kids have loved Happy Family Organics &amp;nbsp;HappyBaby products from their puffs to their pouches (which I confess have become an emergency adu… [+20797 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Andrew DePietro, Contributor, Andrew DePietro, Contributor https://www.forbes.com/sites/andrewdepietro/","title":"A 30-Year Look At America's Money Since The End Of The Cold War","description":"It's been 30 years since 1989, when a wave of revolutions totally dismantled the decades-old Cold War system. But how has Americans' finances fared since?","url":"https://www.forbes.com/sites/andrewdepietro/2019/04/22/money-end-cold-war/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F138c464aff6e441a8950f12984b975c6%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T16:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\n2017 AP YEAR END PHOTOS - U.S. President Donald Trump meets with Russian President Vladimir Putin at the G-20 Summit on July 7, 2017, in Hamburg. Trump and Putin met for more than two hours. (AP Photo/Ev… [+53403 chars]"},{"source":{"id":null,"name":"Project-syndicate.org"},"author":"Elizabeth Drew","title":"Trump Is Guilty as Not Charged","description":"The report by US special counsel Robert Mueller shows that a criminal approach to links between President Donald Trump's 2016 election campaign and Russian interference on his behalf never made much sense. An independent commission would have conducted a more…","url":"https://www.project-syndicate.org/commentary/mueller-report-trump-guilty-but-not-charged-by-elizabeth-drew-2019-04","urlToImage":"https://webapi.project-syndicate.org/library/b23d488c486df1e504d2321ecbcb67db.2-1-super.1.jpg","publishedAt":"2019-04-22T16:21:52Z","content":"The report by US special counsel Robert Mueller shows that a criminal approach to links between President Donald Trump's 2016 election campaign and Russian interference on his behalf never made much sense. An independent commission would have conducted a more… [+7853 chars]"},{"source":{"id":null,"name":"Atlasobscura.com"},"author":"ugc","title":"Mission Creek Indian Cemetery in Mount Pleasant, Michigan","description":"This peaceful American Indian cemetery, abutting Mission Creek, contains only a few headstones or grave markers. The most well-known person laid to rest here is Chief Shaw-Shaw-Waw-Nay-Beece, also known as \"the Swallow.\" Chief Shaw-Shaw-Waw-Nay-Beece was inst…","url":"https://www.atlasobscura.com/places/mission-creek-indian-cemetery","urlToImage":"https://assets.atlasobscura.com/media/W1siZiIsInVwbG9hZHMvcGxhY2VfaW1hZ2VzL2RiOTJkZGQ3LWUxN2MtNDljMS04OGUwLWZhNDJhMjExZjNjZjlhNjc3MDRiZDE5NGE4Y2ZmZV9JTUdfMjAxOTA0MTJfMTkzNjE3LmpwZyJdLFsicCIsImNvbnZlcnQiLCIiXSxbInAiLCJjb252ZXJ0IiwiLXF1YWxpdHkgODEgLWF1dG8tb3JpZW50Il0sWyJwIiwidGh1bWIiLCI2MDB4PiJdXQ/IMG_20190412_193617.jpg","publishedAt":"2019-04-22T22:00:00Z","content":"We value your privacy\r\nAtlas Obscura and our trusted partners use technology such as cookies on our website to personalise ads, support social media features, and analyse our traffic. Please click below to consent to the use of this technology while browsing … [+76 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":null,"title":"Supreme Court to Decide Whether Bias Law Covers Gay and Transgender Workers - The New York Times","description":"Supreme Court to Decide Whether Bias Law Covers Gay and Transgender Workers The New York Times Supreme Court to decide if anti-discrimination employment laws protect on basis of sexual orientation and gender identity The Washington Post Supreme Court agrees t…","url":"https://www.nytimes.com/2019/04/22/us/politics/supreme-court-gay-transgender-employees.html","urlToImage":"https://static01.nyt.com/images/2019/04/22/us/politics/22dc-scotus-bias/22dc-scotus-bias-facebookJumbo.jpg","publishedAt":"2019-04-22T13:41:15Z","content":"The New York case was brought by a sky-diving instructor who said he was fired because he was gay. The United States Court of Appeals for the Second Circuit concluded that sexual orientation discrimination is motivated, at least in part, by sex and is thus a … [+1205 chars]"},{"source":{"id":null,"name":"11alive.com"},"author":null,"title":"Wife of UGA legend, NFL star Matthew Stafford has surgery to remove brain tumor - 11Alive.com WXIA","description":"Wife of UGA legend, NFL star Matthew Stafford has surgery to remove brain tumor 11Alive.com WXIA Matthew Stafford’s wife recovering from brain surgery, learning her ‘new normal’ Fox News Kelly Stafford returns home after brain surgery FOX 47 News Kelly Staffo…","url":"https://www.11alive.com/article/sports/college/georgia-bulldogs/wife-of-uga-legend-nfl-star-matthew-stafford-has-surgery-to-remove-brain-tumor/85-971e94f9-f931-4e1e-9ab5-6138514965f7","urlToImage":"https://media.11alive.com/assets/WXIA/images/dfeb7924-7231-4ad9-ab93-ad756278ab22/dfeb7924-7231-4ad9-ab93-ad756278ab22_1140x641.jpg","publishedAt":"2019-04-22T03:32:00Z","content":"Kelly Stafford, the wife of Detroit Lions quarterback and former UGA legend Matthew Stafford, has returned to the couple's Michigan home this holiday weekend, after enduring the 12-hour surgery to have a brain tumor removed.\r\nAccording to Stafford, the operat… [+1761 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/diana-stancy-correll","title":"Militia leader allegedly said group was 'training' to kill Obama, Clinton, and Soros - Washington Examiner","description":"Militia leader allegedly said group was 'training' to kill Obama, Clinton, and Soros Washington Examiner Leader of militia detaining migrants allegedly said group trained to assassinate Soros, Clinton, Obama, complaint says NBC News Larry Mitchell Hopkins: Le…","url":"https://www.washingtonexaminer.com/news/militia-leader-allegedly-said-group-was-training-to-kill-obama-clinton-and-soros","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/9c5d0da/2147483647/strip/true/crop/1060x557+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Ffb%2F0e%2F50679a0f43b5be47065cb4a8da7b%2Fobama-clinton-soros.jpg","publishedAt":"2019-04-22T22:13:00Z","content":"Larry Mitchell Hopkins, a militia leader in New Mexico who was arrested by the FBI over the weekend on weapons charges, allegedly said his group was plotting to assassinate President Barack Obama, Hillary Clinton, and other liberal figures.\r\nDocuments unseale… [+1827 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Joe Peters","title":"Avenatti allegedly embezzled Hassan Whiteside's settlement - AOL","description":"Avenatti allegedly embezzled Hassan Whiteside's settlement AOL Avenatti accused of embezzling nearly $2 million that NBA player paid ex-girlfriend Los Angeles Times Michael Avenatti accused of embezzling almost $2M from girlfriend of NBA player Fox News Avena…","url":"https://www.aol.com/article/news/2019/04/22/avenatti-allegedly-embezzled-hassan-whitesides-settlement/23715375/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/2333x1530+0+104/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2F1812bab0-6515-11e9-a1df-e3cad6ac8478","publishedAt":"2019-04-22T15:05:19Z","content":"When Michael Avenattis name pops up these days, you can be pretty sure its not for a good reason.\r\nThe embattled attorney became even more embattled over the weekend when the L.A. Times reported that he took a significant portion of a $3 million settlement th… [+5362 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Rachel Kleinman","title":"Supreme Court to rule whether civil rights law bans discrimination against LGBTQ employees - AOL","description":"Supreme Court to rule whether civil rights law bans discrimination against LGBTQ employees AOL Supreme Court takes up job discrimination cases that could settle whether LGBT workers are protected by law CNBC Supreme Court Will Decide Whether Employment Discri…","url":"https://www.aol.com/article/news/2019/04/22/supreme-court-to-rule-whether-civil-rights-law-bans-discrimination-against-lgbtq-employees/23715509/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/6238x4089+0+61/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-01%2F47550490-137b-11e9-aeef-2a9d1045c721","publishedAt":"2019-04-22T20:13:40Z","content":"WASHINGTON The Supreme Court said Monday it will decide whether existing civil rights laws ban discrimination on the basis of sexual orientation, a question that has divided the nation's lower courts.\r\nFederal law forbids workplace discrimination on the basis… [+6191 chars]"},{"source":{"id":null,"name":"Scotusblog.com"},"author":"Adam Feldman","title":"Empirical SCOTUS: Advocates who drive the justices’ votes","description":"Scholars of the Supreme Court often debate the role of lawyers in Supreme Court decision-making. For an attitudinalist, the justices’ preferences make all (or at least most of) the difference. According to this theory, justices will often vote based on their …","url":"https://www.scotusblog.com/2019/04/empirical-scotus-advocates-who-drive-the-justices-votes/","urlToImage":"https://www.scotusblog.com/wp-content/uploads/2019/04/3-1.png","publishedAt":"2019-04-22T18:59:34Z","content":"Scholars of the Supreme Court often debate the role of lawyers in Supreme Court decision-making. For an attitudinalist, the justices preferences make all (or at least most of) the difference. According to this theory, justices will often vote based on their p… [+13791 chars]"},{"source":{"id":null,"name":"Slate.com"},"author":"Mary Harris","title":"The Political Case for Impeachment","description":"Politics isn’t as static as its leaders sometimes think.","url":"https://slate.com/news-and-politics/2019/04/political-case-for-impeachment-after-mueller-report.html","urlToImage":"https://compote.slate.com/images/925d7862-7a14-4413-a1d4-f5b8b44a6781.jpeg?width=780&height=520&rect=1560x1040&offset=0x0","publishedAt":"2019-04-22T18:05:21Z","content":"House Speaker Nancy Pelosi at the U.S. Capitol on March 27.\r\nIn the wake of the Mueller report, youve probably heard the legal argument for starting impeachment proceedings against President Donald Trump. Perhaps youve also heard the moral argument for impeac… [+13726 chars]"},{"source":{"id":null,"name":"Democracynow.org"},"author":"mail@democracynow.org (Democracy Now!)","title":"Dallas Goldtooth: Hold Banks Accountable for Financing Climate Chaos & Violating Indigenous Rights","description":"As millions celebrate Earth Day around the globe, we speak with organizer Dallas Goldtooth about indigenous-led anti-pipeline activism in the United States. President Trump signed two executive orders earlier this month to facilitate the approval of pipeline …","url":"https://www.democracynow.org/2019/4/22/dallas_goldtooth_hold_banks_accountable_for","urlToImage":"https://www.democracynow.org/images/story/20/47120/full_hd/SEG3-Goldtooth-WaterIsLife-Split.jpg","publishedAt":"2019-04-22T12:48:49Z","content":"AMYGOODMAN: This is Democracy Now! I’m Amy Goodman. Millions around the world are celebrating Earth Day today, following a week of enormous climate activism here in the U.S. and abroad. In the United Kingdom, nearly 1,000 people have been arrested after a wee… [+9466 chars]"},{"source":{"id":null,"name":"Abovethelaw.com"},"author":"Evan Gibbs","title":"Supreme Court To Likely Resolve LGBTQ Title VII Issues","description":"The high court will finally settle the circuit-splitting issue.","url":"https://abovethelaw.com/2019/04/supreme-court-to-likely-resolve-lgbtq-title-vii-issues/","urlToImage":"https://abovethelaw.com/uploads/2015/07/rainbow-flag-at-Supreme-Court-SCOTUS-gay-marriage-same-sex-marriage-Obergefell-v-Hodges.jpg","publishedAt":"2019-04-22T20:43:27Z","content":"(Photo by Ted Eytan / Flickr)\r\nSCOTUS indicated today that it will finally settle the circuit-splitting issue of whether gay and transgender status falls under the protection of Title VII. The Court signaled this when it agreed on April 22, 2019, to hear thre… [+3740 chars]"},{"source":{"id":null,"name":"Thechive.com"},"author":"Dustin","title":"Parents trash guy’s $29,000 porn collection (7 Photos)","description":"There are so many levels to this I'm not sure where to start, so I'll just dive right the fuck in. A dude in Michigan is suing his parents for throwing away his $29,000 porn collection. $29,000. Twenty-nine and three zeros! Oh wait, it gets better, but first …","url":"https://thechive.com/2019/04/22/parents-trash-guys-29000-porn-collection/","urlToImage":"https://thechive.files.wordpress.com/2019/04/thats-a-lot-of-porn-full-lead.jpg?quality=85&strip=info","publishedAt":"2019-04-22T23:30:13Z","content":"We can see you're using Adblocker. Block everybody else, but we thought we were friends. Please click Yes below to whitelist us, so we can keep doing our best to show you half-naked ladies and funny Internet memes. It's what any friend would do.\r\nNo, thank you"},{"source":{"id":null,"name":"Freep.com"},"author":"Ryan Ford","title":"Meet the Big Ten's NFL draft G.O.A.T.s (even beyond Tom Brady) - Detroit Free Press","description":"Meet the Big Ten's NFL draft G.O.A.T.s (even beyond Tom Brady) Detroit Free Press Montez Sweat fits the Buffalo Bills prototype at defensive end Buffalo Rumblings Jonah Williams' unique preparation could make him the NFL draft's top tackle ESPN 2019 Buccaneer…","url":"https://www.freep.com/story/sports/nfl/lions/2019/04/22/best-nfl-players-big-ten-conference/3532958002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2018/10/31/USAT/b72e49b0-bae3-43f3-a9a7-03044e9b3f53-AP_Fearsome_Players_Football_1.JPG?crop=1298,730,x312,y67&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T10:01:00Z","content":"Dave Birkett and Carlos Monarrez break down what they heard from the Detroit Lions on Tuesday, April 16, 2019, in Allen Park.\r\n Carlos Monarrez and Dave Birkett, Detroit Free Press\r\nIt’s NFL draft week once again and this year the draft is in Nashville, deep … [+17786 chars]"},{"source":{"id":null,"name":"Cornnation.com"},"author":"ranchbabe","title":"2019 NFL Draft Profile: Nebraska Cornhuskers Wide Receiver Stanley Morgan - Corn Nation","description":"2019 NFL Draft Profile: Nebraska Cornhuskers Wide Receiver Stanley Morgan Corn Nation 2019 NFL Draft: Can the Giants afford to pass on Dwayne Haskins? | First Take ESPN The Race to Make the NFL Draft an Exact Science The Ringer Will Harris NFL Draft Tape | Bo…","url":"https://www.cornnation.com/2019/4/22/18507687/2019-nfl-draft-profile-wide-receiver-stanley-morgan-nebraska-cornhuskers-wideout-career-records","urlToImage":"https://cdn.vox-cdn.com/thumbor/ivibifzLy5GUu0ViCAGINnxQimo=/0x0:1500x785/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/4242805/MSU_FB_15-65.0.jpg","publishedAt":"2019-04-22T18:02:00Z","content":"Stanley Morgan Jr. could have gone pro after his junior season, but new coach Scott Frost got some welcome news last winter when Morgan announced that he would come back to Nebraska to play his senior year. Stanley already held the single season receiving rec… [+5020 chars]"},{"source":{"id":null,"name":"Watchdog.org"},"author":"Tyler Arnold &#124; Watchdog.org","title":"Study: Holland, Michigan best small city to open up a business - Watchdog.org","description":"Study: Holland, Michigan best small city to open up a business Watchdog.org Holland, Michigan, is the best small city in the country to open up a business, according to a WalletHub study released Monday.","url":"https://www.watchdog.org/michigan/study-holland-michigan-best-small-city-to-open-up-a/article_8b5bcd10-654a-11e9-85cb-4f2015616a64.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/watchdog.org/content/tncms/assets/v3/editorial/c/31/c319aa72-3cb2-593b-889b-377f9433025b/5a15a28b49833.image.jpg?resize=949%2C630","publishedAt":"2019-04-22T22:33:00Z","content":"Holland, Michigan, is the best small city in the country to open up a business, according to a WalletHub study released Monday.\r\nThe study classified a small city as any city with a population between 25,000 and 100,000, and 1,261 American cities fit this cri… [+2347 chars]"},{"source":{"id":null,"name":"Wtop.com"},"author":"The Associated Press","title":"What happens when a big business tries to take over and rename a neighborhood - WTOP","description":"What happens when a big business tries to take over and rename a neighborhood WTOP The Conversation is an independent and nonprofit source of news, analysis and commentary from academic experts.) Raechel A. Portelli, Michigan State...","url":"http://wtop.com/real-estate/2019/04/what-happens-when-a-big-business-tries-to-take-over-and-rename-a-neighborhood/","urlToImage":"https://wtop.com/wp-content/uploads/2017/04/wtop_logo_512x512.png","publishedAt":"2019-04-22T11:09:47Z","content":"(The Conversation is an independent and nonprofit source of news, analysis and commentary from academic experts.)\r\nRaechel A. Portelli, Michigan State University\r\n(THE CONVERSATION) What if Google tried to rename your neighborhood?\r\nThat happened to some Cali… [+6687 chars]"},{"source":{"id":null,"name":"Umich.edu"},"author":null,"title":"Why business shouldn't fear the Green New Deal - University of Michigan News","description":"One of the hottest topics in current public debate is the Green New Deal. The plan outlines ambitious goals for a more sustainable country by eliminating carbon pollution, expanding transportation alternatives, and more.\r\n\r\n\r\n\r\nTom Lyon, a University of Michi…","url":"https://news.umich.edu/why-business-shouldnt-fear-the-green-new-deal/","urlToImage":"https://news.umich.edu/wp-content/uploads/2019/04/why-business-shouldnt-fear-the-green-new-deal-lead.png","publishedAt":"2019-04-22T14:50:30Z","content":"One of the hottest topics in current public debate is the Green New Deal. The plan outlines ambitious goals for a more sustainable country by eliminating carbon pollution, expanding transportation alternatives, and more.\r\nTom Lyon\r\nTom Lyon, a University of M… [+6376 chars]"},{"source":{"id":null,"name":"Grbj.com"},"author":null,"title":"West Michigan town is No. 1 'small city to start a business' in US - grbj.com","description":"West Michigan town is No. 1 'small city to start a business' in US grbj.com A town in the region has been ranked as the most business-friendly small city in the nation. Holland tops the 2019 ranking of “Best Small Cities to Start a...","url":"https://www.grbj.com/articles/93174-west-michigan-town-is-no-1-small-city-to-start-a-business-in-us","urlToImage":null,"publishedAt":"2019-04-22T19:49:59Z","content":null},{"source":{"id":null,"name":"Freep.com"},"author":"Aleanna Siacon","title":"Holland is America's best small city to start a business, study says - Detroit Free Press","description":"Holland is America's best small city to start a business, study says Detroit Free Press WalletHub reviewed more than 1200 small cities across the U.S. via 18 metrics and ranked Holland, Mich. the best for starting a business.","url":"https://www.freep.com/story/news/local/michigan/2019/04/22/holland-michigan-starting-business/3537012002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/PDTF/60c65b34-1038-4f1b-bf61-caa214cf5461-Holland_Mich_3_JPG_1_1_.JPG?crop=3263,1835,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T14:13:00Z","content":"After reviewing more than 1,200 cities with less than 100,000 residents across the U.S., personal-finance site WalletHub says Holland, Michigan is the best small city to start a business. \r\nAccording to WalletHub, their ranking of small cities came from a rev… [+1642 chars]"},{"source":{"id":null,"name":"Twincities.com"},"author":"Pioneer Press","title":"Business People: Sunday, April 21 - St. Paul Pioneer Press","description":"Business People: Sunday, April 21 St. Paul Pioneer Press Arden Hills-based farmer co-op and dairy-goods brand Land O'Lakes announced that Pete Kappelman joined the company as senior vice president, member...","url":"https://www.twincities.com/2019/04/21/business-people-sunday-april-21/","urlToImage":"https://www.twincities.com/wp-content/themes/twincities/static/images/twincities.jpg","publishedAt":"2019-04-22T04:17:00Z","content":"AGRICULTURE\r\nArden Hills-based farmer co-op and dairy-goods brand Land O’Lakes announced that Pete Kappelman joined the company as senior vice president, member and government relations.\r\nCONSTRUCTION\r\nLS Black Constructors, St. Paul, announced the addition o… [+8351 chars]"},{"source":{"id":null,"name":"Calaverasenterprise.com"},"author":"Dakota Morlan","title":"'Earth Science Emporium' highlights importance of geology | Business - Calaveras Enterprise","description":"'Earth Science Emporium' highlights importance of geology | Business Calaveras Enterprise Russ and Pamela Shoemaker retired almost 20 years ago, but it didn't last. The couple sold the old Murphys General Store building that housed their beloved...","url":"http://www.calaverasenterprise.com/business/article_982af78c-61f3-11e9-a133-5b5e113bf7dd.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/calaverasenterprise.com/content/tncms/assets/v3/editorial/1/64/1644c58a-61f4-11e9-a872-07aeb95c4639/5cb8a13ae6f20.image.jpg?resize=859%2C630","publishedAt":"2019-04-22T16:14:00Z","content":"Russ and Pamela Shoemaker retired almost 20 years ago, but it didnt last. The couple sold the old Murphys General Store building that housed their beloved rock shop and took off on the road, traveling the entire perimeter of the United States and collecting s… [+5512 chars]"},{"source":{"id":null,"name":"Wdet.org"},"author":null,"title":"Canton Chamber President Says the Township's Business Climate Remains Strong - WDET","description":"Canton Chamber President Says the Township's Business Climate Remains Strong WDET Throughout the month of April, WDET is focusing on Canton as part of its “Crossing the Lines” series. The project examines what separates us and unites us as a...","url":"https://wdet.org/posts/2019/04/22/88104-canton-chamber-president-says-the-townships-business-climate-remains-strong/","urlToImage":"https://wdet.org/media/wdet/assets/2019/04/10/Canton_community_sign_040919.JPG","publishedAt":"2019-04-22T22:04:19Z","content":"Throughout the month of April, WDET is focusing on Canton as part of its “Crossing the Lines” series.  The project examines what separates us and unites us as a region.\r\nCanton has seen dramatic growth in recent years, both in terms of residents, and in terms… [+4102 chars]"},{"source":{"id":null,"name":"Theblaze.com"},"author":"Mike Ciandella","title":"In case with far-reaching implications, Supreme Court will rule on whether LGBT status is a protected class under the Civil Rights Act","description":"The Supreme Court has agreed to rule on whether or not the Civil Rights Act needs further clarification to include LGBT people specifically as a protected class. What's the background? Title VII of the 1964 Civil Rights Act \"prohibits employment discriminatio…","url":"https://www.theblaze.com/supreme-court-to-rule-on-lgbt-rights-case","urlToImage":"https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19410034%2F1200x600.jpg/2000%2C2000/KGn7nIinEC6JjNJM/img.jpg","publishedAt":"2019-04-22T18:38:47Z","content":"The Supreme Court has agreed to rule on whether or not the Civil Rights Act needs further clarification to include LGBT people specifically as a protected class.\r\nWhat's the background?\r\nTitle VII of the 1964 Civil Rights Act \"prohibits employment discriminat… [+1867 chars]"},{"source":{"id":null,"name":"Theblaze.com"},"author":"Dave Urbanski","title":"'Simply inexcusable': Mom sentenced after running over son, 9, while trying to shake him loose of car door handle in school parking lot","description":"A mother heard her sentence in a Michigan courtroom Thursday after an incident last December in which she used her car to shake loose her 9-year-old son's grip on the door handle in a school parking lot and then ran over him, fracturing his skull and breaking…","url":"https://www.theblaze.com/news/mom-sentenced-after-running-over-son-while-trying-to-shake-him-loose-of-car-door","urlToImage":"https://theblaze-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19410903%2F1200x600.jpg/2000%2C2000/6qZVZzx1T7BAuLFj/img.jpg","publishedAt":"2019-04-22T22:05:08Z","content":"A mother heard her sentence in a Michigan courtroom Thursday after an incident last December in which she used her car to shake loose her 9-year-old son's grip on the door handle in a school parking lot and then ran over him, fracturing his skull and breaking… [+3366 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Melissa Locker","title":"The Supreme Court will finally weigh in on federal job protections for LGBTQ workers","description":"It’s the next big hurdle in equal rights for all. The Supreme Court has accepted a case that could determine whether members of the LGBTQ community are entitled to federal job protections, AP reports. Read Full Story","url":"https://www.fastcompany.com/90338244/the-supreme-court-will-finally-weigh-in-on-federal-job-protections-for-lgbtq-workers?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcocreate%2Ffeed+%28Co.Create%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-supreme-court-to-weigh-in-on-lgbtq-job-protections.jpg","publishedAt":"2019-04-22T12:51:08Z","content":"The Supreme Court has accepted a case that could determine whether members of the LGBTQ community are entitled to federal job protections, AP reports.The justices will hear arguments from arising from three cases involving alleged job discrimination against g… [+1903 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By julia.arciga@thedailybeast.com (Julia Arciga)","title":"New Mexico Border Militia Leader Allegedly Said Group Planned to Assassinate Obama, Clinton","description":"PAUL RATJE The border militia leader who was arrested in New Mexico over the weekend on weapons charges allegedly said that his far-right group was training to kill prominent Democratic figures because of their “support of Antifa.” According to an arrest warr…","url":"https://www.thedailybeast.com/larry-mitchell-hopkins-border-militia-leader-allegedly-said-group-was-training-to-assassinate-obama-clinton","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2812,w_5000,x_0,y_494/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555961704/GettyImages-1132938248_yrzuew","publishedAt":"2019-04-22T19:49:13Z","content":"The border militia leader who was arrested in New Mexico over the weekend on weapons charges allegedly said that his far-right group was training to kill prominent Democratic figures because of their support of Antifa.\r\nAccording to an arrest warrant for Larr… [+2160 chars]"},{"source":{"id":null,"name":"Billboard.com"},"author":"Harley Brown","title":"Live Nation Not Responsible for Drunk Festivalgoers Injuring Themselves, Rules Appeals Court","description":"A Michigan appeals court has ruled that drunk festivalgoers have only themselves to blame for getting injured following a day of drinking at a...","url":"https://www.billboard.com/articles/business/legal-and-management/8508178/live-nation-drunk-festivalgoers-not-responsible-appeals-ruling","urlToImage":"https://www.billboard.com/files/media/drink-concert-billboard-1548.jpg","publishedAt":"2019-04-22T21:24:00Z","content":"A Michigan appeals court has ruled that drunk festivalgoers have only themselves to blame for getting injured following a day of drinking at a music event.\r\nIn 2016, a woman named Brandi Roe sued Live Nation and Michigan International Speedway (MIS) for break… [+1928 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Melissa Locker","title":"The Supreme Court will finally weigh in on federal job protections for LGBTQ workers","description":"It’s the next big hurdle in equal rights for all. The Supreme Court has accepted a case that could determine whether members of the LGBTQ community are entitled to federal job protections, AP reports. Read Full Story","url":"https://www.fastcompany.com/90338244/the-supreme-court-will-finally-weigh-in-on-federal-job-protections-for-lgbtq-workers?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcoexist%2Ffeed+%28Co.Exist%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-1-supreme-court-to-weigh-in-on-lgbtq-job-protections.jpg","publishedAt":"2019-04-22T12:51:08Z","content":"The Supreme Court has accepted a case that could determine whether members of the LGBTQ community are entitled to federal job protections, AP reports.The justices will hear arguments from arising from three cases involving alleged job discrimination against g… [+1903 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Transcripts","title":"Independent Bank Corporation (IBCP) CEO Brad Kessel on Q1 2019 Results - Earnings Call Transcript","description":"Independent Bank Corporation (NASDAQ:IBCP) Q1 2019 Earnings Conference Call April 22, 2019 11:00 AM ET Company Participants Brad Kessel - President and CEO Rob","url":"https://seekingalpha.com/article/4255740-independent-bank-corporation-ibcp-ceo-brad-kessel-q1-2019-results-earnings-call-transcript","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-22T17:40:08Z","content":"Independent Bank Corporation (NASDAQ:IBCP) Q1 2019 Earnings Conference Call April 22, 2019 11:00 AM ET\r\nCompany Participants\r\nBrad Kessel - President and CEO\r\nRob Shuster - EVP and CFO\r\nConference Call Participants\r\nBrendan Nosal - Sandler O'Neill\r\nDamon DelM… [+32479 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"In Michigan, developer cancels plan for large Upper Peninsula wind project","description":"Citing planning delays, a global renewable energy developer has canceled plans for a major wind project in Michigan’s Upper Peninsula.","url":"http://feedproxy.google.com/~r/RenewableEnergyNewsRssFeed/~3/bkLlOqMhgsc/in-michigan-developer-cancels-plan-for-large-upper-peninsula-wind-project.html","urlToImage":null,"publishedAt":"2019-04-22T13:24:05Z","content":null},{"source":{"id":"vice-news","name":"Vice News"},"author":"Tess Owen, VICE News","title":"FBI arrests \"dangerous felon\" and leader of armed militia group detaining migrants","description":"Larry Mitchell Hopkins, 69, who heads the United Constitutional Patriots militia, was taken into custody on Saturday.","url":"https://news.vice.com/en_us/article/mb8ad4/fbi-arrests-dangerous-felon-and-leader-of-armed-militia-group-detaining-migrants","urlToImage":"https://video-images.vice.com/articles/5cbdc80c9e85b200078275a1/lede/1555945615433-AP_18325684411529.jpeg?crop=1xw:0.75xh;center,center","publishedAt":"2019-04-22T15:07:43Z","content":"The FBI has arrested the leader of the right-wing armed militia thats been detaining migrants near the New Mexico border. Hes expected in federal court on Monday on charges of being a felon in possession of a gun. \r\nLarry Mitchell Hopkins, 69, who heads the U… [+3986 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"PokerStars fined $10K for taking bets on NJ college teams","description":"New Jersey gambling regulators have fined PokerStars $10,000 for taking bets on New Jersey college teams in violation of the state's sports betting law","url":"https://www.foxsports.com/other/story/pokerstars-fined-10k-for-taking-bets-on-nj-college-teams-042219","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-22T19:23:46Z","content":"ATLANTIC CITY, N.J. (AP) — New Jersey gambling regulators have fined PokerStars $10,000 for taking bets on New Jersey college basketball teams in violation of the state’s sports betting law.\r\nThe state Division of Gaming Enforcement issued the fine on April 1… [+2053 chars]"},{"source":{"id":null,"name":"Thecut.com"},"author":"Lisa Ryan","title":"The Supreme Court Is Taking on Major Cases on LGBT Rights","description":"The Court will decide whether it’s illegal to discriminate against LGBT employees.","url":"http://www.thecut.com/2019/04/supreme-court-lgbt-employee-discrimination.html","urlToImage":"https://pixel.nymag.com/imgs/fashion/daily/2019/04/22/22-supreme-court.w1200.h630.jpg","publishedAt":"2019-04-22T20:05:23Z","content":"On Monday, the Supreme Court announced that it will soon consider whether its illegal for employers to discriminate against gay or transgender workers.\r\nAs BuzzFeed News reports, the Supreme Court has agreed to hear three cases involving Title VII of the Civi… [+1948 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Dan Avery","title":"New hope rises for would-be LGBTQ parents in New York","description":"New York is one of only three states across the U.S. that bans paid surrogacy outright. The ban affects many LGBTQ families.","url":"https://www.nbcnews.com/feature/nbc-out/new-hope-rises-would-be-lgbtq-parents-new-york-n996411","urlToImage":"https://media4.s-nbcnews.com/j/newscms/2019_16/2828051/190419-dennis-williams-and-son-ew-219p_18fbe0499649df6c367157e25162d376.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-22T14:45:31Z","content":"April 22, 2019, 2:45 PM GMT\r\nA measure before the New York Legislature could ease the path to creating a family for thousands of prospective parents: The Child-Parent Security Act, which passed the state Assembly judiciary committee in February, would lift Ne… [+8374 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Evan McMullin","title":"I was in the CIA. Here's why Trump's Russia contacts should trigger impeachment.","description":"No collusion? Who cares. Mueller report proves Trump picked Russia over American national security, an impeachable offense","url":"https://www.nbcnews.com/think/opinion/mueller-report-proves-trump-failed-sound-alarm-russia-impeachable-offense-ncna997076","urlToImage":"https://media4.s-nbcnews.com/j/newscms/2019_17/2830416/190422-donald-trump-se-1232p_105469e2346b04457d3d4c6f44f1cda7.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-22T19:26:18Z","content":"Get the Think newsletter.\r\nSUBSCRIBE\r\nApril 22, 2019, 5:28 PM GMT / Updated April 22, 2019, 8:09 PM GMT\r\nBy Evan McMullin, Former presidential candidate and co-founder of Stand Up Republic\r\nAs with many Americans, I began reading special counsel Robert Muelle… [+6747 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Peter King","title":"Peter King: Kyler Murray will go No. 1 in NFL draft","description":"With the first pick in the 2019 NFL Draft, the Arizona Cardinals select ... . That's where Peter King begins his Football Morning in America column, with his first—and only—mock draft of the year. He also covers:\r\n\r\n• Four first-round trades are projected in …","url":"https://profootballtalk.nbcsports.com/2019/04/22/nfl-mock-draft-fmia-peter-king/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/fmia4.jpg?w=1200","publishedAt":"2019-04-22T06:19:35Z","content":"Interesting mock draft dropped Sunday morning in the Los Angeles Times. The papers redoubtable NFL beat man, Sam Farmer, had his annual sportswriter mock drafthes done it for 10 yearsin which he asks longtime NFL writers he trusts in the franchise cities to m… [+48449 chars]"},{"source":{"id":null,"name":"Eater.com"},"author":"Carla Vianna","title":"Popular Fluffy Japanese Shaved Ice Spot Opens on the LES This Week","description":"Plus, Cardi B’s most treasured NYC spots — and more intel","url":"https://ny.eater.com/2019/4/22/18507612/cardi-b-favorite-nyc-restaurants","urlToImage":"https://cdn.vox-cdn.com/thumbor/1k-8jx-_6M29tVIaab4oGhWc2xY=/0x238:1000x762/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16181674/Family_Shot.jpg","publishedAt":"2019-04-22T14:24:23Z","content":"Plus, Cardi B’s most treasured NYC spots — and more intel Bonsai Kakigori opens next week, and other openings and coming attractions Japanese dessert shop Bonsai Kakigori will move into the LES at 100 Stanton St., near Ludlow Street, on Saturday, April 27. Th… [+4015 chars]"},{"source":{"id":null,"name":"Photofocus.com"},"author":"Bryan Esler","title":"Photography Marketing: The number one thing you need to check on your website","description":"In my line of work, I visit a lot of photographers’ websites. Whether it be for inspiration, to find wedding referrals (no, I still don’t photograph weddings) or just browsing the ‘net, I undoubtedly visit photographers’ websites on a pretty regular basis. If…","url":"https://photofocus.com/business/photography-marketing-the-number-one-thing-you-need-to-check-on-your-website/","urlToImage":"https://i2.wp.com/photofocus.com/wp-content/uploads/2019/04/mktg-042219.jpg?fit=1920%2C1080&ssl=1","publishedAt":"2019-04-22T13:00:40Z","content":"In my line of work, I visit a lot of photographers’ websites. Whether it be for inspiration, to find wedding referrals (no, I still don’t photograph weddings) or just browsing the ‘net, I undoubtedly visit photographers’ websites on a pretty regular basis.\r\nI… [+3293 chars]"},{"source":{"id":null,"name":"Yellowjackedup.com"},"author":"Dylan Callaghan-Croley","title":"Georgia Tech Recruiting Roundup: Commitments, official visits, and more - Yellow Jacked Up","description":"Georgia Tech Recruiting Roundup: Commitments, official visits, and more Yellow Jacked Up It's been busy recently on The Flats an on the recruiting trail for the Georgia Tech Yellow Jackets and we have the complete roundup.","url":"https://yellowjackedup.com/2019/04/22/georgia-tech-recruiting-roundup-commitments-official-visits/","urlToImage":"https://imagesvc.timeincapp.com/v3/fan/image?url=https://yellowjackedup.com/wp-content/uploads/getty-images/2017/07/1025924534.jpeg&","publishedAt":"2019-04-22T18:17:53Z","content":"It’s been a while since we’ve done a Georgia Tech football recruiting roundup here at Yellow Jacked Up and there’s no better week to do one than leading up to the Georgia Tech spring game on Friday!\r\nWhere the class stands:\r\nGeorgia Tech this past weekend lan… [+2001 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":null,"title":"Online Tech is Now Otava - Associated Press","description":"Online Tech is Now Otava Associated Press Press release *content* from Business Wire. The AP news staff was not involved in its creation.","url":"https://www.apnews.com/Business%20Wire/117b0251584a4d04849345b8e8ec20d8","urlToImage":"https://apnews.com/images/PaidContent3.png","publishedAt":"2019-04-22T11:39:09Z","content":"ANN ARBOR, Mich.--(BUSINESS WIRE)--Apr 22, 2019--Online Tech, a leader in secure, compliant cloud services for enterprise and channel partners, announced today that it has changed its name to Otava.\r\nThe rebranding follows recent significant growth in Otavas … [+4499 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Defense order of the day for 1st round of NFL draft","description":"We learned during the 2018 season that offense is beloved by NFL teams (and fans). Yet the Super Bowl score was 13-3.","url":"https://www.foxsports.com/nfl/story/defense-order-of-the-day-for-1st-round-of-nfl-draft-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/c876ca7eb8434a938c9fd39ef0fc8c09-1.vresize.1200.630.high.84.jpg","publishedAt":"2019-04-22T21:12:30Z","content":"NASHVILLE, Tenn. (AP) — We learned during the 2018 season that offense is beloved by NFL teams (and fans). We also learned that defense, as performed by the Patriots in the Super Bowl, carries away the Lombardi Trophy.\r\nThis year’s draft, which begins Thursda… [+6095 chars]"},{"source":{"id":null,"name":"Wwd.com"},"author":"Layla Ilchi","title":"12 Emerging Brands Melding Style With Sustainability","description":"See 12 emerging green designers below as part of WWD’s special Earth Day coverage.","url":"https://wwd.com/fashion-news/fashion-features/earth-day-2019-12-emerging-brands-melding-style-with-sustainability-1203113700/","urlToImage":"https://pmcwwd.files.wordpress.com/2019/04/schmidt_gypsy_fw19_115.jpg","publishedAt":"2019-04-22T04:33:04Z","content":"A growing number of young brands are putting sustainability at the center of their business models. As part of WWD’s special Earth Day coverage, here are 12 emerging green designers:\r\n1. Ali Grace\r\nBackground: Grace, a New York City-based jewelrydesigner, has… [+15272 chars]"},{"source":{"id":null,"name":"Techreport.com"},"author":null,"title":"Don't skimp on the power supply: a 20 kW solar installation reviewed, part one","description":"There are a lot of reasons I decided to have a big honkin' solar array installed on my roof. I'll get to the tangible ones shortly—backed by cold, hard data. The main reason that comes to mind, though, is less concrete. It's a feeling, or an instinct; a desir…","url":"https://techreport.com/review/34541/dont-skimp-on-the-power-supply-a-20-kw-solar-installation-reviewed-part-one","urlToImage":"https://techreport.com/thumbs.x/lgnew/2019_03_30_Don_t_skimp_on_the_power_supply_20_kW_of_solar_power_reviewed/feature.jpg","publishedAt":"2019-04-22T22:00:00Z","content":"There are a lot of reasons I decided to have a big honkin' solar array installed on my roof. I'll get to the tangible ones shortlybacked by cold, hard data. The main reason that comes to mind, though, is less concrete. It's a feeling, or an instinct; a desire… [+5727 chars]"},{"source":{"id":null,"name":"Adweek.com"},"author":"Ronan Shields","title":"Zeta Global to Purchase Sizmek Assets in $36 Million Deal","description":"Sizmek has agreed to sell its data management and demand-side platforms to Zeta Global in a deal that will see the latter pay up to $36 million for the assets. The proposed private sale was announced late on Friday afternoon. If accepted as part of Sizmek's C…","url":"http://www.adweek.com/programmatic/zeta-global-to-purchase-sizmek-assets-in-36-million-deal/","urlToImage":"https://static.adweek.com/adweek.com-prod/wp-content/uploads/2019/04/zeta-sizmek-TEXT-2019-600x315.jpg","publishedAt":"2019-04-22T14:30:41Z","content":"Sizmek has agreed to sell its data management and demand-side platforms to Zeta Global in a deal that will see the latter pay up to $36 million for the assets. The proposed private sale was announced late on Friday afternoon.If accepted as part of Sizmeks Cha… [+1995 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":null,"title":"Report: Raiders have 'some sort of surprise pick' at No. 4 - NBCSports.com","description":"Report: Raiders have 'some sort of surprise pick' at No. 4 NBCSports.com Everything You Need to Know About the 2019 NFL Draft’s Top Storylines Sports Illustrated Welcome To The Jon Gruden Show Deadspin Raiders News 4/22: Could Raiders target offensive line he…","url":"https://www.nbcsports.com/bayarea/raiders/nfl-rumors-raiders-have-some-sort-surprise-no-4-pick-draft","urlToImage":"https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2019/04/22/grudenjonhatus.jpg","publishedAt":"2019-04-22T20:28:46Z","content":"The Raiders could certainly trade down from one of their three first-round picks to pick up extra selections later in the 2019 NFL Draft.\r\nAn early trade would net a strong return that could add Day 2 picks to their cache, something general manager Mike Mayoc… [+4486 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"https://www.facebook.com/lena.sun.90","title":"U.S. measles cases surge as officials scramble to stop near-record outbreak - Washington Post","description":"U.S. measles cases surge as officials scramble to stop near-record outbreak Washington Post Measles nears record in US as the disease spreads in New York CNBC New York Outbreaks Drive US Measles Count up to 626 U.S. News & World Report Measles outbreak prompt…","url":"https://www.washingtonpost.com/health/2019/04/22/us-measles-cases-surge-officials-scramble-stop-near-record-outbreak/","urlToImage":"https://www.washingtonpost.com/resizer/GtS0vYsmUAaipxCL3gfQ4EqwgJw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UIC6T24PXNHDNCLXFJJHM7SSYU.jpg","publishedAt":"2019-04-22T13:49:49Z","content":"The United States is on track to surpass the record number of measles cases in a single year since the disease was declared eliminated in 2000, according to figures reported Monday. For the fourth week in a row, health officials have added dozens of new cases… [+3234 chars]"},{"source":{"id":null,"name":"Jamanetwork.com"},"author":"Kim M.","title":"Attending Patient Funerals—Claiming the Right to Grieve","description":"In this narrative medicine essay a neurointensivist discusses her evolving understanding of her personal and professional responses to patient deaths, the pressures physicians face not to grieve, and the importance of attending patients’ funerals for bringing…","url":"https://jamanetwork.com/journals/jama/fullarticle/2731182","urlToImage":"https://cdn.jamanetwork.com/images/logos/JAMA.png","publishedAt":"2019-04-23T00:00:00Z","content":"Should I go to the funeral? I asked my sister, a neonatologist. She was frequently invited to the funeral of the babies she had taken care of. I also felt a twinge of shame, recalling an insensitive comment that I made years ago over the death of her patient.… [+9400 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Zamira Rahim, Zamira Rahim","title":"Far-right rally for Hitler's birthday attracts crowd of 20","description":"Thousands of counter-protesters jeer during Ingelheim demonstration","url":"https://www.independent.co.uk/news/world/europe/hitler-birthday-rally-ingelheim-crowd-far-right-germany-frankfurt-a8881396.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/22/15/far-right-rally-germany-.jpg","publishedAt":"2019-04-22T16:29:12Z","content":"Only 20 people attended a far-right rally held in a small German town to celebrate the 130th anniversary of Adolf Hitlers birth on Saturday.\r\nThe German newspaper Allgemeine Zeitung reported even lower numbers and said only 14 people had attended.\r\nOrganisers… [+31108 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Chris Riotta, Chris Riotta","title":"Florida man impersonating police officer pulls over undercover detective","description":"The 26-year-old is arrested by real police officers while trying to jump traffic queue","url":"https://www.independent.co.uk/news/world/americas/undercover-cop-pull-over-impersonating-police-officer-florida-matthew-erris-a8881761.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/05/25/12/us_police.jpg","publishedAt":"2019-04-22T20:52:04Z","content":"A Florida man pretending to be a police officer was arrested after attempting to pull over an undercover detective. \r\nMatthew Erris was arrested on charges he impersonated a public officer when he flipped on red and blue lights attached to his SUV in Plant Ci… [+30239 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Zamira Rahim, Zamira Rahim","title":"Baby dies in stranger's arms on flight from Malaysia to Australia","description":"'The parents were just genuinely beside themselves,' passenger says","url":"https://www.independent.co.uk/news/world/australasia/baby-dies-plane-flight-perth-australia-air-asia-malaysia-a8881631.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/22/18/perth-air-asia.jpg","publishedAt":"2019-04-22T16:51:51Z","content":"A two-month-old baby died in a passenger's arms after she fell ill on an Air Asia flight from Malaysia to Australia. \r\nNadia Parenzee said the child had been crying continuously during the journey.\r\nShe said she could tell by looking at the parents \"they were… [+30679 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Clarisse Loughrey, Clarisse Loughrey","title":"Jussie Smollett's brother defends Empire actor: 'What if Jussie is telling the truth?'","description":"'Is it really that easy to convince the world of a person's guilt? Is that all it takes to turn someone's life upside down in America?'","url":"https://www.independent.co.uk/arts-entertainment/tv/news/jussie-smollett-brother-empire-felony-charges-op-ed-attack-hate-crime-a8880946.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/22/11/jussie-smolett.jpg","publishedAt":"2019-04-22T08:44:00Z","content":"Jussie Smolletts brother has defended him in an op-ed, suggesting that Americans should re-examine the details of the case and consider the possibility that the Empire actor is telling the truth. \r\nThe 36-year-old was accused of hiring two men to stage a raci… [+31202 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Chris Riotta, Chris Riotta","title":"US Supreme Court to decide if it's legal to fire people for being gay","description":"A series of cases the Supreme Court is reviewing could set a controversial precedent for US employers","url":"https://www.independent.co.uk/news/world/americas/us-politics/us-supreme-court-gay-fire-lgbt-transgender-workers-a8881491.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/22/16/sei63718972.jpg","publishedAt":"2019-04-22T15:51:50Z","content":"The Supreme Court has agreed to hear arguments over a slate of cases that could effectively determine whether US employers have the right to fire someone for being LGBTQ+. \r\nThe nations highest court said Monday it would hear legal arguments for Altitude Expr… [+31156 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Chris Riotta, Chris Riotta","title":"Female marine discovers hidden recording device in women's bathroom on US Navy ship","description":"The US Navy's criminal investigative unit is currently investigating the incident","url":"https://www.independent.co.uk/news/world/americas/us-navy-ship-female-marine-hidden-camera-bathroom-recording-device-video-a8881841.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/22/22/rtx398gq.jpg","publishedAt":"2019-04-22T21:21:03Z","content":"A female Marine discovered a hidden recording device aboard a US Navy ship, prompting an investigation and concerns of sexual harassment. \r\nThe Sixth Fleet confirmed a recording device was located in a head aboard the USS Arlington as it was stationed in Gree… [+30351 chars]"}]}