{"status":"ok","totalResults":104,"articles":[{"source":{"id":"business-insider","name":"Business Insider"},"author":"Becky Peterson","title":"This map shows which states in the US are competing to top California-based Uber's $15.7 billion in equity funding","description":"With $15.7 billion in equity funding, Uber is the most highly-funded tech startup in the United States. This map by CB Insights shows that there's plenty of money to go around. Florida's Magic Leap, an augmented reality has raised $2.4 billion in funding, whi…","url":"https://www.businessinsider.com/map-top-funded-tech-startups-us-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba232416c65a440d1b22d4-2732-1366.jpg","publishedAt":"2019-04-21T14:00:00Z","content":"With $15.7 billion in equity funding in its pocket, the San Francisco, California-based ride-hailing company Uber has raised more money than any other tech startup in the country. But California isn't the only state in the union harboring highly-funded tech s… [+3249 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Peter Beinart","title":"U.S. Trade Hawks Exaggerate China’s Threat","description":"Democrats and Republicans echo Trump’s anti-Beijing rhetoric, but escalating tensions could leave Americans far worse off.","url":"https://www.theatlantic.com/ideas/archive/2019/04/us-trade-hawks-exaggerate-chinas-threat/587536/?utm_source=feed","urlToImage":null,"publishedAt":"2019-04-21T10:00:00Z","content":"N ews reports suggest that in the coming weeks, the United States and China will sign an agreement that repeals the tariffs the two nations have been levying on each other’s goods for the past nine months. If past behavior is any guide, Donald Trump will call… [+17229 chars]"},{"source":{"id":null,"name":"Avclub.com"},"author":"Mike Vago on AUX, shared by Mike Vago to The A.V. Club","title":"In the past 50 years, one thing U.S. Senators have agreed on is candy—but barely","description":"This week’s entry: Candy Desk Read more...","url":"https://aux.avclub.com/in-the-past-50-years-one-thing-u-s-senators-have-agre-1834067815","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--AzVwNWsd--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/rpmu6jgoxqwh6ycq7lsa.jpg","publishedAt":"2019-04-21T15:00:00Z","content":"This weeks entry: Candy Desk\r\nWhat its about: The United States Senate. That august body plays a vital role as a check against executive power, whether its looking the other way while the president lines his pockets with taxpayer money, or looking the other w… [+5007 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"Elliot Carter","title":"When the Washington Easter Egg Roll Was Chaos","description":"The president now hosts the annual event because Congress literally kicked the kids off their lawn. Here’s why.","url":"https://www.politico.com/magazine/story/2019/04/21/when-the-washington-easter-egg-roll-was-chaos-226669","urlToImage":"https://static.politico.com/00/79/8a46597d4d33871256a632b9a18f/eastern-roll-eggs-in-the-white-house-in-1929.jpg","publishedAt":"2019-04-21T11:02:24Z","content":"Elliot Carter is a writer and researcher in Washington, D.C.\r\nThe White House Easter Egg Roll is upon us again, with its usual light-hearted fanfare and wholesome traditions. There will be bunny costumes, live music performances and senior government official… [+6852 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Ephrat Livni","title":"Meet the man responsible for restoring the art in Notre Dame cathedral. He’s the insurance agent","description":"This Easter Sunday in Paris, there is cause for dismay and celebration.","url":"https://qz.com/quartzy/1600581/michel-honore-is-the-insurance-assessor-for-the-treasure-of-notre-dame/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/04/crownofthorns.jpeg?quality=75&strip=all&w=1400","publishedAt":"2019-04-21T13:16:18Z","content":"On this Easter Sunday, Christians around the world celebrate the resurrection of Jesus Christ following his crucifixion. For Catholics in Paris, the holiday is especially poignant this year, as the Cathedral of Notre Dame stands scorched and scarred from a fi… [+7460 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Matthew DiLallo)","title":"Chevron Is Getting a Hidden Gem in the Anadarko Deal","description":"The oil giant is getting more than just additional land in the Permian Basin.","url":"https://www.fool.com/investing/2019/04/21/chevron-is-getting-a-hidden-gem-in-the-anadarko-de.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519364/cave-with-skylight-streaming-sunlight-on-a-treasure-chest.jpg","publishedAt":"2019-04-21T21:17:00Z","content":"The main reason Chevron(NYSE:CVX) is paying $50 billion to acquire Anadarko(NYSE:APC) is to bulk up its industry-leading position in the fast-growing Permian Basin. An added benefit is that the deal will also bolster the oil giant's presence in the Gulf of Me… [+4434 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Maria Pasquini","title":"Milania Giudice, 14, Asks Trump to Stop Her Father’s Deportation: ‘We Will Never Stop Fighting’","description":"Milania Giudice is doing everything in her power to stop her father Joe Giudice from being deported. Days after her father’s deportation appeal was denied by ICE, Milania, 14, made an appeal on social media to ask President Donald Trump to intervene. “We will…","url":"https://people.com/tv/milania-giudice-asks-trump-to-stop-father-joe-deportation/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/joe-giudice.jpg?crop=0px%2C218px%2C1203px%2C632px&resize=1200%2C630","publishedAt":"2019-04-21T18:30:38Z","content":"Milania Giudice is doing everything in her power to stop her father Joe Giudice from being deported.\r\nDays after her fathers deportation appeal was denied by ICE, Milania, 14, made an appeal on social media to ask President Donald Trump to intervene.\r\nWe will… [+2775 chars]"},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" A Pennsylvania man created a digital image of himself pointing an AR-15 rifle at a group of praying Jewish men and posted it online, one... via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_a9531130830f6e02eb4543d6548e7bf1","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-21T06:57:08Z","content":"Houston Rockets, Utah Jazz, James Harden, Donovan Mitchell\r\nThe Houston Rockets cruised through the first two games of their opening-round playoff series against the Utah Jazz this week, winning by 32..."},{"source":{"id":null,"name":"Bradford-delong.com"},"author":"J. Bradford DeLong","title":"Fairly Recently: Must- and Should-Reads, and Writings... (April 21, 2019)","description":"* _[How Big a Problem Is the Malapportionment of the Senate?](https://www.bradford-delong.com/2019/04/council-on-foreign-relations-_the-future-of-democracy-symposiumhttpswwwcfrorgeventfuture-democracy-symposium_.html)_ * _[\"Unexpected Convergers\" since World …","url":"https://www.bradford-delong.com/2019/04/fairly-recently-must-and-should-reads-and-writings-april-21-2019.html","urlToImage":"https://delong.typepad.com/.a/6a00e551f080038834022ad38f739e200c-600wi","publishedAt":"2019-04-21T20:18:23Z","content":"How Big a Problem Is the Malapportionment of the Senate? \"Unexpected Convergers\" since World War II Weekend Reading: Cosma Shalizi (2011): Dives, Lazarus, and Alice Comment of the Day: Mark Field: How Big a Problem Is the Malapportionment of the Senate?: \"It'… [+9320 chars]"},{"source":{"id":null,"name":"Theadvocate.com"},"author":null,"title":"Baton Rouge area Business Briefs for April 21, 2019 - The Advocate","description":"Baton Rouge area Business Briefs for April 21, 2019 The Advocate Two executives with the Cincinnati USA Regional Chamber will be keynote speakers for the Baton Rouge Area Chamber's Diversity in Business Event...","url":"https://www.theadvocate.com/baton_rouge/news/business/article_55ba0d42-607d-11e9-a1eb-0b4a793853c2.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/theadvocate.com/content/tncms/custom/image/fd83d8a8-033a-11e6-80c7-775cd15a5fb2.jpg","publishedAt":"2019-04-21T05:15:00Z","content":"Cincinnati executives to discuss diversity\r\nTwo executives with the Cincinnati USA Regional Chamber will be keynote speakers for the Baton Rouge Area Chamber's Diversity in Business Event scheduled from 11 a.m. to 1:30 p.m. May 7 in the Renaissance Hotel, 700… [+3706 chars]"},{"source":{"id":null,"name":"Oleantimesherald.com"},"author":"BOB CLARK Olean Times Herald","title":"Plethora of new business set to open in West Olean area - Olean Times Herald","description":"Plethora of new business set to open in West Olean area Olean Times Herald OLEAN — A string of openings, remodelings and new construction is bearing fruit on the west end of Olean.","url":"http://www.oleantimesherald.com/news/plethora-of-new-business-set-to-open-in-west-olean/article_842eb452-db36-555d-8cd1-239c637b1522.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/oleantimesherald.com/content/tncms/assets/v3/editorial/8/60/860874e5-712b-5e4d-9b91-fdd226d4af3a/5cbbdbc47073d.image.jpg?resize=885%2C630","publishedAt":"2019-04-21T17:00:00Z","content":"OLEAN A string of openings, remodelings and new construction is bearing fruit on the west end of Olean.\r\nFrom the former Kmart site west, new or relocating businesses within a few blocks include:\r\nOllies Bargain Outlet officials announced in December that a n… [+3653 chars]"},{"source":{"id":null,"name":"Lowellsun.com"},"author":"The Lowell Sun","title":"People in Business - Lowell Sun","description":"Julie Dolan has been named chief financial officer at Groton School. Dolan, currently executive vice president and treasurer of Clark University in Worcester, combines deep experience in finance and administration with a commitment both to education","url":"http://www.lowellsun.com/business/ci_32587578/people-business","urlToImage":"http://local.lowellsun.com/common/dfm/assets/logos/1200x627/lowellsun.png","publishedAt":"2019-04-21T10:35:21Z","content":"Julie Dolan has been named chief financial officer at Groton School. Dolan, currently executive vice president and treasurer of Clark University in Worcester, combines deep experience in finance and administration with a commitment both to education and to th… [+2694 chars]"},{"source":{"id":null,"name":"Altoonamirror.com"},"author":null,"title":"Business enters next generation | News, Sports, Jobs - Altoona Mirror","description":"Business enters next generation | News, Sports, Jobs Altoona Mirror HUNTINGDON — A risk Dennis Cisney Sr. took many years ago has paid off. This year, the business started by Cisney and his partner, Richard O'Donnell — Ci.","url":"http://www.altoonamirror.com/news/local-business/2019/04/business-enters-next-generation/","urlToImage":"http://s3.amazonaws.com/ogden_images/www.altoonamirror.com/images/2019/04/19221140/cisney_4_cmyk.jpg","publishedAt":"2019-04-21T04:02:53Z","content":"Mirror photo by Gary M. Baranec /\r\nDenny Cisney Jr. and his sister, Melissa Cisney Foster, talk in the kitchen of one of their latest completed projects in the Lower Brush Mountain area of Hollidaysburg.HUNTINGDON — A risk Dennis Cisney Sr. took many years ag… [+6359 chars]"},{"source":{"id":null,"name":"Njherald.com"},"author":null,"title":"People in Business, April 21 - New Jersey Herald","description":"People in Business, April 21 New Jersey Herald Corey Brown received the 2018 Rudolph N. Hawkins Staff Member of the Year award at the Metro YMCA's annual awards dinner on April 11 at the Hanover...","url":"https://www.njherald.com/20190421/people-in-business-april-21","urlToImage":"https://www.njherald.com/img/NH200x200social.jpg","publishedAt":"2019-04-21T04:01:00Z","content":"Corey Brown received the 2018 Rudolph N. Hawkins Staff Member of the Year award at the Metro YMCA's annual awards dinner on April 11 at the Hanover Marriott in East Hanover.\r\nMembership was climbing at the just-renovated Sussex County YMCA last summer when Br… [+7538 chars]"},{"source":{"id":null,"name":"Santafenewmexican.com"},"author":"Will Webber | wwebber@sfnewmexican.com","title":"Early signs indicate New Mexico sportsbooks good for business - Santa Fe New Mexican","description":"Early signs indicate New Mexico sportsbooks good for business Santa Fe New Mexican The business of legalized sports betting in New Mexico is, to borrow the phrase, paying off. The state's only legal sportsbooks — at Buffalo Thunder Resort...","url":"https://www.santafenewmexican.com/news/local_news/early-signs-indicate-new-mexico-sportsbooks-good-for-business/article_c001c7e8-809a-53b8-996e-e352684c256b.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/santafenewmexican.com/content/tncms/custom/image/91a8148a-466e-11e9-afc5-2fd66c148ffe.jpg","publishedAt":"2019-04-21T01:40:00Z","content":"The business of legalized sports betting in New Mexico is, to borrow the phrase, paying off.\r\nThe states only legal sportsbooks at Buffalo Thunder Resort &amp; Casino north of Santa Fe and Santa Ana Star Casino northwest of Albuquerque are up and running. By … [+8091 chars]"},{"source":{"id":null,"name":"Journaltimes.com"},"author":"Ricardo  Torres","title":"Foxconn's legal issues: Two lawsuits could shed light on how the business operates - Journal Times","description":"Foxconn's legal issues: Two lawsuits could shed light on how the business operates Journal Times Much of what goes on regarding the Foxconn Technology Group is secret, from its negotiations with the State of Wisconsin on the development agreement to the...","url":"https://journaltimes.com/news/local/foxconn-s-legal-issues-two-lawsuits-could-shed-light-on/article_f4745f56-4be6-5469-a1b5-7e8b3dbdd8a2.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/journaltimes.com/content/tncms/assets/v3/editorial/8/14/814bcfc9-e053-5f31-a4ca-a600df297019/5a7286f1b6652.image.jpg?crop=1213%2C682%2C268%2C160&resize=1121%2C630&order=crop%2Cresize","publishedAt":"2019-04-21T11:00:00Z","content":"Much of what goes on regarding the Foxconn Technology Group is secret, from its negotiations with the State of Wisconsin on the development agreement to the details of its operations in Racine County.\r\nBut two lawsuits might shed some light on how Foxconn ope… [+9507 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"Long Player","title":"David M. Wood Can Get Gulfport Energy Growing Again","description":"The new CEO David M. Wood has a decent background. The market does not like the no-growth strategy. Stock repurchases are not as important as production growth.","url":"https://seekingalpha.com/article/4255583-david-m-wood-can-get-gulfport-energy-growing","urlToImage":"https://static.seekingalpha.com/uploads/2019/4/17/1102834-15554795309141579_origin.png","publishedAt":"2019-04-21T18:55:01Z","content":"Gulfport Energy (GPOR) probably chose a losing investor strategy in the current market. The share buybacks are not popular when production is not growing. However, the new CEO and board member, David M. Wood, can turn that around. He can get the company profi… [+7361 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"Badsha Chowdhury","title":"Calfrac Gets A Short-Term Breather; But The Long Term Woes Are Not Over","description":"Pricing pressure and low asset utilization are Calfrac’s primary concerns. The Canadian energy market continues to suffer from structural weaknesses. Calfrac’s","url":"https://seekingalpha.com/article/4255593-calfrac-gets-short-term-breather-long-term-woes","urlToImage":"https://static2.seekingalpha.com/images/marketing_images/oil_gas/oil_cc0.png","publishedAt":"2019-04-21T21:48:50Z","content":"Calfracs Recovery May Not Last Long\r\nCalfrac Well Services (OTCPK:CFWFF) provides hydraulic fracturing, coiled tubing, cementing and other well stimulation services to energy customers in Canada, the United States, Russia and Argentina. I think investing in t… [+12331 chars]"},{"source":{"id":null,"name":"Techspot.com"},"author":"James Miller","title":"26 U.S. states ban or restrict local broadband initiatives","description":"Healthy competition is meant to be the cornerstone of the U.S. economy, but the telecom industry has not only never embraced that mentality, it has apparently gone one step further by successfully lobbying to reduce competition through restrictions and outrig…","url":"https://www.techspot.com/news/79739-26-us-states-ban-or-restrict-local-broadband.html","urlToImage":"https://static.techspot.com/images2/news/ts3_thumbs/2015/03/2015-03-16-ts3_thumbsc96.jpg","publishedAt":"2019-04-21T14:32:00Z","content":"Bottom line: Faced with high fees, slow speeds and poor customer service, many communities in the U.S. have turned to community broadband projects to free themselves from the clutches of major telecom providers. But this isnt an option for everyone, as 26 sta… [+1760 chars]"},{"source":{"id":null,"name":"Latech.edu"},"author":null,"title":"Tech team finishes in Top 10 in international debate championship - News at Louisiana Tech","description":"Tech team finishes in Top 10 in international debate championship News at Louisiana Tech Against more than 80 other competitors, Louisiana Tech junior political science major Leah Hannah was Champion of the Varsity Division in the recent 2019...","url":"https://www.latech.edu/2019/04/20/tech-team-finishes-in-top-10-in-international-debate-championship/","urlToImage":null,"publishedAt":"2019-04-21T02:00:07Z","content":"Against more than 80 other competitors, Louisiana Tech junior political science major Leah Hannah was Champion of the Varsity Division in the recent 2019 International Public Debate Association (IPDA) National Championship, the top achievement in an exception… [+1967 chars]"},{"source":{"id":null,"name":"Cleantechnica.com"},"author":"Tina Casey","title":"How Much Does Trump Admin Love Renewable Energy? Shhh, Don’t Tell!","description":"Hey, whatever happened to saving coal? US Energy Dept. is still working all the renewable energy levers to support clean power for green businesses.","url":"https://cleantechnica.com/2019/04/21/how-much-does-trump-admin-love-renewable-energy-shhh-dont-tell/","urlToImage":"https://cleantechnica.com/files/2019/04/Lone-Star-Wind-Farm-Texas-renewable-energy.jpg","publishedAt":"2019-04-21T22:30:31Z","content":"Clean PowerPublished on April 21st, 2019 |\r\n by Tina Casey\r\n0\r\nApril 21st, 2019 by Tina Casey \r\nLeading US corporations have been hopping on the renewable energy bandwagon to save big bucks, despite a lack of support from the current occupant of the Oval Offi… [+6441 chars]"},{"source":{"id":null,"name":"Bleedingcool.com"},"author":"Rich Johnston","title":"Bleeding Cool Bestseller List, 21st April 2019 – Donny Cates Calls It Ultimate Buffy","description":"This is the Top Ten Bleeding Cool Bestseller List, as compiled by a number of comic stores from their sales... Read More The post Bleeding Cool Bestseller List, 21st April 2019 – Donny Cates Calls It Ultimate Buffy appeared first on Bleeding Cool News And Rum…","url":"https://www.bleedingcool.com/2019/04/21/bleeding-cool-bestseller-list-21st-april-2019-donny-cates-ultimate-buffy/","urlToImage":"https://mlpnk72yciwc.i.optimole.com/w:auto/h:auto/q:auto/https://www.bleedingcool.com/wp-content/uploads/2019/04/batman-69-3.jpg","publishedAt":"2019-04-21T15:00:20Z","content":"This is the Top Ten Bleeding Cool Bestseller List, as compiled by a number of comic stores from their sales on Wednesday and Thursday. It measures what are known as the Wednesday Warriors, those who cant wait till the weekend to get this weeks comics. We salu… [+5070 chars]"},{"source":{"id":null,"name":"Apkmania.live"},"author":"noreply@blogger.com (chathu_ac)","title":"DMV Practice Test 2019 v4.25","description":"<!--Overview-->Free Car, CDL or Motorcycle DMV Practice Test for all US States. <!--end--><!--Description-->Appearing for DMV test? Bored studying with DMV Handbook? You are at the right place. Download this free application for your Car, Motorcycle or CDL DM…","url":"https://www.apkmania.live/2017/05/dmv-practice-test.html","urlToImage":"https://lh3.googleusercontent.com/7Nt6V6uJrQeuMMPgra_bbE4s-p4d5884meL045rEZ9yTGQttrH6SGfGfJHnRJUhjE3r0=s72-c-h450","publishedAt":"2019-04-21T05:36:00Z","content":null},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Chevron Is Getting a Hidden Gem in the Anadarko Deal","description":"The oil giant is getting more than just additional land in the Permian Basin.","url":"https://finance.yahoo.com/news/chevron-getting-hidden-gem-anadarko-211700433.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/f.8nyOV.RHFLXXC5Y4Sr1g--~B/aD0xNDE0O3c9MjEyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/motleyfool.com/0255fbf673a4626781129096c1e88ad8","publishedAt":"2019-04-21T21:17:00Z","content":"The main reason Chevron(NYSE: CVX) is paying $50 billion to acquire Anadarko(NYSE: APC) is to bulk up its industry-leading position in the fast-growing Permian Basin. An added benefit is that the deal will also bolster the oil giant's presence in the Gulf of … [+4760 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Polanski sues US motion picture academy for reinstatement","description":"Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement. Polanski, who in 1977 pleaded guilty in California to …","url":"https://news.yahoo.com/polanski-sues-us-motion-picture-academy-reinstatement-210216276.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/GYH1hvKnWci2Om6fi8xh2g--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/64d32131087355713ffefca07043bc426eee4b41.jpg","publishedAt":"2019-04-21T00:51:18Z","content":"Los Angeles (AFP) - Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.\r\nPolanski, who in 1977 pleaded gui… [+2576 chars]"},{"source":{"id":null,"name":"Oregonlive.com"},"author":"OregonLive.com","title":"Meet the officials for Trail Blazers-Thunder Game 4: Is this a good referee crew?","description":"The Portland Trail Blazers are still up 2-1 on the Oklahoma City Thunder with Game 4 on tap for tonight. The Blazers found success on their home floor in Games 1 and 2, but the officials clearly played a big role in Game 3 in Oklahoma where the Thunder were a…","url":"https://www.oregonlive.com/blazers/2019/04/meet-the-officials-for-trail-blazers-thunder-game-4-is-this-a-good-referee-crew.html","urlToImage":"https://www.oregonlive.com/resizer/Sk1CfI7shOLc69Qyem0gLa61foc=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/E3WU4WYMI5GG5AZPNE6JOLXJSI.jpg","publishedAt":"2019-04-21T18:28:04Z","content":"The Portland Trail Blazers are still up 2-1 on the Oklahoma City Thunder with Game 4 on tap for tonight. The Blazers found success on their home floor in Games 1 and 2, but the officials clearly played a big role in Game 3 in Oklahoma where the Thunder were a… [+4270 chars]"},{"source":{"id":null,"name":"Rawstory.com"},"author":"Agence France-Presse","title":"Polanski sues US motion picture academy for reinstatement","description":"Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement. Polanski, who in 1977 pleaded guilty in California to …","url":"https://www.rawstory.com/2019/04/polanski-sues-us-motion-picture-academy-reinstatement/","urlToImage":"https://www.rawstory.com/wp-content/uploads/2015/01/Filmmaker-Roman-Polanski-pictured-at-the-Cannes-Film-Festival-in-May-2014-AFP-800x430.jpg","publishedAt":"2019-04-21T09:16:02Z","content":"Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.\r\n# p #1_17 # ad skipped = NULL #\r\nPolanski, who in 197… [+3159 chars]"},{"source":{"id":null,"name":"Historynewsnetwork.org"},"author":null,"title":"The Electoral College and the Myth of a Proslavery Ploy","description":"As the New York Times at present lacks the proper format for a debate over an Op-Ed of mine that it published on the origins of the Electoral College, “The Electoral College Was Not a Pro-Slavery Ploy,” I am grateful to History News Network for giving me the …","url":"https://historynewsnetwork.org/article/171722","urlToImage":"https://s3.amazonaws.com/hnn-bucket/sites/default/files/171722-constitution.jpg","publishedAt":"2019-04-21T18:51:16Z","content":"Sean Wilentz is the George Henry Davis 1886 Professor of American History at Princeton University, where he has taught since 1979. He is author of many books, including The Rise of American Democracy: From Jefferson to Lincoln.\r\nAs the New York Times at prese… [+23617 chars]"},{"source":{"id":null,"name":"Wordpress.com"},"author":"whyevolutionistrue","title":"Identity politics and 2020","description":"I am not a political expert, and somehow I just can’t get deeply involved in a race for President when the election won’t take place for a year and a half. But I do know three things: 1.) We have to get a Democrat into the White House, and that means defeatin…","url":"https://whyevolutionistrue.wordpress.com/2019/04/21/identity-politics-and-2020/","urlToImage":"https://whyevolutionistrue.files.wordpress.com/2019/04/screen-shot-2019-04-21-at-10.30.23-am.png","publishedAt":"2019-04-21T15:45:53Z","content":"I am not a political expert, and somehow I just can’t get deeply involved in a race for President when the election won’t take place for a year and a half.  But I do know three things:\r\n1.) We have to get a Democrat into the White House, and that means defeat… [+5427 chars]"},{"source":{"id":null,"name":"Theroot.com"},"author":"Ibn Safir","title":"Wife of Ku Klux Klan Leader Admits to Murder of Her Husband, Sentenced to Life in Prison","description":"Malissa Ancona, 46, pleaded guilty to second-degree murder in St. Francois County Court in Farmington, Mo., according to the St. Louis Post-Dispatch. Read more...","url":"https://www.theroot.com/wife-of-ku-klux-klan-leader-admits-to-murder-of-her-hus-1834197766","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--VcUUHIIr--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/qzdvvjonbcogdtlcayfo.jpg","publishedAt":"2019-04-21T14:17:00Z","content":"Malissa Ancona, 46, pleaded guilty to second-degree murder in St. Francois County Court in Farmington, Mo., according to the St. Louis Post-Dispatch.\r\nShes charged in connection to the death of her husband, 51-year-old Frank Ancona Jr., imperial wizards of th… [+1907 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"CBS Sports Staff","title":"2019 Kentucky Derby odds, predictions: Expert who has nailed 9 Derby-Oaks Doubles reveals early picks","description":"Jody Demling has called the winners of both races all but once in the last decade","url":"https://www.cbssports.com/general/news/2019-kentucky-derby-odds-predictions-expert-who-has-nailed-9-derby-oaks-doubles-reveals-early-picks/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/03/30/c7a45d2f-0ba1-4ee6-b9ef-cba0d242e665/thumbnail/770x433/229d292bffc6fef7948393f2e90373cd/audible33018.jpg","publishedAt":"2019-04-21T17:10:53Z","content":"The prep races for the 2019 Kentucky Derby are in the books. War of Will took down the Risen Star Stakes shortly after the Super Bowl and is going off at 18-1 Kentucky Derby odds to come away with a victory at Churchill Downs on Saturday, May 4. Last month, T… [+4452 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Michael Kaskey-Blomain","title":"2019 NBA Playoffs: Watch 76ers vs. Nets Game 5, series schedule, results, live stream, TV channels, odds, matchups","description":"The 76ers will try to take both games in Brooklyn and take a 3-1 lead back to Philly","url":"https://www.cbssports.com/nba/news/2019-nba-playoffs-watch-76ers-vs-nets-game-5-series-schedule-results-live-stream-tv-channels-odds-matchups/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/21/63f62860-40f2-4bc5-a491-7c529ef190d7/thumbnail/770x433/8b0960a0f8c23ff7232a0c198f09dd48/usatsi-12565000-1.jpg","publishedAt":"2019-04-21T22:01:57Z","content":"While nothing has come easy for them to this point in their opening round playoff series against the Brooklyn Nets, the Philadephia 76ers are now one win away from advancing to the Eastern Conference semifinals and they will look to close things out on their … [+4994 chars]"},{"source":{"id":null,"name":"Lawyersgunsmoneyblog.com"},"author":"Erik Loomis","title":"Today in Our Tech Bro Betters","description":"Our tech betters sure are awesome, conning towns into handing over their education systems to them with predictably disastrous results: Eight months earlier, public schools near Wichita had rolled out a web-based platform and curriculum from Summit Learning. …","url":"http://www.lawyersgunsmoneyblog.com/2019/04/today-in-our-tech-bro-betters","urlToImage":"http://www.lawyersgunsmoneyblog.com/wp-content/uploads/2016/04/The_Prize_Russakoff-e1441918450638.jpeg","publishedAt":"2019-04-21T22:22:41Z","content":"NBC NEWS EVENT — Pictured: (l-r) New Jersey Governor Chris Christie, Facebook CEO Mark Zuckerberg, and Newark Mayor Cory Booker — NBC News hosts EDUCATION NATION, an educational summit on Rockefeller Plaza Photo by: Charles Sykes/NBC\r\nOur tech betters sure ar… [+4821 chars]"},{"source":{"id":null,"name":"Dallasnews.com"},"author":"Cheryl Hall","title":"Michael Sorrell is fighting poverty one Paul Quinn College student at a time","description":"Michael Sorrell’s biggest challenge is showing Dallas that the reincarnation of Paul Quinn College isn’t a pipe dream.After 12 years under his...","url":"https://www.dallasnews.com/business/business/2019/04/21/michael-sorrell-fighting-poverty-one-paul-quinn-student-time","urlToImage":"https://dallasnews.imgix.net/1555560845-NB_05PaulQuinn.jpg?w=1200&h=630&format=jpg&crop=faces&fit=crop","publishedAt":"2019-04-21T11:00:00Z","content":"Debt of gratitude\r\nFormer Dallas Mayor Ron Kirk says the city owes Sorrell a debt of gratitude.\r\nIts not too much to say that if it hadnt been for Michaels personal commitment, passion and downright stubbornness, we wouldnt have Paul Quinn College, and that w… [+2885 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.facebook.com/DailyMailCeleb","title":"Cher, 72, dazzles in an elaborate warrior-inspired costume as she performs","description":"Cher looked all parts the A-lister on Saturday as she stepped out on stage in Philadelphia, Pennsylvania for another date of her Here We Go Again tour.","url":"https://www.dailymail.co.uk/tvshowbiz/article-6944267/Cher-72-dazzles-elaborate-warrior-inspired-costume-performs.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/21/10/12533222-0-image-a-37_1555837408923.jpg","publishedAt":"2019-04-21T09:45:25Z","content":"She rose to fame in the 1960s and is widely known as the Goddess of Pop.\r\nAnd Cher looked all parts the A-lister on Saturday as she stepped out on stage in Philadelphia, Pennsylvania for another date of her Here We Go Again tour. \r\nThe musician, 72, wore an e… [+3032 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.facebook.com/DailyMailCeleb","title":"Chaz Bono keeps it casual while running some weekend errands around LA","description":"The actor and political activist, 49, was dressed in a dark grey Henley and blue jeans for his outing. Chaz topped his look off with his usual thick-rimmed glasses. Not seen was his girlfriend.","url":"https://www.dailymail.co.uk/tvshowbiz/article-6944099/Chaz-Bono-keeps-casual-running-weekend-errands-LA.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/21/06/12529804-0-image-a-8_1555824523622.jpg","publishedAt":"2019-04-21T05:36:48Z","content":"He's the son of famous singing duo Sonny and Cher.\r\nBut Chaz Bono looked like the average Joe while running errands around LA on Saturday.\r\nThe actor and political activist, 49, was dressed in a dark grey Henley and blue jeans for his outing.\r\nAround town: Ch… [+1694 chars]"},{"source":{"id":null,"name":"Dianeravitch.net"},"author":"dianeravitch","title":"Kansas: Students, Parents Rebel Against Mark Zuckerberg’s Summit Learning","description":"Today, the New York Times posted a story about a rebellion in Kansas against Mark Zuckerberg’s Summit Learning platform. They said NO to Facebook’s “personalized learning,” which replaces teachers with Chromebooks. Good for the students of Kansas! WELLINGTON,…","url":"https://dianeravitch.net/2019/04/21/kansas-students-parents-rebel-against-mark-zuckerbergs-summit-learning/","urlToImage":"https://greatschoolwars.files.wordpress.com/2017/12/diane.jpg?w=200","publishedAt":"2019-04-21T17:00:01Z","content":"WELLINGTON, Kan. The seed of rebellion was planted in classrooms. It grew in kitchens and living rooms, in conversations between students and their parents.\r\nIt culminated when Collin Winter, 14, an eighth grader in McPherson, Kan., joined a classroom walkout… [+2992 chars]"},{"source":{"id":null,"name":"Bostonherald.com"},"author":"Mike Pingree","title":"Man busted after driving Harley into Wisconsin factory, starting up forklift","description":"A drunken former employee drove his Harley-Davidson motorcycle up an access ramp, into a two-block-long factory in Menasha, Wis., and through the production areas of the building where he used to work at speeds reaching 35 to 40 mph. He then dismounted and st…","url":"https://www.bostonherald.com/2019/04/21/man-busted-after-driving-harley-into-wisconsin-factory-starting-up-forklift/","urlToImage":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","publishedAt":"2019-04-21T04:26:05Z","content":"A drunken former employee drove his Harley-Davidson motorcycle up an access ramp, into a two-block-long factory in Menasha, Wis., and through the production areas of the building where he used to work at speeds reaching 35 to 40 mph. He then dismounted and st… [+2490 chars]"},{"source":{"id":null,"name":"Denverpost.com"},"author":"The Associated Press","title":"Republicans across the country championed a national popular vote until Trump","description":"WASHINGTON -- For years, polls show, Republicans across the country championed a national popular vote to elect presidents, instead of the state-by-state tally of the Electoral College.","url":"https://www.denverpost.com/2019/04/21/national-popular-vote-republicans-trump/","urlToImage":"https://www.denverpost.com/wp-content/uploads/2019/03/AP19088667928204.jpg?w=1024&h=682","publishedAt":"2019-04-21T18:36:20Z","content":"By Matt Vasilogambros, The Associated Press\r\nWASHINGTON — For years, polls show, Republicans across the country championed a national popular vote to elect presidents, instead of the state-by-state tally of the Electoral College.\r\nBut something changed: Donal… [+13892 chars]"},{"source":{"id":null,"name":"Ctvnews.ca"},"author":"CTV Winnipeg","title":"How to be protected as warmer weather brings ticks - CTV News","description":"How to be protected as warmer weather brings ticks CTV News Here's what you need to know as tick season arrives CBC.ca Bug that causes relapsing fever identified in tick collected in Ireland The Irish Times Pennsylvania lab offers free tick testing WKBN.com W…","url":"https://winnipeg.ctvnews.ca/how-to-be-protected-as-warmer-weather-brings-ticks-1.4388635","urlToImage":"https://www.ctvnews.ca/polopoly_fs/1.4388666.1555889568!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","publishedAt":"2019-04-21T23:07:00Z","content":"The warmer weather has arrived in Manitoba and many people are heading outdoors, but that means its time to watch out for whats lurking.\r\nTicks have now hatched and its important to be on the lookout.\r\nAt this time of year they are the nymphs, so they are as … [+1118 chars]"},{"source":{"id":null,"name":"Wnd.com"},"author":"Chuck Norris","title":"God, guns and Glock","description":"There’s a joke or meme about me I even added to my “Official Chuck Norris Fact Book”: “Chuck Norris sleeps with a pillow under his gun.” Outside of being funny, it’s not far from the truth. During Easter week, I was pondering again the power that God and guns…","url":"https://www.wnd.com/2019/04/god-guns-and-glock/","urlToImage":"https://www.wnd.com/files/2017/10/Chuck-Norris.jpg","publishedAt":"2019-04-21T19:28:16Z","content":"There’s a joke or meme about me I even added to my “Official Chuck Norris Fact Book”: “Chuck Norris sleeps with a pillow under his gun.” Outside of being funny, it’s not far from the truth.\r\nDuring Easter week, I was pondering again the power that God and gun… [+8017 chars]"},{"source":{"id":null,"name":"Fee.org"},"author":"David Unsworth","title":"The National Debt is the Most Serious Crisis America Faces","description":"Why do Americans fail to understand how ruinous our national debt truly is and what an astounding percent of our national budget we are now spending on interest?","url":"https://fee.org/articles/the-national-debt-is-the-most-serious-crisis-america-faces/","urlToImage":"https://fee.org/media/33665/worried.jpg?center=0.28490028490028491,0.53041825095057038&mode=crop&height=466&widthratio=2.0171673819742489270386266094&rnd=132000724280000000","publishedAt":"2019-04-21T15:00:49Z","content":"A generation ago, the national debt stood at just a smidgen over USD $4 trillion and a young presidential candidate named Bill Clinton was discussing a great plan he had to have it entirely paid off by now. Oops. The national debt is now 5.5 times bigger.\r\nMo… [+7933 chars]"},{"source":{"id":null,"name":"Thepennyhoarder.com"},"author":"cat.hiles@gmail.com (Catherine Hiles)","title":"We’ve Got You Covered: Our Picks for 2019’s Best Car Insurance Companies","description":"Finding the best car insurance depends on your budget, needs and whether or not you have a teenage driver. Here are the best car insurance companies for your situation. This was originally published on The Penny Hoarder, which helps millions of readers worldw…","url":"http://www.thepennyhoarder.com/smart-money/best-car-insurance/","urlToImage":"https://cdn.thepennyhoarder.com/wp-content/uploads/2019/03/29142959/best-car-insurance-1024x683.jpg","publishedAt":"2019-04-21T15:00:41Z","content":"Car ownership comes with unseen costs. Everyones least favorite: the dreaded insurance.\r\nCar insurance companies often get a bad rap, partially thanks to reviews from disgruntled customers. That makes it hard to determine the best auto insurance for you.\r\nWha… [+12447 chars]"},{"source":{"id":null,"name":"Activistpost.com"},"author":"Activist Post","title":"The National Debt is the Most Serious Crisis America Faces","description":"By David Unsworth A generation ago, the national debt stood at just a smidgen over USD $4 trillion and a young presidential candidate named Bill...","url":"https://www.activistpost.com/2019/04/the-national-debt-is-the-most-serious-crisis-america-faces.html","urlToImage":"https://www.activistpost.com/wp-content/uploads/2019/04/money-debts.jpg","publishedAt":"2019-04-21T15:50:49Z","content":"By David Unsworth\r\nA generation ago, the national debt stood at just a smidgen over USD $4 trillion and a young presidential candidate named Bill Clinton was discussing a great plan he had to have it entirely paid off by now. Oops. The national debt is now 5.… [+7889 chars]"},{"source":{"id":null,"name":"Databreaches.net"},"author":"Dissent","title":"TX: EmCare Says Patient and Employee Personal Data Were Hacked","description":"Related Posts:Verity Health System of California, Inc. and Verity&hellip;ATI Physical Therapy notifies patients of data breachMN: Dakota County Notifies 1,000...","url":"https://www.databreaches.net/tx-emcare-says-patient-and-employee-personal-data-were-hacked/","urlToImage":null,"publishedAt":"2019-04-21T12:59:48Z","content":"Jim Silver and Hailey Waller report:\r\nEmCare Inc. recently learned an unauthorized party obtained access to a number of employees email accounts that contained the personal information of as many as 60,000 individuals, 31,000 of which are patients, the compan… [+4810 chars]"},{"source":{"id":null,"name":"Desmogblog.com"},"author":"Sharon Kelly","title":"Gas Driller at Center of 2019 Pulitzer-Winning Book on Fracking Still Faces Legal Battles","description":"Read time: 7 mins Eliza Griswold’s book Amity and Prosperity: One Family and the Fracturing of America examines the impacts of fracking in western Pennsylvania, and on Monday it was awarded the Pulitzer Prize in General Nonfiction. Griswold’s book carefully r…","url":"https://www.desmogblog.com/2019/04/21/range-resources-amity-and-prosperity-pulitzer-pennsylvania-fracking","urlToImage":"https://www.desmogblog.com/sites/beta.desmogblog.com/files/blogimages/girl-summit-elementary-playground-pennsylvania-fracking_credit-moms-clean-air-force_creative-commons_0.jpg","publishedAt":"2019-04-21T10:56:05Z","content":"Eliza Griswolds book Amity and Prosperity: One Family and the Fracturing of America examines the impacts of fracking in western Pennsylvania, and on Monday it was awarded the Pulitzer Prize in General Nonfiction.\r\nGriswolds book carefully refuses the birds-ey… [+8616 chars]"},{"source":{"id":null,"name":"Governmentslaves.news"},"author":"newsguy76","title":"Why Philly’s Reformist Prosecutor Finally Supports Letting Mumia Abu-Jamal’s Appeal Go Forward","description":"Mumia Abu-Jamal’s long struggle for freedom and justice gained crucial ground this week. The former Black Panther, activist, and journalist will get a new hearing to appeal his conviction for the 1981…","url":"https://governmentslaves.news/2019/04/21/why-phillys-reformist-prosecutor-finally-supports-letting-mumia-abu-jamals-appeal-go-forward/","urlToImage":"https://governmentslaves.news/wp-content/uploads/2019/01/cropped-G-1.png","publishedAt":"2019-04-21T16:15:37Z","content":"Mumia Abu-Jamals long struggle for freedom and justice gained \r\ncrucial ground this week. The former Black Panther, activist, and \r\njournalist will get a new hearing to appeal his conviction for the 1981 \r\nkilling of a Philadelphia police officer. On Wednesda… [+2400 chars]"},{"source":{"id":null,"name":"Freemalaysiatoday.com"},"author":"AFP","title":"Polanski sues US motion picture academy for reinstatement","description":"Roman Polanski is suing the US Academy of Motion Picture Arts and Sciences to reverse his expulsion, saying he was never given a hearing.","url":"https://www.freemalaysiatoday.com/category/world/2019/04/21/polanski-sues-us-motion-picture-academy-for-reinstatement/","urlToImage":"https://s3media.freemalaysiatoday.com/wp-content/uploads/2019/04/roman-polanski.jpg","publishedAt":"2019-04-21T02:20:23Z","content":"Roman Polanski pleaded guilty in 1977 to having had unlawful sex with a 13-year-old girl. (AFP pic)\r\nLOS ANGELES: Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year af… [+2664 chars]"},{"source":{"id":null,"name":"Metafilter.com"},"author":"CollectiveMind","title":"Do I understand this correctly?","description":"I am trying to explain radio station market share and average quarter hours. I wrote these two paragraphs trying to compare the listening area of New York City verses Beckley, West Virginia. I've researched this to death but want to make sure what I wrote mak…","url":"http://ask.metafilter.com/333365/Do-I-understand-this-correctly","urlToImage":"http://cdn.mefi.us/images/askmefi/apple-touch-icon.png","publishedAt":"2019-04-21T00:48:23Z","content":"Once stations know how many people listen, that number is compared to the number of people who are within range of the stations signal. Thats the stations potential audience. AQH is divided by the number of people a stations signal could reach and multiplied … [+771 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Associated Press","title":"Court battle over sedative used for executions in Arkansas is renewed","description":"A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after the state raced to put eight convicted killers to death in 11 days before a previ…","url":"https://www.latimes.com/nation/la-na-arkansas-executions-lethal-injection-20190420-story.html","urlToImage":"https://www.latimes.com/resizer/NNhY8U5cNcj07RlQ2-SD2xgNezo=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/I6TOWCEBZFCWRECOTOHSHERA7I.jpg","publishedAt":"2019-04-21T02:35:00Z","content":"A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after the state raced to put eight convicted killers to death in 11 days before a previ… [+3696 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"MARC LEVY","title":"Pennsylvania eyes retirement-savings plan for its portfolio","description":"HARRISBURG, Pa. (AP) — With Pennsylvania facing a wave of retirees leaving the workforce with no savings, top state officials are working to head off the financial blow. A task force organized by Treasurer Joe Torsella has spurred an effort that now has key s…","url":"https://www.seattletimes.com/seattle-news/northwest/pennsylvania-eyes-retirement-savings-plan-for-its-portfolio/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-21T14:04:24Z","content":"HARRISBURG, Pa. (AP) With Pennsylvania facing a wave of retirees leaving the workforce with no savings, top state officials are working to head off the financial blow.\r\nA task force organized by Treasurer Joe Torsella has spurred an effort that now has key st… [+4351 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Dante Chinni","title":"Crowded field complicates 2020 polling","description":"The fact that Trump wasn’t even in the race at this point in the 2016 cycle should serve as a point of caution for anyone making predictions about 2020.","url":"https://www.nbcnews.com/politics/meet-the-press/biden-bernie-lead-early-polls-don-t-place-bets-yet-n996761","urlToImage":"https://media4.s-nbcnews.com/j/newscms/2019_01/2705191/nbc-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.nbcnews-fp-1200-630.png","publishedAt":"2019-04-21T14:43:00Z","content":"Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\r\nSUBSCRIBE\r\nApril 21, 2019, 2:43 PM GMT\r\nIts Easter Sunday of 2019, but many political watchers are already looking ahead to 2020 and who will win the … [+4625 chars]"},{"source":{"id":null,"name":"Americanthinker.com"},"author":null,"title":"And now for the latest episode of 'Identity politics USA'","description":"The life and times of what used to be a serious party.","url":"https://www.americanthinker.com/blog/2019/04/and_now_for_the_latest_episode_of_identity_politics_usa.html","urlToImage":"https://www.americanthinker.com/images/bucket/2019-04/213250.jpg","publishedAt":"2019-04-21T05:00:00Z","content":"Back in the late 1970s, there was a TV show about a Cuban family in Miami called Que pasa USA.  It was a hilarious look at Cuban immigrants adapting to life in the U.S., from the grandparents who could not stop talking about Cuba to the parents who had to sur… [+3404 chars]"},{"source":{"id":null,"name":"Jamaicaobserver.com"},"author":null,"title":"UTech, Jamaica research provide hope for stroke patients","description":"RESEARCH by Professor Felix Akinladejo, recently appointed professor of Computer Information Systems in the Faculty of Engineering and Computing, University of Technology (UTech), Jamaica, on computer model and virtual reality technology for post- stroke reha…","url":"http://www.jamaicaobserver.com/your-health-your-wealth/utech-jamaica-research-provide-hope-for-stroke-patients_162745?profile=1470","urlToImage":"http://www.jamaicaobserver.com/apps/pbcsi.dll/storyimage/JO/20190421/ARTICLE/304219933/AR/0/AR-304219933.jpg","publishedAt":"2019-04-21T05:09:04Z","content":"RESEARCH by Professor Felix Akinladejo, recently appointed professor of Computer Information Systems in the Faculty of Engineering and Computing, University of Technology (UTech), Jamaica, on computer model and virtual reality technology for post- stroke reha… [+3088 chars]"},{"source":{"id":null,"name":"Commondreams.org"},"author":null,"title":"Nuclear Weapons Ruined My Life, and I Wouldn't Have It Any Other Way","description":"As someone deeply embedded in a life of anti-nuclear resistance, I know the only way to get rid of these weapons is to never stop thinking about them.. I want to offer you something different than the barrage of facts and figures around nuclear weapons. But l…","url":"https://www.commondreams.org/views/2019/04/21/nuclear-weapons-ruined-my-life-and-i-wouldnt-have-it-any-other-way","urlToImage":"https://www.commondreams.org/sites/default/files/views-article/thumbs/screen_shot_2019-04-21_at_10.55.01_am.jpg","publishedAt":"2019-04-21T14:56:40Z","content":"I want to offer you something different than the barrage of facts and figures around nuclear weapons. But lets establish the basics. There are nine countries that possess them: France, China, the United Kingdom, India, Pakistan, Israel, North Korea and of cou… [+27914 chars]"},{"source":{"id":null,"name":"Npr.org"},"author":"Sacha Pfeiffer","title":"Inside The Mueller Report, This Man Found A Photo Of His Dad Being Used By Russians","description":"When a redacted version of special counsel Robert Mueller's report on Russian interference in the 2016 election was released to the public and Congress this week, the effects of Russian influence efforts through social media became clearer. Part of the inform…","url":"https://www.npr.org/2019/04/21/715765240/inside-the-mueller-report-this-man-found-a-photo-of-his-dad-being-used-by-russia","urlToImage":"https://media.npr.org/assets/img/2019/04/21/ira-poster-in-mueller-report_wide-e52eaba206fadcf1e497bc6d7b1f49869e2028fa.jpg?s=1400","publishedAt":"2019-04-21T23:32:05Z","content":"When a redacted version of special counsel Robert Mueller's report on Russian interference in the 2016 election was released to the public and Congress this week, the effects of Russian influence efforts through social media became clearer. \r\nPart of the info… [+2043 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Becky Peterson","title":"This map shows which states in the US are competing to top California-based Uber's $15.7 billion in equity funding","description":"With $US15.7 billion in equity funding in its pocket, the San Francisco, California-based ride-hailing company Uber has raised more money than any other tech startup in the country. But California isn’t the only state in the union harboring highly-funded tech…","url":"https://www.businessinsider.com.au/map-top-funded-tech-startups-us-2019-4","urlToImage":"https://static.businessinsider.com/image/5cba155012ece23e3c091c74-640.jpg","publishedAt":"2019-04-21T14:00:00Z","content":"With $US15.7 billion in equity funding, Uber is the most highly-funded tech startup in the United States.\r\nThis map by CB Insights shows that there’s plenty of money to go around.\r\nFlorida’s Magic Leap, an augmented reality has raised $US2.4 billion in fundin… [+3848 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.facebook.com/DailyMail","title":"Hunt for Philadelphia high speed hit-and-run driver who sparked six-car pile-up that killed two","description":"Pennsylvania police say a Chevy Camaro was heading south at high speed in Philadelphia before midnight on Saturday when it hit cars waiting to turn north at a traffic light.","url":"https://www.dailymail.co.uk/news/article-6944995/Driver-hit-run-crash-killed-2-injured-5-sought.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/21/19/12545848-0-image-a-52_1555870259783.jpg","publishedAt":"2019-04-21T18:43:18Z","content":"Pennsylvania police are seeking a driver in a hit-and-run crash that killed two people and injured five others in northeast Philadelphia on Saturday.\r\nLaw enforcement says the Chevy Camaro was barreling down the road when it hit vehicles waiting at the Red Li… [+1933 chars]"},{"source":{"id":null,"name":"Bangkokpost.com"},"author":"Bangkok Post Public Company Limited","title":"Polanski sues US motion picture academy for reinstatement","description":"LOS ANGELES - Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.","url":"https://www.bangkokpost.com/news/world/1664656/polanski-sues-us-motion-picture-academy-for-reinstatement","urlToImage":"https://www.bangkokpost.com/media/content/20190421/3167972.jpg","publishedAt":"2019-04-21T00:45:09Z","content":"LOS ANGELES - Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.\r\nDirector Roman Polanski is suing the US… [+2719 chars]"},{"source":{"id":null,"name":"Phillymag.com"},"author":"Michael Callahan","title":"Is This Rich Middle-Aged White Guy From Texas the Most Revolutionary Thinker in Philly?","description":"Richard Vague said he wanted to do the focus groups himself. Yes, yes, he told his seasoned — and worried — political advisers; he knew […] The post Is This Rich Middle-Aged White Guy From Texas the Most Revolutionary Thinker in Philly? appeared first on Phil…","url":"https://www.phillymag.com/news/2019/04/20/richard-vague-philadelphia/","urlToImage":"https://cdn10.phillymag.com/wp-content/uploads/sites/3/2019/04/richard-vague-fb.jpg","publishedAt":"2019-04-21T01:00:59Z","content":"CityRichard Vague is known in Philadelphia as a venture capitalist and a Renaissance Man. Soon he may be known as something else entirely: a presidential candidate.\r\nRichard Vague in his Center City office. Photograph by Justin James Muir\r\nRichard Vague said … [+26587 chars]"},{"source":{"id":null,"name":"Slickdeals.net"},"author":"jkhanlar","title":"$206.89 + FS at Amazon for Panda PAN56MGP3 Portable Compact Washing Machine, Cloth Washer 1.6 cu.ft $221.37","description":"Amazon \n \nPanda PAN56MGP3 Portable Compact Washing Machine, Cloth Washer 1.6 cu.ft  \n \nhttps://www.amazon.com/gp/product/B07NHVFWCQ/ref=ox_sc_mini_detail?ie=UTF8&psc=1&smid=ATVPDKIKX0DER \n \nCu ...","url":"https://slickdeals.net/f/13030567-206-89-fs-at-amazon-for-panda-pan56mgp3-portable-compact-washing-machine-cloth-washer-1-6-cu-ft-221-37","urlToImage":"https://static.slickdealscdn.com/attachment/4/9/0/2/7/1/8025556.attach","publishedAt":"2019-04-21T06:57:04Z","content":"AmazonPanda PAN56MGP3 Portable Compact Washing Machine, Cloth Washer 1.6 cu.ft \r\nhttps://www.amazon.com/gp/product...PDKIK\r\nX0DER\r\nCurrently $206.89 &amp; FREE Shipping.\r\nWas $245.99 &amp; FREE Shipping\r\nTax for me was $14.48 in Pennsylvania"},{"source":{"id":null,"name":"Northjersey.com"},"author":"North Jersey Record, Mike Kelly, North Jersey Record","title":"It's time for Trump to stop talking about the 9/11 attacks: OPINION","description":"Donald Trump's latest Tweet is yet another example of his attempt to politicize 9/11","url":"https://www.northjersey.com/story/news/columnists/mike-kelly/2019/04/19/its-time-trump-stop-talking-9-11-attacks/3506775002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/17b8f1763a2abd2efe67f06163d65af722679fcc/c=0-141-1664-1081/local/-/media/2017/09/11/Bergen/NorthJersey/636407480416541425-0910117-NineElevenNYC-2661.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-21T11:39:23Z","content":"A video tour of Old Tennent Church in Manalapan, which was built in 1751 and still has scars from the Battle of Monmouth.\r\n Jerry Carino, @njhoopshaven\r\nOn the same day that America bid farewell to another firefighter who succumbed to cancer linked to the tox… [+7015 chars]"},{"source":{"id":null,"name":"Rollingout.com"},"author":"Terry Shropshire","title":"Bill Cosby is suing his own lawyers","description":"Comedian Bill Cosby can no longer see very well, but he says he can easily see that his former attorneys gouged him for millions of dollars. The legendary entertainer is now suing to get his money back. The man who used to be affectionately called “America’s …","url":"https://rollingout.com/2019/04/21/bill-cosby-is-suing-his-own-lawyers/","urlToImage":"https://rollingout.com/wp-content/uploads/2018/04/bill-cosby-2_arshaw.png","publishedAt":"2019-04-21T14:49:49Z","content":"Bill Cosby. Photo: By A.R. Shaw\r\nComedian Bill Cosby can no longer see very well, but he says he can easily see that his former attorneys gouged him for millions of dollars. The legendary entertainer is now suing to get his money back.\r\nThe man who used to be… [+1892 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"Michael Fitzsimmons","title":"Gulfport Energy Vs. Cabot Oil & Gas - Part II","description":"The two companies appear to be heading in opposite directions despite the general consensus that Gulfport is significantly undervalued. It all comes down to fre","url":"https://seekingalpha.com/article/4255584-gulfport-energy-vs-cabot-oil-and-gas-part-ii","urlToImage":"https://static2.seekingalpha.com/uploads/2019/4/20/173432-15557804817326062.png","publishedAt":"2019-04-21T18:55:45Z","content":"Last November, I published an article here on Seeking Alpha on Gulfport Energy (GPOR) and comparing it to Cabot Oil &amp; Gas (COG). Several users gave me a hard time in the comments section for my preference of Cabot over Gulfport. My outlook was based on Ca… [+7609 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By SARAH M. WOJCIK, The (Allentown) Morning Call","title":"Colonial-era fort site commemorated to guard legacy","description":"WHITEHALL, Pa. (AP) — Just south of the Sheetz gas station off MacArthur Road, buried beneath about 4 feet of soil and rocky fill, likely lie the remnants of Fort Deshler, a more than 250-year-old encampment that protected Lehigh County…","url":"https://apnews.com/9004d612dfa1486c9d06ed6c597b481b","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-21T14:11:55Z","content":"WHITEHALL, Pa. (AP) Just south of the Sheetz gas station off MacArthur Road, buried beneath about 4 feet of soil and rocky fill, likely lie the remnants of Fort Deshler, a more than 250-year-old encampment that protected Lehigh County settlers living in the h… [+6226 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"PA Cleveland OH Zone Forecast","description":"PA Cleveland OH Zone Forecast for Sunday, April 21, 2019","url":"https://www.richmond.com/news/ap/pa-cleveland-oh-zone-forecast/article_d452608d-9474-5b78-a398-a24c17c245ad.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-21T13:06:10Z","content":"PA Cleveland OH Zone Forecast for Sunday, April 21, 2019\r\n566 FPUS51 KCLE 211302\r\nZFPCLE\r\nZone Forecast Product for Northern Ohio and Northwest Pennsylvania\r\nNational Weather Service Cleveland OH\r\n902 AM EDT Sun Apr 21 2019\r\nPAZ001-212015-\r\nNorthern Erie-\r\nIn… [+4576 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"NY Binghamton NY Zone Forecast","description":"NY Binghamton NY Zone Forecast for Saturday, April 20, 2019","url":"https://www.richmond.com/news/ap/ny-binghamton-ny-zone-forecast/article_35c1e15b-2871-5a56-aa1f-659e88ed2b27.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-21T08:36:14Z","content":"NY Binghamton NY Zone Forecast for Saturday, April 20, 2019\r\n604 FPUS51 KBGM 210832\r\nZFPBGM\r\nZone Forecast Product for Central New York and Northeast Pennsylvania\r\nNational Weather Service Binghamton NY\r\n431 AM EDT Sun Apr 21 2019\r\nThis is an automatically ge… [+25523 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"OH Cleveland OH Zone Forecast","description":"OH Cleveland OH Zone Forecast for Sunday, April 21, 2019","url":"https://www.richmond.com/news/ap/oh-cleveland-oh-zone-forecast/article_93b7a8ee-7e7f-5173-8832-1e635d2c6df8.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-21T13:06:10Z","content":"OH Cleveland OH Zone Forecast for Sunday, April 21, 2019\r\n566 FPUS51 KCLE 211302\r\nZFPCLE\r\nZone Forecast Product for Northern Ohio and Northwest Pennsylvania\r\nNational Weather Service Cleveland OH\r\n902 AM EDT Sun Apr 21 2019\r\nOHZ003-212015-\r\nLucas-\r\nIncluding … [+41673 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"PA State College PA Zone Forecast","description":"PA State College PA Zone Forecast for Saturday, April 20, 2019","url":"https://www.richmond.com/news/ap/pa-state-college-pa-zone-forecast/article_75217194-9f62-54e7-8721-353c2380e648.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-21T08:21:15Z","content":"PA State College PA Zone Forecast for Saturday, April 20, 2019\r\n260 FPUS51 KCTP 210817\r\nZFPCTP\r\nZone Forecast Product for Central Pennsylvania\r\nNational Weather Service State College PA\r\n415 AM EDT Sun Apr 21 2019\r\nPAZ064-212000-\r\nAdams-\r\nIncluding the city o… [+57494 chars]"},{"source":{"id":null,"name":"Japantimes.co.jp"},"author":"No Author, No Author","title":"Polanski sues Oscars academy for reinstatement","description":"Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled...","url":"https://www.japantimes.co.jp/culture/2019/04/21/entertainment-news/polanski-sues-oscars-academy-reinstatement/","urlToImage":"https://cdn.japantimes.2xx.jp/wp-content/uploads/2019/04/f-polanski-a-20190422-870x580.jpg","publishedAt":"2019-04-21T04:33:39Z","content":"LOS ANGELES - Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.\r\nPolanski, who in 1977 pleaded guilty in… [+2551 chars]"},{"source":{"id":null,"name":"Startribune.com"},"author":"Paul Douglas","title":"A Few Easter Showers - Maps Look Like Spring","description":"A frontal boundary approaches today, increasing the odds of bumping into a shower or T-storm. Steadier rain arrives tonight & Monday, up to an inch of rain may fall before skies clear Tuesday. Expect a run of 60s next week; a shower risk early Thursday - then…","url":"http://www.startribune.com/a-few-easter-showers-maps-look-like-spring/508860652/","urlToImage":"http://stmedia.stimg.co/pauldouglas_1555765443_Easter.JPG?h=630&w=1200&fit=crop&bg=999&crop=faces","publishedAt":"2019-04-21T03:36:44Z","content":"Easter Sunday\r\nWOW - what a spectacular Saturday it was with high temps reaching the 70s and low 80s across the southern half of the state. In fact, high temps in the Twin Cities were the warmest of 2019 so far and the warmest since October 3rd when the mercu… [+27802 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":null,"title":"2-vehicle crash in Pennsylvania kills 3","description":"ABBOTSTOWN, Pa. (AP) — Authorities have released the names of two of the three people killed in a two-vehicle crash in central Pennsylvania.","url":"https://lancasteronline.com/news/pennsylvania/vehicle-crash-in-pennsylvania-kills/article_8f389ac6-9959-5f52-adf9-b92572f11c5d.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/8/fd/8fd98df2-8171-11e5-b67c-5fe96ff54470/563779296ff09.image.jpg?resize=778%2C552","publishedAt":"2019-04-21T19:35:33Z","content":"ABBOTSTOWN, Pa. (AP) Authorities have released the names of two of the three people killed in a two-vehicle crash in central Pennsylvania.\r\nThe York County coroner's office says a vehicle heading east on Route 30 just before 5:30 p.m. Saturday in Paradise Tow… [+737 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":null,"title":"2-vehicle crash in York County kills 3","description":"ABBOTSTOWN, Pa. (AP) — Authorities say a two-vehicle crash in central Pennsylvania killed three people.","url":"https://lancasteronline.com/news/pennsylvania/vehicle-crash-in-york-county-kills/article_8f389ac6-9959-5f52-adf9-b92572f11c5d.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/8/fd/8fd98df2-8171-11e5-b67c-5fe96ff54470/563779296ff09.image.jpg?resize=778%2C552","publishedAt":"2019-04-21T15:18:00Z","content":"ABBOTSTOWN, Pa. (AP) Authorities say a two-vehicle crash in central Pennsylvania killed three people.\r\nThe York County coroner's office says a vehicle heading east on Route 30 just before 5:30 p.m. Saturday in Paradise Township reportedly crossed into the wes… [+566 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"LANCASTERONLINE | Staff","title":"Lancaster County bankruptcies: April 21, 2019","description":"Here is a list of Lancaster County bankruptcies recorded in U.S. Bankruptcy Court, Eastern District of Pennsylvania, Reading, April 9-15.","url":"https://lancasteronline.com/business/bankruptcies/lancaster-county-bankruptcies-april/article_5441d512-6113-11e9-b73a-53bb7e9ee874.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/a/1f/a1f9649a-404d-11e5-9395-bb71d2a36c11/55ca2f7bd7d1d.image.jpg?resize=570%2C400","publishedAt":"2019-04-21T11:00:00Z","content":"Here is a list of Lancaster County bankruptcies recorded in U.S. Bankruptcy Court, Eastern District of Pennsylvania, Reading, April 9-15.\r\nTimothy M. Seager, 100 block of East Main Street, Adamstown. Chapter 7.\r\nRonald Lee Laughman Jr., 1000 block of Truce Ro… [+925 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"LANCASTERONLINE | Staff","title":"Easter Sunday: events, food tips, tricks for celebration [photos, video]","description":"Happy Easter!","url":"https://lancasteronline.com/news/local/easter-sunday-events-food-tips-tricks-for-celebration-photos-video/article_0a0f5418-6435-11e9-9243-1bd44ad78a82.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/f/c9/fc9ea930-5e32-11e9-9c70-a3781edcb00c/5cb254551d9c9.image.jpg?resize=568%2C630","publishedAt":"2019-04-21T12:57:00Z","content":"Happy Easter!\r\nThough you may already have your plans carved in stone, here are some more ideas to make your Easter just that much more special.\r\nWhether you're looking for leftover food tips, Easter egg hunts or other means of celebrating, we have you covere… [+786 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"JUNIOR GONZÁLEZ | Staff Writer","title":"Lancaster Watchdog: State chapter investigating sudden AmVets Post 19 closure","description":"What’s going on with AmVets Post 19?","url":"https://lancasteronline.com/news/local/lancaster-watchdog-state-chapter-investigating-sudden-amvets-post-closure/article_e3ce0dc6-643e-11e9-b043-6be9678076fb.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/8/8c/88cac2b8-8019-11e6-9cd9-ab9481780e63/57e2b7c4b0380.image.jpg?resize=778%2C553","publishedAt":"2019-04-21T14:18:00Z","content":"Whats going on with AmVets Post 19?\r\nThe veteran social volunteer organization chapter at 715 Fairview Ave. has been closed for at least a month, according to members, and some of the chapters members have wondered why.\r\nIt just doesnt make any sense, AmVets … [+2758 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"HEATHER STAUFFER | Staff Writer","title":"Lancaster General considers doubling size of emergency department, adding patient tower","description":"Faced with increasing demand that intensified with a neighbor’s recent closure, the largest hospital in Lancaster County might get even bigger.","url":"https://lancasteronline.com/news/local/lancaster-general-considers-doubling-size-of-emergency-department-adding-patient/article_bcb7086a-62b7-11e9-a9a7-3ff26b47047f.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/a/f7/af76ac56-6220-11e9-8a14-5b19e8d8b228/5cb8eb9d5f00c.image.jpg?resize=952%2C630","publishedAt":"2019-04-21T09:00:00Z","content":"Faced with increasing demand that intensified with a neighbors recent closure, the largest hospital in Lancaster County might get even bigger.\r\nJan Bergen, president and CEO of Penn Medicine Lancaster General Health, told LNP that two major expansions at the … [+6676 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"JENELLE JANCI | Staff Writer","title":"Here's what you need to know about the 11th annual Launch Music Conference and Festival","description":"About 14,000 musicians, fans and industry professionals will soon fill the streets of Lancaster city.","url":"https://lancasteronline.com/features/here-s-what-you-need-to-know-about-the-th/article_0f1fc752-62b5-11e9-8c8a-5fdeffaba843.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/0/01/001afb28-4047-11e8-aff6-8f8641558be0/5ad2a1d854a87.image.jpg?resize=971%2C630","publishedAt":"2019-04-21T09:00:00Z","content":"About 14,000 musicians, fans and industry professionals will soon fill the streets of Lancaster city.\r\nThe 11th annual Launch Music Conference &amp; Festival kicks off Thursday night and continues through the wee hours of Sunday morning.\r\nThe event was founde… [+5897 chars]"},{"source":{"id":null,"name":"Investopedia.com"},"author":"Kevin B. Johnston","title":"Top 5 Steel Stocks of 2019","description":"Steel represents a significant amount of materials trading done on the stock market. Some companies perform better than others—for a number of reasons.","url":"https://www.investopedia.com/investing/top-steel-stocks/","urlToImage":"https://www.investopedia.com/thmb/LS3Qm-NO7HPJbH1BL_s0ArdgoKI=/680x440/filters:fill(auto,1)/shutterstock_203914771.jpg_steel_tubes-5bfc3ade46e0fb00265ff5b0.jpg","publishedAt":"2019-04-21T13:51:33Z","content":"The steel sub-sector which falls under the broader basic material sector. Steel represents a significant amount of materials trading done on the stock market, but as is the case with other sectors, individual companies perform better than othersfor a number o… [+8099 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"2-vehicle crash in Pennsylvania kills 3","description":"ABBOTSTOWN, Pa. (AP) — Authorities say a two-vehicle crash in central Pennsylvania killed three people.","url":"https://apnews.com/2dc63d5759c74c27aeb516aefff176dc","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-21T15:18:00Z","content":"ABBOTSTOWN, Pa. (AP) Authorities say a two-vehicle crash in central Pennsylvania killed three people.\r\nThe York County coroner's office says a vehicle heading east on Route 30 just before 5:30 p.m. Saturday in Paradise Township reportedly crossed into the wes… [+566 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By CAROL THOMPSON Lansing State Journal","title":"Michigan experts warn residents about spotted lanternflies","description":"LANSING, Mich. (AP) — The bugs don't look so menacing when they're pinned to the bottom of a cardboard box.","url":"https://apnews.com/811b58029935412cb134d701e14090b0","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-21T05:05:18Z","content":"LANSING, Mich. (AP) The bugs don't look so menacing when they're pinned to the bottom of a cardboard box.\r\nBy some standards they are pretty, with speckled outer wings, long legs curved delicately inward, a bold splotch of red that flashes when they fly.\r\nIn … [+14360 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"A battle over management of Savannah's planned arena","description":"SAVANNAH, Ga. (AP) — A Georgia city's plan to hire a management firm to operate its planned arena is being challenged by a competitor.","url":"https://apnews.com/fdcbb2b7185e49af84c25359dac95fb5","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-21T16:40:04Z","content":"SAVANNAH, Ga. (AP) A Georgia city's plan to hire a management firm to operate its planned arena is being challenged by a competitor.\r\nThe Savannah Morning News reports that Los Angeles-based Oak View Group was recently recommended for the job after it scored … [+1453 chars]"},{"source":{"id":null,"name":"Phillymag.com"},"author":"Sandy Hingston","title":"The Best Thing That Happened This Week: The Great State Amphibian Debate","description":"In recent months, our state legislature has been, um, mired in a furious argument over whether to name the Eastern hellbender or Wehrle’s salamander Pennsylvania’s official state […] The post The Best Thing That Happened This Week: The Great State Amphibian D…","url":"https://www.phillymag.com/news/2019/04/20/best-thing-pennsylvania-amphibian-hellbender/","urlToImage":"https://cdn10.phillymag.com/wp-content/uploads/sites/3/2019/04/best-thing-Hellbender-1200x630-fb.jpg","publishedAt":"2019-04-21T00:56:10Z","content":"The Best Thing This WeekYoull be happy to know its been settled at last.\r\nIn recent months, our state legislature has been, um, mired in a furious argument over whether to name the Eastern hellbender or Wehrles salamander Pennsylvania’s official state amphibi… [+1358 chars]"},{"source":{"id":null,"name":"Southbendtribune.com"},"author":"By Bill Moor Columnist","title":"Readers submit their favorite songs that mention cities","description":"It's Part II of \"cities in song.\"","url":"https://www.southbendtribune.com/news/community/readers-submit-their-favorite-songs-that-mention-cities/article_9773bb07-5de3-5160-bfa6-b4af23a3fcad.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/southbendtribune.com/content/tncms/assets/v3/editorial/c/09/c0928793-608f-5c68-bed3-330efabbf140/5b0dbfcbc1da1.image.jpg?resize=424%2C630","publishedAt":"2019-04-21T09:45:00Z","content":"Cue up a little traveling music. Readers shared some of their favorite songs that mention destinations and datelines in this cities in song column Part II:\r\nWhen Mickey Skelly was in his teens, he decided he would visit all the places from Boston to Frisco Ba… [+4588 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"By MARC LEVY Associated Press","title":"Pennsylvania eyes retirement-savings plan for its portfolio","description":"With Pennsylvania facing a wave of retirees leaving the workforce with no savings, top state officials are working to head off the financial blow. A task force organized by Treasurer … Click to Continue »","url":"https://www.charlotteobserver.com/news/business/national-business/article229518054.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-21T14:04:45Z","content":"Pennsylvania eyes retirement-savings plan for its portfolio\r\nHARRISBURG, Pa.\r\n With Pennsylvania facing a wave of retirees leaving the workforce with no savings, top state officials are working to head off the financial blow.\r\nA task force organized by Treasu… [+4341 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Brantly, Rodriguez lead the way for Lehigh Valley","description":"ALLENTOWN, Pa. (AP) -- Rob Brantly homered and doubled twice, driving home three runs and scoring a couple as the Lehigh Valley IronPigs defeated the Rochester Red Wings 13-8 on … Click to Continue »","url":"https://www.charlotteobserver.com/sports/article229513749.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-21T02:15:33Z","content":"Brantly, Rodriguez lead the way for Lehigh Valley\r\nAllentown, Pennsylvania\r\n ALLENTOWN, Pa. (AP) -- Rob Brantly homered and doubled twice, driving home three runs and scoring a couple as the Lehigh Valley IronPigs defeated the Rochester Red Wings 13-8 on Satu… [+1003 chars]"},{"source":{"id":null,"name":"Nydailynews.com"},"author":"David Krajicek","title":"Two decades of killing inspired by the Columbine massacre","description":"If mass murder by alienated young men is a contagion, as many experts believe, then Eric David Harris is the Typhoid Mary of this particular disease. In death, the alpha of the two Columbine killers has become an icon of that aggrieved peer group. Harris and …","url":"https://www.nydailynews.com/news/crime/ny-justice-story-columbine-mass-killers-20190421-l6qjw5ixjfc2dbdixnx2qs6c6y-story.html","urlToImage":"https://www.nydailynews.com/resizer/c55AIHb7qsrVFG1J84VYtGcDeEU=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/IVD2MLGXPNBBJKXWO2IZOLMVUQ.jpg","publishedAt":"2019-04-21T04:00:37Z","content":"If mass murder by alienated young men is a contagion, as many experts believe, then Eric David Harris is the Typhoid Mary of this particular disease.\r\nIn death, the alpha of the two Columbine killers has become an icon of that aggrieved peer group.\r\nHarris an… [+5263 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Celia Wexler","title":"Soros, DHS whistleblowers urge more truth-telling","description":"For whistleblowers, it’s the Emmys, the Grammys, and the Oscars rolled into one.","url":"https://www.salon.com/2019/04/21/soros-dhs-whistleblowers-urge-more-truth-telling/","urlToImage":"https://media.salon.com/2018/02/george-soros.jpg","publishedAt":"2019-04-21T14:59:38Z","content":"For whistleblowers, it’s the Emmys, the Grammys, and the Oscars rolled into one. The Ridenhour Prizes mark the one time each year that they and their supporters are celebrated for their important and often dangerous work.\r\nThe ceremony, founded in 2003 and he… [+9810 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Talia Buford","title":"In a time of cheap fossil fuels, nuclear power companies are seeking — and getting — big subsidies","description":"Illinois and NY have approved hundreds of millions of dollars in clean-energy incentives for nuclear power","url":"https://www.salon.com/2019/04/21/in-a-time-of-cheap-fossil-fuels-nuclear-power-companies-are-seeking-and-getting-big-subsidies_partner/","urlToImage":"https://media.salon.com/2018/06/nuclear-power-plant.jpg","publishedAt":"2019-04-21T11:29:18Z","content":"The energy company PSEG had a simple message for the New Jersey Legislature as it weighed the fate of three nuclear plants in the state.\r\n“What’s good for New Jersey is what’s good for PSEG,” Ralph Izzo, the company’s chairman, president and CEO, told the Leg… [+19326 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Arnold R. Isaacs","title":"Looking back at 1919: immigration, race, and women’s rights, then and now","description":"The 2019 calendar is full of dates that evoke similar echoes","url":"https://www.salon.com/2019/04/21/looking-back-at-1919-immigration-race-and-womens-rights-then-and-now_partner/","urlToImage":"https://media.salon.com/2018/07/german-immigrants.jpg","publishedAt":"2019-04-21T08:29:31Z","content":"Reading about immigration policy, religious and racial bigotry, and terrorism fears in America in 1919 offers an eerie sense of decades melting away and past and present blurring together.\r\nThe blend isn’t exact. Bigotry was expressed much more explicitly a c… [+15624 chars]"},{"source":{"id":null,"name":"Newser.com"},"author":"Bob Cronin","title":"Wife Admits Killing KKK Leader","description":"\"I fired both shots that killed my husband,\" Malissa Ancona told a Missouri judge in pleading guilty to second-degree murder in the 2017 death of a KKK leader. Her son, who's also charged, helped her clean the crime scene and dispose of the body but wasn't in…","url":"http://www.newser.com/story/274162/wife-admits-killing-kkk-leader.html","urlToImage":"http://www.newser.com//img1-azrcdn.newser.com/image/1233848-12-20190421094027.jpeg","publishedAt":"2019-04-21T14:26:00Z","content":"(Newser)\r\n\"I fired both shots that killed my husband,\" Malissa Ancona told a Missouri judge in pleading guilty to second-degree murder in the 2017 death of a KKK leader. Her son, who's also charged, helped her clean the crime scene and dispose of the body but… [+1035 chars]"},{"source":{"id":null,"name":"Nydailynews.com"},"author":"Michael Gartland","title":"Former Podolsky business associate claims landlords’ lawyer engaged in fraud; brothers covered it up","description":"The city’s $173 million deal to buy 17 apartment buildings and convert them to permanent affordable housing has come under fire for months, but there is an unknown, and equally unsettling, story about how the shady landlords who sold the properties obtained t…","url":"https://www.nydailynews.com/news/politics/ny-metro-podolsky-dfouni-de-blasio-carone-20190421-ttyaolgg2fgardv5gdajwchkxe-story.html","urlToImage":"https://www.nydailynews.com/resizer/CLh5IJIaLYN9gFqXKlKah8fWIsA=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/ZCNW7ARX6VHLDHWGK6IJNURT3E.JPG","publishedAt":"2019-04-21T11:00:04Z","content":"The citys $173 million deal to buy 17 apartment buildings and convert them to permanent affordable housing has come under fire for months, but there is an unknown, and equally unsettling, story about how the shady landlords who sold the properties obtained th… [+7823 chars]"},{"source":{"id":null,"name":"Seattlepi.com"},"author":"jim_jaillet","title":"Some Spring Cleaning…","description":"Mary is no longer available for RV traveling, but we remain good friends. Because we have 5,000+ postings, I’ve invited her to continue posting entries on this blog. Sadly Mary is struggling with health issues. To see the latest about her situation, click her…","url":"https://blog.seattlepi.com/ramblinman/2019/04/21/some-spring-cleaning/","urlToImage":"https://otrwjam.files.wordpress.com/2015/05/dsc040481b1.jpg","publishedAt":"2019-04-21T11:57:59Z","content":"Mary is no longer available for RV traveling, but we remain good friends.Because we have 5,000+ postings, Ive invited her to continue posting entries on this blog.Sadly Mary is struggling with health issues. To see the latest about her situation, click here\r\n… [+3004 chars]"},{"source":{"id":null,"name":"Slashdot.org"},"author":"feedfeeder","title":"A Blazing Hot Coal Seam Shows How Microbes Can Spring to Life","description":"A decades-long fire in Pennsylvania revealed some unexpected twists in how microbes survive in harsh environments.","url":"https://slashdot.org/firehose.pl?op=view&amp;id=108220890","urlToImage":null,"publishedAt":"2019-04-21T12:12:15Z","content":"The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."},{"source":{"id":null,"name":"Hhhistory.com"},"author":"Kathleen Rouser","title":"Textbooks for a Growing Country: McGuffey's Eclectic Readers","description":"When I began homeschooling my children many moons ago, I attended a conference where a man spoke about a traditional back-to-basics curr...","url":"https://www.hhhistory.com/2019/04/textbooks-for-growing-country-mcguffeys.html","urlToImage":"https://1.bp.blogspot.com/-Mqyw61b1m1s/XLP_a1B-u7I/AAAAAAAAFWQ/Y5oubmbORMsUQvbjXAYypGm7qpM9WhGbACEwYBhgL/w1200-h630-p-k-no-nu/William_Holmes_McGuffey.jpg","publishedAt":"2019-04-21T04:30:00Z","content":"When I began homeschooling my children many moons ago, I attended a conference where a man spoke about a traditional back-to-basics curriculum for children. His name was George Mott and he’d begun a company which published facsimile versions of the original M… [+6580 chars]"},{"source":{"id":"the-irish-times","name":"The Irish Times"},"author":"Paul Clements","title":"Finding the source of the binge – and other hidden delights","description":"For some reason it is often the inconsequential titbit that remains lodged in the mind long after a trip abroad. While hitchhiking along the Rhine in the late 1970s, I came across the German town of Bingen. My Penguin guidebook informed me that it lies at the…","url":"https://www.irishtimes.com/opinion/finding-the-source-of-the-binge-and-other-hidden-delights-1.3866134","urlToImage":"https://www.irishtimes.com/image-creator/?id=1.3866132&origw=1440","publishedAt":"2019-04-21T17:01:00Z","content":"For some reason it is often the inconsequential titbit that remains lodged in the mind long after a trip abroad. While hitchhiking along the Rhine in the late 1970s, I came across the German town of Bingen. My Penguin guidebook informed me that it lies at the… [+4144 chars]"},{"source":{"id":null,"name":"Variety.com"},"author":"chrislwillman","title":"Mott the Hoople: 2019’s Great Rock Resurrection","description":"Ian Hunter borrowed a bit of Easter imagery for “Roll Away the Stone,” the closing number from Mott the Hoople’s final studio album in 1974. He didn’t take the religious symbolism much further for a song that is a jubilant paean to enduring love and, implicit…","url":"https://variety.com/2019/music/news/mott-the-hoople-reunion-resurrection-interview-1203194152/","urlToImage":"https://pmcvariety.files.wordpress.com/2019/04/p1010233-2-e1555881516570.jpg?w=700&h=393&crop=1","publishedAt":"2019-04-21T21:21:38Z","content":"Ian Hunter borrowed a bit of Easter imagery for “Roll Away the Stone,” the closing number from Mott the Hoople’s final studio album in 1974. He didn’t take the religious symbolism much further for a song that is a jubilant paean to enduring love and, implicit… [+16835 chars]"},{"source":{"id":null,"name":"Wonkette.com"},"author":"Doktor Zoom","title":"The Great Depression Coulda Been Worse: What If Herbert Hoover Had Twitter?","description":"Happy Day Before Half-Priced Easter Chocolate Day, Wonkers! Time to wrap up our Wonkette Book Club discussion of Winter War: Hoover, Roosevelt, and the First Clash Over the New Deal, by Erich Rauchway, a historian at UC-Davis. We're increasingly convinced the…","url":"https://www.wonkette.com/great-depression-could-have-been-worse-what-if-herbert-hoover-had-twitter","urlToImage":"https://wonkette-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F19408166%2F1200x600.jpg/2000%2C2000/A5ELgozL%2Bfh7jvNo/img.jpg","publishedAt":"2019-04-21T17:38:36Z","content":"Happy Day Before Half-Priced Easter Chocolate Day, Wonkers! Time to wrap up our Wonkette Book Club discussion of Winter War: Hoover, Roosevelt, and the First Clash Over the New Deal, by Erich Rauchway, a historian at UC-Davis. We're increasingly convinced the… [+16823 chars]"},{"source":{"id":null,"name":"Smallbiztrends.com"},"author":"Michael Guta","title":"The Ultimate Small Business Guide to the Most Popular Social Media Apps By State - Small Business Trends","description":"The Ultimate Small Business Guide to the Most Popular Social Media Apps By State - Small Business Trends smallbiztrends.com","url":"https://smallbiztrends.com/2019/04/most-popular-social-media-apps.html","urlToImage":"https://smallbiztrends.com/wp-content/uploads/2019/04/Social-Media.png","publishedAt":"2019-04-21T13:01:22Z","content":"Knowing how and which social media platform your audience uses is an important data point. Identifying this information will improve your engagement level and marketing efforts. And according to a new report by CenturyLinkQuote, the platforms vary from state … [+5658 chars]"},{"source":{"id":null,"name":"Afp.com"},"author":null,"title":"Polanski sues US motion picture academy for reinstatement","description":"Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.The global network of Agence France-Presse covers 1","url":"https://www.afp.com/en/news/3954/polanski-sues-us-motion-picture-academy-reinstatement-doc-1ft30a3","urlToImage":null,"publishedAt":"2019-04-21T06:23:00Z","content":"Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.\r\nPolanski, who in 1977 pleaded guilty in California to… [+2558 chars]"}]}