{"status":"ok","totalResults":120,"articles":[{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Joey Garrison, USA TODAY","title":"KKK leader's wife admits to killing her husband","description":"The wife of a Ku Klux Klan leader in Missouri admitted Friday to the 2017 murder of her husband after initially saying that her son was the murderer.","url":"https://www.usatoday.com/story/news/nation/2019/04/20/kkk-leader-wife-admits-killing-husband-missouri/3528837002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/20/USAT/9fcfda3a-3c86-470e-923e-670d109e994d-AP_KKK_Leader_Killed.JPG?crop=1965,1139,x0,y269&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T19:05:39Z","content":"This photo provided by the St. Francois County Sheriff's Department in Farmington, Mo., shows Malissa Ancona, Ancona has admitted fatally shooting her husband, an imperial wizard in the Ku Klux Klan. The St. Louis Post-Dispatch reports that Ancona pleaded gui… [+4887 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Mara Wilson","title":"What Atlantic Readers Thought About Marijuana in the ’90s","description":"In 1994, Eric Schlosser made the case for decriminalizing marijuana and eliminating mandatory minimum sentencing. Readers had a wide array of responses.","url":"https://www.theatlantic.com/letters/archive/2019/04/marijuana-decriminalization-1990s-reefer-madness/587617/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/GettyImages_85625036/facebook.jpg?1555702044","publishedAt":"2019-04-20T15:30:00Z","content":"In 1994, Eric Schlosser was eating breakfast at home when he received a phone call from the Editor-in-Chief of The Atlantic, Bill Whitworth. “Eric,” Schlosser recalls Whitworth asking, “is there anyone in prison right now for marijuana?” The call came as a su… [+12697 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"daniel@politico.com (Daniel Lippman)","title":"POLITICO Playbook: Trump team’s newest scapegoat: Don McGahn … Biden starts taking 2020 cash","description":null,"url":"https://www.politico.com/newsletters/playbook/2019/04/20/trump-teams-newest-scapegoat-don-mcgahn-biden-starts-taking-2020-cash-426840","urlToImage":"https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg","publishedAt":"2019-04-20T14:16:17Z","content":"Former White House counsel Don McGahn cooperated extensively with special counsel Robert Mueller's team of federal prosecutors. | Melina Mara-Pool/Getty Images\r\nDRIVING THE DAY\r\nTHE LATEST MUELLER FALLOUT DONALD VS. DON -- Giuliani Attacks McGahns Account to … [+25797 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Casey Quinlan","title":"Washington state passes law extending statute of limitations for victims of sexual violence","description":"Washington Gov. Jay Inslee (D) signed into law on Friday an extension of the statute of limitations for some cases of sexual assault and removes the statute of limitation for serious sex crimes against children. Without this law, it would have been more diffi…","url":"https://thinkprogress.org/washington-state-passes-law-extending-statute-of-limitations-for-victims-of-sexual-violence-49d88db6a08e/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1143635036.jpg?w=1024&h=680&crop=1","publishedAt":"2019-04-20T18:44:00Z","content":"Washington Gov. Jay Inslee (D) signed into law on Friday an extension of the statute of limitations for some cases of sexual assault and removes the statute of limitation for serious sex crimes against children.\r\nWithout this law, it would have been more diff… [+4272 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Natasha Lennard","title":"Why Philly’s Reformist Prosecutor Finally Supports Letting Mumia Abu-Jamal’s Appeal Go Forward","description":"Activists were angry when Philly DA Larry Krasner initially objected to Mumia Abu-Jamal’s path to a new appeal, but Krasner changed course last week. The post Why Philly’s Reformist Prosecutor Finally Supports Letting Mumia Abu-Jamal’s Appeal Go Forward appea…","url":"https://theintercept.com/2019/04/20/mumia-abu-jamal-larry-krasner/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/GettyImages-1507780-mumia-1555702227-e1555702325175.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-20T11:30:02Z","content":"Philadelphia District Attorney Larry Krasner speaks with members of the media during a news conference in Philadelphia on Dec. 19, 2018.\r\nPhoto: Matt Rourke/AP\r\nMumia Abu-Jamals\r\n long struggle for freedom and justice gained crucial ground this week. The form… [+6471 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Billy Duberstein)","title":"Why MedMen Could Be the Best Pot Stock in the U.S… or the Worst","description":"This cannabis retailer is spending big in hopes of making an even larger impact.","url":"https://www.fool.com/investing/2019/04/20/why-medmen-could-be-the-best-pot-stock-in-the-us-o.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519406/forget-stoner-page-2018.jpg","publishedAt":"2019-04-20T10:30:00Z","content":"With Canada's legalization of marijuana in late 2018, much of the attention has been on companies that sell into the country's fully legal market, but now that Canada has gone ahead, many think full U.S. decriminalization could be around the corner.\r\nEven wit… [+7868 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"DWIGHT GARNER","title":"Books of The Times: The Mueller Report: A Thorny, Patriotic Addition to a Curious American Bookshelf","description":"Much of what’s in the report is already known, but our book critic says it still has “the power to shock and appall.”","url":"https://www.nytimes.com/2019/04/20/books/review-mueller-report.html","urlToImage":"https://static01.nyt.com/images/2019/04/20/books/20bookmueller/20bookmueller-facebookJumbo.jpg","publishedAt":"2019-04-20T15:48:52Z","content":"The theme of the Mueller report, like the theme of Thomas Hardys The Mayor of Casterbridge, is lies and the souls of those who tell them. Through the entirety of the report, Trump is observed to lie, at almost every moment, like Falstaff telling Hal how many … [+1281 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Matthew Rozsa","title":"Bernie's Fox News town hall at Bethlehem Steel: Perfect symbol of American populism","description":"Bernie on Fox in Bethlehem: It sounded like a contradiction, but captured something essential in America","url":"https://www.salon.com/2019/04/20/how-the-bernie-sanders-town-hall-at-bethlehem-steel-symbolized-american-populism/","urlToImage":"https://media.salon.com/2019/04/sanders-town-hall.jpg","publishedAt":"2019-04-20T06:00:28Z","content":"On Election Day 2016, I crisscrossed a region of eastern Pennsylvania known as the Lehigh Valley — my home — covering local voting activity. At one point I stopped at the Bethlehem Steel Stacks, a hollow and rusted husk looming next to a hip culture center kn… [+10910 chars]"},{"source":{"id":null,"name":"Psychologytoday.com"},"author":"Christopher Bergland","title":"Psilocybin, Sublime Awe, and Flow Made “Oneness” My Religion","description":"A recent study found a link between strong \"oneness beliefs\" and greater life satisfaction. This post explores three key ingredients that made me a lifelong believer in \"oneness.\"","url":"https://www.psychologytoday.com/us/blog/the-athletes-way/201904/psilocybin-sublime-awe-and-flow-made-oneness-my-religion","urlToImage":"https://cdn.psychologytoday.com/sites/default/files/styles/image-article_inline_full/public/field_blog_entry_teaser_image/2019-04/caspar_david_friedrich_-_the_grosse_gehege_near_dresden_-_google_art_project.jpg?itok=Ler6Zc60","publishedAt":"2019-04-20T15:30:38Z","content":"A few days ago, I wrote a post, Does Flow Open Our Minds to Believing in Oneness? which was inspired by a recent study (Edinger-Schons, 2019) published in the Psychology of Religion and Spirituality. This follow-up post explores how oneness became my religion… [+14832 chars]"},{"source":{"id":null,"name":"Postsecret.com"},"author":"Frank","title":"PostSecret Live! in Pennsylvania","description":"Free multi-media PostSecret Live! presentation, book signing and postcard exhibition. Wednesday, April 24, at 7:30 p.m. in Lemmond Theatre in Walsh Hall.","url":"http://postsecret.com/2019/04/20/postsecret-live-in-pennsylvania/","urlToImage":null,"publishedAt":"2019-04-20T04:22:07Z","content":null},{"source":{"id":null,"name":"Forbes.com"},"author":"Bruce Japsen, Contributor, Bruce Japsen, Contributor https://www.forbes.com/sites/brucejapsen/","title":"In Medicare-For-All Debate, Insurers Bet They're Loved More Than Bernie","description":"Amid Medicare for All debate, health insurance companies are touting their growing businesses and surveys showing consumer support.","url":"https://www.forbes.com/sites/brucejapsen/2019/04/20/in-medicare-for-all-debate-insurers-bet-theyre-loved-more-than-bernie/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1137452656%2F960x0.jpg","publishedAt":"2019-04-20T12:30:00Z","content":"BETHLEHEM, PA - APRIL 15: Democratic presidential candidate, U.S. Sen. Bernie Sanders (I-VT) participates in a FOX News Town Hall at SteelStacks on April 15, 2019 in Bethlehem, Pennsylvania. Sanders is running for president in a crowded field of\r\nGetty Images… [+7443 chars]"},{"source":{"id":null,"name":"Pennlive.com"},"author":"Travis Kellar | tkellar@pennlive.com","title":"Another tornado in central Pa.? National Weather Service is investigating - PennLive","description":"Another tornado in central Pa.? National Weather Service is investigating PennLive A survey crew from the National Weather *Service* will be investigating possible tornado damage in parts of south central Pennsylvania, including Franklin County... View full c…","url":"https://www.pennlive.com/news/2019/04/another-tornado-in-central-pa-national-weather-service-is-investigating.html","urlToImage":"https://www.pennlive.com/resizer/maSjlbJO2Z70jtaUXC2zV68T5SE=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/237XPQATQVFBJGGX2BCKYI5RNU.jpg","publishedAt":"2019-04-20T14:31:00Z","content":"Officials with the National Weather Service will be investigating to determine if a tornado caused damage in parts of southcentral Pennsylvania Friday night.\r\nMike Dangelo, meteorologist with National Weather Service in State College, said an official would b… [+884 chars]"},{"source":{"id":null,"name":"Abc11.com"},"author":"Don Schwenneker","title":"Weather NC: Severe storms expected across NC, including Raleigh, on Friday, tornadoes possible - WTVD-TV","description":"Weather NC: Severe storms expected across NC, including Raleigh, on Friday, tornadoes possible WTVD-TV LIVE: At least five fatalities confirmed as severe outbreak brings tornadoes, flooding from Florida to Virginia AccuWeather.com ORLANDO WEATHER: Hail, damag…","url":"https://abc11.com/weather/weather-main-threat-over;-pop-up-showers-possible-through-midnight/5259436/","urlToImage":"https://cdn.abcotvs.com/dip/images/5260782_041919-wtvd-brittany-main-evening-wx-vid.jpg?w=1600","publishedAt":"2019-04-20T00:09:53Z","content":"Central North Carolina endured numerous tornado warnings and reports of damage as heavy rain and wind lashed the area. By 8 p.m., all tornado watches and warnings had expired in the ABC11 viewing area, except for Mecklenburg County, Virginia, which remains on… [+1511 chars]"},{"source":{"id":null,"name":"Cumberlink.com"},"author":"Sentinel Staff","title":"Severe thunderstorm warning issued; 70 mph gusts possible - Carlisle Sentinel","description":"Severe thunderstorm warning issued; 70 mph gusts possible Carlisle Sentinel Storms bring winds, tornadoes Friday to the Triangle Raleigh News & Observer Heavy rain and storm threat exits region. Tornado causes damage in Reston. The Washington Post Multiple re…","url":"https://cumberlink.com/news/local/severe-thunderstorm-warning-issued-mph-gusts-possible/article_8b49ec17-f556-5863-ac02-87eb8d44db5a.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/cumberlink.com/content/tncms/assets/v3/editorial/f/91/f9124616-0ebd-52e8-a195-d3963ad2f378/5b089970c31e2.image.jpg?crop=432%2C243%2C0%2C94&resize=432%2C243&order=crop%2Cresize","publishedAt":"2019-04-20T00:37:00Z","content":"The National Weather Service has issued a sever thunderstorm warning for Cumberland County effective until 9:15 p.m. Friday.\r\nAt 8:33 pm., a severe thunderstorm was located near Scotland, moving northeast at 30 mph.\r\nThe Weather Service said radar indicated 7… [+561 chars]"},{"source":{"id":null,"name":"Ktvz.com"},"author":"#printStr($author.authorFirstName) #printStr($author.authorLastName)","title":"Storms will drench the Northeast before the weather finally warms up - KTVZ","description":"Storms will drench the Northeast before the weather finally warms up KTVZ Confirmed tornado in Reston, Va. damages homes, cars WTOP Severe weather moves toward the Northeast ABC News Tornado touch down confirmed in Siler City; cleanup underway WGHP FOX 8 Gree…","url":"https://www.ktvz.com/news/national-world/storms-will-drench-the-northeast-before-the-weather-finally-warms-up/1070808308","urlToImage":"https://static.lakana.com/npg-global-us-east-1/photo/2019/04/20/georgia%20storm%20damage_1555754350692.jpg.jpg.jpg_38147825_ver1.0_1280_720.jpg","publishedAt":"2019-04-20T10:10:00Z","content":"The front facade of a furniture store in Kingsland , Georgia, was ripped off by high winds on Friday, April 19, 2019. \r\nRelated Content\r\n(CNN) - Warm weather is just a few more thunderstorms away.\r\nThe storm system that made its way through the South and Mid-… [+2495 chars]"},{"source":{"id":null,"name":"Pennlive.com"},"author":"Sean Sauro | ssauro@pennlive.com","title":"Two tornadoes with winds stronger than 100 mph touched down in central Pa. - PennLive","description":"Two tornadoes with winds stronger than 100 mph touched down in central Pa. PennLive Franklin County, Va. tornado rated an EF3 WWBT NBC12 News National Weather Service investigating after severe storms rip through Franklin County WGAL Susquehanna Valley Pa. Se…","url":"https://www.pennlive.com/news/2019/04/two-tornadoes-with-winds-stronger-than-100-mph-touched-down-friday-in-central-pa.html","urlToImage":"https://www.pennlive.com/resizer/maSjlbJO2Z70jtaUXC2zV68T5SE=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/237XPQATQVFBJGGX2BCKYI5RNU.jpg","publishedAt":"2019-04-20T23:06:00Z","content":"At least two tornadoes, both with wind speeds stronger than 100 mph, touched down Friday evening in central Pennsylvania, where they damaged roofs and uprooted trees.\r\nNo one was injured by the tornadoes, which touched down after 7 p.m. in Huntingdon and Juni… [+2210 chars]"},{"source":{"id":null,"name":"Carscoops.com"},"author":"Sergiu Tudose","title":"Ford Fiesta Drives Through Red Light, Stops Into Pickup Truck","description":"After missing a Jeep, the Fiesta collided with a pickup truck, though luckily no one was injured.","url":"https://www.carscoops.com/2019/04/ford-fiesta-driver-runs-red-light-crashes-into-pickup-truck/","urlToImage":"https://images.carscoops.com/2019/04/99e6e46c-accidents-fiesta-runs-red-hits-truck.gif","publishedAt":"2019-04-20T14:55:25Z","content":"Even though the driver of the Ford Fiesta was one hundred percent at fault here, we can’t help but reiterate the importance of always being alert and aware of your surroundings when driving.\r\nThat’s because you never know who’s not paying attention, talking o… [+1350 chars]"},{"source":{"id":null,"name":"Mcall.com"},"author":"Ryan Kneller","title":"Retail Watch: Small businesses blooming in Emmaus - Allentown Morning Call","description":"Retail Watch: Small businesses blooming in Emmaus Allentown Morning Call Like the daffodils blooming throughout downtown Emmaus, a host of small businesses are also blossoming in the borough.","url":"https://www.mcall.com/business/retail-watch/mc-biz-small-businesses-blooming-in-emmaus-20190420-v5ln3gjyljhxhb2onahyvifjve-story.html","urlToImage":"https://www.mcall.com/resizer/rHOvRJEll_aikGFNZ1fKWYFAUOk=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/T7RQJ3ZFJNAOVD2SVNVHXMFSVE.jpg","publishedAt":"2019-04-20T11:02:10Z","content":"Like the daffodils blooming throughout downtown Emmaus, a host of small businesses are also blossoming in the borough.\r\nTwo businesses Your CBD Store and The Mix Bartending School recently opened, two more Conversational Threads Fiber Arts Studio and South Mo… [+7052 chars]"},{"source":{"id":null,"name":"Wvnews.com"},"author":"Conor Griffith BUSINESS EDITOR","title":"NETL sees developments in tech research and partnerships in WV - WV News","description":"NETL sees developments in tech research and partnerships in WV WV News MORGANTOWN — When factoring in new leadership, new research, improvements to promising projects and partnerships to get new AAA technology into the...","url":"https://www.wvnews.com/news/wvnews/netl-sees-developments-in-tech-research-and-partnerships-in-wv/article_bbc49771-5aa2-591e-83d1-00b5714ab519.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/wvnews.com/content/tncms/assets/v3/editorial/0/dc/0dc7b507-64a1-5ee6-a621-60c904f802f1/5ca7d5887eac7.image.jpg?resize=945%2C630","publishedAt":"2019-04-20T12:00:00Z","content":"MORGANTOWN When factoring in new leadership, new research, improvements to promising projects and partnerships to get new AAA technology into the hands of industry, the past year has been busy one for the U.S. Department of Energys National Energy Technology … [+5927 chars]"},{"source":{"id":null,"name":"Baseballamerica.com"},"author":"Teddy Cahill","title":"College Baseball Roundup: Arkansas Wins Big, Texas Tech Evens Key Series - Baseball America","description":"College Baseball Roundup: Arkansas Wins Big, Texas Tech Evens Key Series Baseball America Arkansas clinched a series win against Mississippi State in a key SEC West showdown, highlighting Friday's college baseball action.","url":"https://www.baseballamerica.com/stories/arkansas-slugs-its-way-to-win-texas-tech-evens-key-series/","urlToImage":"https://www.baseballamerica.com/media/8776/arkansas_cws_getty.jpg","publishedAt":"2019-04-20T07:19:02Z","content":"Arkansas Slugs Its Way To Key Series Win\r\nThe SEC West Division is college baseballs most competitive and it got another shakeup Friday as No. 10 Arkansas defeated No. 3 Mississippi State, 12-5, to clinch the series. The Razorbacks have won six straight home … [+10656 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 22k-Mile 1999 Mercedes-Benz C230 Kompressor","description":"This 1999 Mercedes-Benz C230 Kompressor was first sold in December 1998 by Ertley MotorWorld of Wilkes-Barre, Pennsylvania and remained with its original owner until October 2018. The car shows 22k miles and is finished in Bordeaux Red over a Parchment leathe…","url":"https://bringatrailer.com/listing/1999-mercedes-benz-c230-kompressor/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/03/1999_mercedes-benz_c230_kompressor_155407768495d565ef66e7d44E04C05-B247-4A29-A3A4-A15C61623E77-e1555710427592.jpeg","publishedAt":"2019-04-20T01:40:15Z","content":"This 1999 Mercedes-Benz C230 Kompressor was first sold in December 1998 by Ertley MotorWorld of Wilkes-Barre, Pennsylvania and remained with its original owner until October 2018. The car shows 22k miles and is finished in Bordeaux Red over a Parchment leathe… [+2047 chars]"},{"source":{"id":null,"name":"Flightglobal.com"},"author":"Dominic Perry","title":"Bell promises to build 407GXi in USA if selected by US Navy","description":"Bell has confirmed that if selected for US Navy s TH-XX trainer contest, its 407GXi will be assembled at a facility in Ozark, Alabama.","url":"https://www.flightglobal.com/news/articles/bell-promises-to-build-407gxi-in-usa-if-selected-by-457595/","urlToImage":null,"publishedAt":"2019-04-20T07:13:45Z","content":"Bell has confirmed that if selected for US Navys TH-XX trainer contest, its 407GXi will be assembled at a facility in Ozark, Alabama.\r\nAlthough the company bills itself as the only US-based manufacturer to be participating in the competition, the airframer bu… [+1127 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"CBS News","title":"Severe weather wreaks havoc on holiday weekend travel","description":"Thousands were without power Saturday morning as several towns tried to recover from days of devastating weather","url":"https://www.cbsnews.com/news/severe-weather-wreaks-havoc-on-holiday-weekend-travel-04-20-2019/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/20/9b080faa-f19a-4a50-9942-a350f884831d/thumbnail/1200x630g4/275b9b63119c93f3cb95438449e6f6c1/weather.png","publishedAt":"2019-04-20T12:58:32Z","content":"Powerful storms producing heavy rain and damaging winds are taking aim at the eastern half of the country, from Texas to Pennsylvania. More than 1,700 flights were canceled Friday nationwide and many of those passengers are now scrambling to find alternatives… [+1663 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"The 10 Costliest States for Cooking Fires","description":"Be careful in the kitchen on Easter Sunday, especially in these places.","url":"https://finance.yahoo.com/news/10-costliest-states-cooking-fires-134621928.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/IOyMkYNVk1MycNluRLs6vQ--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/moneywise_327/3dcc1461aa928dfd159f12c4562ec156","publishedAt":"2019-04-20T13:46:21Z","content":"Your kitchen can be a dangerous place, especially around holidays, like Easter.Typically, holiday distractions (\"Mom, he took my chocolate bunny!\") result in food left unattended on the stove.Insurance giant State Farm says it pays out more than $130 million … [+6173 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Why MedMen Could Be the Best Pot Stock in the U.S… or the Worst","description":"This cannabis retailer is spending big in hopes of making an even larger impact.","url":"https://finance.yahoo.com/news/why-medmen-could-best-pot-103000737.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/SwgTdOY30lMo.HaflcDmBw--~B/aD02NjA7dz0xMzIwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/motleyfool.com/93c2c81177e204442edc3370dc1063f4","publishedAt":"2019-04-20T10:30:00Z","content":"With Canada's legalization of marijuana in late 2018, much of the attention has been on companies that sell into the country's fully legal market, but now that Canada has gone ahead, many think full U.S. decriminalization could be around the corner.\r\nEven wit… [+8278 chars]"},{"source":{"id":"msnbc","name":"MSNBC"},"author":"MSNBC.com","title":"Rep. Dean: Barr lost all credibility","description":"Democratic Rep. Madeleine Dean of Pennsylvania says Attorney General William Barr “lost all credibility” with his summary of the Mueller Report.","url":"https://www.msnbc.com/david-gura/watch/rep-dean-barr-lost-all-credibility-1500670019796","urlToImage":"https://media11.s-nbcnews.com/j/MSNBC/Components/Video/201904/n_gura_dean_190421_1920x1080.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-20T14:29:54Z","content":null},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Roman Polanski sues Oscars academy seeking reinstatement after 'improper' expulsion","description":"Oscar-winning filmmaker Roman Polanski sues to get back in to the Academy of Motion Picture Arts and Sciences, after it expelled him last year.","url":"https://news.yahoo.com/roman-polanski-sues-oscars-academy-204257580.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Dx.ssK6LFZU5OvML90j_Iw--~B/aD0xNDM0O3c9MjA0NztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/usa_today_life_698/704326187abfa70ad9d1e2d2d165b267","publishedAt":"2019-04-20T00:48:53Z","content":"Roman Polanski's expulsion from the Academy of Motion Picture Arts and Sciences last year was \"improper\" and \"invalid,\" the Oscar-winning filmmaker said in a lawsuit he filed Friday seeking to be reinstated. \r\n\"The Academy's actions, sanctions, and decision a… [+3937 chars]"},{"source":{"id":null,"name":"Blogspot.com"},"author":"Igor","title":"Videos: Sublinear Algorithms and Nearest-Neighbor Search workshop, Nov. 27 – Nov. 30, 2018 (Simon Institute and Kavli Foundation)","description":"A blog about Compressive Sensing, Computational Imaging, Machine Learning. Using priors to avoid the curse of dimensionality arising in Big Data.","url":"https://nuit-blanche.blogspot.com/2019/04/videos-sublinear-algorithms-and-nearest.html","urlToImage":"https://3.bp.blogspot.com/-oYnJr1S_tj0/XLi4Zh_LSVI/AAAAAAAAWUQ/3m8wM_fkPpgorFFVzYYUZxptb56WXa8SQCLcBGAs/w1200-h630-p-k-no-nu/notredame.png","publishedAt":"2019-04-20T05:00:00Z","content":"The Sublinear Algorithms and Nearest-Neighbor Search workshop is part of the Program on Foundations of Data Science sponsored by the Simons Institute for the Theory of Computing at Berkeley and the Kavli Foundation. It took place Nov. 27 – Nov. 30, 2018 in Be… [+24927 chars]"},{"source":{"id":"next-big-future","name":"Next Big Future"},"author":"Brian Wang","title":"Treating Precancerous Skin Lesions With Fewer Side Effects","description":"Precancerous skin lesions can be treated with topical targeted therapies to significantly reduce their size and inhibit the growth of cutaneous squamous cell carcinoma, the second most common form of... [[ This is a content summary only. Visit my website for …","url":"https://www.nextbigfuture.com/2019/04/treating-precancerous-skin-lesions-with-fewer-side-effects.html","urlToImage":"https://www.nextbigfuture.com/wp-content/uploads/2019/04/skincancerlesion.jpg","publishedAt":"2019-04-20T03:11:30Z","content":"Precancerous skin lesions can be treated with topical targeted therapies to significantly reduce their size and inhibit the growth of cutaneous squamous cell carcinoma, the second most common form of cancer.\r\nTwo treatmentssmall-molecule kinase inhibitors kno… [+737 chars]"},{"source":{"id":null,"name":"Realmenrealstyle.com"},"author":"Antonio","title":"12 Watch Styles Every Man Should Know","description":"The post 12 Watch Styles Every Man Should Know appeared first on Real Men Real Style. Related posts: 2015 Holiday Gift Guide | 125 Practical Christmas Gifts For Men Elegant Vs Rugged Watches | Which Watch To Buy First? | Watch Wars Dress Like A Rich Man | How…","url":"https://www.realmenrealstyle.com/watch-styles-guide/","urlToImage":"https://www.realmenrealstyle.com/wp-content/uploads/2015/10/Five-Watches-Every-Well-Dressed-Gentleman-Should-Own-745x180.jpg","publishedAt":"2019-04-20T11:55:04Z","content":"The significance of mens watches cant be understated. A watch is an accessory that is universally recognized as both a stylish and utilitarian a tool to tell time and make a statement with all in one.\r\nWith so many different watch styles however, even experie… [+16381 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"CBS Sports Staff","title":"2019 Kentucky Derby odds, predictions: Expert who has nailed 9 Derby-Oaks Doubles releases early picks","description":"Jody Demling has called the winners of both races all but once in the last decade","url":"https://www.cbssports.com/general/news/2019-kentucky-derby-odds-predictions-expert-who-has-nailed-9-derby-oaks-doubles-releases-early-picks/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/07/20/4fcd1ea0-24a4-4428-b169-515b28b9b5d4/thumbnail/770x433/6f82159ee60cd52feda243b42f69661a/newmoneyhoney72018.jpg","publishedAt":"2019-04-20T02:10:27Z","content":"The 2019 Kentucky Derby is quickly approaching. Jockey Mike Smith, who rode Justify to a Triple Crown last year, will sit atop Omaha Beach at Churchill Downs this time around. The Richard Mandella-trained Omaha Beach already won the Arkansas Derby and Rebel S… [+4568 chars]"},{"source":{"id":null,"name":"Rawstory.com"},"author":"Cody Fenwick, AlterNet","title":"The most important mystery in Mueller’s report: Did Trump’s obstruction cover up a conspiracy?","description":"In the wake of Special Counsel Robert Mueller’s expansive case for President Donald Trump’s obstruction of justice, as revealed in the newly public report, a common theme is emerging among much of the commentariat that Trump’s obstruction of the Russia invest…","url":"https://www.rawstory.com/2019/04/important-mystery-muellers-report-trumps-obstruction-cover-conspiracy/","urlToImage":"https://www.rawstory.com/wp-content/uploads/2019/04/Donald_Trump_and_William_Barr-800x430.jpg","publishedAt":"2019-04-20T11:01:55Z","content":"In the wake of Special Counsel Robert Muellers expansive case for President Donald Trumps obstruction of justice, as revealed in the newly public report, a common theme is emerging among much of the commentariat that Trumps obstruction of the Russia investiga… [+7361 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Laura Krantz and Deirdre Fernandes","title":"The wealthy don’t need to cheat to get edge in admissions","description":"The glare of the admissions scandal has obscured the vast ecosystem of other ways that the connected get a leg up — all of which are perfectly legal.","url":"https://www.bostonglobe.com/metro/2019/04/20/for-wealthy-myriad-advantages-college-admissions-even-without-cheating/oNnMf0BIaekFR5a2jeWGuK/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/12/BostonGlobe.com/Metro/Images/senter0002.jpg","publishedAt":"2019-04-20T22:26:11Z","content":"George Washington University president Stephen Trachtenberg was alone in his office one spring day in 2006 when he received an unexpected phone call.\r\nFormer president George H.W. Bush, more than a dozen years out of office, was calling from sunny Kennebunkpo… [+18206 chars]"},{"source":{"id":null,"name":"Acs.org"},"author":"nobody@acs.org(\"Katherine Bourzac\"), Katherine Bourzac","title":"Dopant doubles a crystal's piezoelectricity","description":"Better piezoelectric materials could enable higher-resolution ultrasound imaging","url":"https://cen.acs.org/materials/Dopant-doubles-crystals-piezoelectricity/97/i16?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+cen_latestnews+%28Chemical+%26+Engineering+News%3A+Latest+News%29","urlToImage":"https://cen.acs.org/content/dam/cen/97/16/09716-scicon11-crystal.jpg","publishedAt":"2019-04-20T11:56:20Z","content":"Piezoelectric materials generate mechanical strain under an applied electric field, and vice versa. Over the past 20 years, these materials have come into wide use in inkjet printers, guitar pickups, and devices that generate ultrasound waves for medical imag… [+1217 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Michael Kaskey-Blomain","title":"2019 NBA Playoffs: 76ers vs. Nets Game 4 score, series schedule, results, live stream, TV channels, odds, matchups","description":"The 76ers will try to take both games in Brooklyn and take a 3-1 lead back to Philly","url":"https://www.cbssports.com/nba/news/2019-nba-playoffs-76ers-vs-nets-game-4-score-series-schedule-results-live-stream-tv-channels-odds-matchups/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/20/39eb156e-4028-4f1c-a75a-e35ead760838/thumbnail/770x433/d683ca608057b3b00bb5c6f6de48e898/nets-76ers.jpg","publishedAt":"2019-04-20T22:17:43Z","content":"It hasn't been exactly easy, but the Philadephia 76ers are now one win away from advancing to the Eastern Conference semifinals.\r\nJoel Embiid, who ended up playing after being a game-time decision, led all scorers with 31 points as the third-seeded Sixers out… [+4890 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Christina Maxouris, CNN","title":"Storms will drench the Northeast before the weather finally warms up","description":"Warm weather is just a few more thunderstorms away.  The storm system that made its way through the South and Mid-Atlantic states, killing four people, is now pouring over the Northeast and will move into New England by Sunday.","url":"https://www.cnn.com/2019/04/20/us/severe-weather-saturday-wxc/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190419113715-01-jackson-mississippi-weather-0419-super-tease.jpg","publishedAt":"2019-04-20T08:37:28Z","content":"(CNN)Warm weather is just a few more thunderstorms away. \r\nThe storm system that made its way through the South and Mid-Atlantic states, killing four people, is now pouring over the Northeast and will move into New England by Sunday, the National Weather Serv… [+2341 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Denise Powell, CNN","title":"A peep into the history of Easter's marshmallow icon","description":"Easter is a popular time for America's bunny- and chick-shaped marshmallows friends known as Peeps. Join us as we take a look back at the adventure of a perennial favorite.","url":"https://www.cnn.com/2019/04/20/health/peeps-history/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190417112820-07-peep-history-super-tease.jpg","publishedAt":"2019-04-20T12:14:27Z","content":"(CNN)Easter is a popular time for America's bunny- and chick-shaped marshmallows friends known as Peeps. Every day, about 5.5 million Peeps are produced, roughly 2 billion a year. \r\nPeeps may be made with love, but they also have some less-healthy ingredients… [+5826 chars]"},{"source":{"id":null,"name":"Timesofisrael.com"},"author":null,"title":"Director Polanski sues Motion Picture Academy for reinstatement","description":"Oscar-winner who fled statutory rape rap in 1977 says he wasn't given a chance to defend himself when the academy voted to expel him last year amid #MeToo furor","url":"https://www.timesofisrael.com/director-polanski-sues-motion-picture-academy-for-reinstatement/","urlToImage":"https://static.timesofisrael.com/www/uploads/2018/05/AP18124361939314-e1525876404526-1024x640.jpg","publishedAt":"2019-04-20T21:49:05Z","content":"LOS ANGELES, California — Oscar-winning film director Roman Polanski is suing the Academy of Motion Picture Arts and Sciences, demanding his reinstatement nearly a year after the organization expelled him amid the #MeToo movement.\r\nPolanski, who in 1977 plead… [+2674 chars]"},{"source":{"id":null,"name":"Tribune.com.pk"},"author":"News Desk, News Desk, AFP, News Desk, Reuters, News Desk, AFP, Natasha Raheel, AFP, AFP","title":"TV shows ‘encourage’ teenagers to drink, smoke and have sex: study","description":"Exposure to shows such as 'Empire', 'Sex Education' and '13 Reasons Why' make teens see these behaviours positively The post TV shows ‘encourage’ teenagers to drink, smoke and have sex: study appeared first on The Express Tribune.","url":"https://tribune.com.pk/story/1955417/9-tv-shows-encourage-teenagers-drink-smoke-sex-study/","urlToImage":"https://c.tribune.com.pk/2019/04/1955417-download-1555780490-724-640x480.jpg","publishedAt":"2019-04-20T17:38:03Z","content":"More than 300 young people, aged 14 to 17, involved in the study by researchers from the University of Pennsylvania. SCREEN GRAB \r\nA recent study suggests that television shows like Empire, Sex Education and 13 Reasons Why could be encouraging teenagers to dr… [+1537 chars]"},{"source":{"id":null,"name":"Screenanarchy.com"},"author":null,"title":"Branko Tomovic's ‘The Smell of Petrol’ to have US Premiere at Jim Thorpe Independent Film Festival","description":"The Smell of Petrol is the second film by award winning writer/director and actor Branko Tomovic (24: Live Another Day, Luna, The Bourne Ultimatum). Cosima Shaw (Mars, V for Vendetta) stars as the main character Jackie. The exciting cast also includes Laurenc…","url":"https://screenanarchy.com/2019/04/branko-tomovics-the-smell-of-petrol-to-have-us-premiere-at-jim-thorpe-independent-film-festival-contrib.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+TwitchEverything+%28ScreenAnarchy+%28All%29%29","urlToImage":"https://screenanarchy.com/assets_c/2019/04/d1aff5623d92022db3df6f37765cc300309b1a5a-thumb-200x200-74876.jpeg","publishedAt":"2019-04-20T13:23:49Z","content":"The Smell of Petrol is the second film by award winning writer/director and actor Branko Tomovic (24: Live Another Day, Luna, The Bourne Ultimatum). Cosima Shaw (Mars, V for Vendetta) stars as the main character Jackie. The exciting cast also includes Laurenc… [+1423 chars]"},{"source":{"id":null,"name":"Bostonherald.com"},"author":"Mary Markos","title":"Retailers say they’re getting smoked over black market tobacco","description":"Police storage units are brimming with illicit tobacco as state police continue to crack down on the black market in an attempt to recover some of the $300 million tax revenue lost every year. “These are high-volume cases,” state police Maj. Steven Fennessy t…","url":"https://www.bostonherald.com/2019/04/19/retailers-say-theyre-getting-smoked-over-black-market-tobacco/","urlToImage":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","publishedAt":"2019-04-20T02:16:31Z","content":"Police storage units are brimming with illicit tobacco as state police continue to crack down on the black market in an attempt to recover some of the $300 million tax revenue lost every year.\r\n“These are high-volume cases,” state police Maj. Steven Fennessy … [+3255 chars]"},{"source":{"id":null,"name":"Legalinsurrection.com"},"author":"Mike LaChance","title":"Conservatives on Campus Week in Higher Education","description":"Your weekly report on campus news.","url":"https://legalinsurrection.com/2019/04/conservatives-on-campus-week-in-higher-education-2/","urlToImage":"https://legalinsurrection.com/wp-content/uploads/2019/04/U.-Missouri-Attack-Michael-Knowles.jpg","publishedAt":"2019-04-20T12:00:57Z","content":"Your weekly report on campus news.It was quite a week for conservatives on college campuses. First there was the Michael Knowles incident at UMKC.\r\nThen Candace Owens went to U. Pennsylvania.\r\nBrett Kavanaugh was under fire at George Mason.\r\nThis was unreal.\r… [+102 chars]"},{"source":{"id":null,"name":"Legalinsurrection.com"},"author":"Mary Chastain","title":"Report: Biden Hires Obama Advisors, May Announce 2020 Presidential Bid Next Week","description":"It's happening.","url":"https://legalinsurrection.com/2019/04/report-biden-hires-obama-advisors-may-announce-2020-presidential-bid-next-week/","urlToImage":"https://legalinsurrection.com/wp-content/uploads/2018/10/Biden.jpg","publishedAt":"2019-04-20T01:00:29Z","content":"It’s happening.After months of speculation, it looks like former Vice President Joe Biden will join the crowded 2020 Democrat presidential field.\r\nCNBC reported that Biden hired advisors from President Barack Obama’s administration while other outlets claimed… [+3305 chars]"},{"source":{"id":null,"name":"Typepad.com"},"author":"Paul Caron","title":"88.6% Of The Class Of 2016 Passed The Bar Within 2 Years Of Graduation","description":"ABA Section of Legal Education Releases Comprehensive Report on Bar Passage Data: The Managing Director’s Office of the ABA Section of Legal Education and Admissions to the Bar released today a comprehensive set of data on bar passage outcomes for American Ba…","url":"https://taxprof.typepad.com/taxprof_blog/2019/04/886-of-the-class-of-2016-passed-the-bar-within-2-years-of-graduation.html","urlToImage":"https://taxprof.typepad.com/.a/6a00d8341c4eab53ef0240a47e485a200d-220si","publishedAt":"2019-04-20T14:45:00Z","content":"ABA Section of Legal Education Releases Comprehensive Report on Bar Passage Data:\r\nThe Managing Directors Office of the ABA Section of Legal Education and Admissions to the Bar released today a comprehensive set of data on bar passage outcomes for American Ba… [+5411 chars]"},{"source":{"id":null,"name":"Wnd.com"},"author":"Bill Federer","title":"Short life, powerful career","description":"Born in Haddam, Connecticut, April 20, 1718, his parents died while he was a young teenager. He attempted farming, but on July 12, 1739, he had an experience with God of “unspeakable glory” that gave him a “hearty desire to exalt Him, to set Him on the throne…","url":"https://www.wnd.com/2019/04/short-life-powerful-career/","urlToImage":"https://www.wnd.com/files/2018/02/Bible.jpg","publishedAt":"2019-04-20T00:22:00Z","content":"David Brainerd\r\nBorn in Haddam, Connecticut, April 20, 1718, his parents died while he was a young teenager. He attempted farming, but on July 12, 1739, he had an experience with God of “unspeakable glory” that gave him a “hearty desire to exalt Him, to set H… [+4008 chars]"},{"source":{"id":null,"name":"Freebeacon.com"},"author":"Kim Jarrett - Watchdog.org, Kim Jarrett - Watchdog.org","title":"In Minimum Wage Case, Justices Lament Having to Assume Rule-Making Duties of State Agency","description":"The Pennsylvania Supreme Court will decide how the state’s overtime laws should be interpreted after hearing oral arguments in a case challenging a formula for calculating overtime. The post In Minimum Wage Case, Justices Lament Having to Assume Rule-Making D…","url":"https://freebeacon.com/issues/in-minimum-wage-case-justices-lament-having-to-assume-rule-making-duties-of-state-agency/","urlToImage":"https://freebeacon.com/wp-content/uploads/2017/12/minimum-wage.jpg","publishedAt":"2019-04-20T08:55:14Z","content":"BY: Kim Jarrett - Watchdog.orgApril 20, 2019 4:55 am\r\nThe Pennsylvania Supreme Court will decide how the states overtime laws should be interpreted after hearing oral arguments in a case challenging a formula for calculating overtime.\r\nSalaried employees with… [+2637 chars]"},{"source":{"id":null,"name":"Freebeacon.com"},"author":"Bethany Blankley - Watchdog.org, Bethany Blankley - Watchdog.org","title":"New Site Tracks $1.5 Billion in Public Union Political Spending Over Two Decades","description":"The Center for Union Facts has launched a new website, www.PublicUnionFacts.com, to track more than $1.5 billion in public sector union political spending over the past two decades. It found that these unions give 90 percent of political funding to Democrats.…","url":"https://freebeacon.com/issues/new-site-tracks-1-5-billion-in-public-union-political-spending-over-two-decades/","urlToImage":"https://freebeacon.com/wp-content/uploads/2017/06/cash.jpg","publishedAt":"2019-04-20T08:55:39Z","content":"BY: Bethany Blankley - Watchdog.orgApril 20, 2019 4:55 am\r\nThe Center for Union Facts has launched a new website, www.PublicUnionFacts.com, to track more than $1.5 billion in public sector union political spending over the past two decades. It found that thes… [+4414 chars]"},{"source":{"id":null,"name":"Blogger.com"},"author":"Randy Seaver","title":"Added and Updated Record Collections at FamilySearch.org - Week of 14 to 20 April 2019","description":null,"url":"https://www.blogger.com/comment.g?blogID=26204193&postID=4053369518531060719&bpli=1","urlToImage":null,"publishedAt":"2019-04-20T23:50:00Z","content":"I am trying to keep up with the new and updated record collections at FamilySearch   (https://familysearch.org/search/collection/list) every week.As of 20 April 2019, there were 2,469 record collections on FamilySearch (an increase of 6 from last week):\r\n[Ima… [+8703 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Greg Porter","title":"PM Update: Spotty showers possible this evening. More unsettled on Sunday with scattered showers.","description":"Easter Sunday won't be a washout, but some raindrops are likely at some point during the day.","url":"https://www.washingtonpost.com/weather/2019/04/20/pm-update-spotty-showers-possible-this-evening-more-unsettled-sunday-with-scattered-showers/","urlToImage":"https://www.washingtonpost.com/resizer/gpU_SfsHg776n_NeL3FQPmrqd0E=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/N5QQZUXIPRCW3KKCQ3XQITM3IE.jpg","publishedAt":"2019-04-20T19:52:29Z","content":"After some pretty active weather Friday, things settled down nicely today. The upper-level low responsible for Fridays severe weather is still lingering close by, and it will continue to do so into early next week. That translates to increasing unsettled cond… [+2384 chars]"},{"source":{"id":"the-hill","name":"The Hill"},"author":"Max Greenwood and Alex Gangitano","title":"2020 Dems ratchet up anti-corporate talk in bid to woo unions","description":"Democratic presidential hopefuls are seizing on anti-corporate rhetoric and policy proposals as they look to win the support of influential labor unions and frame themselves as working-class heroes.Whi...","url":"https://thehill.com/homenews/campaign/439851-2020-dems-ratchet-up-anti-corporate-talk-in-bid-to-woo-unions","urlToImage":"https://thehill.com/sites/default/files/anticorporate_sandersbernie_041519getty.jpg","publishedAt":"2019-04-20T20:50:43Z","content":"Democratic presidential hopefuls are seizing on anti-corporate rhetoric and policy proposals as they look to win the support of influential labor unions and frame themselves as working-class heroes.\r\nWhile virtually every Democrat in the race has sworn off co… [+8792 chars]"},{"source":{"id":"the-hill","name":"The Hill"},"author":"Olivia Beavers","title":"Democrats renew attacks on Trump attorney general","description":"Democrats ripped into Attorney General William Barr on Friday, signaling he'll be a focal point of their attacks on the Trump administration in the post-Mueller report world.The Democrats say Barr bungled the handl...","url":"https://thehill.com/homenews/house/439797-democrats-renew-attacks-on-trump-attorney-general","urlToImage":"https://thehill.com/sites/default/files/demsinvestigation_pelosinancy_040419getty_0.jpg","publishedAt":"2019-04-20T16:03:27Z","content":"Democrats ripped into Attorney General William BarrWilliam Pelham BarrImpeachment? Not so fast without missing element of criminal intentTrump approval drops to 2019 low after Mueller report's release: pollTrump: Mueller report was 'written as nastily as poss… [+9281 chars]"},{"source":{"id":null,"name":"Newyorker.com"},"author":"Eric Lach","title":"Bernie Sanders’s Electability Tour","description":"Eric Lach writes about Bernie Sanders’s tour through the Midwest—Wisconsin, Indiana, Ohio, Michigan, and Pennsylvania—as a Democratic candidate for the 2020 Presidential election.","url":"https://www.newyorker.com/news/dispatch/bernie-sanderss-electability-tour","urlToImage":"https://media.newyorker.com/photos/5cb75eb385215b2b2c37de32/16:9/w_1200,h_630,c_limit/Lach-BernieMidwestTour.jpg","publishedAt":"2019-04-20T09:00:00Z","content":"On a recent Friday afternoon in April, a large crowd gathered in a park on the shore of Lake Mendota, in downtown Madison, Wisconsin, for a Bernie Sanders rally. Spring hadnt yet fully settled on the Midwestit was overcast, with a cold wind blowingbut hundred… [+14868 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Hillary Hoffower","title":"The evolution of brands like Michael Kors and Abercrombie & Fitch explains the downfall of some status symbols, according to a Wharton professor","description":"Status symbols evolve, and it's all thanks to how social influence affects their popularity. If enough outsiders adopt a trend, action, or brand, they can change the meaning of its signal, according to Wharton professor Jonah Berger. Honda's Element and Aberc…","url":"https://www.businessinsider.com/status-symbols-downfall-outsider-adoption-fine-line-2019-4","urlToImage":"https://amp.businessinsider.com/images/579625804321f102278ba649-1920-960.jpg","publishedAt":"2019-04-20T13:30:00Z","content":"Some status symbols come and go, and it all has to do with how people perceive them. \r\n According to Jonah Berger, marketing professor at the Wharton School of the University of Pennsylvania, we use people's choices as signals of who they are and what they're… [+3500 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"By ANDREW DeMILLO Associated Press","title":"Arkansas faces new court fight over sedative for executions","description":"A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after it raced to put eight inmates to death in 11 days before its batch expired","url":"https://abcnews.go.com/US/wireStory/arkansas-faces-court-fight-sedative-executions-62526833","urlToImage":"https://s.abcnews.com/images/US/WireAP_a834b65c352942d3bd9ee510b5c528c7_16x9_992.jpg","publishedAt":"2019-04-20T16:29:22Z","content":"A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after the state raced to put eight convicted killers to death in 11 days before a previ… [+6339 chars]"},{"source":{"id":null,"name":"Ndtv.com"},"author":null,"title":"Indian-Origin Professor Faces Inquiry Over Drawing Double Salaries In UK","description":"A 44-year-old Indian-origin medical professor is facing a tribunal inquiry over his alleged failure to inform a UK university that he was still working at another varsity and continued to draw salaries from both the places for little over a year.","url":"https://www.ndtv.com/indians-abroad/indian-origin-professor-faces-inquiry-over-drawing-double-salaries-in-uk-2026088","urlToImage":"https://c.ndtvimg.com/2019-04/uloohtgk_akhilesh-reddy_625x300_20_April_19.jpg","publishedAt":"2019-04-20T13:04:24Z","content":"London: A 44-year-old Indian-origin medical professor is facing a tribunal inquiry over his alleged failure to inform a UK university that he was still working at another varsity and continued to draw salaries from both the places for little over a year.\r\nAkh… [+1465 chars]"},{"source":{"id":null,"name":"Alternet.org"},"author":"Matthew Rozsa","title":"Bernie Sanders’ Fox News town hall at Bethlehem Steel: The perfect symbol of American populism","description":"On Election Day 2016, I crisscrossed a region of eastern Pennsylvania known as the Lehigh Valley — my home — covering local voting activity. At one point I stopped at the… Related Stories Elizabeth Warren calls on the House of Representatives to begin impeach…","url":"https://www.alternet.org/2019/04/bernie-sanders-fox-news-town-hall-at-bethlehem-steel-the-perfect-symbol-of-american-populism/","urlToImage":"https://www.alternet.org/wp-content/uploads/2019/04/shutterstock_634157375.jpg","publishedAt":"2019-04-20T12:08:47Z","content":"On Election Day 2016, I crisscrossed a region of eastern Pennsylvania known as the Lehigh Valley my home  covering local voting activity. At one point I stopped at the Bethlehem Steel Stacks, a hollow and rusted husk looming next to a hip culture center known… [+10896 chars]"},{"source":{"id":null,"name":"Alternet.org"},"author":"Cody Fenwick","title":"The most important mystery in Mueller’s report: Did Trump’s obstruction work?","description":"In the wake of Special Counsel Robert Mueller’s expansive case for President Donald Trump’s obstruction of justice, as revealed in the newly public report, a common theme is emerging among… Related Stories White House aide lashes out at the New York Times for…","url":"https://www.alternet.org/2019/04/the-most-important-mystery-in-muellers-report-did-trumps-obstruction-work/","urlToImage":"https://www.alternet.org/wp-content/uploads/2019/03/Untitled-collage-87.jpg","publishedAt":"2019-04-20T00:26:31Z","content":"In the wake of Special Counsel Robert Mueller’s expansive case for President Donald Trump’s obstruction of justice, as revealed in the newly public report, a common theme is emerging among much of the commentariat that Trump’s obstruction of the Russia invest… [+6576 chars]"},{"source":{"id":null,"name":"Alternet.org"},"author":"Valerie Tarico","title":"Easter bunnies are more deliciously wicked than you might think","description":"For most of Christian history, those furry little creatures were associated with queer sex, not chocolate. Easter may be a Christian holiday, but many of its most delightful traditions have… Related Stories What is hell, exactly? We might joke it’s other peop…","url":"https://www.alternet.org/2019/04/easter-bunnies-are-more-deliciously-wicked-than-you-might-think/","urlToImage":"https://www.alternet.org/wp-content/uploads/2019/04/Trump-bunny-800x430-1.jpg","publishedAt":"2019-04-20T14:00:17Z","content":"For most of Christian history, those furry little creatures were associated with queer sex, not chocolate.\r\nEaster may be a Christian holiday, but many of its most delightful traditions have pagan or pre-Christian roots. Spring equinox has long been celebrate… [+7038 chars]"},{"source":{"id":null,"name":"Inquirer.net"},"author":"jvicente","title":"Journalist who covered Columbine attack reflects on lives unlived","description":"Daniel. Rachel. Isaiah.\"You can't prove a negative,\" our teachers and parents sometimes tell us when we're young. The post Journalist who covered Columbine attack reflects on lives unlived appeared first on Inquirer News.","url":"https://newsinfo.inquirer.net/1108740/journalist-who-covered-columbine-attack-reflects-on-lives-unlived","urlToImage":"https://newsinfo.inquirer.net/files/2019/04/AP19102641844701-620x415.jpg","publishedAt":"2019-04-20T03:27:38Z","content":"In this April 21, 1999, file photo, from left, Rachel Ruth, Rhianna Cheek and Mandi Annibel, all 16-year-old sophomores at Heritage High School in Littleton, Colorado, console each other during a vigil service to honor the victims of the shooting spree in Col… [+5877 chars]"},{"source":{"id":null,"name":"Stripes.com"},"author":null,"title":"Yokota retains DODEA-Japan baseball title, reclaims softball crown","description":"Perry and Kinnick triumph in boys and girls soccer tourneys as champs crowned in four sports.","url":"https://www.stripes.com/sports/pacific/yokota-retains-dodea-japan-baseball-title-reclaims-softball-crown-1.577721?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+starsandstripes%2Fgeneral+%28Stars+and+Stripes%29","urlToImage":"https://www.stripes.com/img/socialmedia/images/facebook_default.jpg","publishedAt":"2019-04-20T14:40:14Z","content":"MISAWA AIR BASE, Japan After watching the tournament title bounce around Japan the last two years, the Yokota softball team can once more call itself DODEA-Japan champion.\r\nIsabella Garcia drove in the tie-breaking run with a two-out double on a 2-2 count in … [+6156 chars]"},{"source":{"id":"mirror","name":"Mirror"},"author":"Zoe Forsey","title":"Outrage at teacher's comment on boy's maths homework as dad calls for her to be fired","description":"Chris Piland's son was tasked with solving as many subtraction problems in three minutes from a list of 60, but his teacher clearly wasn't impressed by his efforts","url":"https://www.mirror.co.uk/news/weird-news/outrage-teachers-comment-boys-maths-14436890","urlToImage":"https://i2-prod.mirror.co.uk/incoming/article14436951.ece/ALTERNATES/s1200/1_THP_CHP_200419SLUG_5429JPG.jpg","publishedAt":"2019-04-20T10:58:05Z","content":"A dad has started a petition for his son's teacher to be sacked after seeing the comment she wrote on his maths homework.\r\nChris Piland was shocked when he saw the feedback on Kamdyn's test criticising his efforts.\r\nThe second grade children, equivalent to ye… [+1770 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joe Perticone","title":"Trump and the Republican-controlled Senate are increasingly at odds on everything from trade to Yemen to the border wall","description":"The first few months of 2019 have resulted in multiple vetoes by President Donald Trump, as Republicans buck leadership over frustrations with administration policy. There have been several instances where the administration has been embarrassed over squabble…","url":"https://www.businessinsider.com/trump-gop-republican-senate-increasingly-at-odds-2019-4","urlToImage":"https://amp.businessinsider.com/images/5ca3af08c6cc5018323b5284-2732-1366.jpg","publishedAt":"2019-04-20T11:39:00Z","content":"WASHINGTON — President Donald Trump's administration has continued to be volatile and chaotic in 2019, which should come as no surprise taking the past several years into consideration. \r\n But one development which only began in 2019 is a constant stream of e… [+5896 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Hillary Hoffower","title":"The evolution of brands like Michael Kors and Abercrombie & Fitch explains the downfall of some status symbols, according to a Wharton professor","description":"Status symbols evolve, and it's all thanks to how social influence affects their popularity. If enough outsiders adopt a trend, action, or brand, they can change the meaning of its signal, according to Wharton professor Jonah Berger. More »","url":"https://www.businessinsider.com.au/status-symbols-downfall-outsider-adoption-fine-line-2019-4","urlToImage":"https://static.businessinsider.com/image/573669e552bcd01f7b8c2b09-640.jpg","publishedAt":"2019-04-20T13:30:00Z","content":"Some status symbols come and go, and it all has to do with how people perceive them.\r\nAccording to Jonah Berger, marketing professor at the Wharton School of the University of Pennsylvania, we use people’s choices as signals of who they are and what they’re l… [+3475 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Joe Perticone","title":"Trump and the Republican-controlled Senate are increasingly at odds on everything from trade to Yemen to the border wall","description":"WASHINGTON – President Donald Trump’s administration has continued to be volatile and chaotic in 2019, which should come as no surprise taking the past several years into consideration.","url":"https://www.businessinsider.com.au/trump-gop-republican-senate-increasingly-at-odds-2019-4","urlToImage":"https://static.businessinsider.com/image/5ca3af08c6cc5018323b5284-640.jpg","publishedAt":"2019-04-20T11:39:00Z","content":"The first few months of 2019 have resulted in multiple vetoes by President Donald Trump, as Republicans buck leadership over frustrations with administration policy.\r\nThere have been several instances where the administration has been embarrassed over squabbl… [+6433 chars]"},{"source":{"id":null,"name":"Livemint.com"},"author":"Avantika Bhuyan","title":"The story of innovation at your fingertips","description":"The exhibits in ‘Once Upon A Try’ don’t confine themselves to pure science, looking at innovation across disciplines.It is hailed as the largest online exhibition by Google Arts &amp; Culture, with over 400 interactive exhibitions and 200,000 artefacts from 1…","url":"https://www.livemint.com/mint-lounge/features/the-story-of-innovation-at-your-fingertips-1555745742348.html","urlToImage":"https://images.livemint.com/img/2019/04/20/600x338/5904f4a2-5d31-11e9-ac53-f97d5e167a14_1555745741098_1555746474331.jpg","publishedAt":"2019-04-20T08:05:21Z","content":"On the face of it, Once Upon A Try seems like a regular online exhibition about scientific innovation and discoveries. But as one begins to delve into its many layers, interesting nuggets and factoids begin to emerge, ranging from the first recorded map of th… [+3945 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"Leslie Patton","title":"In yogurt world, the Greeks are down, Vikings are up","description":"It's Icelandic yogurt, also known as Skyr, and as the meteoric popularity of the Greek product fizzles, farmers are hoping the new variety will help lift them out of years of lackluster demand.","url":"https://www.seattletimes.com/nation-world/in-yogurt-world-the-greeks-are-down-vikings-are-up/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/yogurt-d872144e-6200-11e9-9412-daf3d2e67c6d-1200x630.jpg","publishedAt":"2019-04-20T11:34:17Z","content":"It’s high in protein, low in sugar, and just right for the struggling American dairy industry.\r\nIt’s Icelandic yogurt, also known as Skyr, and as the meteoric popularity of the Greek product fizzles, farmers are hoping the new variety will help lift them out … [+4907 chars]"},{"source":{"id":null,"name":"Freerepublic.com"},"author":"Washington Examiner","title":"House Republicans leave border tour shocked to learn immigrant children being recycled by smugglers","description":"YUMA, Ariz.  Congressional Republicans who toured part of the southern border this week saw firsthand the number of families and children arriving. But the House lawmakers were shocked at the idea that smugglers recycle children across the border. I think t…","url":"https://www.freerepublic.com/focus/f-news/3743382/posts","urlToImage":null,"publishedAt":"2019-04-20T14:50:24Z","content":"Skip to comments.\r\nHouse Republicans leave border tour shocked to learn immigrant children being recycled by smugglersWashington Examiner ^\r\n | April 19, 2019 08:54 PM\r\n | Anna Giaritelli\r\nPosted on 04/20/2019 7:50:24 AM PDT by E. Pluribus Unum\r\nYUMA, Ariz. —… [+2358 chars]"},{"source":{"id":null,"name":"Brica.de"},"author":"","title":"Patient names, treatments leak among millions of rehab records","description":"It's some of the most sensitive medical information a person could have. Records for potentially tens of thousands of patients seeking treatment at several addiction rehabilitation centers were exposed in an unsecured online database, an independent researche…","url":"https://brica.de/alerts/alert/public/1255525/patient-names-treatments-leak-among-millions-of-rehab-records/","urlToImage":null,"publishedAt":"2019-04-20T12:43:00Z","content":"It's some of the most sensitive medical information a person could have. Records for potentially tens of thousands of patients seeking treatment at several addiction rehabilitation centers were exposed in an unsecured online database, an independent researche… [+3395 chars]"},{"source":{"id":null,"name":"Tmcnet.com"},"author":null,"title":"EmCare Sends Notification Of Data Security Incident","description":"PLANTATION, Fla. April 20, 2019 /PRNewswire/ -- EmCare, Inc. and its affiliates (EmCare) today announced that they are addressing a data security incident that involved the personal information of some patients, employees and contractors. EmCare has launched …","url":"https://www.tmcnet.com/usubmit/2019/04/20/8941939.htm","urlToImage":null,"publishedAt":"2019-04-20T21:27:00Z","content":"PLANTATION, Fla., April 20, 2019 /PRNewswire/ -- EmCare, Inc. and its affiliates (EmCare) today announced that they are addressing a data security incident that involved the personal information of some patients, employees and contractors. EmCare has launched… [+3458 chars]"},{"source":{"id":null,"name":"Bmj.com"},"author":"Strober, B., Greenberg, J. D., Karki, C., Mason, M., Guo, N., Hur, P., Zhao, Y., Herrera, V., Lin, F., Lebwohl, M.","title":"Impact of psoriasis severity on patient-reported clinical symptoms, health-related quality of life and work productivity among US patients: real-world data from the Corrona Psoriasis Registry","description":"Objectives This analysis examined the association between psoriasis severity, assessed by body surface area (BSA) and the Investigator’s Global Assessment (IGA; previously used only in clinical trials), and patient-reported outcomes (PROs) in a real-world set…","url":"https://bmjopen.bmj.com/content/9/4/e027535","urlToImage":"https://bmjopen.bmj.com/","publishedAt":"2019-04-20T10:55:47Z","content":"Strengths and limitations of this study\r\nThis is the first study to explore the link between psoriasis severity measured by the Investigators Global Assessment and patient-reported outcomes (PROs) in a real-world setting.\r\nDue to the cross-sectional study des… [+9824 chars]"},{"source":{"id":null,"name":"Startribune.com"},"author":"Leslie Patton","title":"Icelandic eclipses Greek as the new hot yogurt trend","description":"While U.S. yogurt sales dropped 3.4% in the 12 months ended in February, the Icelandic style jumped 24%.","url":"http://www.startribune.com/icelandic-yogurt-eclipses-greek-as-the-new-hot-trend/508846502/","urlToImage":"http://stmedia.stimg.co/ows_155577033367451.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces","publishedAt":"2019-04-20T14:31:13Z","content":"It’s high in protein, low in sugar, and just right for the struggling American dairy industry.\r\nIt’s Icelandic yogurt, also known as Skyr, and as the meteoric popularity of the Greek product fizzles, farmers are hoping the new variety will help lift them out … [+4822 chars]"},{"source":{"id":null,"name":"Tikkun.org"},"author":"Valerie Elverton Dixon","title":"Twenty Years Ago, When Columbine Happened","description":"The 20th anniversary of Columbine reminds us that we each have to do the hard soul work, the hard spiritual work of radical love.","url":"https://www.tikkun.org/columbine","urlToImage":"https://www.tikkun.org/wp-content/uploads/2018/11/default-1-1170x878.png","publishedAt":"2019-04-20T16:55:59Z","content":"Twenty years ago, when Columbine happened, I was teaching Christian Social Ethics at United Theological Seminary in Dayton, Ohio. The class was reading a slim volume entitled American in Search of its Soul written by one of my teachers, Dr. Gibson Winter.\r\nDr… [+5499 chars]"},{"source":{"id":null,"name":"App.com"},"author":"Asbury Park Press, Michael L. Diamond, Asbury Park Press","title":"NJ jobs: This is how we stack up against other states","description":"New Jersey added 3,600 jobs in March, putting it in the middle of the pack for job growth during the past year.","url":"https://www.app.com/story/money/business/career/2019/04/20/nj-jobs-how-we-stack-up-against-other-states/3449029002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PAPP/fa2a60b8-4597-4bf6-a53a-26bdc6c3f440-GettyImages-1063332724.jpg?crop=3659,2049,x0,y365&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T09:00:03Z","content":"How are New Jerseyans faring? Prosperity Now looked at five categories and revealed its ranking.\r\n Michael L. Diamond\r\nNew Jersey added 3,600 jobs in March, bouncing back from a sluggish February, but not enough to keep up with the rising number of job seeker… [+4020 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"PA Cleveland OH Zone Forecast","description":"PA Cleveland OH Zone Forecast for Saturday, April 20, 2019","url":"https://www.richmond.com/news/ap/pa-cleveland-oh-zone-forecast/article_9cb196f0-5de1-5c5d-bcf9-c7b7438ecdca.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-20T23:56:10Z","content":"PA Cleveland OH Zone Forecast for Saturday, April 20, 2019\r\n413 FPUS51 KCLE 202351\r\nZFPCLE\r\nZone Forecast Product for Northern Ohio and Northwest Pennsylvania\r\nNational Weather Service Cleveland OH\r\n751 PM EDT Sat Apr 20 2019\r\nPAZ001-210815-\r\nNorthern Erie-\r\n… [+5252 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"PA State College PA Zone Forecast","description":"PA State College PA Zone Forecast for Saturday, April 20, 2019","url":"https://www.richmond.com/news/ap/pa-state-college-pa-zone-forecast/article_c303febc-ce50-5325-97ec-2166f2695e3c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-20T11:21:17Z","content":"PA State College PA Zone Forecast for Saturday, April 20, 2019\r\n860 FPUS51 KCTP 201117\r\nZFPCTP\r\nZone Forecast Product for Central Pennsylvania\r\nNational Weather Service State College PA\r\n715 AM EDT Sat Apr 20 2019\r\nPAZ064-202000-\r\nAdams-\r\nIncluding the city o… [+60798 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"OH Cleveland OH Zone Forecast","description":"OH Cleveland OH Zone Forecast for Saturday, April 20, 2019","url":"https://www.richmond.com/news/ap/oh-cleveland-oh-zone-forecast/article_35d15a91-2783-56a9-bf3a-fe0ddbad414b.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-20T23:56:10Z","content":"OH Cleveland OH Zone Forecast for Saturday, April 20, 2019\r\n413 FPUS51 KCLE 202351\r\nZFPCLE\r\nZone Forecast Product for Northern Ohio and Northwest Pennsylvania\r\nNational Weather Service Cleveland OH\r\n751 PM EDT Sat Apr 20 2019\r\nOHZ003-210815-\r\nLucas-\r\nIncludin… [+48814 chars]"},{"source":{"id":null,"name":"Zerohedge.com"},"author":"Tyler Durden","title":"The Death Of Education In America","description":"Authored by W.J.Astore via BracingViews.com, Trump! Mueller! Collusion! I know: who cares about the education of our kids as the redacted Mueller Report dominates the airwaves on CNN, MSNBC, and similar cable “news” networks? I care. I spent fifteen years as …","url":"https://www.zerohedge.com/news/2019-04-20/death-education-america","urlToImage":"https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/2019-04/2019-04-20_11-30-04.jpg?itok=ufYdLoXu","publishedAt":"2019-04-20T21:30:00Z","content":"Authored by W.J.Astore via BracingViews.com,\r\nTrump!  Mueller!  Collusion!\r\nI know: who cares about the education of our kids as the redacted Mueller Report dominates the airwaves on CNN, MSNBC, and similar cable news networks?\r\nI care. \r\n I spent fifteen yea… [+4281 chars]"},{"source":{"id":null,"name":"Voanews.com"},"author":"VOA","title":"America: A Nation of Redaction","description":"Today, a different kind of Words and Their Stories - an examination of the word redaction. This week, United States Attorney General William Barr released the long-awaited report by special counsel Robert Mueller. The report presents the findings of Mueller’s…","url":"https://learningenglish.voanews.com/a/america-a-nation-of-redaction/4880386.html","urlToImage":"https://gdb.voanews.com/7337C0C9-8B2E-4F41-8BEB-1877E4AC9F62_w1200_r1_s.jpg","publishedAt":"2019-04-20T21:59:57Z","content":"Today, a different kind of Words and Their Stories - an examination of the word redaction. \r\nThis week, United States Attorney General William Barr released the long-awaited report by special counsel Robert Mueller. The report presents the findings of Mueller… [+4274 chars]"},{"source":{"id":null,"name":"Startribune.com"},"author":"Paul Douglas","title":"Weather Bliss Today - Risk of Another Inch of Rain Sunday-Monday","description":"Friday was a tonic for the senses and today should be a good 10-13F warmer, with a stiff southerly breeze by afternoon and mid-70s. I wouldn't be shocked to see an 80-degree temperature closer to home. Soak it up, because puddles return part of Sunday and mos…","url":"http://www.startribune.com/weather-bliss-today-risk-of-another-inch-of-rain-sunday-monday/508802262/","urlToImage":"http://stmedia.stimg.co/pauldouglas_1555126315_tor1.JPG?h=630&w=1200&fit=crop&bg=999&crop=faces","publishedAt":"2019-04-20T03:25:45Z","content":"Daydreams Do Come True: 70s Later Today\r\nAfter 45 years of attempting to predict a cantankerous Mother Nature's moods, here is what I know: the number of people who blame us for bad weather is far greater than those who thank us for the nice days. It never qu… [+22143 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"HEATHER STAUFFER | Staff Writer","title":"Where to drop your unused meds on April 27, National Prescription Drug Take Back Day","description":"Want to help prevent drug addiction and overdose deaths?","url":"https://lancasteronline.com/news/local/where-to-drop-your-unused-meds-on-april-national-prescription/article_592dbbe8-62d7-11e9-a6bd-0b8bf174bfa7.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/8/dc/8dccde5c-d15e-11e8-aa0e-db0874466c1a/5bc6114555cdb.image.jpg?crop=790%2C714%2C270%2C131&resize=697%2C630&order=crop%2Cresize","publishedAt":"2019-04-20T09:00:00Z","content":"Want to help prevent drug addiction and overdose deaths?\r\nOne way to do that is to participate in National Prescription Drug Take Back Day, according to the U.S. Drug Enforcement Administration. The agency noted that in 2016, a national survey found that a ma… [+1548 chars]"},{"source":{"id":null,"name":"Lancasteronline.com"},"author":"JENNIFER KOPF | Staff Writer","title":"The CBD boom: Popularity of hemp product swells in Lancaster; here's what you should know","description":"Over-the-counter CBD oil and its products are available without a prescription, and are being touted as relief for a litany of conditions -- just know what you're really buying.","url":"https://lancasteronline.com/features/the-cbd-boom-popularity-of-hemp-product-swells-in-lancaster/article_787c5dca-15e7-11e9-8729-db187c723e0c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/lancasteronline.com/content/tncms/assets/v3/editorial/a/27/a2769aa8-15e9-11e9-b273-a7cee8c7ff6c/5c390d9fef934.image.jpg?resize=850%2C630","publishedAt":"2019-04-20T18:10:00Z","content":"Julio Perrone turned to CBD oil several years ago to improve his focus, relax his edginess and improve sleep.\r\nBrittany Ditzler credits a CBD tincture with relieving some of her anxiety and depression symptoms.\r\nJill Good-Miller has used a CBD product externa… [+7644 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Fatal crash on wet road kills man, teenage girl","description":"HOMER CITY, Pa. (AP) — State police say a Pennsylvania man and a teenage girl from West Virginia were killed in a crash on a wet western Pennsylvania road that also injured two other people.","url":"https://apnews.com/17f431f9e09e462a9994f740834af732","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T14:49:04Z","content":"HOMER CITY, Pa. (AP) State police say a Pennsylvania man and a teenage girl from West Virginia were killed in a crash on a wet western Pennsylvania road that also injured two other people.\r\nPolice in Indiana County say a westbound vehicle lost control on a we… [+659 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By STEPHEN HUBA, Tribune-Review","title":"Pennsylvania aims to hook anglers young, spur interest","description":"PITTSBURGH (AP) — Every year, Pennsylvania stocks its public waterways with millions of trout in the hopes that humans will follow.","url":"https://apnews.com/841557104ad14f6b900f704d0b3be578","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T07:05:33Z","content":"PITTSBURGH (AP) Every year, Pennsylvania stocks its public waterways with millions of trout in the hopes that humans will follow.\r\nJudging from the numbers who turn out religiously for the opening day of trout season, the strategy is working. On opening day f… [+6220 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By MELODY PARKER Waterloo-Cedar Falls Courier","title":"Marion woodcarver creates comfort birds as gifts of solace","description":"WATERLOO, Iowa (AP) — Jerry Schierholz began carving \"comfort birds\" several years ago. He read in a magazine about a Pennsylvania carver who made them and because there was a pattern included, he tried it out.","url":"https://apnews.com/5d5ed7aaa1bf48a08d1573060d924c61","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T05:05:21Z","content":"WATERLOO, Iowa (AP) Jerry Schierholz began carving \"comfort birds\" several years ago. He read in a magazine about a Pennsylvania carver who made them and because there was a pattern included, he tried it out.\r\nNow he's carved more than 250 \"headed toward 300,… [+3539 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Hayman named new director of VA Montana Health Care System","description":"HELENA, Mont. (AP) — U.S. Veterans Affairs officials say Judy Hayman has been named the new director of the VA Montana Health Care System.","url":"https://apnews.com/bae53c192b8541d38a6bf6171951e1f3","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T14:58:20Z","content":"HELENA, Mont. (AP) U.S. Veterans Affairs officials say Judy Hayman has been named the new director of the VA Montana Health Care System.\r\nA VA statement released Friday says Hayman most recently was the agency's medical center director in Syracuse, New York, … [+525 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By ANDREW DeMILLO Associated Press","title":"Arkansas faces new court fight over sedative for executions","description":"LITTLE ROCK, Ark. (AP) — A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after the state raced to put eight convicted…","url":"https://apnews.com/ccb155e31ae2445892d8bd52839ebc75","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/8/9b/89b37fb1-378e-5b57-9e98-e39aeb175275/5cbb4cc3a551d.image.jpg?resize=807%2C630","publishedAt":"2019-04-20T16:28:52Z","content":"LITTLE ROCK, Ark. (AP) A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after the state raced to put eight convicted killers to death in… [+6496 chars]"},{"source":{"id":null,"name":"Prnewswire.com"},"author":null,"title":"EmCare Sends Notification Of Data Security Incident","description":"PLANTATION, Fla., April 20, 2019 /PRNewswire/ -- EmCare, Inc. and its affiliates (EmCare) today announced that they are addressing a data security incident that involved the personal information of some patients, employees and contractors. EmCare has launched…","url":"https://www.prnewswire.com/news-releases/emcare-sends-notification-of-data-security-incident-300835378.html","urlToImage":"https://www.prnewswire.com/content/dam/prnewswire/common/prn_facebook_sharing_logo.jpg","publishedAt":"2019-04-20T18:54:00Z","content":"PLANTATION, Fla., April 20, 2019 /PRNewswire/ -- EmCare, Inc. and its affiliates (EmCare) today announced that they are addressing a data security incident that involved the personal information of some patients, employees and contractors. EmCare has launched… [+3332 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"ANDREW DeMILLO","title":"Arkansas faces new court fight over sedative for executions","description":"LITTLE ROCK, Ark. (AP) — A federal lawsuit filed by death row inmates is renewing a court fight over a sedative Arkansas uses for lethal injections, two years after the state raced to put eight convicted killers to death before a batch of the drug expired. Th…","url":"https://www.seattletimes.com/nation-world/nation/arkansas-faces-new-court-fight-over-sedative-for-executions/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/urn-publicid-ap-org-ccb155e31ae2445892d8bd52839ebc75Arkansas_Executions_67602-1200x630.jpg","publishedAt":"2019-04-20T16:26:09Z","content":"LITTLE ROCK, Ark. (AP) A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after the state raced to put eight convicted killers to death in… [+6367 chars]"},{"source":{"id":null,"name":"Prnewswire.com"},"author":null,"title":"HEALTHCARE SERVICES SHAREHOLDER ALERT: CLAIMSFILER REMINDS INVESTORS WITH LOSSES IN EXCESS OF $500,000 of Lead Plaintiff Deadline in Class Action Lawsuit Against Healthcare Services Group, Inc. - HCSG","description":"NEW ORLEANS, April 19, 2019 /PRNewswire/ -- ClaimsFiler, a FREE shareholder information service, reminds investors that they have until May 21, 2019 to file lead plaintiff applications in a securities class action lawsuit against Healthcare Services Group, In…","url":"https://www.prnewswire.com/news-releases/healthcare-services-shareholder-alert-claimsfiler-reminds-investors-with-losses-in-excess-of-500-000-of-lead-plaintiff-deadline-in-class-action-lawsuit-against-healthcare-services-group-inc---hcsg-300835268.html","urlToImage":"https://www.prnewswire.com/content/dam/prnewswire/common/prn_facebook_sharing_logo.jpg","publishedAt":"2019-04-20T02:50:00Z","content":"NEW ORLEANS, April 19, 2019 /PRNewswire/ -- ClaimsFiler, a FREE shareholder information service, reminds investors that they have untilMay 21, 2019\r\n to file lead plaintiff applications in a securities class action lawsuit against Healthcare Services Group, I… [+1910 chars]"},{"source":{"id":null,"name":"Prnewswire.com"},"author":null,"title":"BRIGHTVIEW HOLDINGS SHAREHOLDER ALERT BY FORMER LOUISIANA ATTORNEY GENERAL: KAHN SWICK & FOTI, LLC REMINDS INVESTORS WITH LOSSES IN EXCESS OF $100,000 of Lead Plaintiff Deadline in Class Action Lawsuit Against BrightView Holdings, Inc. - BV","description":"NEW ORLEANS, April 19, 2019 /PRNewswire/ -- Kahn Swick & Foti, LLC (\"KSF\") and KSF partner, former Attorney General of Louisiana, Charles C. Foti, Jr., remind investors that they have until June 14, 2019 to file lead plaintiff applications in a securities cla…","url":"https://www.prnewswire.com/news-releases/brightview-holdings-shareholder-alert-by-former-louisiana-attorney-general-kahn-swick--foti-llc-reminds-investors-with-losses-in-excess-of-100-000-of-lead-plaintiff-deadline-in-class-action-lawsuit-against-brightview-holdings-300835245.html","urlToImage":"https://mma.prnewswire.com/media/399590/Kahn_Swick_and_Foti_Logo.jpg?p=facebook","publishedAt":"2019-04-20T02:50:00Z","content":"NEW ORLEANS, April 19, 2019 /PRNewswire/ -- Kahn Swick &amp; Foti, LLC (\"KSF\") and KSF partner, former Attorney General of Louisiana, Charles C. Foti, Jr., remind investors that they have untilJune 14, 2019\r\n to file lead plaintiff applications in a securitie… [+2217 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"CBS News","title":"Severe weather wreaks havoc on holiday travel","description":"Powerful storms producing heavy rain and damaging winds are taking aim at the eastern half of the country from Texas to Pennsylvania. A tornado was confirmed near Reston, Virginia, Friday night. Thousands are without power Saturday as several towns try to rec…","url":"https://www.cbsnews.com/video/severe-weather-wreaks-havoc-on-holiday-travel/","urlToImage":"https://cbsnews1.cbsistatic.com/hub/i/r/2019/04/20/70a8b4c4-8874-4cae-98d2-4d3b278d4ba5/thumbnail/1200x630/ffdfca324b66f975dbebbc35d77c2b97/0420-satmo-deadlystorms.jpg","publishedAt":"2019-04-20T11:48:30Z","content":null},{"source":{"id":null,"name":"Haaretz.com"},"author":"David Stavrou","title":"Chinese institutes at universities are under fire, but Israeli scholars insist there's no undue influence","description":"Are these Beijing-funded entities disseminating China’s contentious policies to the West under the guise of language courses, cultural events and research programs?","url":"https://www.haaretz.com/israel-news/.premium-chinese-institutes-on-campuses-are-under-fire-israeli-scholars-deny-undue-influence-1.7141138","urlToImage":"https://www.haaretz.com/polopoly_fs/1.7141136.1555623093!/image/1024948329.jpg_gen/derivatives/headline_1200x630/1024948329.jpg","publishedAt":"2019-04-20T13:08:13Z","content":"In the past, the Chinese Communist Party worked hard to suppress the legacy of Confucius. But in recent years it has been making extensive and some would say cynical use of the name and thought of the renowned philosopher, who lived from 551 to 479 B.C.E. The… [+17943 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"By STEPHEN HUBA, Tribune-Review The Associated Press","title":"Pennsylvania aims to hook anglers young, spur interest","description":"Every year, Pennsylvania stocks its public waterways with millions of trout in the hopes that humans will follow. Judging from the numbers who turn out religiously for the opening day … Click to Continue »","url":"https://www.charlotteobserver.com/news/politics-government/national-politics/article229498109.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-20T07:06:09Z","content":"Pennsylvania aims to hook anglers young, spur interest\r\nPITTSBURGH\r\n Every year, Pennsylvania stocks its public waterways with millions of trout in the hopes that humans will follow.\r\nJudging from the numbers who turn out religiously for the opening day of tr… [+6094 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Wiel’s homer leads Rochester to 4-1 win over Lehigh Valley","description":"ALLENTOWN, Pa. (AP) -- Zander Wiel hit a three-run home run in the fourth inning, leading the Rochester Red Wings to a 4-1 win over the Lehigh Valley IronPigs on … Click to Continue »","url":"https://www.charlotteobserver.com/sports/article229494874.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-20T01:55:45Z","content":"Wiels homer leads Rochester to 4-1 win over Lehigh Valley\r\nAllentown, Pennsylvania\r\n ALLENTOWN, Pa. (AP) -- Zander Wiel hit a three-run home run in the fourth inning, leading the Rochester Red Wings to a 4-1 win over the Lehigh Valley IronPigs on Friday.\r\nThe… [+581 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Hayman named new director of VA Montana Health Care System","description":"U.S. Veterans Affairs officials say Judy Hayman has been named the new director of the VA Montana Health Care System. A VA statement released Friday says Hayman most recently was … Click to Continue »","url":"https://www.charlotteobserver.com/news/business/national-business/article229500304.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-20T14:58:38Z","content":"Hayman named new director of VA Montana Health Care System\r\nHELENA, Mont.\r\n U.S. Veterans Affairs officials say Judy Hayman has been named the new director of the VA Montana Health Care System.\r\nA VA statement released Friday says Hayman most recently was the… [+448 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"By NOMAAN MERCHANT Associated Press","title":"Family detention space goes unused as Trump warns of crisis","description":"President Donald Trump has warned that Central American families are staging an \"invasion\" at the U.S.-Mexico border. He has threatened to take migrants to Democratic strongholds to punish political opponents. … Click to Continue »","url":"https://www.charlotteobserver.com/news/business/national-business/article229463009.html#storylink=rss","urlToImage":"https://www.mcclatchy-wires.com/incoming/8pi956/picture229463354/alternates/LANDSCAPE_1140/Immigration_Family_Detention_30489.jpg","publishedAt":"2019-04-20T00:05:33Z","content":"Family detention space goes unused as Trump warns of crisis\r\nHOUSTON\r\n President Donald Trump has warned that Central American families are staging an \"invasion\" at the U.S.-Mexico border. He has threatened to take migrants to Democratic strongholds to punish… [+4241 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"By ANDREW DeMILLO Associated Press","title":"Arkansas faces new court fight over sedative for executions","description":"A federal lawsuit filed by death row inmates has renewed a court fight over whether the sedative Arkansas uses for lethal injections causes torturous executions, two years after it raced to put eight inmates to death in 11 days before its batch expired.","url":"https://www.charlotteobserver.com/news/nation-world/national/article229501619.html#storylink=rss","urlToImage":"https://www.mcclatchy-wires.com/incoming/4hiiv0/picture229501604/alternates/LANDSCAPE_1140/Arkansas_Executions_67602.jpg","publishedAt":"2019-04-20T16:29:50Z","content":"Arkansas faces new court fight over sedative for executions\r\nFILE--In this Thursday, Nov. 17, 2016, file photo, Arkansas Attorney General Leslie Rutledge speaks to reporters at Trump Tower, in New York. A federal lawsuit filed by death row inmates in Arkansas… [+7197 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"Leslie Patton","title":"In yogurt world, the Greeks are down, Vikings are up","description":"It's Icelandic yogurt, also known as Skyr, and as the meteoric popularity of the Greek product fizzles, farmers are hoping the new variety will help lift them out of years of lackluster demand.","url":"https://www.seattletimes.com/nation-world/in-yogurt-world-the-greeks-are-down-vikings-are-up/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/yogurt-d872144e-6200-11e9-9412-daf3d2e67c6d-1200x630.jpg","publishedAt":"2019-04-20T11:34:17Z","content":"It’s high in protein, low in sugar, and just right for the struggling American dairy industry.\r\nIt’s Icelandic yogurt, also known as Skyr, and as the meteoric popularity of the Greek product fizzles, farmers are hoping the new variety will help lift them out … [+4907 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Shira Tarlo","title":"Joe Biden expected to announce 2020 presidential campaign next week","description":"The decision would end months of suspense looming large over a growing Democratic primary field","url":"https://www.salon.com/2019/04/20/joe-biden-expected-to-announce-2020-presidential-campaign-next-week/","urlToImage":"https://media.salon.com/2019/04/biden-american-flag.jpg","publishedAt":"2019-04-20T12:07:46Z","content":"Former Vice President Joe Biden is poised to officially throw his hat into the presidential ring next Wednesday with a video announcement, The Atlantic reported Friday.\r\nThe decision ends months of suspense that has loomed large over a growing Democratic prim… [+3413 chars]"},{"source":{"id":null,"name":"Newser.com"},"author":"Neal Colgrass","title":"Angry Dad Wants Teacher Fired—and 16K Agree","description":"A Pennsylvania dad's frustration has boiled over and put his son's math teacher in the hot seat, Fox News reports. On Tuesday, Chris Piland posted a Facebook photo of his son's second-grade math assignment with a comment from the teacher: \"Absolutely pathetic…","url":"http://www.newser.com/story/274110/angry-dad-wants-teacher-fired-and-16k-agree.html","urlToImage":"http://www.newser.com//img1-azrcdn.newser.com/image/1233782-12-20190420182315.jpeg","publishedAt":"2019-04-20T22:40:00Z","content":"(Newser)\r\nA Pennsylvania dad's frustration has boiled over and put his son's math teacher in the hot seat, Fox News reports. On Tuesday, Chris Piland posted a Facebook photo of his son's second-grade math assignment with a comment from the teacher: \"Absolutel… [+1429 chars]"}]}