{"status":"ok","totalResults":73,"articles":[{"source":{"id":"abc-news","name":"ABC News"},"author":"Brittany Borer","title":"Storm threat winds down ahead of pleasant Easter Sunday","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews.  Find the top news online at ABC news.","url":"https://abcnews.go.com/US/storm-threat-winds-ahead-pleasant-easter-sunday/story?id=62523955","urlToImage":"https://s.abcnews.com/images/US/fla-tornado-ap-mo-20190420_hpMain_16x9_992.jpg","publishedAt":"2019-04-20T10:34:30Z","content":"Three days of severe storms in the South and Southeast are about to give way to a nice holiday weekend for much of the country.\r\nThere were 31 reported tornadoes in the South -- from Texas to Virginia -- since Wednesday, including 13 on Friday. The highest re… [+1014 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Joey Garrison, USA TODAY","title":"KKK leader's wife admits to killing her husband","description":"The wife of a Ku Klux Klan leader in Missouri admitted Friday to the 2017 murder of her husband after initially saying that her son was the murderer.","url":"https://www.usatoday.com/story/news/nation/2019/04/20/kkk-leader-wife-admits-killing-husband-missouri/3528837002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/20/USAT/9fcfda3a-3c86-470e-923e-670d109e994d-AP_KKK_Leader_Killed.JPG?crop=1965,1139,x0,y269&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-20T19:05:39Z","content":"This photo provided by the St. Francois County Sheriff's Department in Farmington, Mo., shows Malissa Ancona, Ancona has admitted fatally shooting her husband, an imperial wizard in the Ku Klux Klan. The St. Louis Post-Dispatch reports that Ancona pleaded gui… [+4887 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"qforgey@politico.com (Quint Forgey)","title":"Trump lashes out at Romney","description":"The Utah senator had criticized the president after the release of Robert Mueller’s report.","url":"https://www.politico.com/story/2019/04/20/mueller-report-trump-romney-1283781","urlToImage":"https://static.politico.com/5d/73/44daef6045f1a2014300b34ee24c/190420-romney-trump-ap-773.jpg","publishedAt":"2019-04-20T23:23:29Z","content":"Mitt Romney is one of the few GOP senators who has expressed disappointment in President Donald Trump following the release of the special counsel's report. | Carolyn Kaster, File/AP Photo\r\nPresident Donald Trump on Saturday ridiculed Sen. Mitt Romney (R-Utah… [+2957 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Amarjeet Singh","title":"Helped raze Babri, will build Ram temple: Pragya","description":"Bringing Babri Masjid back into the political narrative, Sadhvi Pragya made a controversial remark to a TV channel while campaigning in Bhopal on Saturday. \"I climbed atop the structure to break it. I am tremendously proud that God gave me the opportunity and…","url":"https://timesofindia.indiatimes.com/elections/lok-sabha-elections-2019/madhya-pradesh/news/helped-raze-babri-will-now-build-ram-temple-pragya/articleshow/68972087.cms","urlToImage":"https://static.toiimg.com/thumb/msid-68972144,width-1070,height-580,imgsize-183405,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2019-04-20T18:41:13Z","content":"BHOPAL: The political storm over her 'curse' on 26/11 martyr Hemant Karkare was still raging when BJP Bhopal candidate Sadhvi Pragya Thakur dropped another explosive statement on Saturday - she boasted that she climbed atop Babri Masjid and helped demolish it… [+2109 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Express Web Desk","title":"Bizarre statements by politicians that will make you facepalm this election season","description":"Unable to hold their horses, politicians in India more often than not end up creating a stir with their bold and often ill-thought out utterances.","url":"https://indianexpress.com/elections/lok-sabha-elections-2019-bizarre-controversial-statements-by-politicians-5685951/","urlToImage":"https://images.indianexpress.com/2019/04/controversial-political-leaders.jpg?w=759","publishedAt":"2019-04-20T15:55:36Z","content":"(Clockwise from top) Yogi Adityanath, Azam Khan, HD Kumaraswamy, Kawasi Lakhma, Sakshi Maharaj, Ananthkumar Hegde political leaders who courted controversy this election season.\r\nAs the election fever grips the nation, the political leaders seem to be buzzing… [+5988 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Living in Australia, Brett Brown once stole eggs from an emu's nest for an omelet","description":"The rise of Brett Brown and the rise of basketball in Australia paralleled each other. Many of the Australians in the NBA -- past and present -- have ties to Brown, including Kyrie Irving and Ben Simmons.","url":"http://www.espn.com/nba/story/_/id/26321321/living-australia-brett-brown-once-stole-eggs-emu-nest-omelet","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0321%2Fr517576_1296x729_16%2D9.jpg","publishedAt":"2019-04-20T11:35:02Z","content":"BRETT BROWN WAS 25 and lost. It's not an unfamiliar place for many.\r\nHe was single and stir-crazy, unfulfilled in a sales job, a few years out of Boston University -- where he played for Rick Pitino -- and with an itch to see more. He had made some sound inve… [+12484 chars]"},{"source":{"id":"cbc-news","name":"CBC News"},"author":"Kelly Crowe","title":"What happened to triclosan? A lingering legacy of the hyper-hygiene era","description":"A few years ago we were brushing our teeth with it, rinsing our mouths with it, sanitizing our hands with it. And now triclosan is almost vanished from the marketplace.","url":"https://www.cbc.ca/news/health/triclosan-hand-sanitizer-antibacterial-health-canada-fda-toxic-environment-1.5104614","urlToImage":"https://i.cbc.ca/1.5104720.1555637188!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/hand-sanitizer.jpg","publishedAt":"2019-04-20T13:00:43Z","content":"This is an excerpt from Second Opinion, a weekly roundup of eclectic and under-the-radar health and medical science news emailed to subscribers every Saturday morning. If you haven't subscribed yet, you can do that by clicking here.\r\nWhatever happened to tric… [+6577 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":null,"title":"The Conversation","description":"Readers respond to our March 2019 cover story and more.","url":"https://www.theatlantic.com/magazine/archive/2019/05/the-conversation/585991/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/2019/04/0519_CONV_cover/facebook.jpg?1554213470","publishedAt":"2019-04-20T17:00:00Z","content":"The Case for Impeachment Starting the process will rein in a president who is undermining American ideals, Yoni Appelbaum argued in March. Yoni Appelbaum acknowledges that the impeachment of Donald Trump would almost certainly not result in his removal from o… [+22220 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/naomi-lim","title":"Mueller report creates new headache for Pelosi - Washington Examiner","description":"Mueller report creates new headache for Pelosi Washington Examiner Justice Department calls Nadler subpoena \"premature and unnecessary\" CBS News Mueller report poses new test for Dems | TheHill The Hill Mueller report: Rep. Nadler says he sees \"considerable e…","url":"https://www.washingtonexaminer.com/news/mueller-report-creates-new-headache-for-nancy-pelosi","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/d4563f6/2147483647/strip/true/crop/2000x1050+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Ffd%2F89%2Fdb113ef849ce9aed0de22872cc05%2F040319-wex-nancy-pelosi-11.JPG","publishedAt":"2019-04-20T00:39:00Z","content":"House Speaker Nancy Pelosi, D-Calif., has a major problem on her hands after the release of the Mueller report how to resist demands from her fractious caucus for President Trump to be impeached. \r\nPelosi, who has repeatedly downplayed the prospect of impeach… [+3903 chars]"},{"source":{"id":null,"name":"Scmagazine.com"},"author":null,"title":"Ransomware Ravages Municipalities Nationwide This Week","description":"Municipalities took a beating this week with at least four reporting being shut down from new ransomware attacks or struggling to recover from an older incident.","url":"https://www.scmagazine.com/home/security-news/ransomware/ransomware-ravages-municipalities-nationwide-this-week/","urlToImage":"https://www.scmagazine.com/wp-content/uploads/sites/4/2018/08/ransomware2_1308382-1.jpg","publishedAt":"2019-04-20T14:35:58Z","content":"Municipalities took a beating this week with at least four\r\nreporting being shut down from new ransomware attacks or struggling to recover\r\nfrom an older incident.\r\nAugusta, Maine; Imperial County, Calif.; Stuart, Fla.; and Greenville, N.C. were all in differ… [+2049 chars]"},{"source":{"id":null,"name":"Nbc11news.com"},"author":"Grace Reader","title":"20 years later: Being a student at Columbine High School - KKCO-TV","description":"20 years later: Being a student at Columbine High School KKCO-TV Columbine Survivors Reflect, and Reckon With Specter of Future Shootings The New York Times Doves, heartbreak and hope on 20th anniversary of Columbine High massacre Yahoo News Columbine survivo…","url":"https://www.nbc11news.com/content/news/508832581.html","urlToImage":"https://media.graytvinc.com/images/NEVER.FORGOTTEN.jpg","publishedAt":"2019-04-20T01:18:04Z","content":"GRAND JUNCTION, Colo. (KKCO/KJCT) -- For many, time stopped for Columbine after 13 people were shot and killed on April 20, 1999. But for the students who have gone through the school since, that's very much not the case. \r\nI was one of those students. I grad… [+642 chars]"},{"source":{"id":null,"name":"Bangordailynews.com"},"author":"Maine Public","title":"Maine businesses already feeling consequences of visa complications - Bangor Daily News","description":"Maine businesses already feeling consequences of visa complications Bangor Daily News In what is becoming an annual problem, visa complications are forcing some Maine businesses to consider curtailing services as the tourist season gets...","url":"https://bangordailynews.com/2019/04/20/business/maine-businesses-already-feeling-consequences-of-visa-complications/","urlToImage":"https://bdn-data.s3.amazonaws.com/uploads/2019/04/28359221_H14807770-600x416.jpg","publishedAt":"2019-04-20T14:08:00Z","content":"In what is becoming an annual problem, visa complications are forcing some Maine businesses to consider curtailing services as the tourist season gets underway in Maine.\r\nAt issue are H-2B visas, which many seasonal businesses in towns such as Bar Harbor use … [+1333 chars]"},{"source":{"id":null,"name":"Pressherald.com"},"author":null,"title":"Letter to the editor: Small-business owner supports Maine paid-sick-day bill - Press Herald","description":"Letter to the editor: Small-business owner supports Maine paid-sick-day bill Press Herald I'm a small-business owner and I support L.D. 369, state Sen. Rebecca Millett's bill to guarantee earned paid sick days for Maine workers. I grew up in Gorham...","url":"https://www.pressherald.com/?p=1935226","urlToImage":"https://multifiles.pressherald.com/uploads/sites/4/2017/01/pph-icon-red-linkforFB.png","publishedAt":"2019-04-20T08:00:00Z","content":"I’m a small-business owner and I support L.D. 369, state Sen. Rebecca Milletts bill to guarantee earned paid sick days for Maine workers.\r\nI grew up in Gorham and after training at Portland Arts and Technology High School and at Northern Maine Community Colle… [+1479 chars]"},{"source":{"id":null,"name":"Thesunchronicle.com"},"author":"Capt. Dave Monti sports@thesunchronicle.com","title":"MONTI: New Association promotes business through conservation | Local Sports - The Sun Chronicle","description":"MONTI: New Association promotes business through conservation | Local Sports The Sun Chronicle The American Saltwater Guides Association officially launched this month with a mission to promote sustainable business through marine conservation.","url":"https://www.thesunchronicle.com/sports/local_sports/monti-new-association-promotes-business-through-conservation/article_16b67931-af35-5a99-8670-51984b73e318.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/thesunchronicle.com/content/tncms/assets/v3/editorial/8/5f/85f4a8a0-960a-5572-aadb-ca03f51d9c1e/5cb9065f6b67d.image.jpg?resize=800%2C630","publishedAt":"2019-04-20T02:45:00Z","content":"The American Saltwater Guides Association officially launched this month with a mission to promote sustainable business through marine conservation.\r\nWe represent fishing guides and charter captains, small business owners and like-minded anglers to protect ma… [+6849 chars]"},{"source":{"id":null,"name":"Voanews.com"},"author":"VOA","title":"Study Examines How Americans View Birds","description":"A new study released by the Proceedings of the National Academy of Science aims to define “a range of relationships between people and birds” across the United States. Those are the words of Justin Schuetz, one of the study’s writers. Schuetz is a biologist a…","url":"https://learningenglish.voanews.com/a/study-examines-how-americans-view-birds/4881733.html","urlToImage":"https://gdb.voanews.com/DC9C1FCF-960B-4877-B44A-E9B6121619D0_w1200_r1_s.jpg","publishedAt":"2019-04-20T21:56:45Z","content":"A new study released by the Proceedings of the National Academy of Science aims to define a range of relationships between people and birds across the United States.\r\nThose are the words of Justin Schuetz, one of the studys writers. Schuetz is a biologist and… [+3066 chars]"},{"source":{"id":null,"name":"Baseballamerica.com"},"author":"Teddy Cahill","title":"College Baseball Roundup: Arkansas Wins Big, Texas Tech Evens Key Series - Baseball America","description":"College Baseball Roundup: Arkansas Wins Big, Texas Tech Evens Key Series Baseball America Arkansas clinched a series win against Mississippi State in a key SEC West showdown, highlighting Friday's college baseball action.","url":"https://www.baseballamerica.com/stories/arkansas-slugs-its-way-to-win-texas-tech-evens-key-series/","urlToImage":"https://www.baseballamerica.com/media/8776/arkansas_cws_getty.jpg","publishedAt":"2019-04-20T07:19:02Z","content":"Arkansas Slugs Its Way To Key Series Win\r\nThe SEC West Division is college baseballs most competitive and it got another shakeup Friday as No. 10 Arkansas defeated No. 3 Mississippi State, 12-5, to clinch the series. The Razorbacks have won six straight home … [+10656 chars]"},{"source":{"id":null,"name":"Bleedingcool.com"},"author":"Ray Flook","title":"Arrow, The Flash, and Supergirl: Learn Why Stephen Amell, Grant Gustin, Melissa Benoist, and Nicole Maines Were Cast","description":"It’s pretty safe to say that the CW is in the midst of what might be its largest programming overhaul... Read More The post Arrow, The Flash, and Supergirl: Learn Why Stephen Amell, Grant Gustin, Melissa Benoist, and Nicole Maines Were Cast appeared first on …","url":"https://www.bleedingcool.com/2019/04/20/arrow-the-flash-supergirl-why-stephen-amell-grant-gustin-melissa-benoist-nicole-maines-were-cast/","urlToImage":"https://mlpnk72yciwc.i.optimole.com/w:1024/h:536/q:auto/https://www.bleedingcool.com/wp-content/uploads/2019/04/cwcasting-1.jpg","publishedAt":"2019-04-20T16:25:14Z","content":"Its pretty safe to say that the CW is in the midst of what might be its largest programming overhaul since it first began broadcasting under those two letters. This season, viewers will be saying goodbye to Crazy Ex-Girlfriend, Jane the Virgin, and iZombie an… [+4559 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump and impeachment: where Democrats stand after Mueller","description":"Elizabeth Warren and Rashida Tlaib have called for action, but many lawmakers say more information is needed firstElizabeth Warren was the first 2020 presidential candidate to call for impeachment. Photograph: Kristopher Radder/APLong before a redacted versio…","url":"https://news.yahoo.com/trump-impeachment-where-democrats-stand-183728709.html","urlToImage":null,"publishedAt":"2019-04-20T18:37:28Z","content":null},{"source":{"id":null,"name":"Huffpost.com"},"author":"Mary Papenfuss","title":"Twitter Foes Burn Sen. Susan Collins' For Calling Mueller Report 'Unflattering' To Trump","description":"\"No one parodies Susan Collins more viciously than Susan Collins,\" says one damning tweet.","url":"https://www.huffpost.com/entry/susan-collins-mueller-trump-unflattering_n_5cba9f8ae4b06605e3eec45b","urlToImage":"https://img.huffingtonpost.com/asset/5cbaa2ab240000130a4f6ebc.jpeg?cache=pa9IALtlJt&ops=1200_630","publishedAt":"2019-04-20T05:53:35Z","content":"Sen. Susan Collins (R-Maine) screwed up her “courage” to concede that the Mueller report was “unflattering” to President Donald Trump because it exposed his efforts to derail the probe. \r\nThe president was “not only very upset by the special counsel’s investi… [+611 chars]"},{"source":{"id":"breitbart-news","name":"Breitbart News"},"author":"Warner Todd Huston, Warner Todd Huston","title":"Vermont's Republican Governor to Sign Bill Abolishing Columbus Day","description":"Vermont Republican Gov. Phil Scott said he would sign a bill that would abolish Columbus Day and replace it with \"Indigenous Peoples' Day.\"","url":"https://www.breitbart.com/politics/2019/04/20/vermonts-republican-governor-to-sign-bill-abolishing-columbus-day/","urlToImage":"https://media.breitbart.com/media/2019/04/Phil-Scott-640x335.jpg","publishedAt":"2019-04-20T19:03:49Z","content":"The bill to dump the traditional holiday passed through the state legislature in Montpelier on Wednesday and is now on the governor’s desk waiting for a signature, the Burlington Free Press reported.\r\n“I see no reason that I would not sign it,” Scott told the… [+999 chars]"},{"source":{"id":null,"name":"Wgme.com"},"author":"Associated Press","title":"Maine man among former Colorado police officers traumatized by school shootings - WGME","description":"Maine man among former Colorado police officers traumatized by school shootings WGME AP Was There: Shock, then terror as Columbine attack unfolds Fox News The Latest: 12 students,1 teacher killed honored at ceremony Yahoo News Saturday marks 20 years since Co…","url":"http://wgme.com/news/local/maine-man-among-former-colorado-police-officers-traumatized-by-school-shootings","urlToImage":"http://static-35.sinclairstoryline.com/resources/media/cddaeb69-d739-4cfc-8c77-f6f575388dff-large16x9_Columbine.PNG?1555773034620","publishedAt":"2019-04-20T15:11:00Z","content":null},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":null,"title":"Vermont passes bill abolishing Columbus Day in favor of Indigenous Peoples’ Day - Washington Post","description":"Vermont passes bill abolishing Columbus Day in favor of Indigenous Peoples’ Day Washington Post Vermont bill to replace Columbus Day with Indigenous Peoples’ Day advances Fox News Vermont may abolish Columbus Day amid colonialism uproar New York Post Vermont …","url":"https://www.washingtonpost.com/nation/2019/04/20/vermont-passes-bill-abolishing-columbus-day-favor-indigenous-peoples-day/","urlToImage":"https://www.washingtonpost.com/resizer/omGY5a1QtgZxGgOjK3E1zpVDeTc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QORHOVYVQ5BVFCSAJDXO7K2PHI.jpg","publishedAt":"2019-04-20T16:18:39Z","content":"For three years, the state of Vermont has been celebrating the second Monday of October, traditionally and federally labeled as Columbus Day, as Indigenous Peoples Day.\r\nVermonts former governor, a Democrat, signed a proclamation rebranding the holiday in 201… [+3934 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"the Associated Press","title":"Warmth, snowmelt, rain raise flood concerns in Northern New England","description":"Flood warnings and watches remained in effect for much of the three-state region, officials said.","url":"https://www.bostonglobe.com/metro/2019/04/20/warmth-snowmelt-rain-raise-flood-concerns-northern-new-england/2eQEYnKVCUYPXOofrc0bsI/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-20T20:40:56Z","content":"PORTLAND, Maine — A combination of warm weather, rain and melting snow was feeding floodwaters in low-lying areas of Vermont, New Hampshire, and Maine on Saturday.\r\nNo injuries were reported, but in Vermont the Stowe swift water rescue team was staging in the… [+1486 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":null,"title":"Lottery","description":"Lottery results from Friday drawings","url":"https://www.bostonglobe.com/metro/lottery/2019/04/19/lottery/yAOMdnTbSl2hOQ0yY0FziO/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-20T00:20:14Z","content":"FRIDAY MIDDAY\r\n0929\r\nPayoffs (based on a $1 bet)\r\nEXACT ORDER\r\nAll 4 digits\r\n$4,253\r\nFirst or last 3\r\n$595\r\nAny 2 digits\r\n$51\r\nAny 1 digit\r\n$5\r\nANY ORDER\r\nAll 4 digits\r\n$354\r\nFirst 3\r\n$99\r\nLast 3\r\n$198\r\nFRIDAY NIGHT\r\n3490\r\nPayoffs (based on a $1 bet)\r\nEXACT O… [+640 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":null,"title":"Lottery","description":"Lottery results from Saturday drawings","url":"https://www.bostonglobe.com/metro/lottery/2019/04/20/lottery/sFodQBP71LtjkaLp8399YO/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-20T23:24:00Z","content":"SATURDAY MIDDAY\r\n5-4-4-5\r\nPayoffs (based on a $1 bet)\r\nEXACT ORDER\r\nAll 4 digits$3,565\r\nFirst or last 3$499\r\nAny 2 digits$43\r\nAny 1 digit$4\r\nANY ORDER\r\nAll 4 digits$594\r\nFirst 3$166\r\nLast 3$166\r\nSATURDAY NIGHT\r\nPayoffs (based on a $1 bet)\r\nEXACT ORDER\r\nAll 4 … [+756 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"David Abel","title":"How federal officials hope to protect endangered right whales in Cape Cod Bay","description":"A team plans to meet in Providence next week and issue formal recommendations that seek to reduce whale deaths and serious injuries by as much as 80 percent.","url":"https://www.bostonglobe.com/metro/2019/04/20/how-federal-officials-hope-protect-endangered-right-whales-cape-cod-bay/I57nFpeibxyuslQDeevYYO/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/11/BostonGlobe.com/Metro/Images/Motherandcalf.jpg","publishedAt":"2019-04-20T21:52:05Z","content":"ON CAPE COD BAY — Moments after Michael Moore launched the drone, just off the starboard side of the Rosita, a charcoal-colored fluke thrust out of the dark chop\r\n. Seconds later, a few feet away, another smaller fluke emerged.\r\nIt was a rare sign of good new… [+8544 chars]"},{"source":{"id":null,"name":"Nationalinterest.org"},"author":"Warfare History Network","title":"This Gun Did One Historic Thing: It Made America a Superpower","description":"Warfare History Network Security, Americas Here's why. In the late 19th century, an arms race was in effect among the nations of Europe. Advances in technology were quickly rendering obsolete the weapons that had served relatively unchanged for decades. The m…","url":"https://nationalinterest.org/blog/buzz/gun-did-one-historic-thing-it-made-america-superpower-53552","urlToImage":"https://nationalinterest.org/sites/default/files/main_images/Gev%C3%A4r_f%C3%B6rs%C3%B6ksmodell_1892_Krag-J%C3%B6rgensen_Norge_-_Arm%C3%A9museum_0.jpg","publishedAt":"2019-04-20T20:00:00Z","content":"In the late 19th century, an arms race was in effect among the nations of Europe. Advances in technology were quickly rendering obsolete the weapons that had served relatively unchanged for decades. The muzzle loader gave way to the breech-loading cartridge r… [+9098 chars]"},{"source":{"id":null,"name":"Windowseat.aero"},"author":"Window Seat","title":"Portland, Maine to Washington, DC","description":"Grey skies on the ground in Maine yielded to blue skies and sunshine in the air on this American Eagle CRJ 200 to the nation's capital. Added bonus: a relatively rare landing on RWY 33 at DCA, with a couple tight turns to pull that off. The post Portland, Mai…","url":"https://windowseat.aero/portland-maine-to-washington-dc/","urlToImage":"https://windowseat.aero/wp-content/uploads/2019/01/PWM-DCA.jpg","publishedAt":"2019-04-20T11:29:13Z","content":"Grey skies on the ground in Maine yielded to blue skies and sunshine in the air on this American Eagle CRJ 200 to the nation’s capital. Far from comfortable inside, but the views are pretty darn nice. Added bonus: a relatively rare landing on RWY 33 at DCA, w… [+41 chars]"},{"source":{"id":null,"name":"Yourmileagemayvary.net"},"author":"Your Mileage May Vary","title":"Happy 420! So, Can You Fly With Weed Now, Or What?","description":"The rules regarding marijuana have been rapidly evolving so it can be confusing to understand the restrictions on flying with what may be a legal amount of weed from where you are leaving from. If you would have asked, “Can you fly with pot?” to a group of fr…","url":"https://yourmileagemayvary.net/2019/04/20/happy-420-so-can-you-fly-with-weed-now-or-what/","urlToImage":"https://yourmileagemayvary.net/wp-content/uploads/2019/04/marijuana-3801012_960_720.jpg","publishedAt":"2019-04-20T20:15:51Z","content":"The rules regarding marijuana have been rapidly evolving so it can be confusing to understand the restrictions on flying with what may be a legal amount of weed from where you are leaving from.\r\nIf you would have asked, “Can you fly with pot?” to a group of f… [+8175 chars]"},{"source":{"id":null,"name":"Memeorandum.com"},"author":null,"title":"Collins: Mueller report includes 'an unflattering portrayal' of Trump (Jordain Carney/The Hill)","description":"Jordain Carney / The Hill : Collins: Mueller report includes ‘an unflattering portrayal’ of Trump — Sen. Susan Collins (R-Maine) said Friday that special counsel Robert Mueller's report gives an “unflattering portrayal” of President Trump, including an effort…","url":"https://www.memeorandum.com/190419/p111","urlToImage":"http://thehill.com/sites/default/files/collinssusan_031419sr_lead.jpg","publishedAt":"2019-04-20T00:10:00Z","content":"memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme ane Mediagazer, it is not a human-edited news outlet, but rather a media-monitoring tool for sophisticated ne… [+12 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Louis Casiano","title":"Vermont bill to replace Columbus Day with Indigenous Peoples’ Day advances - Fox News","description":"Vermont bill to replace Columbus Day with Indigenous Peoples’ Day advances Fox News Vermont may abolish Columbus Day amid colonialism uproar New York Post Vermont governor says he's likely to sign bill abolishing Columbus Day | TheHill The Hill Maine bill to …","url":"https://www.foxnews.com/politics/vermont-poised-to-replace-columbus-day-with-indigenous-peoples-day","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/C1.jpg","publishedAt":"2019-04-20T10:40:32Z","content":"Vermont appears poised to replace Columbus Day with Indigenous Peoples' Day, as more cities, states and universities opt to stop honoring the famed explorer and recognize Native Americans instead.\r\nA bill to replace the federal holiday cleared the state Legis… [+1692 chars]"},{"source":{"id":null,"name":"Chicagotribune.com"},"author":"Bob Narang","title":"College notes: Stevenson grad Ryuji Aoki hopes to go pro in Japan","description":"Ryuji Aoki isn’t ready to hang up his basketball shoes. The former Stevenson guard completed his third and final season at Rose-Hulman in late February. Aoki will graduate in May after only three years at the prestigious institution in Terre Haute, Ind. Aoki …","url":"https://www.chicagotribune.com/suburbs/mundelein/sports/ct-lsr-college-notes-ryuji-aoki-rose-hulman-basketball-tl-0425-story.html","urlToImage":"https://www.trbimg.com/img-5cbb8e46/turbine/ct-lsr-college-notes-ryuji-aoki-rose-hulman-basketball-tl-0425","publishedAt":"2019-04-20T21:05:00Z","content":"Ryuji Aoki isnt ready to hang up his basketball shoes.\r\nThe former Stevenson guard completed his third and final season at Rose-Hulman in late February. Aoki will graduate in May after only three years at the prestigious institution in Terre Haute, Ind.\r\nAoki… [+3257 chars]"},{"source":{"id":null,"name":"Activistpost.com"},"author":"Activist Post","title":"Washington State Politicians Drop Cynical Attempt to Impose Taxes on Gold & Silver","description":"Sound Money Group, In-State Dealers, and Grassroots Activists Deter Tax-Hungry Politicians Well, here’s some encouraging news… Efforts in Washington State to impose sales tax on...","url":"https://www.activistpost.com/2019/04/washington-state-politicians-drop-cynical-attempt-to-impose-taxes-on-gold-silver.html","urlToImage":"https://www.activistpost.com/wp-content/uploads/2019/04/Money_gold_bars_HD_wallpaper-1_3-1024x512-1024x512-1024x512-1024x512-1024x512-1024x512-1024x512.jpg","publishedAt":"2019-04-20T15:11:29Z","content":"Sound Money Group, In-State Dealers, and Grassroots Activists Deter Tax-Hungry Politicians \r\nWell, heres some encouraging news\r\nEfforts in Washington State to impose sales tax on gold and silver were SHUT DOWN today thanks to intense efforts by the Sound Mone… [+2756 chars]"},{"source":{"id":null,"name":"Activistpost.com"},"author":"Activist Post","title":"Google’s Sensorvault Can Tell Police Where You’ve Been","description":"The location data comes from GPS signals, cellphone towers, nearby Wi-Fi devices and Bluetooth beacons. According to Google, users opt in...","url":"https://www.activistpost.com/2019/04/googles-sensorvault-can-tell-police-where-youve-been.html","urlToImage":"https://www.activistpost.com/wp-content/uploads/2019/04/location-city-1024x512-1-1024x512-1.png","publishedAt":"2019-04-20T02:07:10Z","content":"By Jennifer Lynch\r\nDo you know where you were five years ago? Did you have an Android phone at the time? It turns out Google might knowand it might be telling law enforcement.\r\nIn a new article, the New York Times details a little-known technique increasingly… [+9402 chars]"},{"source":{"id":null,"name":"Comicbook.com"},"author":"Jamie Lovett","title":"'The Curse of La Llorona' to Top Opening Weekend Box Office","description":"The Curse of La Llorona, the sixth film in The Conjuring Universe, will take to the top of the box office in its opening weekend. The Curse of La Llorona earned $11.8 million on Friday and is expected to walk away with $26 million after its first three days a…","url":"https://comicbook.com/horror/2019/04/20/curse-of-la-llorona-opening-weekend-box-office/","urlToImage":"https://media.comicbook.com/2018/10/the-curse-of-la-llorona-teaser-trailer-1139752-640x320.jpeg","publishedAt":"2019-04-20T18:39:00Z","content":"The Curse of La Llorona, the sixth film in The Conjuring Universe, will take to the top of the box office in its opening weekend. The Curse of La Llorona earned $11.8 million on Friday and is expected to walk away with $26 million after its first three days a… [+9771 chars]"},{"source":{"id":null,"name":"Hustlebelt.com"},"author":"Hustle Belt","title":"2019 Central Michigan football positional previews: Quarterbacks","description":"The quarterback position was a bit of a strip-mall carousel for the Chippewas football program in 2018, with an amazing five different players (including a defensive back in Darius Bracy) taking the reins at the QB1 spot for a minimum of a series throughout t…","url":"https://www.hustlebelt.com/2019/4/20/18242138/central-michigan-football-positional-previews-quarterbacks-2019","urlToImage":"https://cdn.vox-cdn.com/thumbor/0TiFxrFtgHj00M-P18ioohE1WVY=/0x0:4494x2353/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14659341/usa_today_10317380.jpg","publishedAt":"2019-04-20T05:00:00Z","content":"The quarterback position was a bit of a strip-mall carousel for the Chippewas football program in 2018, with an amazing five different players (including a defensive back in Darius Bracy) taking the reins at the QB1 spot for a minimum of a series throughout t… [+11308 chars]"},{"source":{"id":null,"name":"Governmentslaves.news"},"author":"newsguy76","title":"Google’s Sensorvault Can Tell Police Where You’ve Been","description":"Do you know where you were five years ago? Did you have an Android phone at the time? It turns out Google might know—and it might be telling law enforcement. In a new article, the New York Times…","url":"https://governmentslaves.news/2019/04/20/googles-sensorvault-can-tell-police-where-youve-been/","urlToImage":"https://governmentslaves.news/wp-content/uploads/2019/01/cropped-G-1.png","publishedAt":"2019-04-20T16:44:02Z","content":"Do\r\n you know where you were five years ago? Did you have an Android phone \r\nat the time? It turns out Google might knowand it might be telling law \r\nenforcement.\r\nIn a new article, the New York Times\r\n details a little-known technique increasingly used by la… [+8437 chars]"},{"source":{"id":null,"name":"Thepassivevoice.com"},"author":"PG","title":"Open Access","description":"The Passive Voice is a blog about books, authors, writing, publishing, etc., but PG is pleased to learn of open access policies by a couple of large art museums whereby the museum offers high-quality digital files of art for which copyrights have expired. Thi…","url":"https://www.thepassivevoice.com/open-access/","urlToImage":null,"publishedAt":"2019-04-20T00:13:28Z","content":"The Passive Voice is a blog about books, authors, writing, publishing, etc., but PG is pleased to learn of open access policies by a couple of large art museums whereby the museum offers high-quality digital files of art for which copyrights have expired.\r\nTh… [+784 chars]"},{"source":{"id":null,"name":"Startribune.com"},"author":"Curt Brown","title":"Questions still shadow 1891 hanging in Redwood County","description":"Follow the StarTribune for the news, photos and videos from the Twin Cities and beyond.","url":"http://www.startribune.com/questions-still-shadow-1891-hanging-in-redwood-county/508851252/","urlToImage":"http://stmedia.stimg.co/ows_155579097515724.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces","publishedAt":"2019-04-20T20:09:39Z","content":"Just before the black hood was drawn over his face, a doomed man faced the crowd that gathered at 5 a.m. to witness the only execution ever recorded in southwestern Minnesota's Redwood County.\r\n\"I stand on this platform a poor unfortunate man who in a few min… [+4706 chars]"},{"source":{"id":null,"name":"Slate.com"},"author":"Daniel Politi","title":"Vermont Likely to Become Third State to Officially Scrap Columbus Day for Indigenous Peoples’ Day","description":"The state's lawmakers have passed the bill and are just waiting for Gov. Phil Scott's signature.","url":"https://slate.com/news-and-politics/2019/04/vermont-to-officially-scrap-columbus-day-indigenous-peoples-day.html","urlToImage":"https://compote.slate.com/images/a24b086b-88a9-49fe-a416-d486be776f1a.jpeg?width=780&height=520&rect=3179x2119&offset=0x0","publishedAt":"2019-04-20T21:01:44Z","content":"A statue of Christopher Columbus at a downtown Los Angeles park is surrounded by a chain-link fence on October 9, 2017 in Los Angeles, California.\r\nFox News Shepard Smith Delivered the Best Burn I Heard All Day\r\nThe Mueller Report Is a Portrait of an Egomania… [+2595 chars]"},{"source":{"id":"cbc-news","name":"CBC News"},"author":"CBC News","title":"Canada says no to Asian carp as lobster bait","description":"The Canadian Food Inspection Agency is throwing cold water on the prospect of importing Asian carp from the United States for use as lobster bait.","url":"https://www.cbc.ca/news/canada/nova-scotia/canada-says-no-to-asian-carp-as-lobster-bait-1.5104802","urlToImage":"https://i.cbc.ca/1.4596431.1522235750!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/asian-carp-great-lakes.jpg","publishedAt":"2019-04-20T09:00:00Z","content":"The Canadian Food Inspection Agency is throwing cold water on the prospect of importing Asian carp from the United States for use as lobster bait.\r\nWith bait prices on the rise, the invasive species was promoted as a cheaper bait source for the lucrative fish… [+2523 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Nidhi Sharma","title":"BJP ticket biggest clean chit for me, says Pragya Thakur","description":"BJP distances itself from her remarks on Karkare and EC seeks report from MP’s chief electoral officer.","url":"https://economictimes.indiatimes.com/news/politics-and-nation/bjp-ticket-biggest-clean-chit-for-me-says-pragya-thakur/articleshow/68961719.cms","urlToImage":"https://img.etimg.com/thumb/msid-68961752,width-1070,height-580,imgsize-637814,overlay-economictimes/photo.jpg","publishedAt":"2019-04-20T01:30:35Z","content":"SEHORE (BHOPAL): Unfazed by the political controversy stirred by her remarks on late ATS chief Hemant Karkare, Sadhvi Pragya Bharti Thakur told ET on Friday that the BJP giving her a ticket to contest was the biggest “clean chit” for her.\r\nSadhvi Pragya, who … [+4466 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"ME Caribou ME Zone Forecast","description":"ME Caribou ME Zone Forecast for Saturday, April 20, 2019","url":"https://www.richmond.com/news/ap/me-caribou-me-zone-forecast/article_3225a88f-2297-555d-9fa1-24ac3ccffc1b.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-20T13:21:18Z","content":"ME Caribou ME Zone Forecast for Saturday, April 20, 2019\r\n692 FPUS51 KCAR 201318\r\nZFPCAR\r\nZone Forecast Product for Northern and Eastern Maine\r\nNational Weather Service Caribou ME\r\n918 AM EDT Sat Apr 20 2019\r\nMEZ001-202015-\r\nNorthwest Aroostook-\r\nIncluding th… [+26060 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Maine company plays a role at White House Easter Egg roll","description":"NEW VINEYARD, Maine (AP) — The White House Easter Egg Roll will once again feature colorful eggs made in Maine.","url":"https://apnews.com/575cb43de13c4c9eb92082595c1d963c","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/2/e0/2e018af7-08f7-543f-b5d6-006deecd299f/5cbb53b0ccee5.image.jpg?resize=945%2C630","publishedAt":"2019-04-20T16:51:38Z","content":"NEW VINEYARD, Maine (AP) The White House Easter Egg Roll will once again feature colorful eggs made in Maine.\r\nMaine Wood Concepts has created 100,000 wooden eggs featuring the president and first lady's signatures for the annual event that takes place Monday… [+1152 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Lawmakers will get to work next year on funding county jails","description":"AUGUSTA, Maine (AP) — Maine lawmakers want to take a closer look at increasing state funding for Maine's county jail.","url":"https://apnews.com/83a687779c1e4fffb3523357fe2655d0","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T17:30:17Z","content":"AUGUSTA, Maine (AP) Maine lawmakers want to take a closer look at increasing state funding for Maine's county jail.\r\nThe Bangor Daily News reports lawmakers have kicked back the issue until next year.\r\nThe Legislature's Criminal Justice and Public Safety Comm… [+739 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"53rd edition of the Kenduskeag Stream Canoe Race kicks off","description":"BANGOR, Maine (AP) — It's a rite of spring in Maine: Paddlers are set to make their way down the Kenduskeag Stream.","url":"https://apnews.com/d121a961d6d44cd19db308410f76b99a","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T16:48:14Z","content":"BANGOR, Maine (AP) It's a rite of spring in Maine: Paddlers are set to make their way down the Kenduskeag Stream.\r\nScores were participating in Saturday's Kenduskeag Stream Canoe Race in Bangor. The 16-mile race is punctuated with spills and thrills at Six Mi… [+496 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Computer networks in Maine capital back up after infection","description":"AUGUSTA, Maine (AP) — Officials in Maine's capital say a malicious piece of software that froze the city's computer network and forced the closure of the Augusta City Center has been removed from computers.","url":"https://apnews.com/5c9c95c66a3f4145ab28ac866664ad65","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T12:42:49Z","content":"AUGUSTA, Maine (AP) Officials in Maine's capital say a malicious piece of software that froze the city's computer network and forced the closure of the Augusta City Center has been removed from computers.\r\nThe Kennebec Journal reports the work to repair the s… [+767 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"By The Associated Press","title":"Warmth, snowmelt, rain raise flood concerns in New England","description":"PORTLAND, Maine (AP) — The National Weather Service says a combination of warm temperatures, rain and melting snow are fueling flood danger this weekend in northern New England.","url":"https://apnews.com/fa1ac3c90a8b4f63bc4c2c8d0de83f3d","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-20T12:22:39Z","content":"PORTLAND, Maine (AP) The National Weather Service says a combination of warm temperatures, rain and melting snow are fueling flood danger this weekend in northern New England.\r\nMeteorologist James Brown says minor flooding is expected on Saturday and Sunday i… [+713 chars]"},{"source":{"id":null,"name":"Vox.com"},"author":"Khushbu Shah","title":"Mitt Romney is “sickened” by the Trump administration’s “dishonesty” after reading Mueller report","description":"The Republican senator broke with his party, criticizing the Trump administration after reading the 448-page report.","url":"https://www.vox.com/policy-and-politics/2019/4/20/18508795/mitt-romney-is-sickened-by-the-trump-administrations-dishonesty-after-reading-mueller-report","urlToImage":"https://cdn.vox-cdn.com/thumbor/Eeldffxg-4un_fUk-s1J3GMwn_o=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15243270/163772834.0.0.1422633439.jpg","publishedAt":"2019-04-20T14:19:41Z","content":"The Republican senator broke with his party, criticizing the Trump administration after reading the 448-page report. Utah Republican Senator Mitt Romney offered harsh criticism of the Trump administration after reading the recently released redacted version o… [+5365 chars]"},{"source":{"id":null,"name":"Theweek.com"},"author":"Tim O'Donnell","title":"Mitt Romney says he is 'sickened' by the Mueller reports findings, but government can now 'move on'","description":"It's fair to say that the Mueller report did not knock down any partisan barriers. Reactions were typically divided. Democrats vowed to continue pursuing the reports findings, with some prominent members of the party, like Sen. Elizabeth Warren (D-Mass.), cal…","url":"https://theweek.com/speedreads/836450/mitt-romney-says-sickened-by-mueller-reports-findings-but-government-now-move","urlToImage":"https://images.theweek.com/sites/default/files/styles/tw_image_6_4/public/gettyimages-1138653362.jpg?itok=n9H1rFWT","publishedAt":"2019-04-20T17:08:36Z","content":"It's fair to say that the Mueller report did not knock down any partisan barriers. Reactions were typically divided. Democrats vowed to continue pursuing the reports findings, with some prominent members of the party, like Sen. Elizabeth Warren (D-Mass.), cal… [+1538 chars]"},{"source":{"id":null,"name":"Stltoday.com"},"author":"","title":"Ruta, Rijo and Saez lead Trenton in win","description":"PORTLAND, Maine (AP) -- Ben Ruta had four hits, while Wendell Rijo and Jorge Saez recorded three apiece as the Trenton Thunder topped the Portland Sea Dogs 13-10 on Friday.","url":"https://www.stltoday.com/sports/baseball/ruta-rijo-and-saez-lead-trenton-in-win/article_92430887-f960-5bb5-9db3-3a3ace5634d7.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517","publishedAt":"2019-04-20T01:45:18Z","content":"PORTLAND, Maine (AP) -- Ben Ruta had four hits, while Wendell Rijo and Jorge Saez recorded three apiece as the Trenton Thunder topped the Portland Sea Dogs 13-10 on Friday.\r\nRuta doubled and singled three times, scoring two runs. Rijo singled three times, sco… [+1014 chars]"},{"source":{"id":null,"name":"Upi.com"},"author":null,"title":"Storms calm after claiming at least 5 lives","description":"Between Wednesday and Friday, 31 tornadoes were reported from Florida to Texas, with the storm's biggest blast charging through Avon, N.C., Saturday at 90 mph.","url":"https://www.upi.com/Top_News/US/2019/04/20/Storms-calm-after-claiming-at-least-5-lives/1051555779903/","urlToImage":"https://cdnph.upi.com/ph/st/th/1051555779903/2019/i/15557863661686/v1.5/Storms-calm-after-claiming-at-least-5-lives.jpg?lg=2","publishedAt":"2019-04-20T19:00:22Z","content":"April 20 (UPI) -- Most of the United States can expect pleasant weather this Easter Sunday after harsh storms ripped through the nation over the last three days.\r\nBetween Wednesday and Friday, reports of 31 tornadoes stretched from Florida to Texas, with a on… [+573 chars]"},{"source":{"id":null,"name":"Inquirer.net"},"author":"lalos","title":"Spreading happiness during Lent","description":"The Lenten season was about forgiving sins, breaking free from distractions, sparking more creativity and feeling grateful. The post Spreading happiness during Lent appeared first on Inquirer Lifestyle.","url":"https://lifestyle.inquirer.net/332455/spreading-happiness-during-lent/","urlToImage":"https://lifestyle.inquirer.net/files/2019/04/t0421tessa_11-620x414.jpg","publishedAt":"2019-04-20T21:42:34Z","content":"Gift-giving for Balesin Islands grade school children, with Luisa Banta, Kerry Tiñga, Yvette Ilagan,Ysa and Nova Veluz, Kaye Tiñga, Sea Princess, Digzy Umali, Den Casipit and Evans Ramos\r\nHappy Easter to all!\r\nThe Lenten season was about forgiving sins, break… [+4660 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"FerdiS","title":"Dividend Increases: April 8-19, 2019","description":"With earnings season picking up, several companies declared dividend increases in the past two weeks. I like to monitor dividend increases for stocks on my watc","url":"https://seekingalpha.com/article/4255533-dividend-increases-april-8minus-19-2019","urlToImage":"https://static.seekingalpha.com/uploads/2019/4/20/saupload_divgro-dividends-small.png","publishedAt":"2019-04-20T16:59:39Z","content":"One way to identify dividend growth stocks for further analysis is to monitor dividend increases. Companies can only raise their dividends regularly and sustainably if they grow earnings sufficiently.\r\nThe CCC List provides a good starting point, but I limit … [+14708 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Maine company plays a role at White House Easter Egg roll","description":"The White House Easter Egg Roll will once again feature colorful eggs made in Maine. Maine Wood Concepts has created 100,000 wooden eggs featuring the president and first lady's signatures … Click to Continue »","url":"https://www.charlotteobserver.com/news/business/national-business/article229502074.html#storylink=rss","urlToImage":"https://www.mcclatchy-wires.com/incoming/os73f6/picture229502059/alternates/LANDSCAPE_1140/White_House-Easter_Eggs_01373.jpg","publishedAt":"2019-04-20T16:52:39Z","content":"Maine company plays a role at White House Easter Egg roll\r\nNEW VINEYARD, Maine\r\n The White House Easter Egg Roll will once again feature colorful eggs made in Maine.\r\nMaine Wood Concepts has created 100,000 wooden eggs featuring the president and first lady's… [+1074 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Computer networks in Maine capital back up after infection","description":"Officials in Maine's capital say a malicious piece of software that froze the city's computer network and forced the closure of the Augusta City Center has been removed from computers. … Click to Continue »","url":"https://www.charlotteobserver.com/news/science-technology/article229498989.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-20T12:43:21Z","content":"Computer networks in Maine capital back up after infection\r\nAUGUSTA, Maine\r\n Officials in Maine's capital say a malicious piece of software that froze the city's computer network and forced the closure of the Augusta City Center has been removed from computer… [+628 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Ruta, Rijo and Saez lead Trenton in win","description":"PORTLAND, Maine (AP) -- Ben Ruta had four hits, while Wendell Rijo and Jorge Saez recorded three apiece as the Trenton Thunder topped the Portland Sea Dogs 13-10 on Friday. … Click to Continue »","url":"https://www.charlotteobserver.com/sports/article229494624.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-20T01:45:51Z","content":"Ruta, Rijo and Saez lead Trenton in win\r\nPortland, Maine\r\n PORTLAND, Maine (AP) -- Ben Ruta had four hits, while Wendell Rijo and Jorge Saez recorded three apiece as the Trenton Thunder topped the Portland Sea Dogs 13-10 on Friday.\r\nRuta doubled and singled t… [+733 chars]"},{"source":{"id":null,"name":"Charlotteobserver.com"},"author":"The Associated Press","title":"Lawmakers will get to work next year on funding county jails","description":"Maine lawmakers want to take a closer look at increasing state funding for Maine's county jail. The Bangor Daily News reports lawmakers have kicked back the issue until next year. … Click to Continue »","url":"https://www.charlotteobserver.com/news/politics-government/national-politics/article229503189.html#storylink=rss","urlToImage":"https://www.charlotteobserver.com/wps/source/images/charlotteobserver/facebook.jpg","publishedAt":"2019-04-20T17:30:50Z","content":"Lawmakers will get to work next year on funding county jails\r\nAUGUSTA, Maine\r\n Maine lawmakers want to take a closer look at increasing state funding for Maine's county jail.\r\nThe Bangor Daily News reports lawmakers have kicked back the issue until next year.… [+664 chars]"},{"source":{"id":"the-hill","name":"The Hill"},"author":"Aris Folley","title":"Ocasio-Cortez plans visit to Kentucky despite being disinvited by GOP congressman","description":"Rep. Alexandria Ocasio-Cortez (D-N.Y.) still has plans to visit Kentucky despite one of her GOP colleagues walking back an invitation for her to visit his district.A spokesman for Ocasio-Cortez...","url":"https://thehill.com/homenews/house/439819-ocasio-cortez-still-planning-to-go-to-kentucky-despite-being-disinvited-by","urlToImage":"https://thehill.com/sites/default/files/ocasio_cortez_getty_0.jpg","publishedAt":"2019-04-20T01:35:30Z","content":"Rep. Alexandria Ocasio-CortezAlexandria Ocasio-CortezThe Hill's Morning Report Mueller aftermath: What will House Dems do now?Mueller report poses new test for DemsEnvironmentalists see victory with Green New Deal blitzMORE (D-N.Y.) still has plans to visit K… [+3313 chars]"},{"source":{"id":null,"name":"Upi.com"},"author":null,"title":"Storms calm after claiming at least 5 lives","description":"Between Wednesday and Friday, 31 tornadoes were reported from Florida to Texas, with the storm's biggest blast charging through Avon, N.C., Saturday at 90 mph.","url":"https://www.upi.com/Top_News/2019/04/20/Storms-calm-after-claiming-at-least-5-lives/1051555779903/","urlToImage":"https://cdnph.upi.com/ph/st/th/1051555779903/2019/i/15557863661686/v1.5/Storms-calm-after-claiming-at-least-5-lives.jpg?lg=2","publishedAt":"2019-04-20T19:00:22Z","content":"April 20 (UPI) -- Most of the United States can expect pleasant weather this Easter Sunday after harsh storms ripped through the nation over the last three days.\r\nBetween Wednesday and Friday, reports of 31 tornadoes stretched from Florida to Texas, with a ma… [+713 chars]"},{"source":{"id":null,"name":"Sbnation.com"},"author":"cew83","title":"Tales From The Stands: Sunderland 2-1 Crystal Palace, March 1991 - More than just three points?","description":"Who remembers Sunderland’s 2-1 win over Crystal Palace back in March 1991 - and did the result mean MORE than just three points?","url":"https://rokerreport.sbnation.com/2019/4/20/18306784/tales-from-the-stands-sunderland-2-1-crystal-palace-march-1991-more-than-just-three-points","urlToImage":"https://cdn.vox-cdn.com/thumbor/_G32tH2IapHerJYv2OQjZPyzbyk=/0x0:615x322/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16027297/TKR_NJL_260115KieronBradySunderland.jpg","publishedAt":"2019-04-20T13:08:11Z","content":"Who remembers Sunderland’s 2-1 win over Crystal Palace back in March 1991 - and did the result mean MORE than just three points? It was a fairly strange way to get promoted thinking back. Finding out on teletext what the Football Association’s final decision … [+9093 chars]"},{"source":{"id":null,"name":"Thesunchronicle.com"},"author":"By George W. Rhodes grhodes@thesunchronicle.com","title":"New age, new church","description":"Thursday was Ask an Atheist Day.","url":"https://www.thesunchronicle.com/news/local_news/new-age-new-church/article_dbd7d66e-4f7d-524c-8204-4a82bf781e99.html","urlToImage":"https://bloximages.chicago2.vip.townnews.com/thesunchronicle.com/content/tncms/assets/v3/editorial/d/6d/d6dda8a2-f535-5489-b83c-6f1e08f0b4c1/5cba653d7c669.image.jpg?resize=840%2C630","publishedAt":"2019-04-20T00:00:00Z","content":"Thursday was Ask an Atheist Day.\r\nIt fell in the heart of Holy Week, the day before Christianitys Good Friday and two days before Judaisms Passover.\r\nAnd Easter is Sunday.\r\nBut it wasnt purposely timed for one of the holiest times of the year.\r\nA group called… [+16652 chars]"},{"source":{"id":null,"name":"Chowhound.com"},"author":"dfrostnh","title":"Partner has ‘bad’ taste in food","description":"Sis and her husband are still married even though she hates fish and he loves it. There's a lot of food he doesn't like. One time a date took me to a Chinese restaurant where he ordered steak and asked for a bottle of ketchup. It was the beginning of the end …","url":"https://www.chowhound.com/post/partner-bad-taste-food-1082510?commentId=10186548#10186548","urlToImage":"https://www.chowstatic.com/s/og_image_default-0a3137f0f61c00cc0f04194aab2f1d5f.jpg","publishedAt":"2019-04-20T10:22:59Z","content":"Hi all, just wanted to hear your thoughts on this minor thing! \r\nRecently my partner and I went to Japan and we ate food like fresh sushi and Matsusaka beef together. However, my partner has said that they prefer the American supermarket premade type of sushi… [+170 chars]"},{"source":{"id":null,"name":"Slashdot.org"},"author":"feedfeeder","title":"Vermont may abolish Columbus Day amid colonialism uproar - New York Post","description":"Vermont may abolish Columbus Day amid colonialism uproarNew York Post Vermont bill to replace Columbus Day with Indigenous Peoples’ Day advancesFox News Vermont governor says he's likely to sign bill abolishing Columbus Day | TheHillThe Hill Maine bill to rep…","url":"https://slashdot.org/firehose.pl?op=view&amp;id=108211652","urlToImage":null,"publishedAt":"2019-04-20T18:12:46Z","content":"The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way."},{"source":{"id":null,"name":"Slashdot.org"},"author":"feedfeeder","title":"Vermont passes bill abolishing Columbus Day in favor of Indigenous Peoples’ Day - Washington Post","description":"Vermont passes bill abolishing Columbus Day in favor of Indigenous Peoples’ DayWashington Post Vermont bill to replace Columbus Day with Indigenous Peoples’ Day advancesFox News Vermont may abolish Columbus Day amid colonialism uproarNew York Post Vermont gov…","url":"https://slashdot.org/firehose.pl?op=view&amp;id=108212534","urlToImage":null,"publishedAt":"2019-04-20T19:52:47Z","content":"Play Rogue, visit exotic locations, meet strange creatures and kill them."},{"source":{"id":null,"name":"Thetelegram.com"},"author":"Sam Mcneish","title":"St. John’s native Andrea King to receive Folio magazine Top Women in Media Award","description":"Andrea King is about to be recognized for her hard work and diligence at State 23 Media, in Portland, Maine.\r\n\r\nBorn and raised in St. John’s, King will be honoured June 7 by Folio magazine as one of its Top Women in Media Award for","url":"https://www.thetelegram.com/business/st-johns-native-andrea-king-to-receive-folio-magazine-top-women-in-media-award-303718/","urlToImage":"https://www.thetelegram.com/media/photologue/photos/cache/TEL-B01-20042019-AndreaKing_RtT5X60_medium.jpg","publishedAt":"2019-04-20T13:55:24Z","content":"Andrea King is about to be recognized for her hard work and diligence at State 23 Media, in Portland, Maine.\r\nBorn and raised in St. John’s, King will be honoured June 7 by Folio magazine as one of its Top Women in Media Award for 2018.\r\nThe recognition from … [+5058 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Maine Marine's body returns home on Saturday","description":"Tyler Wallingford, killed by another Marine in Beaufort South Carolina last week, returns home Saturday evening.","url":"https://www.newscentermaine.com/article/news/local/maine-marines-body-returns-home-on-saturday/97-6a90e2c6-6f33-4ccf-b5ee-ce52cccc52ae","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/1a713687-e1ec-4e9d-898b-35fbbd5ee931/1a713687-e1ec-4e9d-898b-35fbbd5ee931_1140x641.png","publishedAt":"2019-04-20T18:38:42Z","content":"PORTLAND, Maine The Maine Marine killed in Beaufort, South Carolina last week returns home on Saturday.\r\nTyler Wallingford, 21, of Standish was killed at the Marine Corps Air Station Beaufort in South Carolina on April 12. According to a press release by Stan… [+498 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Flood warnings issued in northern Maine","description":"Two towns in Aroostook County have been issued flood warnings. Island Falls and Washburn are already experiencing flooding and road closures.","url":"https://www.newscentermaine.com/article/news/flood-warnings-issued-in-northern-maine/97-6134fd35-a381-4bee-8036-ff6f11abac9e","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/cc17e840-e991-4113-8b00-bde28d124ee2/cc17e840-e991-4113-8b00-bde28d124ee2_1140x641.jpg","publishedAt":"2019-04-20T04:14:46Z","content":"WASHBURN, Maine Two towns in Aroostook County have already experienced road closures from flooding. This week, Aroostook County issued a flood warning for Washburn and Island Falls. \r\n\"Those residents that live near bodies of water should be preparing to eith… [+1353 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Aroostook County Emergency Management and National Weather Service brace for flooding","description":"Flooding has already begun in part of northern Maine. Multiple roads in Washburn remain closed","url":"https://www.newscentermaine.com/article/news/aroostook-county-emergency-management-and-national-weather-service-brace-for-flooding/97-4f742725-517d-4f33-9a92-0a6851e73ec7","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/094b5255-a2ce-4298-8b8f-ae3a3189992b/094b5255-a2ce-4298-8b8f-ae3a3189992b_1140x641.jpg","publishedAt":"2019-04-20T20:05:13Z","content":"CARIBOU, Maine Flood preparations are well underway in northern Maine. Rising water levels in rivers throughout Aroostook County are leaving multiple agencies on high alert. \r\n\"We know our vulnerable communities and we watch those first ,but it doesnt stop us… [+1060 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Conditions hamper Saturday search for Wisconsin man who fell in Kennebec River on Thursday","description":"Jeff Nichols with the Maine Marine Patrol said visibility for searching underneath the water was only four to eight inches.","url":"https://www.newscentermaine.com/article/news/conditions-hamper-saturday-search-for-wisconsin-man-who-fell-in-kennebec-river-on-thursday/97-683fd8a8-9ab7-4368-a814-3d65d9188b2a","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/a848b6d6-1209-4bf1-9191-f3cbc3a62ae9/a848b6d6-1209-4bf1-9191-f3cbc3a62ae9_1140x641.jpg","publishedAt":"2019-04-20T23:55:58Z","content":"BATH, Maine Maine Marine Patrol is still searching for a Wisconsin man who fell into the Kennebec River Thursday night.\r\nWeather and river conditions on Saturday made searching difficult. Jeff Nichols with the Maine Marine Patrol said visibility for searching… [+735 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Fetch ME a Home: Meet Joshua and Shasha","description":"Fetch ME a home features two dogs this week on the Morning Report. Both are available for adoption","url":"https://www.newscentermaine.com/article/news/fetch-me-a-home-meet-joshua-and-shasha/97-856b592f-c69f-49d3-95c0-2e756b457b9b","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/7c81886e-e0cb-4890-933b-e68ea67d551b/7c81886e-e0cb-4890-933b-e68ea67d551b_1140x641.jpg","publishedAt":"2019-04-20T17:25:20Z","content":"PORTLAND, Maine Fetch ME a home features two dogs this week. Joshua, a one-year-old lab mix loves to run and play. New England Lab Rescue says he's completely house trained, loves people, but is sensitive, so a more quiet home without younger kids may suit hi… [+906 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Local firefighter recovering after heart transplant","description":"45-year-old Tim Smith got the call on Tuesday that doctors had a new heart for him. He is now recovering from the 12-hour procedure and faces a long road to recovery.","url":"https://www.newscentermaine.com/article/news/firefighter-recovering-after-heart-transplant/97-c846a229-d5d2-465b-a356-034eaa6e33cd","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/66afd3ab-67e5-480f-ab54-cab2dcc091f8/66afd3ab-67e5-480f-ab54-cab2dcc091f8_1140x641.jpg","publishedAt":"2019-04-20T03:09:35Z","content":"SEBAGO, Maine 45-year-old Tim Smith spent 19 days on a waiting list at Yale-New Haven hospital in Connecticut. \r\nOn Tuesday, he got the call that doctors had a new heart for him. Smith is now recovering from the 12-hour procedure and faces a long road to reco… [+1231 chars]"},{"source":{"id":null,"name":"Newscentermaine.com"},"author":null,"title":"Rain continues this weekend, with increasing flood threat | CORY'S BLOG","description":"Ongoing snow melt and the rain we see Saturday and early Sunday will add to the river flood potential.","url":"https://www.newscentermaine.com/article/weather/weather-blog/rain-continues-this-weekend-with-increasing-flood-threat-corys-blog/97-a1abc382-ae5e-4660-adaf-849ecc29aaa3","urlToImage":"https://media.newscentermaine.com/assets/WCSH/images/0c9a246a-37c2-4b72-8e61-30cc33f3ab85/0c9a246a-37c2-4b72-8e61-30cc33f3ab85_1140x641.png","publishedAt":"2019-04-20T15:25:10Z","content":"We've been talking about this all week, and the weekend is finally here. Rain is also here. The combination of the rain and current snow melt will add to the river flood threat for the remainder of the weekend.\r\nRainfall estimates through late Monday will ran… [+667 chars]"}]}