{"status":"ok","totalResults":135,"articles":[{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Susanna Heller","title":"Nurses are outraged by a state senator who said they 'probably play cards for a considerable amount of the day'","description":"Sen. Maureen Walsh, a Republican from Washington, said in a debate last week that nurses in rural hospitals \"probably play cards for a considerable amount of the day.\" Walsh made the comments during a debate in which she argued against a bill that would preve…","url":"https://www.thisisinsider.com/maureen-walsh-said-nurses-play-cards-all-day-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cbf2b33d2ce78321317a2df-2732-1366.jpg","publishedAt":"2019-04-23T15:10:07Z","content":null},{"source":{"id":null,"name":"Entrepreneur.com"},"author":"Stephanie Schomer","title":"Three Creative Ways to Acquire Your First Customers","description":"Don't know where your all-important first sale is coming from? Take advice from these entrepreneurs and think outside the box.","url":"https://www.entrepreneur.com/slideshow/331243","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190326202856-GettyImages-900872896.jpeg","publishedAt":"2019-04-23T13:00:00Z","content":"April\r\n23, 2019\r\n4 min read\r\nThis story appears in the \r\nApril 2019 \r\nissue of\r\nEntrepreneur. Subscribe »\r\nAcquiring your first customers is a pivotal moment in any entrepreneur's journey -- and it's also a huge challenge. These three entrepreneurs got creati… [+3576 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, USA TODAY","title":"Horseshoe Bend, Sassafras Mountain, trouble in Waikiki: News from around our 50 states","description":"Stolen dog found in Colorado makes way home to Florida two years later, astronaut from Maine gearing up for first space stint, and more","url":"https://www.usatoday.com/list/news/50-states/50-States-042319/a9a88f21-1a9b-4888-b381-74e9f16d6154/","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/08/PPHXS/671b4f67-b82a-4820-8269-3cc32f123d75-f11.jpg","publishedAt":"2019-04-23T06:14:34Z","content":"Two Lower Shore school systems are among five in the state being recognized for their music education programs. The National Association of Music Merchants recently announced that Wicomico County Public Schools and Worcester County Public Schools were being n… [+559 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"I Like Scary Movies Is a Horror Fan's Instagram Dream","description":"The website for the event titled I Like Scary Movie s describes it as “an interactive art installation.” But what does that mean exactly? Since it’s filled with displays paying tribute to films like The Shining, Beetlejuice, A Nightmare on Elm Street, The Los…","url":"https://io9.gizmodo.com/i-like-scary-movies-is-a-horror-fans-instagram-dream-1834249708","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--ShhLz6SR--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bmywmowid6ibsc2kfkub.jpg","publishedAt":"2019-04-24T00:00:00Z","content":"The website for the event titled I Like Scary Movies describes it as an interactive art installation. But what does that mean exactly? Since its filled with displays paying tribute to films like The Shining, Beetlejuice, A Nightmare on Elm Street, The Lost Bo… [+3278 chars]"},{"source":{"id":null,"name":"Sciencedaily.com"},"author":null,"title":"Gulf of Maine seasonal wildlife timing shifts","description":"Many researchers and amateur naturalists track dates for the first robin or pond ice-out; such records offer data on timing of plant and animal life cycle events known as phenology. While such observations are common in terrestrial systems, a new report shows…","url":"https://www.sciencedaily.com/releases/2019/04/190423133444.htm","urlToImage":"https://www.sciencedaily.com/images/2019/04/190423133444_1_540x360.jpg","publishedAt":"2019-04-23T17:34:44Z","content":"Many researchers and amateur naturalists keep track of dates for the first robin of spring, the first peepers or ice-out on ponds, and such records can offer decades of data on the timing of plant and animal life cycle events known as phenology.While such obs… [+4611 chars]"},{"source":{"id":null,"name":"Avclub.com"},"author":"Sam Barsanti on News, shared by Sam Barsanti to The A.V. Club","title":"James Wan and and It writer Gary Dauberman to adapt Stephen King's Salems Lot","description":"The Dark Tower couldn’t stop it and Pet Sematary couldn’t stop it, and so the Stephen King adaptation machine continues unabated, chewing up those thick horror novels you loved in high school and spitting out movies and TV shows that are occasionally good but…","url":"https://news.avclub.com/james-wan-and-and-it-writer-gary-dauberman-to-adapt-ste-1834255202","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/s--4c2LYPjr--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/atskujhesixrw0lljp6b.jpg","publishedAt":"2019-04-23T22:36:00Z","content":"The Dark Tower couldnt stop it and Pet Sematarycouldnt stop it, and so the Stephen King adaptation machine continues unabated, chewing up those thick horror novels you loved in high school and spitting out movies and TV shows that are occasionally good but of… [+1222 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Michele Debczak","title":"Airbnb Shares Its Best Literary Getaways to Celebrate World Book Day","description":"On April 23, World Book Day, travelers can find special deals on Airbnb homes reminiscent of 'Pride and Prejudice,' 'The Great Gatsby,' and more books.","url":"http://mentalfloss.com/article/581113/airbnb-literary-themed-getaways","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_3068,w_5458,x_0,y_285/v1556028550/shape/mentalfloss/istock-951676964.jpg?itok=zbj0_rps","publishedAt":"2019-04-23T15:00:00Z","content":"April 23 is a special date for book lovers: It marks World Book Day, a holiday dedicated to authors, illustrators, and readers. To celebrate the event, Airbnb is offering deals on homes that look like they were ripped from the pages of a classic novel.\r\nThrou… [+1091 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Chris Evangelista","title":"‘Salem’s Lot’ Movie Coming From James Wan and Gary Dauberman","description":"The Stephen King adaptation renaissance continues, as James Wan and Gary Dauberman plan a visit to ‘Salem’s Lot. Based on King’s second novel, ‘Salem’s Lot follows a small Maine town that quickly becomes overrun by vampires. The book was adapted twice before …","url":"https://www.slashfilm.com/salems-lot-movie/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/salems-lot-movie.jpg","publishedAt":"2019-04-23T22:16:03Z","content":"The Stephen King adaptation renaissance continues, as James Wan and Gary Dauberman plan a visit to ‘Salem’s Lot. Based on King’s second novel, ‘Salem’s Lot follows a small Maine town that quickly becomes overrun by vampires. The book was adapted twice before … [+2147 chars]"},{"source":{"id":null,"name":"Thepointsguy.com"},"author":"Laura Itzkowitz","title":"Book These Gorgeous, Literary-Inspired Airbnbs for Just $17 a Night","description":"To celebrate World Book Day on Tuesday, Airbnb is offering stays at 10 literary homes for just $17 — the average price of a book. The properties range from a barn house in Maine reminiscent of “Charlotte’s Web” to a historic one-bedroom home in Edinburgh swat…","url":"http://thepointsguy.com/news/world-book-day-airbnb-deals/","urlToImage":"https://i1.wp.com/thepointsguy.com/wp-content/uploads/2019/04/The-Great-Gatsby.jpg?fit=1440%2C960px&ssl=1","publishedAt":"2019-04-23T00:00:47Z","content":"To celebrate World Book Day on Tuesday, Airbnb is offering stays at 10 literary homes for just $17 the average price of a book. The properties range from a barn house in Maine reminiscent of “Charlotte’s Web” to a historic one-bedroom home in Edinburgh swathe… [+4568 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"KAREN ZRAICK and EMILY S. RUEB","title":"Walgreens Raises Tobacco-Buying Age to 21, Strengthening a Consensus","description":"In raising the minimum age to purchase tobacco products at its stores, the drugstore chain joined other retailers and lawmakers seeking to curb teenagers’ use.","url":"https://www.nytimes.com/2019/04/23/business/walgreens-tobacco.html","urlToImage":"https://static01.nyt.com/images/2019/04/23/business/23xp-smoking/23xp-smoking-facebookJumbo.jpg","publishedAt":"2019-04-23T22:40:49Z","content":"Health officials say the habits formed during adolescence can persist for decades, and there is concern that vaping could lead to smoking cigarettes.\r\nAccording to the 2017 National Survey on Drug Use and Health, almost all adult smokers begin smoking before … [+1332 chars]"},{"source":{"id":null,"name":"Baltimoresun.com"},"author":"Luke Broadwater","title":"GOP Gov 'Seriously Considering' Primary Against 'Dear Leader'...","description":"GOP Gov 'Seriously Considering' Primary Against 'Dear Leader'... (First column, 15th story, link ) Related stories: HILLARY: TRUMP SHOULD HAVE BEEN INDICTED! PELOSI: KEEP DIGGING... LEADERSHIP BALKS ON IMPEACHMENT... GEORGE CONWAY: Case better than Nixon's...…","url":"https://www.baltimoresun.com/news/maryland/politics/bs-md-hogan-presidential-potential-20190423-story.html","urlToImage":"https://www.trbimg.com/img-5cbf7864/turbine/bs-md-hogan-presidential-potential-20190423","publishedAt":"2019-04-23T21:19:48Z","content":"MANCHESTER, N.H. As he seriously considers a run for president, Maryland Gov. Larry Hogan criticized President Donald Trump on Tuesday over the findings of the Mueller investigation calling its report disturbing and saying Trump narrowly avoided being charged… [+5261 chars]"},{"source":{"id":null,"name":"Fivethirtyeight.com"},"author":"Perry Bacon Jr., Perry Bacon Jr. https://fivethirtyeight.com/contributors/perry-bacon-jr/ perry.bacon@fivethirtyeight.com","title":"How Major Democratic And Republican Blocs Are Responding To The Mueller Report","description":"The Mueller report, released in full on Thursday, has complicated the politics of the broader Trump-Russia story for both Democrats and Republicans. Congressional Democrats are facing an obvious question: What should they do now? Before the report’s release, …","url":"https://fivethirtyeight.com/features/how-major-democratic-and-republican-blocs-are-responding-to-the-mueller-report/","urlToImage":"https://fivethirtyeight.com/wp-content/uploads/2019/04/MUELLER-WINGS-16x9.png?w=1600","publishedAt":"2019-04-23T09:55:31Z","content":"The Mueller report, released in full on Thursday, has complicated the politics of the broader Trump-Russia story for both Democrats and Republicans.\r\nCongressional Democrats are facing an obvious question: What should they do now? Before the reports release, … [+8270 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"Sampad Patnaik","title":"PM Modi to Naveen Patnaik: Wanted you to get a spectacular farewell, now you cannot be saved","description":"Union Minister Dharmendra Pradhan released a video, claiming the alleged attacks against party workers indicate the CM is worried about an impending loss in 2019. Pradhan promised to bring a “Goonda Act” in Odisha if the BJP comes to power.","url":"https://indianexpress.com/elections/pm-modi-to-naveen-patnaik-wanted-you-to-get-a-spectacular-farewell-now-you-cannot-be-saved-odisha-lok-sabha-elections-5690278/","urlToImage":"https://images.indianexpress.com/2019/04/modi-28.jpg?w=759","publishedAt":"2019-04-23T08:15:41Z","content":"Prime Minister Narendra Modi (File Photo)\r\nPrime Minister Narendra Modi in a rally in Kendrapara on Tuesday took off the gloves against Odisha Chief Minister Naveen Patnaik and said he cannot be saved after violence against BJP workers in the run up to the th… [+3227 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"PTI","title":"Bhopal: Day after Sadhvi Pragya Thakur FIR, BJP MP files papers as ‘dummy’","description":"Thakur, an accused in the 2008 Malegaon bomb blast case, had boasted about her role in the demolition of the 16th-century structure, inviting a show-cause notice from the Election Commission (EC), which also directed the police Monday to file an FIR against h…","url":"https://indianexpress.com/elections/bhopal-sadhvi-fir-bjp-mp-sanjar-files-papers-dummy-lok-sabha-elections-5691106/","urlToImage":"https://images.indianexpress.com/2019/04/sanjar-759.jpg?w=759","publishedAt":"2019-04-23T15:25:26Z","content":"Sadhvi Pragya Singh Thakur with BJP sitting MP from Bhopal Alok Sanjar. (PTI Photo)\r\nOutgoing Bhopal MP Alok Sanjar Tuesday filed his nomination as a ‘dummy’ candidate from the seat, a day after police registered an FIR against party’s official nominee Sadhvi… [+3082 chars]"},{"source":{"id":null,"name":"Gq.com"},"author":"Jay Willis","title":"Mitch McConnell Is Gearing Up for an All-Out War on Socialism in 2020","description":"Mitch McConnell vowed to serve as the \"Grim Reaper\" of socialist policies if a Democrat indeed takes the White House in 2020.","url":"https://www.gq.com/story/mitch-mcconnell-grim-reaper","urlToImage":"https://media.gq.com/photos/5cbf44b13dc88d1404e22ad1/16:9/w_1280,c_limit/Mitch-McConnell-Against-Democratic-Socialism-GQ-2019-042319.jpg","publishedAt":"2019-04-23T19:56:24Z","content":"As 2020 Democratic candidates debate the merits of Medicare for All, a Green New Deal, free college, and other ambitious progressive policies, Senate majority leader Mitch McConnell is happily preparing to play the role of spoiler should one of them win the W… [+4703 chars]"},{"source":{"id":null,"name":"Theparisreview.org"},"author":"Elisa Gabbert","title":"The Stupid Classics Book Club","description":"The project of this book club would be to read all the corny stuff from the canon that we really should have read in school but never had.","url":"https://www.theparisreview.org/blog/2019/04/23/the-stupid-classics-book-club/","urlToImage":"https://www.theparisreview.org/blog/wp-content/uploads/2019/04/book-club-1972-post-image.jpg","publishedAt":"2019-04-23T13:00:15Z","content":"In Elisa Gabberts column Mess with a Classic, she revisits canonical works of literature and addresses the anxiety of confronting the art of the past (and the past in general).\r\nVintage advertisement from 1972\r\nLast fall, at a party, my husband and I and two … [+17153 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Andrew DePietro, Contributor, Andrew DePietro, Contributor https://www.forbes.com/sites/andrewdepietro/","title":"Here's How Much Money Graphic Designers Earn In Every State","description":"Find out where you can earn the most money as a graphic designer in the United States.","url":"https://www.forbes.com/sites/andrewdepietro/2019/04/23/graphic-designer-salary-state/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_5036%2Fpt_5036_585_o.jpg%3Ft%3D1556000109","publishedAt":"2019-04-23T06:15:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nGraphic designers earn slightly more than the U.S. average wage for all occupations.\r\nGetty\r\nWith the explosion of the internet and digital revolution in general, the career of a graphic designer has bee… [+8680 chars]"},{"source":{"id":null,"name":"Washingtonexaminer.com"},"author":"https://www.washingtonexaminer.com/author/emily-larsen","title":"Bernie Sanders says Boston bomber should be able to vote from prison - Washington Examiner","description":"Bernie Sanders says Boston bomber should be able to vote from prison Washington Examiner Sanders: Boston Marathon bomber should be able to vote from prison | TheHill The Hill Bernie Sanders says Boston Marathon bomber, sexual assaulters should be allowed to v…","url":"https://www.washingtonexaminer.com/news/bernie-sanders-says-boston-bomber-should-be-able-to-vote-from-prison","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/105c288/2147483647/strip/true/crop/2277x1196+2+27/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F28%2F43%2Fc3a35fad48dc857b1392a7ad20f0%2Fap-18332030759554.jpg","publishedAt":"2019-04-23T02:17:00Z","content":"Sen. Bernie Sanders, I-Vt., said on Monday that \"terrible people\" such as the Boston Marathon bomber and felons convicted of sexual assault should be allowed to vote. \r\nAt a CNN town hall in New Hampshire, a Harvard junior asked Sanders if he supports voting … [+1933 chars]"},{"source":{"id":null,"name":"Sunjournal.com"},"author":null,"title":"Chamber Business After Hours event May 16 - Lewiston Sun Journal","description":"POLAND — The Lewiston Auburn Metropolitan Chamber of Commerce and Uplift LA will present Business After Hours from 5 to 6:30 p.m. Thursday, May 16, at the Maine State Building at Poland Spring Resort. Catering will be by Poland Spring Resort. The Maine State …","url":"https://www.sunjournal.com/2019/04/23/chamber-business-after-hours-event-may-16/","urlToImage":"https://multifiles.pressherald.com/uploads/sites/10/2019/04/LA-Chamber-logo.jpg","publishedAt":"2019-04-23T23:54:00Z","content":"POLAND The Lewiston Auburn Metropolitan Chamber of Commerce and Uplift LA will present Business After Hours from 5 to 6:30 p.m. Thursday, May 16, at the Maine State Building at Poland Spring Resort. Catering will be by Poland Spring Resort.\r\nThe Maine State B… [+986 chars]"},{"source":{"id":null,"name":"Sunjournal.com"},"author":null,"title":"Tourism 101: How to ready L-A for more business - Lewiston Sun Journal","description":"Tourism 101: How to ready L-A for more business Lewiston Sun Journal AUBURN — Visitors in 2017 spent $670 million in the Lakes and Mountains tourism region, which includes the Twin Cities. The message Monday: Let's not stop...","url":"https://www.sunjournal.com/2019/04/22/tourism-101-how-to-ready-l-a-for-more-business/","urlToImage":"https://multifiles.pressherald.com/uploads/sites/10/2019/04/4504214_SJ.BIZtourismP.042219-1-1024x744.jpg","publishedAt":"2019-04-23T00:00:00Z","content":"U.S. Rep. Jared Golden of Lewiston speaks Monday afternoon to attendees at the Tourism 101 forum held at Central Maine Community College in Auburn. Sun Journal photo by Andree Kehn\r\nAUBURN Visitors in 2017 spent $670 million in the Lakes and Mountains tourism… [+3243 chars]"},{"source":{"id":null,"name":"Contemporaryartdaily.com"},"author":"Contemporary Art Daily","title":"Michael Queenland at Maureen Paley","description":"Artist: Michael Queenland Venue: Maureen Paley, London Date: April 6 – May 26, 2019 Click here to view slideshow Full gallery of images, press release, and link available after the jump. Images: Images courtesy of Maureen Paley, London Press Release: Maureen …","url":"http://www.contemporaryartdaily.com/2019/04/michael-queenland-at-maureen-paley/","urlToImage":null,"publishedAt":"2019-04-23T12:15:00Z","content":"Artist: Michael Queenland\r\nVenue: Maureen Paley, London\r\nDate: April 6 May 26, 2019\r\nClick here to view slideshow\r\nFull gallery of images, press release, and link available after the jump.\r\nImages:\r\nImages courtesy of Maureen Paley, London\r\nPress Release:\r\nMa… [+2709 chars]"},{"source":{"id":null,"name":"Thejournal.com"},"author":null,"title":"Helping Parents Learn Tech Too - T.H.E. Journal","description":"Helping Parents Learn Tech Too T.H.E. Journal Every month this 1-to-1 district in Texas hosts parents in a \"technology academy\" to help them understand the digital world their students inhabit.","url":"https://thejournal.com/articles/2019/04/23/helping-parents-learn-tech-too.aspx","urlToImage":"https://thejournal.com/~/media/EDU/THEJournal/2019%20Images%20Editorial/20190423Parent_academy_teaser.JPG","publishedAt":"2019-04-23T17:51:19Z","content":"Digital Citizenship\r\nHelping Parents Learn Tech Too\r\nEvery month this 1-to-1 district in Texas hosts parents in a \"technology academy\" to help them understand the digital world their students inhabit.\r\n The idea of schools holding sessions with parents to exp… [+3068 chars]"},{"source":{"id":null,"name":"Johnaugust.com"},"author":"Megana Rao","title":"Scriptnotes, 397: Big Numbers Transcript","description":"The original post for this episode can be found here. John August: Hello and welcome. My name is John August. Craig Mazin: Hi, my name is Craig Mazin. John: And this is Episode 396 of Scriptnotes, a podcast about screenwriting and things that are interesting …","url":"https://johnaugust.com/2019/scriptnotes-397-big-numbers-transcript","urlToImage":null,"publishedAt":"2019-04-23T23:00:19Z","content":"The original post for this episode can be found here.\r\nJohn August: Hello and welcome. My name is John August.\r\nCraig Mazin: Hi, my name is Craig Mazin.\r\nJohn: And this is Episode 396 of Scriptnotes, a podcast about screenwriting and things that are interesti… [+42232 chars]"},{"source":{"id":null,"name":"Matadornetwork.com"},"author":"Tim Wenger","title":"Best certified US Neapolitan pizzas","description":"Is your favorite pie authentic? The post The 7 best certified Neapolitan pizzerias in the US appeared first on Matador Network.","url":"https://matadornetwork.com/read/certified-neapolitan-pizzerias-us/","urlToImage":"https://s3.amazonaws.com/cdn.matadornetwork.com/blogs/1/2019/04/Neapolitan-pizza-in-a-wood-stove-1200x853.jpg","publishedAt":"2019-04-23T23:30:00Z","content":"Italians take their pizza quite seriously, and nowhere in Italy takes it more seriously than the city of Naples. This is a major surprise to absolutely no one, but what you might not know — unless you’re fortunate enough to spend your working hours stirring s… [+8212 chars]"},{"source":{"id":null,"name":"Aol.com"},"author":"Tatiana Pile","title":"IRS faces Tuesday deadline to hand over Trump's tax returns - AOL","description":"IRS faces Tuesday deadline to hand over Trump's tax returns AOL IRS faces a second deadline to release Trump tax returns to Democrats CNN Team Trump Scoffs at Tax Return Deadline, Dares Dems to Take Legal Action: 'Let Them Knock Themselves Out' The Daily Beas…","url":"https://www.aol.com/article/finance/2019/04/23/irs-faces-tuesday-deadline-to-hand-over-trumps-tax-returns/23715971/","urlToImage":"https://o.aolcdn.com/images/dims3/GLOB/crop/3384x2218+0+33/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-04%2F0db690c0-6351-11e9-af7f-172ac7c7b3a2","publishedAt":"2019-04-23T15:04:14Z","content":"Tuesday is the deadline for the IRS to hand over President Donald Trump's tax returns to the House Ways and Means Committee.\r\nThe panel wants the president's personal tax returns from the last six years and tax returns from eight of his businesses. It initial… [+2942 chars]"},{"source":{"id":null,"name":"Bookriot.com"},"author":"Kelly Jensen","title":"Book Your Dream Literary Escape Today For $17 Through Airbnb","description":"In honor of World Book Day 2019, Airbnb announced a sweet deal for book lovers: you can book a dream literary escape to one of several bookish places for a mere $17 (plus taxes and fees). Ten hosts ha","url":"https://bookriot.com/2019/04/23/airbnb-world-book-day-deal/","urlToImage":"https://s2982.pcdn.co/wp-content/uploads/2019/04/outlander-1.jpg","publishedAt":"2019-04-23T13:53:11Z","content":"In honor of World Book Day 2019, Airbnb announced a sweet deal for book lovers: you can book a dream literary escape to one of several bookish places for a mere $17 (plus taxes and fees). Ten hosts have offered up the deal, with stays available May, June, and… [+2648 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Sam Lovett, Sam Lovett","title":"Manchester United vs Manchester City: The best derbies from the Premier League era","description":"We look back on some of the most notable and thrilling derby encounters from the Premier League era","url":"https://www.independent.co.uk/sport/football/premier-league/manchester-united-vs-manchester-city-best-derbies-derby-premier-league-era-a8882371.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/23/11/rooney.jpg","publishedAt":"2019-04-23T09:46:00Z","content":"Its been quite a while since a Manchester derby held as much significance as tomorrow evenings clash at Old Trafford.\r\nCompared to last years April encounter which saw United merely delay City's eventual coronation as Premier League champions the outcome of W… [+6439 chars]"},{"source":{"id":null,"name":"Hellogiggles.com"},"author":"Elizabeth Entenman","title":"Rent one of these literary-inspired houses on Airbnb for less than the cost of a new book","description":"Tuesday, April 23rd is World Book Day. It’s a holiday organized by the United Nations Educational, Scientific, and Cultural Organization (UNESCO) dedicated to promoting reading, publishing, and copyright. Basically, it’s the perfect day to cancel your plans a…","url":"https://hellogiggles.com/lifestyle/airbnb-world-book-day-2019/","urlToImage":"https://images.hellogiggles.com/uploads/2019/04/22141545/world-book-day-airbnb.png","publishedAt":"2019-04-23T13:29:24Z","content":null},{"source":{"id":null,"name":"Hiphopdx.com"},"author":"Justin Ivey","title":"#DXCLUSIVE: Marcel P. Black Condemns Donald Trump In \"Hallelujah\" Video","description":"The visuals were shot in Charlottesville, Virginia.","url":"https://hiphopdx.com/news/id.51134/title.dxclusive-marcel-p-black-condemns-donald-trump-in-hallelujah-video","urlToImage":"https://static.hiphopdx.com/2019/03/190320-marcel-p-black.jpg","publishedAt":"2019-04-23T07:00:58Z","content":"Marcel P. Black has revisited hisSevenEP to provide some visuals for the standout track “Hallelujah.” The politically-charged video utilizes imagery from the infamous Unite The Right rally in Charlottesville, Virginia, and denounces Donald Trump.\r\n“I released… [+640 chars]"},{"source":{"id":null,"name":"Moneycontrol.com"},"author":null,"title":"FIR filed against Sadhvi Pragya for Babri Masjid remark","description":"The EC Saturday had issued a show-cause notice to Thakur, an accused in the 2008 Malegaon bomb blast accused currently out on bail, over her remark made during an interview to a news channel.","url":"https://www.moneycontrol.com/news/india/fir-filed-against-sadhvi-pragya-for-babri-masjid-remark-3872301.html","urlToImage":"https://static-news.moneycontrol.com/static-mcnews/2019/04/sadhvi-pragya-singh-thakur-770x433.jpg","publishedAt":"2019-04-23T02:29:05Z","content":"Acting on orders of the Election Commission, the police filed an FIR against BJP Lok Sabha candidate from Bhopal Sadhvi Pragya Singh Thakur for her remark that she was \"proud\" of her participation in demolition of the Babri Masjid at Ayodhya in 1992, an offic… [+3040 chars]"},{"source":{"id":null,"name":"Livejournal.com"},"author":"sweet_heloise","title":"'The View' Round-Up: Felons Voting, Female Candidates, Real Housewives' Feminism, and More","description":"SANDERS FAVORS FELONS’ RIGHT TO VOTE: When asked during a town hall whether felons should have the right to vote even while incarcerated, Sen. Bernie Sanders said he believes “every single person does have the right to vote” — the co-hosts weigh in. https://t…","url":"https://ohnotheydidnt.livejournal.com/114576236.html","urlToImage":"https://l-files.livejournal.net/og_image/3616053/447563?v=1556051399","publishedAt":"2019-04-23T20:29:58Z","content":"SANDERS FAVORS FELONS RIGHT TO VOTE: When asked during a town hall whether felons should have the right to vote even while incarcerated, Sen. Bernie Sanders said he believes every single person does have the right to vote the co-hosts weigh in. https://t.co/f… [+2600 chars]"},{"source":{"id":null,"name":"Livejournal.com"},"author":"scriptedending","title":"First Look at 'The Lighthouse'","description":"Here’s a first look at Robert Pattinson and Willem Dafoe in Robert Eggers’ fantasy horror The Lighthouse, shot on 35mm black-and-white stock using equipment from the 1920s and ’40s pic.twitter.com/kUr7Ml5rJR — Little White Lies (@LWLies) April 23, 2019 The Li…","url":"https://ohnotheydidnt.livejournal.com/114573779.html","urlToImage":"https://l-files.livejournal.net/og_image/3616053/447553?v=1556033578","publishedAt":"2019-04-23T15:32:56Z","content":"Here’s a first look at Robert Pattinson and Willem Dafoe in Robert Eggers’ fantasy horror The Lighthouse, shot on 35mm black-and-white stock using equipment from the 1920s and ’40s pic.twitter.com/kUr7Ml5rJR\r\n— Little White Lies (@LWLies) April 23, 2019"},{"source":{"id":null,"name":"Johnnyjet.com"},"author":"Georgie Jet","title":"The 13 Best Things I Did in Nova Scotia en Route to Cape Breton","description":"Apr 23, 2019 The comments on this page are not provided, reviewed, or otherwise approved by the bank advertiser. It is not the bank advertiser's responsibility to ensure all posts...","url":"https://www.johnnyjet.com/13-best-things-to-do-in-nova-scotia/","urlToImage":null,"publishedAt":"2019-04-23T13:00:15Z","content":"On the MV Fundy Rose from Digby, Nova Scotia, to New Brunswick, Maine\r\nLast September, I enjoyed the best solo road trip of my life on the roads of Cape Breton in Nova Scotia. I wrote about it in two posts:\r\nThere’s more to Nova Scotia than just Cape Breton, … [+7891 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Proposal would require Maine students learn about Holocaust","description":"AUGUSTA, Maine (AP) — Maine lawmakers are considering a bill designed to require students to learn about the Holocaust. Democratic Sen. Louie Luchini of Ellsworth introduced the bill, which received a public hearing before a legislative committee Monday. Luch…","url":"https://www.seattletimes.com/nation-world/nation/proposal-would-require-maine-students-learn-about-holocaust/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-23T17:26:52Z","content":"AUGUSTA, Maine (AP) Maine lawmakers are considering a bill designed to require students to learn about the Holocaust.\r\nDemocratic Sen. Louie Luchini of Ellsworth introduced the bill, which received a public hearing before a legislative committee Monday. Luchi… [+629 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Maine bill to boost lowest-in-US governor’s pay gets tabled","description":"AUGUSTA, Maine (AP) — Lawmakers have tabled the latest bill to boost the lowest-in-the-nation salary for Maine’s next governor. The bill would boost the annual salary from $70,000 to $150,000 beginning January 2023. The Legislature’s state and local governmen…","url":"https://www.seattletimes.com/nation-world/nation/maine-bill-to-boost-lowest-in-us-governors-pay-gets-tabled/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-23T20:12:49Z","content":"AUGUSTA, Maine (AP) Lawmakers have tabled the latest bill to boost the lowest-in-the-nation salary for Maine’s next governor.\r\nThe bill would boost the annual salary from $70,000 to $150,000 beginning January 2023. The Legislature’s state and local government… [+622 chars]"},{"source":{"id":null,"name":"Securityweekly.com"},"author":"Security Weekly Productions","title":"Shopify, Intezer, & Weaponized Vuln. – Hack Naked News #215","description":"This week, a weather channel that was knocked off air by a malicious attack, how bad bots make up 20 percent of web traffic, ransomware ravages municipalities nationwide, a flaw in Shopify API exposed revenue and traffic data of thousands of stores, and how a…","url":"https://securityweekly.com/2019/04/23/shopify-intezer-weaponized-vuln-hack-naked-news-215/","urlToImage":"https://securityweekly.com/wp-content/uploads/2019/04/Shopify-Intezer-Weaponized-Vuln.-Hack-Naked-News-215__Image.jpeg","publishedAt":"2019-04-23T19:15:43Z","content":"Hack Naked News\r\nSecurity Weekly Productions215, API, attack news, Hack Naked, Hack Naked News, HNN, interview, Intezer, Itai Tevet, malicious news, News, security news, Shopify, Weaponized VulnApril 23, 2019\r\nThis week, a weather channel that was knocked off… [+7174 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":null,"title":"Pot proposal would put Mainers first in line for licenses","description":"Maine’s proposed rules about the sale of marijuana for recreational use would for the first two years limit licenses to residents of the state.","url":"https://www.bostonglobe.com/news/marijuana/2019/04/23/pot-proposal-would-put-mainers-first-line-for-licenses/DWKUFOCgEd4edou8ucvKUK/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/23/BostonGlobe.com/Metro/Images/AFP_1FV3N5.jpg","publishedAt":"2019-04-23T16:10:24Z","content":"PORTLAND, Maine — Maine’s proposed rules about the sale of marijuana for recreational use would for the first two years limit licenses to residents of the state.\r\nThe state released its long-awaited draft rules about the recreational marijuana program late Mo… [+572 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":null,"title":"Lottery","description":"Lottery results from Monday drawings","url":"https://www.bostonglobe.com/metro/2019/04/22/lottery/r8nyZBZJYy2lOLcA5NxmoJ/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-23T00:41:54Z","content":"MONDAY MIDDAY\r\n2256\r\nPayoffs (based on a $1 bet)\r\nEXACT ORDER\r\nAll 4 digits\r\n$5,113\r\nFirst or last 3\r\n$716\r\nAny 2 digits\r\n$61\r\nGet Metro Headlines in your inbox:\r\nThe 10 top local news stories from metro Boston and around New England delivered daily.\r\nAny 1 d… [+643 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Kari Bodnarchuk","title":"Here, there, and everywhere","description":"Travel news you can use.","url":"https://www.bostonglobe.com/lifestyle/travel/2019/04/23/here-there-and-everywhere/Vhn4qz9DMNoY0klODp3uNK/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/22/BostonGlobe.com/Travel/Images/28hte_1.jpg","publishedAt":"2019-04-23T21:12:42Z","content":"HERE\r\nCelebrate spring at Boston festival\r\nLearn about beekeeping, meet baby chicks, gather tips on planting vegetables, and more at the second annual Agricultural Festival at Boston Public Market, April 28, 10 a.m. to 4 p.m. This free event takes place throu… [+4603 chars]"},{"source":{"id":"cnbc","name":"CNBC"},"author":"Berkeley Lovelace Jr.","title":"Pharma distributor Rochester Drug Cooperative agrees to pay $20 million in first criminal opioid case","description":"The indictment marked the first ever federal criminal charges against company executives for conspiring to illegally distribute opioids.","url":"https://www.cnbc.com/2019/04/23/rochester-drug-cooperative-to-pay-20-million-in-opioid-case.html","urlToImage":"https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/06/103768748-GettyImages-507827681.1910x1000.jpg","publishedAt":"2019-04-23T18:42:37Z","content":"Rochester Drug Cooperative, one of the nation's largest drug distributors, has agreed to pay the federal government $20 million to settle civil and criminal claims it helped fuel the U.S. opioid epidemic, the company announced Tuesday.\r\ndiv &gt; div.group &gt… [+3014 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Stewart’s Ambulance Service/Transformative Healthcare Expands into 4 Maine and N.H. Seacoast Communities","description":"MEREDITH, N.H.--(BUSINESS WIRE)--Stewart's Ambulance Service and parent company Transformative Healthcare are expanding in Maine and N.H. with four new municipal 911 EMS contracts.","url":"https://www.businesswire.com/news/home/20190423005186/en/Stewart%E2%80%99s-Ambulance-ServiceTransformative-Healthcare-Expands-4-Maine","urlToImage":"https://mms.businesswire.com/media/20190423005186/en/717505/23/Stewart%27s_Logo.jpg","publishedAt":"2019-04-23T10:56:39Z","content":"MEREDITH, N.H.--(BUSINESS WIRE)--Stewarts Ambulance Service is expanding into four Maine and New \r\n Hampshire Seacoast communities through new contracts to provide \r\n municipal 911 Emergency Medical Services (EMS) for Berwick, Eliot, and \r\n Kittery, Maine, an… [+3004 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"WEX Inc. to Release First Quarter Financial Results on May 2, 2019","description":"SOUTH PORTLAND, Maine--(BUSINESS WIRE)--WEX Inc. (NYSE: WEX), a leading financial technology service provider, announced today that it will report its first quarter 2019 financial results before the market open on May 2. From WEX, Melissa Smith, the Chief Exe…","url":"https://www.businesswire.com/news/home/20190423005241/en/WEX-Release-Quarter-Financial-Results-2-2019","urlToImage":"http://www.businesswire.com/images/bwlogo_square.png","publishedAt":"2019-04-23T10:38:51Z","content":"SOUTH PORTLAND, Maine--(BUSINESS WIRE)--WEX \r\n Inc. (NYSE: WEX), a leading financial technology service provider, \r\n announced today that it will report its first quarter 2019 financial \r\n results before the market open on May 2. From WEX, Melissa Smith, the … [+1322 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"TEGNA Wins 91 Regional Edward R. Murrow Awards, More Than Any Other Media Company","description":"TYSONS, Va.--(BUSINESS WIRE)--TEGNA won 91 Regional Edward R. Murrow awards, the most in the company's history and more than any other media company.","url":"https://www.businesswire.com/news/home/20190423005863/en/TEGNA-Wins-91-Regional-Edward-R.-Murrow","urlToImage":"https://mms.businesswire.com/media/20190423005863/en/474552/23/TEGNA_Logo.jpg","publishedAt":"2019-04-23T19:06:01Z","content":"TYSONS, Va.--(BUSINESS WIRE)--TEGNA Inc. (NYSE: TGNA) today won 91 Regional Edward R. Murrow Awards, \r\n the most in the companys history and more than any other media company \r\n this year. TEGNA won five awards for overall excellence, the highest \r\n honor awa… [+3362 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Care New England Hospitals Install 10 Carestream Digital X-ray Systems","description":"ROCHESTER, N.Y.--(BUSINESS WIRE)--lt;a href=&quot;https://twitter.com/hashtag/DR?src=hash&quot; target=&quot;_blank&quot;gt;#DRlt;/agt;--Care New England hospitals install a CARESTREAM DRX-Ascend, three CARESTREAM DRX-Revolution Mobile X-ray Systems and six C…","url":"https://www.businesswire.com/news/home/20190423005168/en/Care-New-England-Hospitals-Install-10-Carestream","urlToImage":"https://mms.businesswire.com/media/20190423005168/en/717476/23/Care_New_England_image_WomenInfantsExterior.jpg","publishedAt":"2019-04-23T12:41:40Z","content":"ROCHESTER, N.Y.--(BUSINESS WIRE)--Care New England Health System (Providence, R.I.) installed a CARESTREAM \r\n DRX-Ascend System (see \r\n video link), three CARESTREAM \r\n DRX-Revolution Mobile X-ray Systems and six CARESTREAM DRX-1 Systems \r\n to upgrade existin… [+4175 chars]"},{"source":{"id":null,"name":"Redstate.com"},"author":"Sister Toldjah","title":"WATCH: Kamala Harris and Bernie Sanders Give Extreme Answers on Voting Rights for Boston Marathon Bomber","description":"Can we get Elizabeth Warren's answer on this, too, please? The post WATCH: Kamala Harris and Bernie Sanders Give Extreme Answers on Voting Rights for Boston Marathon Bomber appeared first on RedState.","url":"https://www.redstate.com/sister-toldjah/2019/04/23/watch-kamala-harris-bernie-sanders-give-extreme-answers-voting-rights-boston-marathon-bomber/","urlToImage":"https://www.redstate.com/wp-content/uploads/2019/04/KamalaHarrisCNNtownhall.jpg","publishedAt":"2019-04-23T14:30:50Z","content":"Screen grab: Sen. Kamala Harris (D-CA) is questioned by Don Lemon at a CNN town hall – 4/22/19.\r\nCNN held a series of town halls last night in New Hampshire with several of the Democratic candidates for president, and two question/answer segments have got peo… [+4182 chars]"},{"source":{"id":null,"name":"Truthout.org"},"author":"candice","title":"Maine AFL-CIO Is First to Support a State-Level Green New Deal Bill","description":"Maine lawmakers will hold a hearing today on a new climate and jobs bill. The post Maine AFL-CIO Is First to Support a State-Level Green New Deal Bill appeared first on Truthout.","url":"https://truthout.org/articles/maine-afl-cio-is-first-to-support-a-state-level-green-new-deal-bill/","urlToImage":"https://truthout.org/wp-content/uploads/2019/04/2019_0423-maine-wind-turbine-1200x800.jpg","publishedAt":"2019-04-23T13:52:26Z","content":"Maine lawmakers will hold a hearing today for “An Act to Establish a Green New Deal for Maine” — a new climate and jobs bill that has the notable support of Maine’s AFL-CIO, the first state labor federation to endorse a Green New Deal-themed piece of legislat… [+7981 chars]"},{"source":{"id":null,"name":"Truthout.org"},"author":"Merula Furtado","title":"Explosion of Interest in Worker Cooperatives Drives Economic Changes","description":"The movement for democratic worker-ownership has been steadily growing since the 2008 financial crisis. The post Explosion of Interest in Worker Cooperatives Drives Economic Changes appeared first on Truthout.","url":"https://truthout.org/articles/explosion-of-interest-in-worker-cooperatives-drives-economic-changes/","urlToImage":"https://truthout.org/wp-content/uploads/2019/04/2019_0421-co-ops-2.jpg","publishedAt":"2019-04-23T15:20:44Z","content":"It’s been more than 10 years since the financial crisis of 2008, and working people are still being hammered by its effects — stagnating wages, a widening gap between the rich and the poor, and a rise in the sharing economy to meet basic needs. At the same ti… [+12215 chars]"},{"source":{"id":null,"name":"Norml.org"},"author":"Paul Armentano, NORML Deputy Director","title":"Maine: Regulators Moving Forward With Rules to Govern Retail Marijuana Sales","description":"After multiple delays, regulators are finally moving forward with draft regulations to implement the state's 2016 voter-approved initiative legalizing the commercial production and retail sale of marijuana.","url":"https://blog.norml.org/2019/04/23/maine-regulators-moving-forward-with-rules-to-govern-retail-marijuana-sales/","urlToImage":"https://blog.norml.org/wp-content/uploads/2018/06/logo-norml-900x470.png","publishedAt":"2019-04-23T17:30:52Z","content":"Maine: Regulators Moving Forward With Rules to Govern Retail Marijuana Sales\r\nby Paul Armentano, NORML Deputy DirectorApril 23, 2019\r\nAfter multiple delays, regulators are finally moving forward with draft regulations to implement the state’s 2016 voter-appro… [+1252 chars]"},{"source":{"id":null,"name":"2600.com"},"author":"Emmanuel Goldstein","title":"SHORTWAVE VERSION OF \"OFF THE HOOK\" POSTED","description":"We just uncovered an old tape that was lying around which contains a bit of a treasure. (Thanks to listener Brandon from Cincinnati who sent this to us over ten years ago.) Back in 2008, our weekly radio show was also broadcast on shortwave station WBCQ in Mo…","url":"https://www.2600.com/content/shortwave-version-hook-posted","urlToImage":null,"publishedAt":"2019-04-23T18:58:20Z","content":"We just uncovered an old tape that was lying around which contains a bit of a treasure. (Thanks to listener Brandon from Cincinnati who sent this to us over ten years ago.) Back in 2008, our weekly radio show was also broadcast on shortwave station WBCQ in Mo… [+282 chars]"},{"source":{"id":null,"name":"Insurancejournal.com"},"author":null,"title":"AAIS Gets Insurance Department Approval for CannaBOP in Colorado","description":"The American Association of Insurance Services has received approval for its cannabis businessowners policy (CannaBOP) program from the Colorado Department of Insurance. AAIS announced it filed for approval of the program in Colorado earlier this month. AAIS …","url":"https://www.insurancejournal.com/news/west/2019/04/23/524396.htm","urlToImage":"https://www.insurancejournal.com/img/insurancejournal-square.png","publishedAt":"2019-04-23T05:00:25Z","content":"The American Association of Insurance Services has received approval for its cannabis businessowners policy (CannaBOP) program from the Colorado Department of Insurance.\r\nAAIS announced it filed for approval of the program in Colorado earlier this month.\r\nAAI… [+946 chars]"},{"source":{"id":null,"name":"Insurancejournal.com"},"author":"Jenni Bergal, Stateline","title":"Cops Draw Blood to Catch Impaired Drivers","description":"It was about 6:30 on a Friday night in January when Phoenix Police Det. Kemp Layden pulled over a white Jeep Cherokee that was speeding and weaving in and out of its lane. The 47-year-old driver spoke slowly, his eyes …","url":"https://www.insurancejournal.com/news/national/2019/04/23/524454.htm","urlToImage":"https://www.insurancejournal.com/app/uploads/2019/04/16x9_M.jpg","publishedAt":"2019-04-23T13:09:52Z","content":"It was about 6:30 on a Friday night in January when Phoenix Police Det. Kemp Layden pulled over a white Jeep Cherokee that was speeding and weaving in and out of its lane.\r\nThe 47-year-old driver spoke slowly, his eyes were red and watery, and his pupils were… [+8665 chars]"},{"source":{"id":null,"name":"Mouseplanet.com"},"author":"Alan S. Dalinka","title":"Walt Disney World Resort Update for April 23-29, 2019","description":"Disney's Animal Kingdom to Update Rivers of Light | Celebrate Disney's Hollywood Studios 30th Anniversary on May 1 | Walt Disney World Resort Celebrates Earth Month | Walt Disney World Resort Celebrates Easter | Epcot Concerts & Candlelight","url":"https://www.mouseplanet.com/12364/Walt_Disney_World_Resort_Update_for_April_2329_2019","urlToImage":"https://www.mouseplanet.info/gallery/d/314940-2/ASD-MK-04-21-2019+-+1.jpg","publishedAt":"2019-04-23T07:00:00Z","content":"Walt Disney World Resort Update for April 23-29, 2019\r\nPage Navigation\r\n: After a strong storm passed through Central Florida during the day on Friday, this past Easter weekend saw some of the nicest weather around Walt Disney World Resort so far this year. E… [+64089 chars]"},{"source":{"id":null,"name":"Bostonherald.com"},"author":"Boston Herald","title":"Mary Rosati of Melrose, at 81, hospital worker","description":"Mary C. (Willwerth) Rosati of Melrose died Sunday, April 14. She was 81. She was born and raised in Melrose, and graduated from St. Mary’s Grammar School and St. Mary’s High School. She lived in Stoneham for several years but lived most of her life in Melrose…","url":"https://www.bostonherald.com/2019/04/23/mary-rosati-of-melrose-at-81-hospital-worker/","urlToImage":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","publishedAt":"2019-04-23T18:59:37Z","content":"Mary C. (Willwerth) Rosati of Melrose died Sunday, April 14. She was 81.\r\nShe was born and raised in Melrose, and graduated from St. Mary’s Grammar School and St. Mary’s High School.\r\nShe lived in Stoneham for several years but lived most of her life in Melro… [+1094 chars]"},{"source":{"id":null,"name":"Insurancejournal.com"},"author":null,"title":"Home Improvement Contractor in Maine Charged with Manslaughter","description":"The owner of a home improvement company charged with manslaughter following the death of a worker is set for a court hearing. The Portland Press Herald reports the arraignment of Saco-based contractor, Shawn D. Purvis, is scheduled for May 20 …","url":"https://www.insurancejournal.com/news/east/2019/04/23/524450.htm","urlToImage":"https://www.insurancejournal.com/img/insurancejournal-square.png","publishedAt":"2019-04-23T13:19:14Z","content":"The owner of a home improvement company charged with manslaughter following the death of a worker is set for a court hearing.\r\nThe Portland Press Herald reports the arraignment of Saco-based contractor, Shawn D. Purvis, is scheduled for May 20 at Portland Uni… [+581 chars]"},{"source":{"id":null,"name":"Insurancejournal.com"},"author":null,"title":"Study: $76.4M in Texas Home Values Erased by Flooding Tied to Sea Level Rise","description":"New research shows that increased tidal flooding caused by sea level rise has eroded $76.4 million in relative property values along the Texas coast between 2005 and 2017. That’s according to a peer-reviewed housing market study by data scientists from …","url":"https://www.insurancejournal.com/news/southcentral/2019/04/23/524515.htm","urlToImage":"https://www.insurancejournal.com/img/insurancejournal-square.png","publishedAt":"2019-04-23T16:14:05Z","content":"New research shows that increased tidal flooding caused by sea level rise has eroded $76.4 million in relative property values along the Texas coast between 2005 and 2017.\r\nThat’s according to a peer-reviewed housing market study by data scientists from First… [+2538 chars]"},{"source":{"id":"newsweek","name":"Newsweek"},"author":"Sophia Waterfield","title":"Top National Parks to Visit: Golden Gate Recreation Area, Channel Islands National Park, Voyageurs National Park","description":"Newsweek spoke to Will Shafroth, president and chief executive officer of the National Park Foundation, to identify some of the most-loved national parks in the U.S.","url":"https://www.newsweek.com/top-national-parks-golden-gate-recreation-area-channel-islands-national-park-1403340","urlToImage":"https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2019/04/23/npf-death-valley.jpg","publishedAt":"2019-04-23T10:29:58Z","content":"There are over 400 national parks across the U.S. that you can explore, but if you're stuck for ideas on where to go to celebrate National Park Week, then we've got you covered. \r\nNewsweek spoke to Will Shafroth, president and chief executive officer of the N… [+5172 chars]"},{"source":{"id":"fortune","name":"Fortune"},"author":"Erin Corbett","title":"Bernie Sanders: Even ‘Terrible People’ Have the Right to Vote","description":"In a CNN Town Hall, Bernie Sanders says incarcerated Americans should have the right to vote.","url":"http://fortune.com/2019/04/23/bernie-sanders-town-hall-cnn/","urlToImage":"https://fortunedotcom.files.wordpress.com/2019/04/bernie-sanders-cnn-town-hall-e1556024510440.jpg","publishedAt":"2019-04-23T13:05:05Z","content":"Vermont Sen. Bernie Sanders says the right to vote should be extended to all people, including those in prison.\r\nOn Monday night during a CNN Town Hall, the senator was asked whether people like the Boston marathon bomber and sexual abusers should be allowed … [+2129 chars]"},{"source":{"id":null,"name":"Pajiba.com"},"author":"Lainey Bobainey","title":"HBO May Be In Trouble Once 'Game of Thrones' Comes to An End","description":"Trump regaled the children attending the White House Easter Event with tales of The Wall. We are all that blonde girl in the jean jacket. - (VF) Oooh, new Celebitchy podcast! I am so behind on podcasts. There are too...","url":"http://www.pajiba.com/pajiba_love/hbo-may-be-in-trouble-once-game-of-thrones-comes-to-an-end.php","urlToImage":"http://www.pajiba.com/assets_c/2019/04/game-of-thrones-hbo-subscribers-thumb-700xauto-210462.jpeg","publishedAt":"2019-04-23T02:30:00Z","content":"By Lainey Bobainey | Pajiba Love | April 22, 2019 | \r\nBy Lainey Bobainey | Pajiba Love | April 22, 2019 |\r\nTrump regaled the children attending the White House Easter Event with tales of The Wall. We are all that blonde girl in the jean jacket. - (VF) \r\nOooh,… [+2482 chars]"},{"source":{"id":null,"name":"Loudwire.com"},"author":"Chad Childers","title":"Scott Stapp Reveals Deeply Personal New Song 'Name' + New Album Details","description":"Plus, get the new album art, track listing and tour dates. Continue reading…","url":"https://loudwire.com/scott-stapp-name-new-album-details/","urlToImage":"https://townsquare.media/site/366/files/2019/03/Scott-PR-suit-and-couch-credit-Sebastian-Smith.jpeg?w=1200&h=0&zc=1&s=0&a=t&q=89","publishedAt":"2019-04-23T17:09:55Z","content":"Scott Stapp is ready to fill in the \"space\" concerning the pertinent details surrounding his latest solo set, The Space Between the Shadows. The album is now set to drop on July 19 through Napalm Records, and Stapp has revealed the track listing, artwork and … [+2787 chars]"},{"source":{"id":null,"name":"Theplaylist.net"},"author":"Rodrigo Perez","title":"Cannes Directors’ Fortnight Line-Up Includes ‘The Lighthouse’ With Robert Pattinson & Willem Dafoe & A New Luca Guadagnino Movie","description":"The official line-up for the 2019 Cannes Film Festival is out. And while many are still waiting to hear word whether Quentin Tarantino ‘s “ Once Upon A Time In Hollywood ” will premiere or not—it’s apparently not entirely done yet and rushing to be completed …","url":"https://theplaylist.net/cannes-directors-fortnight-line-lighthouse-20190423/","urlToImage":"https://theplaylist.net/wp-content/uploads/2019/04/D42AqfmUIAU7xi6.jpg","publishedAt":"2019-04-23T14:44:41Z","content":"The official line-up for the 2019 Cannes Film Festival is out. And while many are still waiting to hear word whether Quentin Tarantino‘s “Once Upon A Time In Hollywood” will premiere or notit’s apparently not entirely done yet and rushing to be completed on t… [+3620 chars]"},{"source":{"id":"the-hill","name":"The Hill"},"author":"Jonathan Easley","title":"Sanders: Boston Marathon bomber should be able to vote from prison","description":"Vermont Sen. Bernie Sanders (I) argued Monday that all prisoners, including domestic terrorists like the Boston Marathon bomber, should have the right to vote while they are incarcerated.Speaking at a CNN town hall...","url":"https://thehill.com/homenews/campaign/440125-sanders-boston-marathon-bomber-should-be-able-to-vote-from-prison","urlToImage":"https://thehill.com/sites/default/files/newsletter-sanders_041119getty.jpg","publishedAt":"2019-04-23T01:29:00Z","content":"Vermont Sen. Bernie SandersBernard (Bernie) SandersThe biggest challenge from the Mueller Report depends on the vigilance of everyoneGOP Senate campaign arm hits battleground-state Dems over 'Medicare for All,' Green New DealWarren unveils plan to cancel stud… [+1895 chars]"},{"source":{"id":null,"name":"Runningoffthereeses.com"},"author":"Running off the Reese's","title":"Game of WHOA","description":"I am pleased to report that I finished unpacking this weekend! My boss told me on Friday not to come back to work until my house was unpacked, organized, and cleaned because I was a bit of a nut because … Continue reading → The post Game of WHOA appeared firs…","url":"https://www.runningoffthereeses.com/?p=15710","urlToImage":"https://media.giphy.com/media/xTiTnEHBh7qapyuvwQ/giphy.gif","publishedAt":"2019-04-23T11:27:42Z","content":"I am pleased to report that I finished unpacking this weekend!My boss told me on Friday not to come back to work until my house was unpacked, organized, and cleaned because I was a bit of a nut because of the disorganization last week. Sari and I also went ov… [+2884 chars]"},{"source":{"id":null,"name":"Nypost.com"},"author":"Jeremy Layton","title":"Living on the wrong side of a time zone can damage your health","description":"Sleep. It’s the one thing of which everyone wants more, but consistently fails to get enough. Though a recent study proves there’s a factor keeping us from getting more shuteye that may be entirely out of our control. According to research published this mont…","url":"https://nypost.com/2019/04/23/living-on-the-wrong-side-of-a-time-zone-can-damage-your-health/","urlToImage":"https://thenypost.files.wordpress.com/2019/04/sleep-time-zones-381.jpg?quality=90&strip=all&w=1200","publishedAt":"2019-04-23T19:08:37Z","content":"Sleep. It’s the one thing of which everyone wants more, but consistently fails to get enough. Though a recent study proves there’s a factor keeping us from getting more shuteye that may be entirely out of our control.\r\nAccording to research published this mon… [+2234 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Bloomberg","title":"Drug executives are criminally charged in major opioid case","description":"Federal prosecutors Tuesday unveiled the first criminal charges against pharmaceutical executives that accuse them of illegally diverting opioids. The former chief executive and the head of compliance at a major U.S. drug distributor are accused of a narcotic…","url":"https://www.latimes.com/business/la-fi-opioid-criminal-charge-executive-rochester-drug-20190423-story.html","urlToImage":"https://www.latimes.com/resizer/cHxndFjjFhEd-d5FQb8KUig-QtU=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/FSMRWKKCXNFUTHBCP2HSDQG75I.jpg","publishedAt":"2019-04-23T22:20:00Z","content":"Federal prosecutors Tuesday unveiled the first criminal charges against pharmaceutical executives that accuse them of illegally diverting opioids. The former chief executive and the head of compliance at a major U.S. drug distributor are accused of a narcotic… [+5223 chars]"},{"source":{"id":null,"name":"Popsci.com"},"author":"Eleanor Cummins and Kaitlin Sullivan, Eleanor Cummins and Kaitlin Sullivan","title":"Grass isn't always greener—here's what to plant instead","description":"Environment Lawn gone. Lawnmowers account for 5 percent of our air pollution. And lawn owners use 10 times the amount of pesticides and fertilizers per acre than farmers use on their crops.","url":"https://www.popsci.com/regional-lawn-alternatives","urlToImage":"https://www.popsci.com/sites/popsci.com/files/styles/opengraph_1_91x1/public/images/2019/04/depositphotos_76306231_l-2015.jpg?itok=Nf0_Cd3-","publishedAt":"2019-04-23T18:30:00Z","content":"White picket fences went out of style long ago, but for some reason the American lawn just wont die. Thats unfortunate: Lawnmowers account for 5 percent of our air pollution. Lawn owners use 10 times the amount of pesticides and fertilizers per acre than farm… [+4541 chars]"},{"source":{"id":null,"name":"Sans.org"},"author":null,"title":"Issue #32 - Volume XXI - SANS Newsbites - April 23rd, 2019","description":"Computer security training, certification and free resources. We specialize in computer/network security, digital forensics, application security and IT audit.","url":"https://www.sans.org/newsletters/newsbites/xxi/32","urlToImage":null,"publishedAt":"2019-04-23T05:00:00Z","content":"SANS NewsBites is a semiweekly high-level executive summary of the most important news articles that have been published on computer security during the last week. Each news item is very briefly summarized and includes a reference on the web for detailed info… [+41486 chars]"},{"source":{"id":null,"name":"Thestar.com"},"author":"The Associated Press","title":"Proposal would require Maine students learn about Holocaust","description":"AUGUSTA, Maine - Maine lawmakers are considering a bill designed to require students to learn about the Holocaust.","url":"https://www.thestar.com/news/world/us/2019/04/23/proposal-would-require-maine-students-learn-about-holocaust.html","urlToImage":"https://www.thestar.com/assets/img/thestar-ribbon.png","publishedAt":"2019-04-23T17:27:29Z","content":"AUGUSTA, Maine - Maine lawmakers are considering a bill designed to require students to learn about the Holocaust.\r\nDemocratic Sen. Louie Luchini of Ellsworth introduced the bill, which received a public hearing before a legislative committee Monday. Luchini … [+621 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Laura Manske, Contributor, Laura Manske, Contributor https://www.forbes.com/sites/lauramanske/","title":"The Maine Thing: How This Inn By The Sea Can Seduce You","description":"Lots to love about this one-of-a-kind hideaway.","url":"https://www.forbes.com/sites/lauramanske/2019/04/23/the-maine-thing-how-this-inn-by-the-sea-can-seduce-you/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Flauramanske%2Ffiles%2F2019%2F04%2Fexterior_crescent-beach_puppy-on-chair-500x500.jpg","publishedAt":"2019-04-23T17:23:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nIf you crave travel seduction on your vacation &amp;nbsp;the sublime feeling of falling in love with an oasis of natural beauty, welcome ambience, easy relaxation,&amp;nbsp;endearing surprises and&amp;nb… [+13503 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Maxwell Strachan","title":"Kamala Harris Open To ‘Conversation’ About Giving Jailed Felons Right To Vote","description":"The Democratic presidential candidate was asked for her position on the matter during a CNN town hall for Democratic presidential candidates.","url":"https://www.huffpost.com/entry/kamala-harris-felons-vote_n_5cbe7e81e4b00b3e70ce4984","urlToImage":"https://img.huffingtonpost.com/asset/5cbe80c42a0000aa0c4f947e.jpeg?cache=KnsQ9pWUuZ&ops=1200_630","publishedAt":"2019-04-23T03:53:51Z","content":"Sen. Kamala Harris said Monday that she would be open to having a “conversation” about giving incarcerated felons the right to vote.\r\nDuring a CNN town hall, the 2020 Democratic presidential candidate was asked about her position on the voting rights issue by… [+1274 chars]"},{"source":{"id":null,"name":"Stripes.com"},"author":null,"title":"Funeral set for Marine killed in Marine Corps Air Station Beaufort shooting","description":"Cpl. Tyler Wallingford was an aircraft ordinance technician with the Marine Fighter Attack Training Squadron 501. He was shot and killed by a fellow Marine on April 12 at Marine Corps Air Station Beaufort in South Carolina.","url":"https://www.stripes.com/news/us/funeral-set-for-marine-killed-in-marine-corps-air-station-beaufort-shooting-1.578038?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+starsandstripes%2Fgeneral+%28Stars+and+Stripes%29","urlToImage":"https://www.stripes.com/polopoly_fs/1.577057.1555354977!/image/image.jpg_gen/derivatives/landscape_490/image.jpg","publishedAt":"2019-04-23T05:02:52Z","content":"PORTLAND, Maine A memorial service will be held in Maine for a 21-year-old Marine corporal slain in South Carolina.\r\nThe service for Cpl. Tyler Wallingford, of Standish, is set for Saturday at a funeral home in Portland.\r\nVisiting hours are scheduled from 9 a… [+575 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Gili Malinsky","title":"Senator Elizabeth Warren called for massive student debt relief. Here’s the average student loan debt in every state.","description":"Having announced her bid for candidacy in the 2020 presidential election, Massachusetts Senator Elizabeth Warren has begun rolling out her platform. In  a Medium blog post on Monday, Senator Warren proposed a plan to cancel as much  as$US50,000 in student-loa…","url":"https://www.businessinsider.com.au/student-loan-debt-per-state-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbe1c707456537d7e16e182-640.jpg","publishedAt":"2019-04-23T14:36:32Z","content":"Having announced her bid for candidacy in the 2020 presidential election, Massachusetts Senator Elizabeth Warren has begun rolling out her platform. In a Medium blog post on Monday, Senator Warren proposed a plan to cancel as much as$US50,000 in student-loan … [+6623 chars]"},{"source":{"id":null,"name":"Businessinsider.com.au"},"author":"Susanna Heller","title":"Nurses are outraged by a state senator who said they 'probably play cards for a considerable amount of the day'","description":"Sen. Maureen Walsh, a Republican from Washington, said in a debate last week that nurses in rural hospitals \"probably play cards for a considerable amount of the day.\" More »","url":"https://www.businessinsider.com.au/maureen-walsh-said-nurses-play-cards-all-day-2019-4","urlToImage":"https://static.thisisinsider.com/image/5cbf25b5bd1e27494d7e90a4-640.jpg","publishedAt":"2019-04-23T15:10:07Z","content":"Sen. Maureen Walsh, a Republican from Washington, said in a debate last week that nurses in rural hospitals “probably play cards for a considerable amount of the day.”\r\nWalsh made the comments during a debate in which she argued against a bill that would prev… [+4144 chars]"},{"source":{"id":null,"name":"Greenbiz.com"},"author":"Holly Secon","title":"Dow Chemical changes chiefs; former Seventh Generation CEO helms American Sustainable Business Council","description":"Plus: Patagonia's political plays and food companies begin to bake in sustainability.","url":"https://www.greenbiz.com/article/dow-chemical-changes-chiefs-former-seventh-generation-ceo-helms-american-sustainable","urlToImage":"https://www.greenbiz.com/sites/default/files/styles/panopoly_image_full/public/images/articles/featured/namesinthenewsapril.jpg?itok=WIZpY4tq","publishedAt":"2019-04-23T08:30:00Z","content":"Welcome to Names in the News, the spring 2019 edition. Since we covered the early-year job jumpers, movers and shakers, an entire host of sustainability career changes has taken place. Many people are making fresh new starts and big transitions this spring, a… [+9133 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Cleve R. Wootson Jr.","title":"Sanders faces heat for saying people should be able to vote from prison","description":"Sanders said his support for voting by all jailed criminals reflects basic rights. The GOP said it’s “beyond extreme.”","url":"https://www.washingtonpost.com/politics/sanders-faces-heat-for-saying-people-should-be-able-to-vote-from-prison/2019/04/23/44bd4d98-65e0-11e9-a1b6-b29b90efa879_story.html","urlToImage":"https://www.washingtonpost.com/resizer/RAg-qTej-7jtZSY699tS9lvyI_0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EIG22ATGCEI6TJUYFKHYBDE47M.jpg","publishedAt":"2019-04-23T22:43:13Z","content":"As the words left his mouth, Sen. Bernie Sanders (I-Vt.) could see the shape of the attack ads that could be used against him.\r\nA questioner at a CNN town hall Monday night asked the presidential candidate whether he believes that incarcerated felons the Bost… [+7184 chars]"},{"source":{"id":null,"name":"Joblo.com"},"author":"Cody Hamman","title":"Andy Muschietti shares shot of James McAvoy as Bill in It: Chapter Two","description":"When we met the character of Bill Denbrough in director Andy Muschietti&#39;s Stephen King adaptation IT, he was a young kid played by Jaeden Lieberher Martell (pictured above). When we catch up with him twenty-seven years later in the upcoming continuation I…","url":"https://www.joblo.com/horror-movies/news/andy-muschietti-shares-shot-of-james-mcavoy-as-bill-in-it-chapter-two","urlToImage":"https://www.joblo.com/assets/images/arrow/news/2019/04/656mcavoyjaedenit.jpg","publishedAt":"2019-04-23T13:34:00Z","content":"When we met the character of Bill Denbrough in director Andy Muschietti's Stephen King adaptation IT, he was a young kid played by Jaeden Lieberher Martell (pictured above). When we catch up with him twenty-seven years later in the upcoming continuation IT: C… [+1239 chars]"},{"source":{"id":null,"name":"Dailykos.com"},"author":"rss@dailykos.com (Jeff Singer)","title":"Longtime Iowa legislator declares he can't back 'bully' Trump and leaves the Republican Party","description":"On Tuesday, Iowa state Rep. Andy McKean announced that he was leaving the Republican Party and joining the Democrats, and that he planned to seek re-election with Team Blue in 2020. McKean’s move leaves the GOP with a small 53 to 47 majority in the chamber. M…","url":"https://www.dailykos.com/story/2019/4/23/1852589/-Longtime-Iowa-legislator-declares-he-can-t-back-bully-Trump-and-leaves-the-Republican-Party","urlToImage":"https://images.dailykos.com/images/668401/story_image/AP_18008671595362.jpg?1556045787","publishedAt":"2019-04-23T18:57:39Z","content":null},{"source":{"id":null,"name":"Extratv.com"},"author":null,"title":"Win an Aveeno® Haircare Gift Bag, Plus; Daphne Oz Unveils Their Farm-to-Shower-Inspired Collection!","description":"Best-selling author and Emmy-winning television host Daphne Oz has a holistic approach to health and beauty, which is why she’s the first ever brand ambassador for Aveeno Haircare.","url":"http://extratv.com/2019/04/23/win-an-aveeno-haircare-gift-bag-plus-daphne-oz-unveils-their-farm-to-shower-inspired-collection/","urlToImage":"https://media.extratv.com/2019/04/23/daphne-oz-screengrab-1200x630.jpg","publishedAt":"2019-04-23T23:50:09Z","content":"Best-selling author and Emmy-winning television host Daphne Oz has a holistic approach to health and beauty, which is why she’s the first ever brand ambassador for Aveeno Haircare. Watch Video The new collection of haircare products is rooted in fresh, farm-t… [+5560 chars]"},{"source":{"id":null,"name":"Pinknews.co.uk"},"author":"Eve Hartley","title":"Nevada allows non-binary people to self-identify on IDs","description":"Great news. The post Nevada allows non-binary people to self-identify on IDs appeared first on PinkNews.","url":"https://www.pinknews.co.uk/2019/04/23/nevada-allows-non-binary-people-self-identify-ids/","urlToImage":"https://www.pinknews.co.uk/images/2019/03/pride_with_the_T_transgender_pride_2.jpg","publishedAt":"2019-04-23T06:29:35Z","content":"Nevada has become the 10th state to allow trans and intersex people to obtain gender neutral IDs.\r\nIn addition to the current “M” for male and “F’ for female markers, residents can ask for an “X” to be displayed on driver’s licenses and ID cards.\r\nNevada join… [+2020 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Science X staff","title":"New study compiles Gulf of Maine seasonal wildlife timing shifts","description":"Many researchers and amateur naturalists keep track of dates for the first robin of spring, the first peepers or ice-out on ponds, and such records can offer decades of data on the timing of plant and animal life cycle events known as phenology.","url":"https://phys.org/news/2019-04-gulf-maine-seasonal-wildlife-shifts.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2019/newstudycomp.jpg","publishedAt":"2019-04-23T16:12:48Z","content":"Many researchers and amateur naturalists keep track of dates for the first robin of spring, the first peepers or ice-out on ponds, and such records can offer decades of data on the timing of plant and animal life cycle events known as phenology.\r\nWhile such o… [+5224 chars]"},{"source":{"id":null,"name":"Freerepublic.com"},"author":"CNN","title":"Two more states are dumping Christopher Columbus to celebrate indigenous people instead","description":"More states are ditching Christopher Columbus. Vermont and Maine are the latest to join the growing number of cities, states and municipalities that have renamed the October holiday for the people who lived in America long before the explorer arrived. The leg…","url":"https://www.freerepublic.com/focus/f-news/3743912/posts","urlToImage":null,"publishedAt":"2019-04-23T01:44:39Z","content":"Skip to comments.\r\nTwo more states are dumping Christopher Columbus to celebrate indigenous people insteadCNN ^\r\n | April 21, 2019\r\n | By Christina Maxouris\r\nPosted on 04/22/2019 6:44:39 PM PDT by ConservativeStatement\r\nMore states are ditching Christopher Co… [+4098 chars]"},{"source":{"id":null,"name":"Freerepublic.com"},"author":"The Hill","title":"Sanders: Boston Marathon bomber should be able to vote from prison","description":"Vermont Sen. Bernie Sanders (I) argued Monday that all prisoners, including domestic terrorists like the Boston Marathon bomber, should have the right to vote while they are incarcerated. Speaking at a CNN town hall, Sanders was asked if he believes the right…","url":"https://www.freerepublic.com/focus/f-news/3743920/posts","urlToImage":null,"publishedAt":"2019-04-23T02:27:25Z","content":"Skip to comments.\r\nSanders: Boston Marathon bomber should be able to vote from prisonThe Hill ^\r\n | 04/22/19 09:29 PM EDT\r\n | JONATHAN EASLEY\r\nPosted on 04/22/2019 7:27:25 PM PDT by E. Pluribus Unum\r\nVermont Sen. Bernie Sanders (I) argued Monday that all pris… [+5765 chars]"},{"source":{"id":null,"name":"Footwearnews.com"},"author":"Barbara Schneider-Levy","title":"16 Retailers That Are Absolute Experts in Healthy Comfortable Shoes","description":"They go above and beyond by offering the expertise of certified pedorthists.","url":"https://footwearnews.com/2019/business/retail/best-comfort-shoe-stores-schuler-shoes-lebos-schuler-shoes-1202774113/","urlToImage":"https://pmcfootwearnews.files.wordpress.com/2019/04/nobile-shoes-florida-store.jpg","publishedAt":"2019-04-23T20:35:39Z","content":"In this first in a new series, FN profiles some of the most influential independent shoe stores in the U.S.\r\nThese comfort retailers, listed below, remain committed to the well-being of their customers. Not only do they curate a selection of stylish health-mi… [+8218 chars]"},{"source":{"id":null,"name":"Footwearnews.com"},"author":"Barbara Schneider-Levy","title":"16 Best Stores to Shop for Comfort & Athleisure Shoes","description":"They go above and beyond by offering the expertise of certified pedorthists.","url":"https://footwearnews.com/2019/business/retail/best-comfort-shoe-stores-schuler-shoes-lebos-1202774113/","urlToImage":"https://pmcfootwearnews.files.wordpress.com/2019/04/nobile-shoes-florida-store.jpg","publishedAt":"2019-04-23T20:35:39Z","content":"In this first in a new series, FN profiles some of the most influential independent shoe stores in the U.S.\r\nThese comfort retailers, listed below, remain committed to the well-being of their customers. Not only do they curate a selection of stylish health-mi… [+8269 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Sean Fay","title":"Beyond the 'Emptyhad' Jokes: Searching for the Soul of Manchester City","description":"Mary D's Beamish Bar is so close to the Etihad Stadium you can hear the team announcements from inside. A two-storey white-brick building with a flat roof, barred windows and...","url":"https://bleacherreport.com/articles/2832648-beyond-the-emptyhad-jokes-searching-for-the-soul-of-manchester-city","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/329/hi-res-227bedd7cb15c0644b9f6ff238f8400c_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-23T12:25:51Z","content":"Robbie Jay Barratt - AMA/Getty Images\r\nMary D's Beamish Bar is so close to the Etihad Stadium you can hear the team announcements from inside.\r\nA two-storey white-brick building with a flat roof, barred windows and a team of burly door staff in orange hi-vis … [+10878 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Maine woman charged with killing 2-year-old girl denied bail","description":"BANGOR, Maine (AP) — A woman who Maine State Police say killed a 2-year-old girl has been denied bail.","url":"https://apnews.com/0e3d015ab22843619a5f132fe8354cb5","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-23T15:58:25Z","content":"BANGOR, Maine (AP) A woman who Maine State Police say killed a 2-year-old girl has been denied bail.\r\nProsecutors charge that 21-year-old Savannah Smith, of Bucksport, killed Kloe Hawksley in October 2017 with a blow to the girl's abdomen.\r\nSmith, who pleaded… [+611 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Maine bill to boost lowest-in-US governor's pay gets tabled","description":"AUGUSTA, Maine (AP) — Lawmakers have tabled the latest bill to boost the lowest-in-the-nation salary for Maine's next governor.","url":"https://apnews.com/7959fccc78014eaaa5da3ff49e9c701c","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-23T20:12:49Z","content":"AUGUSTA, Maine (AP) Lawmakers have tabled the latest bill to boost the lowest-in-the-nation salary for Maine's next governor.\r\nThe bill would boost the annual salary from $70,000 to $150,000 beginning January 2023. The Legislature's state and local government… [+756 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"BY JUSTIN MATTINGLY Richmond Times-Dispatch","title":"William & Mary taps George Mason dean as next provost","description":"The College of William &amp; Mary is looking to Northern Virginia for its next academics chief.","url":"https://www.richmond.com/news/local/education/william-mary-taps-george-mason-dean-as-next-provost/article_b12588e4-6872-5cde-b0fe-3ec60dab477a.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/2/6a/26a32015-0e22-50e4-bc42-41dedf8c6b1f/582f796bad0bd.preview.jpg?resize=920%2C505","publishedAt":"2019-04-23T13:04:00Z","content":"The College of William &amp; Mary is looking to Northern Virginia for its next academics chief.\r\nPresident Katherine Rowe announced Tuesday that Peggy Agouris, the current dean of George Mason University's College of Science, will be the university's next pro… [+1725 chars]"},{"source":{"id":null,"name":"Richmond.com"},"author":"","title":"ME Gray ME Zone Forecast","description":"ME Gray ME Zone Forecast for Tuesday, April 23, 2019","url":"https://www.richmond.com/news/ap/me-gray-me-zone-forecast/article_a1485bb8-f0aa-53ee-a349-940e33f77e6c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/d3d347f2-efa0-11e6-b02b-d30e16810f0d.jpg?resize=600%2C600","publishedAt":"2019-04-23T13:11:14Z","content":"ME Gray ME Zone Forecast for Tuesday, April 23, 2019\r\n534 FPUS51 KGYX 231307\r\nZFPGYX\r\nZone Forecasts for New Hampshire and western Maine\r\nNational Weather Service Gray ME\r\n907 AM EDT Tue Apr 23 2019\r\nMEZ024-240315-\r\nCoastal Cumberland-\r\nIncluding the cities o… [+28479 chars]"},{"source":{"id":null,"name":"Eurekalert.org"},"author":null,"title":"New study compiles gulf of maine seasonal wildlife timing shifts","description":"( University of Massachusetts at Amherst ) Many researchers and amateur naturalists track dates for the first robin or pond ice-out; such records offer data on timing of plant and animal life cycle events known as phenology. While such observations are common…","url":"https://www.eurekalert.org/pub_releases/2019-04/uoma-nsc042319.php","urlToImage":"https://www.eurekalert.org/multimedia/pub/web/198994_web.jpg","publishedAt":"2019-04-23T04:00:00Z","content":"IMAGE: New England has an exceptional network of river herring wardens and other citizen science groups who for many decades have kept track of important life cycle dates and counted numbers...\r\n view more \r\nCredit: UMass Amherst/Matt Devine\r\nAMHERST, Mass. -… [+5803 chars]"},{"source":{"id":null,"name":"Consequenceofsound.net"},"author":"Michael Roffman","title":"James Wan stakes adaptation of Stephen King’s ‘Salem’s Lot","description":"The Nun screenwriter Gary Dauberman will adapt the 1975 novel.","url":"https://consequenceofsound.net/2019/04/stephen-kings-salems-lot-movie/","urlToImage":"https://consequenceofsound.net/wp-content/uploads/2019/04/Screen-Shot-2019-04-23-at-4.38.14-PM.png","publishedAt":"2019-04-23T22:02:37Z","content":"One of Stephen Kings most popular stories to date will finally hit the big screen.\r\nAccording to The Hollywood Reporter, The Conjuring mastermind James Wan and The Nun screenwriter Gary Dauberman have signed on to adapt Kings 1975 vampire epic, Salems Lot. Wa… [+1785 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Miguel Delaney, Ed Malyon, Miguel Delaney, Ed Malyon","title":"Manchester United transfer news: Thomas Meunier an option for United from PSG as club compile reports on Aaron Wan-Bissaka and Kieran Trippier","description":"The Belgian international has just over a year left on his contract and won't extend his deal for now","url":"https://www.independent.co.uk/sport/football/transfers/manchester-united-transfer-news-thomas-meunier-psg-rightback-a8882446.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/18/21/Thomas-Muenier.jpg","publishedAt":"2019-04-23T10:55:00Z","content":"Manchester United are considering Thomas Meunier as an option for the troublesome right-back position this summer. \r\nThe Paris Saint-Germain defender would represent an experienced choice to fill Antonio Valencia's boots when the Ecuadorean veteran leaves the… [+7431 chars]"},{"source":{"id":null,"name":"Prnewswire.com"},"author":null,"title":"Michael Phelps Continues As Global Ambassador Of Colgate's \"Save Water\" Conservation Effort With Behavior-Change Tips","description":"NEW YORK, April 23, 2019 /PRNewswire/ -- On Earth Day 2019, Colgate announced its continued partnership with one of the greatest swimmers of all time, Michael Phelps, who serves as global ambassador for the brand's ongoing \"Save Water\" initiative. The campaig…","url":"https://www.prnewswire.com/news-releases/michael-phelps-continues-as-global-ambassador-of-colgates-save-water-conservation-effort-with-behavior-change-tips-300836855.html","urlToImage":"https://www.multivu.com/players/English/8528351-colgate-michael-phelps-make-every-drop-count-save-water/image/NicoleandMichael_1555706704900-HR.jpg","publishedAt":"2019-04-23T20:31:00Z","content":"Colgate products are found in two out of every three homes in the world, and almost all of them require water use. \"Given that our brand is found in more households than any other brand in the world, Colgate is uniquely positioned to lead in water conservatio… [+3605 chars]"},{"source":{"id":null,"name":"Thestar.com"},"author":"The Associated Press","title":"Maine bill to boost lowest-in-US governor’s pay gets tabled","description":"AUGUSTA, Maine - Lawmakers have tabled the latest bill to boost the lowest-in-the-nation salary for Maine's next governor.","url":"https://www.thestar.com/news/world/us/2019/04/23/maine-bill-to-boost-lowest-in-us-governors-pay-gets-tabled.html","urlToImage":"https://www.thestar.com/assets/img/thestar-ribbon.png","publishedAt":"2019-04-23T20:13:15Z","content":"AUGUSTA, Maine - Lawmakers have tabled the latest bill to boost the lowest-in-the-nation salary for Maines next governor.\r\nThe bill would boost the annual salary from $70,000 to $150,000 beginning January 2023. The Legislatures state and local government comm… [+611 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Caribou had snow on the ground for 163 consecutive days","description":"CARIBOU, Maine (AP) — It's another overcast day in Maine, but there's reason for cheer in Caribou.","url":"https://apnews.com/e48dc06f071b4dafb394d1c0e6af1dee","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T14:34:06Z","content":"CARIBOU, Maine (AP) It's another overcast day in Maine, but there's reason for cheer in Caribou.\r\nThe National Weather Service reports that the city is mostly snow-free after setting a record for longest stretch with at least an inch of snow on the ground.\r\nO… [+578 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Fire claims storied general store in small community","description":"WELD, Maine (AP) — A fire has leveled a storied general store that long served a Maine county.","url":"https://apnews.com/b278bc88077c40a388f9f8464d9e95d3","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T04:15:43Z","content":"WELD, Maine (AP) A fire has leveled a storied general store that long served a Maine county.\r\nThe Sun Journal reports that one of the owners of the Weld General Store said he escaped early Monday morning from a fire in the building.\r\nFire Chief Corney Hutchin… [+591 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Bosnian man deported, criminal charges dropped","description":"ROCKLAND, Maine (AP) — A Bosnian man accused of trying to strangle his pregnant girlfriend in Maine has been deported.","url":"https://apnews.com/719fdc78d2ce490988503b1492b371b2","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T17:57:31Z","content":"ROCKLAND, Maine (AP) A Bosnian man accused of trying to strangle his pregnant girlfriend in Maine has been deported.\r\nThe Portland Press Herald reports that the charges of aggravated assault and domestic violence assault were dismissed last week in Knox Count… [+584 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Bill would require Maine students learn about the Holocaust","description":"AUGUSTA, Maine (AP) — Maine lawmakers are considering a bill designed to require students to learn about the Holocaust.","url":"https://apnews.com/d24407f9d9f6490bbe232d2457b0b51e","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T16:46:34Z","content":"AUGUSTA, Maine (AP) Maine lawmakers are considering a bill designed to require students to learn about the Holocaust.\r\nDemocratic Sen. Louie Luchini of Ellsworth introduced the bill, which received a public hearing before a legislative committee Monday. Luchi… [+763 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Bill to ban Native American mascots in Maine passes House","description":"AUGUSTA, Maine (AP) — A bill to prevent Maine public schools from using mascots and logos depicting Native Americans has passed the House.","url":"https://apnews.com/953a2f9434134af4b92c8b6ee7248121","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T19:17:52Z","content":"AUGUSTA, Maine (AP) A bill to prevent Maine public schools from using mascots and logos depicting Native Americans has passed the House.\r\nThe Democratic-controlled House voted 88-49 largely along party lines Tuesday to recommend the legislation . Democratic R… [+788 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Maine could end religious, philosophical vaccine opt-outs","description":"AUGUSTA, Maine (AP) — Maine could end non-medical exemptions for routine childhood vaccines required by schools and certain health care facilities by September 2021.","url":"https://apnews.com/29ddb6bf80a74a09b03b0a3fcd50df1d","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T18:11:59Z","content":"AUGUSTA, Maine (AP) Maine could end non-medical exemptions for routine childhood vaccines required by schools and certain health care facilities by September 2021.\r\nThe House voted 78-59 on a Democrat's bill Tuesday. Democrats control Maine's House 88-56.\r\nMu… [+773 chars]"},{"source":{"id":"associated-press","name":"Associated Press"},"author":"","title":"Funeral set for slain Marine","description":"PORTLAND, Maine (AP) — A memorial service will be held in Maine for a 21-year-old Marine corporal slain in South Carolina.","url":"https://apnews.com/3efe3ade532f4d9bb9c0a1ede019d854","urlToImage":"https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg","publishedAt":"2019-04-23T04:15:41Z","content":"PORTLAND, Maine (AP) A memorial service will be held in Maine for a 21-year-old Marine corporal slain in South Carolina.\r\nThe service for Cpl. Tyler Wallingford, of Standish, is set for Saturday at a funeral home in Portland.\r\nVisiting hours are scheduled fro… [+715 chars]"}]}