{"status":"ok","totalResults":250,"articles":[{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Frank Olito","title":"The 12 best amusement parks in the US that aren't Disney","description":"There are amusement parks all over the country that are great — and cheaper — alternatives to Disney parks. Cedar Point in Ohio, Silver Dollar City in Missouri, and Dollywood in Tennessee have thrilling rides that are comparable to those at Disney. Busch Gard…","url":"https://www.thisisinsider.com/underrated-cheap-amusement-parks-2019-4","urlToImage":"https://static.businessinsider.com/image/5cbe35cf2730ca2444735769-750.jpg","publishedAt":"2019-04-22T21:44:16Z","content":"Although a trip to Disney is supposed to be filled with magic, sometimes it can just be expensive, crowded, and downright disappointing. \r\n But there are other amusement parks all over the country that have exciting rides and experiences at half the cost. Whi… [+289 chars]"},{"source":{"id":null,"name":"Profootballweekly.com"},"author":null,"title":"Greg Gabriel: 2019 NFL Mock Draft - Pro Football Weekly","description":"Greg Gabriel: 2019 NFL Mock Draft Pro Football Weekly Quinnen Williams about to fulfill a dream and his mother’s last request Tampa Bay Times Mock Draft: Three Alabama players expected first round 247Sports 2019 NFL Mock Draft: What happens when the Cardinals…","url":"https://www.profootballweekly.com/2019/04/22/greg-gabriel-2019-nfl-mock-draft/aof04kg/","urlToImage":"https://www.profootballweekly.com/_internal/cimg!0/6aanj62zcclsxfikecfb2kgn03kj3nu","publishedAt":"2019-04-22T14:18:00Z","content":"The 2019 NFL draft will be an interesting one because it will unfold much differently than in recent years. We have seen in the past few drafts a running back go in the top 10, which wont be the case this year. In fact, dont be surprised if a running back doe… [+7832 chars]"},{"source":{"id":null,"name":"Castanet.net"},"author":null,"title":"Queen turns 93 - World News - Castanet.net","description":"Queen turns 93 - World News Castanet.net Queen Elizabeth II turns 93 on Easter Sunday CityNews Vancouver Prince Harry Reunites With William and Kate at Easter Service E! Online Britain's Queen Elizabeth celebrates 93rd birthday at Easter service The Globe and…","url":"https://www.castanet.net/news/World/254454/Queen-turns-93","urlToImage":"https://www.castanet.net/content/2019/4/LKW108-421_2019_094139_p3382273.jpg","publishedAt":"2019-04-22T14:10:00Z","content":"World  \r\nQueen Elizabeth II is celebrating her 93rd birthday, which this year coincides with Easter Sunday.\r\nThe queen is marking Easter by attending a service with other senior royals at St. George's Chapel on the grounds of Windsor Castle, west of London.\r\n… [+34919 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Boeing prepares St. Louis plant for likely Air Force F-15 orders","description":"Boeing is preparing to build F-15 fighter planes for the U.S. Air Force at its St. Louis County plant even though the military branch hasn’t bought the jet in over a decade.","url":"https://news.yahoo.com/boeing-prepares-st-louis-plant-215705700.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/0yunSkKyu_bBSowsRxCTEA--~B/aD04MDA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/air_force_times_767/db031c8b8db2b71f9dde961035146cdc","publishedAt":"2019-04-22T21:57:05Z","content":"ST. LOUIS Boeing is preparing to build F-15 fighter planes for the U.S. Air Force at its St. Louis County plant even though the military branch hasnt bought the jet in over a decade.\r\nThe Chicago-based company began ramping up its F-15 production line near St… [+2010 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Ryan W. Miller, USA TODAY","title":"71 additional measles cases confirmed as CDC warns record levels nearing","description":"A total of 626 measles cases in 22 states have been confirmed since Jan. 1, the Centers for Disease Control and Prevention said.","url":"https://www.usatoday.com/story/news/health/2019/04/22/measles-outbreak-71-additional-cases-22-states-confirmed-cdc/3536904002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/09/USAT/ad431b1a-d42b-4898-844c-a02391972c95-AP_Measles_Vaccine.JPG?crop=5211,2931,x1,y440&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T14:09:32Z","content":"Outbreaks across the U.S. have forced officials to declare emergencies. Why are we starting to see the rise of these outbreaks? It dates back to the anti-vax movement.\r\n Just the FAQs, USA TODAY\r\nAn additional 71 measles cases were reported across the United … [+1642 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Elizabeth Weise, USA TODAY","title":"Life after solving climate change: Not mud huts and gruel but clean air and warm homes","description":"What will life be like after we've solved climate change? Better than today or worse? Mud huts and gruel or the flying cars and the Jetsons?","url":"https://www.usatoday.com/story/news/nation/2019/04/22/heres-what-world-look-like-once-we-solve-climate-change/3400271002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/11/USAT/d0b73f0f-40e3-4a85-b26f-17389e36dacc-Weise-2017-07-15-0802.JPG?crop=4031,2267,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T10:01:07Z","content":"The Turning Torso tower in Malmö, Sweden. The nations third largest city, it has a population of 600,000 and is working to be carbon-neutral by 2030. The city is building new eco-neighborhoods that combine urban planning and energy-efficient buildings in area… [+15547 chars]"},{"source":{"id":null,"name":"247wallst.com"},"author":"24/7 Wall Street, Samuel Stebbins, 24/7 Wall Street","title":"Viva Las Vegas, here's the fastest growing cities in each state and Sin City is among them","description":"Nearly every state has at least one city that has reported rapid population growth in recent years. Net migration and natural growth are the factors.","url":"https://247wallst.com/special-report/2019/04/18/the-fastest-growing-city-in-each-state-4?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2019/04/18/USATODAY/usatsports/gettyimages-946583362.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-22T10:00:07Z","content":"The U.S. population growth rate recently hit a low point not seen since 1937, when the country was in the thick of the Great Depression. The U.S. population grew by just 0.62% between July 2017 and July 2018, according to Census Bureau data. The slowing natio… [+13870 chars]"},{"source":{"id":null,"name":"Scientificamerican.com"},"author":"Maxine Joselow, E&E News","title":"Why Are Electric Vehicle Sales Low? Psychology Provides Clues","description":"Social norms and a lack of information on financial benefits have hampered U.S. EV adoption -- Read more on ScientificAmerican.com","url":"https://www.scientificamerican.com/article/why-are-electric-vehicle-sales-low-psychology-provides-clues/","urlToImage":"https://static.scientificamerican.com/sciam/cache/file/6B94991D-E261-4939-9C6218587D5A9E4E.jpg","publishedAt":"2019-04-22T18:00:00Z","content":"At the Washington Auto Show this month, automakers prominently displayed dozens of electric vehicles.\r\nAudi showcased the e-tron, its first electric SUV. Elsewhere in the massive showroom, Chevrolet exhibited a bright lime-green Bolt.\r\nBut the prevalence of E… [+6988 chars]"},{"source":{"id":null,"name":"Futurity.org"},"author":"Eric Stann-Missouri","title":"‘Virtual’ cardio system improves alternative heart test","description":"A new math model could give scientists better information from non-invasive heart monitoring, which may help with early detection of heart disease.","url":"https://www.futurity.org/ballistocardiograms-math-model-2041612/","urlToImage":"https://www.futurity.org/wp/wp-content/uploads/2019/04/ballistocardiogram-math-model_1600.jpg","publishedAt":"2019-04-22T15:26:43Z","content":"A new mathematical model may pave the way for getting better information from ballistocardiograms, report researchers.\r\nEvery heart beat sends blood flowing throughout the human body. While an electrocardiogram uses a contact approach to measure the electrica… [+2703 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Tansey","title":"2019 NFL Mock Draft: 1st-Round Predictions and Stock Watch for Hyped Prospects","description":"With a few days remaining until the 2019  NFL  draft begins, speculation is running rampant across the league...","url":"https://bleacherreport.com/articles/2832496-2019-nfl-mock-draft-1st-round-predictions-and-stock-watch-for-hyped-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/170/hi-res-87b13c937a29a07a92a9c6b99d5dfdbe_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T13:07:29Z","content":"Darron Cummings/Associated Press\r\nWith a few days remaining until the 2019 NFL draft begins, speculation is running rampant across the league. \r\nReports regarding which teams like which prospects the best and who could possibly be trade partners will flare up… [+5316 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"The MMQB Staff","title":"2019 NFL Draft Position Rankings: Linebackers","description":"Devin White and Devin Bush are first-round locks, but the rest of this year's LB draft class is full of question marks.","url":"https://www.si.com/nfl/2019/04/22/draft-position-rankings-linebackers-devin-white-devin-bush-mack-wilson","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/22/devin-white-lsu.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T15:56:27Z","content":"1. Devin White, LSU (Overall Rank: 8)Height: 6' 0\" | Weight: 237 poundsHe doesnt quite have the instincts of last years top linebacker prospect, Bears rising star Roquan Smith, but White brings similar athleticism. Hes still learning the positionhe was consid… [+3946 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Albert Breer","title":"Mock Draft: Kyler Murray Goes No. 1, Then Five Players Stand Out From the Pack","description":"With just four days until the draft, some decisions are becoming clear while others remain closely guarded secrets. With not enough players deserving of first-round grades to go around, here's how we see Thursday night playing out. Plus, more analysis of Russ…","url":"https://www.si.com/nfl/2019/04/22/mock-draft-kyler-murray-arizona-cardinals-nick-bosa-dwayne-haskins","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/MMQB-4-22-kyler-murray-mike-mayock-russell-wilson.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-22T06:14:42Z","content":"The finish line is in sight. In under 100 hours, the Cardinals will take Kyler Murray with the first pick in the 2019 NFL Draft. Or they wont. And thats sort of the story for each of the four quarterbacks atop this years classtheres a wide range of outcomes t… [+38804 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Chase Purdy","title":"Plant-based meat companies have an identity crisis on their hands","description":"The meat industry is pushing back on plant-based companies from using the word \"meat.\"","url":"https://qz.com/1601542/beyond-meat-says-the-word-meat-could-be-a-liability/","urlToImage":"https://cms.qz.com/wp-content/uploads/2017/06/faux.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-04-22T18:18:21Z","content":"The biggest problem for plant-based meat companies might be the very thing that defines them. For years, theyve worked to create products that look, feel, and taste just like conventional meatbut now that theyre finding success in the market, they stare down … [+2444 chars]"},{"source":{"id":null,"name":"Kshb.com"},"author":"https://www.kshb.com/tod-palmer","title":"Teens 'trying to kill each other' in massive amusement park brawl...","description":"Teens 'trying to kill each other' in massive amusement park brawl... (Second column, 26th story, link ) Advertise here","url":"https://www.kshb.com/news/crime/police-break-up-massive-brawl-at-world-of-fun","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/a39a866/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2F321%2Fe14174ecfc5d469285bc97a89e713431%2F3215fa19cf57475fb97ee0508a2c2dfd%2Fposter_6e74f872a2ff474a96b26203f84773d4.jpg","publishedAt":"2019-04-22T01:25:37Z","content":"KANSAS CITY, Mo. Hundreds of people, mostly teenagers, were involved in a fight that required a massive police response Saturday night at Worlds of Fun.\r\nThe Clay County Sheriffs Office issued an assist-the-officer call about a half-hour before the park was s… [+2694 chars]"},{"source":{"id":null,"name":"Firstshowing.net"},"author":"Alex Billington","title":"Official Trailer for Inspirational 'Knock Down the House' Doc on Netflix","description":"\"I'm running because everyday Americans deserve to be represented by everyday Americans.\" Netflix has unveiled a trailer the indie documentary Knock Down the House, which premiered at the Sundance Film Festival earlier this year where it won the top Audience …","url":"https://www.firstshowing.net/2019/official-trailer-for-inspirational-knock-down-the-house-doc-on-netflix/","urlToImage":"https://media2.firstshowing.net/firstshowing/img10/KnockdowntheHouseWomenDocmainTsr.jpg","publishedAt":"2019-04-22T17:47:11Z","content":"by Alex BillingtonApril 22, 2019Source:YouTube\r\n\"I'm running because everyday Americans deserve to be represented by everyday Americans.\" Netflix has unveiled a trailer the indie documentary Knock Down the House, which premiered at the Sundance Film Festival … [+2138 chars]"},{"source":{"id":null,"name":"Ozy.com"},"author":"Molly Fosco","title":"If Abortion Is Murder, Then Miscarriage Is...","description":"Many pro-life advocates in the U.S. define abortion as murder. So should that mean miscarriage constitutes involuntary manslaughter?","url":"https://www.ozy.com/immodest-proposal/if-abortion-is-murder-then-miscarriage-is/93773","urlToImage":"https://pictures.ozy.com/pictures/1500xany/1/7/4/142174_gettyimages534952092fix.jpg","publishedAt":"2019-04-22T04:27:08Z","content":"The right to seek an abortion is under attack nationwide. In Indiana, the procedure can only be performed in the first trimester of pregnancy, must be recommended by a doctor and can only happen in a hospital or licensed surgical center. Some lawmakers contin… [+4308 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Devin White, Drew Lock are Giants' most likely picks in first round","description":"With 12 picks, including two in the first round, the Giants are in position to land a defensive playmaker and their future starting QB on Thursday.","url":"http://www.espn.com/blog/new-york-giants/post/_/id/58877/devin-white-drew-lock-are-giants-most-likely-picks-in-first-round","urlToImage":"https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1015%2Fr447484_1296x729_16%2D9.jpg","publishedAt":"2019-04-22T12:37:57Z","content":"EAST RUTHERFORD, N.J. -- The New York Giants are rich in terms of draft capital. They have the goods in the first round of the NFL draft with the No. 6 and No. 17 overall picks.\r\nWhich direction will they go?\r\nLet's try to dissect it all with an exercise that… [+8983 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"2019 NFL draft features: In-depth stories on the top prospects","description":"Catch up on the stories behind the 2019 draft's best prospects and most interesting personalities.","url":"http://www.espn.com/nfl/draft2019/story/_/id/26378822/2019-nfl-draft-features-depth-stories-top-prospects","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0418%2Fquinnenwilliams1_ms_16x9.jpg","publishedAt":"2019-04-22T01:07:28Z","content":"As the 2019 NFL draft nears, ESPN.com over the next month is telling in-depth feature stories on several of the top prospects. Check back here throughout the month to read more.\r\nThe draft begins April 25 at 8 p.m. ET on ESPN, ABC and the ESPN App. Coverage c… [+24289 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Laura Barcella","title":"Wife of Missouri KKK Leader Admits Killing Her Husband","description":"In 2017, the imperial wizard of a local Missouri KKK chapter was found shot to death — and now his wife has been sentenced to life in prison for his murder, PEOPLE confirms. Frank Ancona, 51, was the Lakewood, MO, based leader of the Traditionalist American K…","url":"https://people.com/crime/wife-missouri-kkk-leader-admits-killing-her-husband/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/malissa-frank-ancona.jpg?crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630","publishedAt":"2019-04-22T16:58:42Z","content":"In 2017, the imperial wizard of a local Missouri KKK chapter was found shot to death and now his wife has been sentenced to life in prison for his murder, PEOPLE confirms.\r\nFrank Ancona, 51, was the Lakewood, MO, based leader of the Traditionalist American Kn… [+2314 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Jason Duaine Hahn","title":"Missouri Firemen Push Disabled Vet Home After His Electric Wheelchair Runs Out of Power","description":"A trio of Missouri firefighters banded together to push a man with disabilities 30 minutes back to his home after his electric wheelchair lost power on a hot afternoon. Last week, the Raytown Fire Protection District posted a video to their Facebook page that…","url":"https://people.com/human-interest/missouri-firemen-push-disabled-vet-home-wheelchair/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/wheelchair.jpg?crop=236px%2C617px%2C844px%2C442px&resize=1200%2C630","publishedAt":"2019-04-22T20:24:07Z","content":"A trio of Missouri firefighters banded together to push a man with disabilities 30 minutes back to his home after his electric wheelchair lost power on a hot afternoon.\r\nLast week, the Raytown Fire Protection District posted a video to their Facebook page tha… [+2238 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Robin Seaton Jefferson, Contributor, Robin Seaton Jefferson, Contributor https://www.forbes.com/sites/robinseatonjefferson/","title":"Americans Over 65 'Probably Aren't Going To Get The Measles,' But Geriatrician Says Check Anyway","description":"If you’re an older adult and unsure about your vaccination status, especially if you live in or are planning to travel to a high-risk area, it’s important to talk to your doctor.","url":"https://www.forbes.com/sites/robinseatonjefferson/2019/04/22/americans-over-65-probably-arent-going-to-get-the-measles-but-geriatrician-says-check-anyway/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1133827018%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T19:35:00Z","content":"Even with the United States edging toward a record number of measles cases in a single year since the disease was declared eliminated in 2000, one physician says seniors likely have little to worry about.The Centers for Disease Control and Prevention (CDC) to… [+7443 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Ellen Paris, Contributor, Ellen Paris, Contributor https://www.forbes.com/sites/ellenparis/","title":"Median Home Listing Price Hits High of $300,000","description":"Realtor com’s March Housing Report Data Shows for the first time the National Median Listing Price Hit $300,000. That’s a historic 7 Percent Year- Over Year Increase.","url":"https://www.forbes.com/sites/ellenparis/2019/04/22/median-home-listing-price-hits-high-of-300000/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_5358%2Fpt_5358_2187_o.jpg%3Ft%3D1555925405","publishedAt":"2019-04-22T09:30:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nCentral Northside, a neighborhood in Pittsburgh where $300,000 goes far\r\nGetty\r\nThe U.S. Median home listing price recently hit a historic high of $300,000 according to realtor.coms March housing data. T… [+5481 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jim Gorzelany, Contributor, Jim Gorzelany, Contributor https://www.forbes.com/sites/jimgorzelany/","title":"Happy Earth Day -- Here's Why This Is A Great Time To Buy An Electric Car","description":"It’s never been easier to drive a ‘greener’ vehicle.","url":"https://www.forbes.com/sites/jimgorzelany/2019/04/22/happy-earth-day-heres-why-this-is-a-great-time-to-buy-an-electric-car/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1142959253%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-22T16:07:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nThough electric cars still account for only a razor-thin share of the U.S. new-vehicle market, theyre gaining momentum. According to the tracking website InsideEVs.com, 361,307 EVs were sold last year, w… [+14305 chars]"},{"source":{"id":null,"name":"Hvper.com"},"author":null,"title":" Missouri teacher charged with hiring hitman to kill student, 10, who he allegedly molested: report via Hvper.com","description":"The Internet on one page. Successor of Popurls, the mother of news aggregators. By @thomas","url":"http://www.hvper.com/?ref=feed_79cb669388b711e8b25a98970912b557","urlToImage":"http://www.hvper.com/static/img/og_09.png","publishedAt":"2019-04-22T15:57:10Z","content":"Flogging Molly, Social Distortion, Mike Ness\r\nVeteran punk bands Flogging Molly and Social Distortion will join forces at Stage AE Outdoors, North Shore, on Aug. 20. Also on the bill are The..."},{"source":{"id":null,"name":"Bradford-delong.com"},"author":"J. Bradford DeLong","title":"Fairly Recently: Must- and Should-Reads, and Writings... (April 21-2, 2019)","description":"* **Across the Wide Missouri**: _[Is tonight the](https://www.bradford-delong.com/2019/04/is-tonight-the-game-of-thrones-episode-when-tony-stark-shows-up-asking-for-a-friend.html)_ _Game of Thrones_ episode when Tony Stark shows up? Asking for a friend... ---…","url":"https://www.bradford-delong.com/2019/04/fairly-recently-must-and-should-reads-and-writings-april-21-2-2019.html","urlToImage":"https://delong.typepad.com/.a/6a00e551f080038834022ad38f739e200c-600wi","publishedAt":"2019-04-22T02:08:23Z","content":"Across the Wide Missouri: Is tonight the Game of Thrones episode when Tony Stark shows up? Asking for a friend... Jeffrey Adam Sachs: The “Campus Free Speech Crisis” Ended Last Year: \"The evidence for a chilling effect... is sketchy at best. By contrast, the … [+8011 chars]"},{"source":{"id":null,"name":"Wgem.com"},"author":"https://www.facebook.com/kara.wgem","title":"Businesses work to clean up mess left from flood waters - WGEM","description":"Businesses work to clean up mess left from flood waters WGEM As the flood water starts to recede, areas in the Tri-States are now dealing with the mess left behind. For one business in Alexandria, Missouri, the clean up is...","url":"https://wgem.com/2019/04/21/businesses-work-to-clean-up-mess-left-from-flood-waters/","urlToImage":"https://s3-ca-central-1.amazonaws.com/quincy-network/wp-content/uploads/sites/13/2019/04/flood.jpg","publishedAt":"2019-04-22T03:15:53Z","content":null},{"source":{"id":null,"name":"News-leader.com"},"author":"Sara Karnes","title":"Nixa man held employee at gunpoint in Springfield business, police say - Springfield News-Leader","description":"Nixa man held employee at gunpoint in Springfield business, police say Springfield News-Leader A Nixa man is facing several charges after he allegedly armed himself and held an employee hostage at a Springfield business. Kenneth Powers, 63, reportedly...","url":"https://www.news-leader.com/story/news/local/ozarks/2019/04/22/nixa-man-held-employee-hostage-springfield-edmonds-dental/3538578002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/PSPR/4fc52e56-bae7-4100-be42-6fb6cbf0628f-InmateImg042019ZZZ457518_04182019193628.jpg?crop=1919,1079,x1,y1&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T19:37:00Z","content":"A Nixa man is facing several charges after he allegedly armed himself and held an employee hostage at a Springfield business.\r\nKenneth Powers, 63, reportedly entered Edmonds Dental Prosthetics, 2065 W. Woodland St., at approximately 1:45 p.m. April 18, accord… [+5466 chars]"},{"source":{"id":null,"name":"Heraldtribune.com"},"author":"Staff Report","title":"Business People: Promotions, awards and moves for Sarasota-Manatee professionals - Sarasota Herald-Tribune","description":"Business People: Promotions, awards and moves for Sarasota-Manatee professionals Sarasota Herald-Tribune Sarasota Title Services Inc. has hired Robin Eekhof as director of business development.Eekhof has more than 15 years of sales and marketing experience.","url":"https://www.heraldtribune.com/article/20190422/NEWS/190429895","urlToImage":"https://www.heraldtribune.com/storyimage/LK/20190422/NEWS/190429895/AR/0/AR-190429895.jpg","publishedAt":"2019-04-22T08:07:11Z","content":"Sarasota Title Services Inc. has hired Robin Eekhof as director of business development.\r\nEekhof has more than 15 years of sales and marketing experience. Her main focus at Sarasota Title Services Inc. will be expanding the company’s customer base and increas… [+9430 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Free-agent pickups ease pressure on Packers at draft","description":"Packers look to add missing pieces at draft after key free-agent signings","url":"https://www.foxsports.com/nfl/story/free-agent-pickups-ease-pressure-on-packers-at-draft-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/fd84f42ffaa343949628e5f397548058-1.vresize.1200.630.high.2.jpg","publishedAt":"2019-04-22T20:02:57Z","content":"GREEN BAY, Wis. (AP) — Having signed four potential starters in free agency, the Green Bay Packers enter this week’s draft looking to add the missing ingredients to a team that has missed the playoffs the last two seasons.\r\n“With some of the things that we’ve… [+3184 chars]"},{"source":{"id":null,"name":"Vanityfair.com"},"author":"Yohana Desta","title":"Watch Alexandria Ocasio-Cortez’s Humble Rise to Congress in Knock Down the House Trailer","description":"The Netflix doc follows four women—including A.O.C., Amy Vilela, Paula Jean Swearingen, and Cori Bush—racing toward the 2018 midterm election.","url":"https://www.vanityfair.com/hollywood/2019/04/knock-down-the-house-netflix-trailer","urlToImage":"https://media.vanityfair.com/photos/5cbdfcd442ae0b19c49f3af7/16:9/w_1200,h_630,c_limit/Knock_Down_The_House_00_43_11_10.jpeg","publishedAt":"2019-04-22T17:50:18Z","content":"Before Alexandria Ocasio-Cortez became a game-changing congresswoman, she was a bartender fighting an uphill political battle after the election of Donald Trump. It’s all captured in the upcoming Netflix documentary Knock Down the House, directed by Rachel Le… [+3075 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Peter King","title":"Peter King: Kyler Murray will go No. 1 in NFL draft","description":"With the first pick in the 2019 NFL Draft, the Arizona Cardinals select ... . That's where Peter King begins his Football Morning in America column, with his first—and only—mock draft of the year. He also covers:\r\n\r\n• Four first-round trades are projected in …","url":"https://profootballtalk.nbcsports.com/2019/04/22/nfl-mock-draft-fmia-peter-king/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/fmia4.jpg?w=1200","publishedAt":"2019-04-22T06:19:35Z","content":"Interesting mock draft dropped Sunday morning in the Los Angeles Times. The papers redoubtable NFL beat man, Sam Farmer, had his annual sportswriter mock drafthes done it for 10 yearsin which he asks longtime NFL writers he trusts in the franchise cities to m… [+48449 chars]"},{"source":{"id":null,"name":"Midmajormadness.com"},"author":"Russell Steinberg","title":"The Other Top 25: Louisiana Tech and Murray State enter and we await Max Hazzard’s decision - Mid-Major Madness","description":"The Other Top 25: Louisiana Tech and Murray State enter and we await Max Hazzard’s decision Mid-Major Madness My sources say the transfer portal is being considered for your favorite player. I am pro-your favorite team and take no pleasure in reporting this. …","url":"https://www.midmajormadness.com/2019/4/22/18410801/the-other-top-25-louisiana-tech-murray-state-missouri-state-lamont-west-max-hazzard","urlToImage":"https://cdn.vox-cdn.com/thumbor/Yr0Qmhjao4IRnYJlJZ0KWKq5610=/0x0:3984x2086/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16182673/usa_today_10446613.jpg","publishedAt":"2019-04-22T21:10:19Z","content":"My sources say the transfer portal is being considered for your favorite player. I am pro-your favorite team and take no pleasure in reporting this.\r\nThats the reality, however, as now over 620 players plan to transfer, according to Jeff Goodman.\r\nThats why, … [+1378 chars]"},{"source":{"id":null,"name":"Ajc.com"},"author":"Ken Sugiura","title":"St. Louis DE/LB Lanell Carr sees a fit at Georgia Tech - Atlanta Journal Constitution","description":"St. Louis DE/LB Lanell Carr sees a fit at Georgia Tech Atlanta Journal Constitution Lanell Carr, a defensive end/linebacker from St. Louis, came to Georgia Tech this past week for an unofficial visit and enjoyed himself so much, he's planning to...","url":"https://www.ajc.com/sports/college/louis-lanell-carr-sees-fit-georgia-tech/Gk4DB4IM6Tpx593eP5MiVP/","urlToImage":"https://www.ajc.com/rf/image_large/Pub/p10/AJC/2019/04/22/Images/lanellcarr_20190422133255.jpg","publishedAt":"2019-04-22T00:00:05Z","content":"Lanell Carr, a defensive end/linebacker from St. Louis, came to Georgia Tech this past week for an unofficial visit and enjoyed himself so much, he’s planning to return on an official visit in June.\r\n“I can see myself at Georgia Tech for sure,” Carr said.\r\nCa… [+2231 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"14 SEC players who could have breakthrough seasons","description":"14 SEC players who could have breakthrough seasons","url":"https://www.foxsports.com/college-football/story/14-sec-players-who-could-have-breakthrough-seasons-042219","urlToImage":"https://b.fssta.com/uploads/2019/04/70b6d5a436944a9091740f93512be24a.vresize.1200.630.high.15.jpg","publishedAt":"2019-04-22T14:53:25Z","content":"Now that spring practice has ended, here’s a list of Southeastern Conference football players who are poised to break out this fall. Classes listed are their classes in the fall.\r\nEASTERN DIVISION\r\nFLORIDA\r\nAMARI BURNEY, LB, Soph. — Burney, a converted safety… [+4854 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 1974 MG MGB Roadster","description":"This 1974 MGB roadster was reportedly purchased new in California and brought to Arizona by its original owner, where it stayed until being acquired by the seller in September 2011. The car has been repainted in red over a black interior and is powered by a 1…","url":"https://bringatrailer.com/listing/1974-mg-mgb-26/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/1974_mg_mgb_1555655030b920a492f3b2253e7hero.jpg","publishedAt":"2019-04-22T21:20:13Z","content":"This 1974 MGB roadster was reportedly purchased new in California and brought to Arizona by its original owner, where it stayed until being acquired by the seller in September 2011. The car has been repainted in red over a black interior and is powered by a 1… [+2573 chars]"},{"source":{"id":null,"name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: 2000 BMW 540i 6-Speed","description":"This 2000 BMW 540i is finished in Siena Red Metallic over Sand leather and shows 75k miles. Power is provided by a 4.4-liter M62 V8 paired with a 6-speed manual transmission, and factory options include 17\" alloy wheels and heated front seats. Originally leas…","url":"https://bringatrailer.com/listing/2000-bmw-540i-22/","urlToImage":"https://cdn.bringatrailer.com/wp-content/uploads/2019/04/2000_bmw_540i_1555044590bae850c154711c6daIMG_5879.jpg","publishedAt":"2019-04-22T21:02:37Z","content":"This 2000 BMW 540i is finished in Siena Red Metallic over Sand leather and shows 75k miles. Power is provided by a 4.4-liter M62 V8 paired with a 6-speed manual transmission, and factory options include 17″ alloy wheels and heated front seats. Originally leas… [+2849 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Kate Smith","title":"Abortion will be illegal in these states if Roe v. Wade is overturned","description":"Abortion would be automatically illegal in six states if Roe vs. Wade were overturned.","url":"https://www.cbsnews.com/news/new-abortion-law-abortion-clinic-automatically-illegal-roe-v-wade-overturned-2019-04-22/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/03/14/1d68c3d9-e2f1-4404-aeff-effd6269db28/thumbnail/1200x630/eb8ee6a46243c6f3465688517d9c277c/gettyimages-526768610.jpg","publishedAt":"2019-04-22T18:51:55Z","content":"States across the country are preparing for a possible day when Roe v. Wade is overturned. \r\nRoe, the 1973 Supreme Court decision, specifies that a woman has a right to an abortion, and states are not allowed to interfere with that right. But abortion activis… [+18628 chars]"},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"https://www.facebook.com/lena.sun.90","title":"U.S. measles cases surge as officials scramble to stop near-record outbreak - Washington Post","description":"U.S. measles cases surge as officials scramble to stop near-record outbreak Washington Post Measles nears record in US as the disease spreads in New York CNBC New York Outbreaks Drive US Measles Count up to 626 U.S. News & World Report Measles outbreak prompt…","url":"https://www.washingtonpost.com/health/2019/04/22/us-measles-cases-surge-officials-scramble-stop-near-record-outbreak/","urlToImage":"https://www.washingtonpost.com/resizer/GtS0vYsmUAaipxCL3gfQ4EqwgJw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UIC6T24PXNHDNCLXFJJHM7SSYU.jpg","publishedAt":"2019-04-22T13:49:49Z","content":"The United States is on track to surpass the record number of measles cases in a single year since the disease was declared eliminated in 2000, according to figures reported Monday. For the fourth week in a row, health officials have added dozens of new cases… [+3234 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Up to 300 teenagers involved in fight at amusement park: 'No one could leave'","description":"Up to 300 teens were drawn into a ruckus that broke out at Worlds of Fun in Kansas City, Missouri, authorities said.","url":"https://news.yahoo.com/300-teenagers-involved-fight-amusement-170300105.html","urlToImage":"https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png","publishedAt":"2019-04-22T17:03:00Z","content":"A massive brawl erupted Saturday night at an amusement park in Missouri that included about 300 teenagers, police said.\r\nAn overwhelmed sheriff's deputy called in multiple agencies for backup as fights unfolded at Worlds of Fun in Kansas City, Missouri, the K… [+1979 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"71 additional measles cases confirmed as CDC warns record levels nearing","description":"A total of 626 measles cases in 22 states have been confirmed since Jan. 1, the Centers for Disease Control and Prevention said.","url":"https://news.yahoo.com/71-additional-measles-cases-confirmed-140932795.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/.76VuKZ5tdu_AjRq2B4Fsw--~B/aD01NDA7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/1009217/2bb78e34-a6bc-4644-a828-9e244c503fbd/83404e80-16fe-541b-b58f-adf67a25e6c0/data_3_0.jpg?s=3cbd4876c4691d8bafe4189c84b8245a&c=ab49697a3322eb2c8d41b6f2b5199832&a=tripleplay4us&mr=0","publishedAt":"2019-04-22T14:09:32Z","content":"An additional 71 measles cases were reported across the United States last week, another jump in a growing outbreak of the disease, federal health officials said Monday.\r\nA total of 626 measles cases in 22 states have been confirmed since Jan. 1, the Centers … [+1391 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Arizona joins 47 other states with cellphone-driving law","description":"PHOENIX (AP) — Arizona ended a decade of resistance to restrictions on using a cellphone while driving when Gov. Doug Ducey signed a law Monday outlawing holding a phone behind the wheel.","url":"https://news.yahoo.com/arizona-joins-47-other-states-221153574.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/v78tRvAmGPDogjTREOY4vg--~B/aD0yMzA2O3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/cf7736d00fc14b49a63af9c7923a0055.jpg","publishedAt":"2019-04-22T22:11:53Z","content":"PHOENIX (AP) Arizona ended a decade of resistance to restrictions on using a cellphone while driving when Gov. Doug Ducey signed a law Monday outlawing holding a phone behind the wheel.\r\nIt is now the 48th state to ban texting and the 18th to ban hand-held ph… [+2483 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Life after solving climate change: Not mud huts and gruel but clean air and warm homes","description":"What will life be like after we've solved climate change? Better than today or worse? Mud huts and gruel or the flying cars and the Jetsons?","url":"https://news.yahoo.com/life-solving-climate-change-not-100107225.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/HZkvQXFZlhXRDGEGWqzMqg--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/usa_today_news_641/34b7572affd8a75bca57c4e8cd8436f9","publishedAt":"2019-04-22T10:01:07Z","content":"What will life be like after we've solved climate change? Better than today or worse? Mud huts and gruel, or flying cars and the Jetsons? Comfy homes, good food, whip-smart appliances and robots hopping around on farms all seem pretty likely, experts queried … [+13851 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"NBC Sports Boston","title":"Former NFL GM sheds light on Patriots coach Bill Belichick's trade demeanor","description":"What's it like to discuss a trade with New England Patriots head coach Bill Belichick? Well, it doesn't sound like the six-time Super Bowl champion has much time for small talk. Ex-Tampa Bay Buccaneers general manager Mark Dominik, in a recent medial call wit…","url":"https://www.nbcsports.com/boston/patriots/former-nfl-gm-sheds-light-patriots-coach-bill-belichicks-trade-demeanor","urlToImage":"https://www.nbcsports.com/boston/sites/csnne/files/2019/04/22/usatsi_12031936_0.jpg","publishedAt":"2019-04-22T16:57:05Z","content":"Unlike in past years, the NFL Draft could help the New England Patriots address some serious needs.\r\nThe Patriots enter the 2019 NFL Draft armed with 12 total picks, more than any team in the league. With holes to fill wide receiver, tight end and defensive e… [+1606 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Reuters","title":"Take 5: NFL draft props to play Thursday","description":"As for the wide receiver most likely to be the first drafted, Mississippi's D.K. Metcalf is listed as the favorite at -175, meaning that bettors would have to bet $175 to win $100.  Oklahoma's Marquise Brown (+210) and Metcalf's teammate at Ole Miss, A.J. Bro…","url":"https://news.yahoo.com/5-nfl-draft-props-play-213105674.html","urlToImage":null,"publishedAt":"2019-04-22T21:31:05Z","content":"Field Level Media analyzed dozens of prop bets offered by numerous sportsbooks, searching for the best odds and most likely moneymakers.\r\nWe've ranked the top five in descending order below, starting off with a dark horse that could pay big, a parlay worthy o… [+4771 chars]"},{"source":{"id":null,"name":"Ocregister.com"},"author":"Daily Breeze","title":"NFL mock draft 3.0: Is Kyler Murray the Cardinals' No. 1 choice?","description":"The last days of smokescreens and pre-draft hot takes are upon us, as the 2019 NFL draft begins on Thursday. With the rumor mill spinning and the Cardinals nearly on the clock, here's the third and final mock draft in our predraft series: 1. ARIZONA CARDINALS…","url":"http://www.ocregister.com/nfl-mock-draft-3-0-is-kyler-murray-the-cardinals-no-1-choice","urlToImage":"https://www.dailybreeze.com/wp-content/uploads/2019/04/NFL-Draft-Kyler-Murray-Football-1.jpg?w=1024&h=697","publishedAt":"2019-04-22T21:39:42Z","content":"The last days of smokescreens and pre-draft hot takes are upon us, as the 2019 NFL draft begins on Thursday. With the rumor mill spinning and the Cardinals nearly on the clock, here’s the third and final mock draft in our predraft series: \r\n1. ARIZONA CARDINA… [+13180 chars]"},{"source":{"id":null,"name":"Greenvilleonline.com"},"author":"The Greenville News","title":"NFL mock draft 2019: Surprises for Clelin Ferrell, Christian Wilkins in first round?","description":"Nate Davis reveals three of the 100 biggest draft busts in NFL history according to USA TODAY Sports. The 2019 NFL draft is less than a week away, and the first-round outlook is still defined by its lack of clarity. While all the team needs have come into foc…","url":"https://www.greenvilleonline.com/story/sports/2019/04/22/nfl-mock-draft-former-clemson-football-players-clelin-ferrel-christian-wilkins-among-surprises/3539704002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/01/12/PGRE/f5b45184-ccc8-4543-90ae-7630ef82a06b-Clemson_National_Championship_02148.JPG?crop=2169,1248,x0,y47&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T16:59:49Z","content":"Nate Davis reveals three of the 100 biggest draft busts in NFL history according to USA TODAY Sports.\r\n USA TODAY Sports\r\nThe 2019 NFL draft is less than a week away, and the first-round outlook is still defined by its lack of clarity.\r\nWhile all the team nee… [+11732 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Peter King on NBC Sports","title":"Peter King’s NFL Mock Draft","description":"Peter King's latest Football Morning in America column features his first, and only, NFL mock draft.","url":"https://sports.yahoo.com/peter-king-nfl-mock-draft-045104303.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/.8hPEePCvqcnRXzjNaYN6Q--~B/aD04NDg7dz0xNTA2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/peter_king_on_nbc_sports_543/ce85cfca1f947e90ea75d9545d26395e","publishedAt":"2019-04-22T04:51:04Z","content":"We live in a society (I sound like Costanza) that screams Fake News! when something seems just too obvious. We need to face reality, folks. When Cards GM Steve Keim walks into a meeting with club president Michael Bidwill today in Tempe to discuss the fate of… [+21987 chars]"},{"source":{"id":null,"name":"Hellogiggles.com"},"author":"Madison Vanderberg","title":"If you can only watch one Netflix trailer this week, make sure it’s Knock Down The House","description":"The day after Donald Trump was elected, Rachel Lears knew she had to do something. The filmmaker reached out to Brand New Congress and Justice Democrats in hopes of finding progressive women running for Congress in the 2018 midterm election that she could pro…","url":"https://hellogiggles.com/news/netflix-knock-down-the-house-alexandria-ocasio-cortez/","urlToImage":"https://images.hellogiggles.com/uploads/2019/04/22121101/aoc-knock-down-the-house.png","publishedAt":"2019-04-22T19:21:28Z","content":null},{"source":{"id":null,"name":"Amazonbookreview.com"},"author":"Adrian Liang","title":"Women Call the Shots in Jenna Glass’s Epic Fantasy “The Women’s War”","description":"Veteran author Jenna Glass takes to epic fantasy with a reimagining of a world in which one spell upends the power hierarchy of gendered magic in ways no one fully expects.","url":"https://www.amazonbookreview.com/post/dfbeb166-13fc-417f-9f94-49dd5de1a332/women-call-the-shots-in-jenna-glass-s-epic-fantasy-the-women-s-war","urlToImage":null,"publishedAt":"2019-04-22T18:17:21Z","content":"Jenna Glass’s The Women’s War opens with a bang: Discarded by her royal husband decades ago for a marriage alliance with another kingdom, the abbess of the Abbey of the Unwanted unleashes a spell that catastrophically changes the magic system that powers seve… [+6948 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Dennis Dodd","title":"Find it tough to empathize with college football officials? Try being one of them","description":"You are aware of the pressures, but do you really know what referees go through over the course of a season?","url":"https://www.cbssports.com/college-football/news/find-it-tough-to-empathize-with-college-football-officials-try-being-one-of-them/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/22/3838ad7c-77a0-4a40-bec0-8e9cc3caa2a0/thumbnail/770x433/7bcd4eaf2310ba8986b4408db10a32c3/sec-officials-huddling.jpg","publishedAt":"2019-04-22T15:43:24Z","content":"ATHENS, Ga. -- You look like you know what you're doing. \r\nThat's a compliment -- I think -- paid to me by Kirby Smart in front of God, country and Sanford Stadium came before the start of Georgia's spring game on Saturday.\r\nMaybe the uniform had something to… [+7804 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"R.J. White","title":"Seven-round 2019 NFL Mock Draft: Full breakdowns for all 32 teams, with 34 trades and all the picks","description":"What might your team do in every round of the 2019 NFL Draft? Here's a look","url":"https://www.cbssports.com/nfl/draft/news/seven-round-2019-nfl-mock-draft-full-breakdowns-for-all-32-teams-with-34-trades-and-all-the-picks/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2017/04/28/7fea5bb6-1fb8-4222-8765-90baf91fe781/thumbnail/770x433/c87b5ba8d3d54f8bd0b11fe81b7bad7e/rogergoodell.jpg","publishedAt":"2019-04-22T19:00:14Z","content":"You may have seen seven-round mock drafts before, and it's possible you've even seen some seven-rounders that include team-by-team breakdowns of each draft class. But have you see a seven-round mock draft with team-by-team breakdowns that includes a whopping … [+71217 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"JONATHAN J. COOPER","title":"Arizona joins 47 other states with cellphone-driving law","description":"PHOENIX (AP) — Arizona ended a decade of resistance to restrictions on using a cellphone while driving when Gov. Doug Ducey signed a law Monday outlawing holding a phone behind the wheel. It is now the 48th state to ban texting and the 18th to ban hand-held p…","url":"https://www.seattletimes.com/business/arizona-joins-47-other-states-with-cellphone-driving-law/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/urn-publicid-ap-org-c3ec7e9bc930487a8a7d990b11c56c51Driving_Cellphones_88040-1200x630.jpg","publishedAt":"2019-04-22T22:11:35Z","content":"PHOENIX (AP) Arizona ended a decade of resistance to restrictions on using a cellphone while driving when Gov. Doug Ducey signed a law Monday outlawing holding a phone behind the wheel.\r\nIt is now the 48th state to ban texting and the 18th to ban hand-held ph… [+2483 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Free-agent pickups ease pressure on Packers at draft","description":"GREEN BAY, Wis. (AP) — Having signed four potential starters in free agency, the Green Bay Packers enter this week’s draft looking to add the missing ingredients to a team that has missed the playoffs the last two seasons. “With some of the things that we’ve …","url":"https://www.seattletimes.com/sports/free-agent-pickups-ease-pressure-on-packers-at-draft/","urlToImage":"https://static.seattletimes.com/wp-content/uploads/2019/04/urn-publicid-ap-org-dd800cebe64b4117b867240303a33577Packers_Draft_Preview_Football_70923-1200x630.jpg","publishedAt":"2019-04-22T20:02:57Z","content":"GREEN BAY, Wis. (AP) Having signed four potential starters in free agency, the Green Bay Packers enter this week’s draft looking to add the missing ingredients to a team that has missed the playoffs the last two seasons.\r\n“With some of the things that we’ve d… [+3178 chars]"},{"source":{"id":null,"name":"Kiplinger.com"},"author":"Michael LaMarche, Investment Adviser","title":"Build a Retirement Plan That Provides Paychecks AND Playchecks","description":"If you don't have an income plan in place, how can you feel free to have a little fun in retirement? Here's how to create paychecks to cover your expenses and \"playchecks\" to cover the rest.","url":"https://www.kiplinger.com/article/retirement/T037-C032-S014-for-retirement-you-need-paychecks-and-playchecks.html","urlToImage":"http://www.kiplinger.com/kipimages/pages/20339.jpg","publishedAt":"2019-04-22T11:16:58Z","content":"If you don't have an income plan in place, how can you feel free to have a little fun in retirement? Here's how to create paychecks to cover your expenses and \"playchecks\" to cover the rest.If youre worried about not having enough money saved to retire, you c… [+5899 chars]"},{"source":{"id":null,"name":"Bitchmedia.org"},"author":"Guest","title":"Clip Artists","description":"couponing Adrienne Rose Bitar Illustration by Gabi de León Coupon Goddess. Money-Saving Mom. The Krazy Coupon Lady. The Coupon Divas. Super Coupon Woman. The past decade has witnessed the development of an entire couponing subculture, spawning websites, books…","url":"https://www.bitchmedia.org/article/extreme-couponing-american-housewives","urlToImage":null,"publishedAt":"2019-04-22T17:35:38Z","content":null},{"source":{"id":null,"name":"Rawstory.com"},"author":"Matthew Chapman","title":"Measles epidemic on track to be the worst in nearly 20 years: report","description":"According to CNN, the Centers for Disease Control and Prevention reports 626 cases of measles so far this year, with new cases being reported in That puts this year’s outbreak within 42 cases of breaking the record set in 2014 — which puts this year on track …","url":"https://www.rawstory.com/2019/04/measles-epidemic-track-worst-nearly-20-years-report/","urlToImage":"https://www.rawstory.com/wp-content/uploads/2019/04/1A472DF2-280B-4DD5-A1D4-53F6D1B350F9-800x430.jpeg","publishedAt":"2019-04-22T15:07:01Z","content":"According to CNN, the Centers for Disease Control and Prevention reports 626 cases of measles so far this year, with new cases being reported in\r\n# p #1_6 # ad skipped = NULL #\r\nThat puts this year’s outbreak within 42 cases of breaking the record set in 2014… [+1441 chars]"},{"source":{"id":null,"name":"Dailycaller.com"},"author":"Mary Margaret Olohan","title":"Netflix Drops Trailer For Its $10 Million AOC Documentary","description":"Netflix released the trailer for the documentary \"Knock Down The House\" featuring Democratic New York Rep. Alexandria Ocasio-Cortez and 3 other women.","url":"https://dailycaller.com/2019/04/22/netflix-aoc-documentary/","urlToImage":"https://cdn01.dailycaller.com/wp-content/uploads/2019/04/AOC-1-e1555957279839.jpg","publishedAt":"2019-04-22T19:13:20Z","content":"Netflix released a trailer Monday for the documentary “Knock Down The House” featuring Democratic New York Rep. Alexandria Ocasio-Cortez and three other women politicians.\r\n“Knock Down The House” releases only on Netflix on May 1, 2019 and depicts the 2018 ra… [+3348 chars]"},{"source":{"id":null,"name":"Dailycaller.com"},"author":"Betsy Rothstein","title":"Morning Mirror: Sarah Huckabee Sanders Has A Dry Response To April Ryan’s Decapitation Wish","description":"Inside the Bubble: Quotes from Washington journalists, lawmakers, pundits, TV personalities and political writers everywhere. Some will be mocked.","url":"https://dailycaller.com/2019/04/22/sarah-sanders-dry-response-april-ryan-decapitation-wish/","urlToImage":"https://cdn01.dailycaller.com/wp-content/uploads/2019/03/mm-morning1-e1552506477221.png","publishedAt":"2019-04-22T15:57:23Z","content":"Quote of the Day:\r\n“I have had reporters say a lot of things about me. They said I should be choked. I should deserve a lifetime of harassment. I certainly never had anybody say I should be decapitated. …I think it just once again proves why this journalist i… [+9682 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Travis Andersen","title":"Mastermind of college admissions cheating scandal asks court for permission to visit son","description":"A lawyer for William Rick Singer, 58, of Newport Beach, Cali., filed a brief motion Sunday in US District Court in Boston requesting that his client be allowed to travel to Missouri to visit his son, who wasn’t named.","url":"https://www.bostonglobe.com/metro/2019/04/22/mastermind-college-admissions-cheating-scandal-asks-court-for-permission-visit-son/jADUkdVpCPMs9tAoOLIfUN/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/22/BostonGlobe.com/Metro/Images/61233ea871a345a39614717a76581d5f-61233ea871a345a39614717a76581d5f-0.jpg","publishedAt":"2019-04-22T16:53:41Z","content":"As he awaits sentencing, the admitted mastermind of the nationwide college admissions cheating scandal that exploded into the headlines last month wants permission to visit his son, who’s currently enrolled in college in Missouri, records show.\r\nA lawyer for … [+3770 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Travis Andersen","title":"Former mob boss Frank Salemme moved to medical prison facility","description":"Former New England Mafia boss Francis “Cadillac Frank” Salemme, serving a life sentence for the 1993 slaying of a Southie nightclub owner, has been moved from a Brooklyn prison to a federal medical lockup in Missouri, records show.","url":"https://www.bostonglobe.com/metro/2019/04/22/former-mob-boss-frank-salemme-moved-medical-prison-facility/Bnt3mNxL2vRx0VeyAmfSNL/story.html","urlToImage":"https://www.bostonglobe.com//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.jpg","publishedAt":"2019-04-22T14:57:12Z","content":"Former New England Mafia boss Francis “Cadillac Frank” Salemme, serving a life sentence for the 1993 slaying of a Southie nightclub owner, has been moved from a Brooklyn prison to a federal medical lockup in Missouri, records show.\r\nSalemme, 85, is currently … [+2003 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Alan Blinder and William Widmer","title":"Divining disaster: inside the US Storm Prediction Center","description":"NORMAN, Okla. — The atmosphere was in turmoil before sunrise one day last week, and more than 58 million people were at risk.","url":"https://www.bostonglobe.com/news/nation/2019/04/21/divining-disaster-inside-storm-prediction-center/ny9VekablzlLIzAa6IutgL/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/22/BostonGlobe.com/National/Images/088d9aff-2e10-4c09-b204-a2ce6ecefa23.jpg","publishedAt":"2019-04-22T00:41:37Z","content":"NORMAN, Okla. — The atmosphere was in turmoil before sunrise one day last week, and more than 58 million people were at risk.\r\nA tornado threat was stalking the Texas and Oklahoma panhandles, and the Dallas-Fort Worth metroplex. Damaging winds were a danger a… [+9387 chars]"},{"source":{"id":null,"name":"Bostonglobe.com"},"author":"Robert Barnes","title":"Justices to examine 2020 Census question","description":"The stakes could hardly be higher. The enumeration clause requiring a count of the nation’s population every 10 years is ‘‘the very foundation of our democratic system,’’ wrote Judge Richard Seeborg of California.","url":"https://www.bostonglobe.com/news/nation/2019/04/21/justices-examine-census-question/pDTOFlyAYCUUDO2R5mhPbN/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2019/04/21/BostonGlobe.com/National/Images/7cd77d8a1b2f441abf5d90049d2153b0-7cd77d8a1b2f441abf5d90049d2153b0-0.jpg","publishedAt":"2019-04-22T00:57:30Z","content":"WASHINGTON — The Supreme Court this week takes up the most consequential Trump administration initiative since last term’s travel ban, with the justices considering whether a question about citizenship can be added to the 2020 Census.\r\nThe restrictions on tra… [+9020 chars]"},{"source":{"id":null,"name":"Kicksonfire.com"},"author":"jamalkhan","title":"First Look At The Jayson Tatum x Nike Air Max 97","description":"The Swoosh is reportedly dropping a special Jayson Tatum x Nike Air Max 97, designed by Boston Celtics forward Jayson Tatum. This iteration of the runner looks to be an homage to Tatum’s Chaminade College Preparatory School in Creve Coeur, Missouri. The shoe …","url":"https://www.kicksonfire.com/jayson-tatum-x-nike-air-max-97-first-look/","urlToImage":"https://cdn5.kicksonfire.com/wp-content/uploads/2019/04/Jayson-Tatum-x-Nike-Air-Max-97-4.jpg?x77451","publishedAt":"2019-04-22T13:45:22Z","content":null},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"Forbes Names Commerce Bank One of the Best Midsize Employers in America for the Third Consecutive Year","description":"ST. LOUIS--(BUSINESS WIRE)--Forbes recently published their 2019 America’s Best Midsize Employers List, ranking Commerce Bank in the top one-third among a selection of 500 employers across the country. This marks the third consecutive year Commerce has been n…","url":"https://www.businesswire.com/news/home/20190422005133/en/Forbes-Names-Commerce-Bank-Midsize-Employers-America","urlToImage":"https://mms.businesswire.com/media/20190422005133/en/666666/23/2018_CB_Green_342.jpg","publishedAt":"2019-04-22T10:12:39Z","content":"ST. LOUIS--(BUSINESS WIRE)--Forbes recently published their 2019 Americas Best Midsize Employers \r\n List, ranking Commerce Bank in the top one-thirdamong a \r\n selection of 500 employers across the country. This marks the third \r\n consecutive year Commerce has… [+4540 chars]"},{"source":{"id":null,"name":"Businesswire.com"},"author":null,"title":"$10K Grant Helps Provide New Home for Texas Military Family","description":"WEATHERFORD, Texas--(BUSINESS WIRE)--A U.S. Army veteran received the keys to her new custom-built, mortgage-free home thanks in part to a $10,000 grant from FHLB Dallas.","url":"https://www.businesswire.com/news/home/20190422005585/en/10K-Grant-Helps-Provide-New-Home-Texas","urlToImage":"https://mms.businesswire.com/media/20190422005585/en/717550/23/M02A0310.jpg","publishedAt":"2019-04-22T23:11:43Z","content":"WEATHERFORD, Texas--(BUSINESS WIRE)--Charlotte Ferris joined the U.S. Army in 2002 at age 18 because she \r\n wanted to serve her country and see the world. Her experience initially \r\n took her to Missouri, then Fort Campbell, Kentucky, before she was \r\n deploy… [+4409 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"State Highlights: Washington State Lawmaker Angers Rural Nurses, Saying They Probably Play Cards; 10 Mass. Health Systems Become Partners, Save Millions","description":"Media outlets report on news from Washington, Massachusetts, Idaho, Utah, Florida, Ohio, Iowa, Wisconsin, Missouri, California, Colorado and New Hampshire.","url":"https://khn.org/morning-breakout/state-highlights-washington-state-lawmaker-angers-rural-nurses-saying-they-probably-play-cards-10-mass-health-systems-become-partners-save-millions/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-22T12:36:46Z","content":"Media outlets report on news from Washington, Massachusetts, Idaho, Utah, Florida, Ohio, Iowa, Wisconsin, Missouri, California, Colorado and New Hampshire.\r\nThe Associated Press:\r\nWashington State Lawmaker's Comments Raise Ire Of NursesA Washington state lawm… [+7611 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"Viewpoints: If Only U.S. Health Policy Was This Good; Why Didn’t People Care About Opioid Epidemic Until It Hit White, Middle-Class America?","description":"Opinion writers weigh in on these health topics and others.","url":"https://khn.org/morning-breakout/viewpoints-if-only-u-s-health-policy-was-this-good-why-didnt-people-care-about-opioid-epidemic-until-it-hit-white-middle-class-america/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-22T12:36:51Z","content":"Opinion writers weigh in on these health topics and others.\r\nThe New York Times:\r\nWhat Can The U.S. Health System Learn From Singapore?Singapores health care system is sometimes held up as an example of excellence, and as a possible model for what could come … [+5190 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"The Flu Season That Just Won’t End: Second Viral Wave Is Pushing Otherwise Mild Year Into The Record Books","description":"The current season began the week of Thanksgiving, a typical start time, but in mid-February, a nastier strain started causing more illnesses and driving up hospitalizations. In other public health news: over-treatment, suicide, exercise, depression, choleste…","url":"https://khn.org/morning-breakout/the-flu-season-that-just-wont-end-second-viral-wave-is-pushing-otherwise-mild-year-into-the-record-books/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-22T12:36:42Z","content":"The current season began the week of Thanksgiving, a typical start time, but in mid-February, a nastier strain started causing more illnesses and driving up hospitalizations. In other public health news: over-treatment, suicide, exercise, depression, choleste… [+9134 chars]"},{"source":{"id":null,"name":"Khn.org"},"author":null,"title":"First Edition: April 22, 2019","description":"Today's early morning highlights from the major news organizations.","url":"https://khn.org/morning-breakout/first-edition-april-22-2019/","urlToImage":"https://s2.wp.com/wp-content/themes/vip/kaiser-healthnews-2017/static/images/placeholder.jpg","publishedAt":"2019-04-22T10:27:28Z","content":"Today's early morning highlights from the major news organizations.\r\nKaiser Health News:\r\nDestination Limbo: Health Suffers Among Asylum Seekers In Crowded Border ShelterImmigrants from Mexico and Central America seeking asylum in the United States frequently… [+25386 chars]"},{"source":{"id":"independent","name":"Independent"},"author":"Chris Riotta, Chris Riotta","title":"Missouri teacher 'hired hitman to kill seven-year-old boy he molested'","description":"The teacher is accused of attempting to order the child's murder from jail","url":"https://www.independent.co.uk/news/world/americas/deonte-taylor-teacher-hitman-child-molest-missouri-elementary-school-a8881346.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/22/15/deonte-0.jpg","publishedAt":"2019-04-22T15:48:46Z","content":"A former teacher accused of molesting a seven-year-old student has pleaded not guilty to charges that he attempted to hire a hitman from jail to kill the alleged victim and his family. \r\nDeonte Taylor, a 36-year-old who previously worked as a teachers aide at… [+30510 chars]"},{"source":{"id":null,"name":"Sputniknews.com"},"author":"Sputnik","title":"Suburban Syphilis: Rural US Racked by Rising STD Rates","description":"Syphilis, a sexually transmitted disease once largely contained, is now surging in a new demographic ‒ suburban and rural parts of the US Midwest, where health care funding cuts, a lack of experience among some small town doctors and conservative attitudes ab…","url":"https://sputniknews.com/society/201904221074362741-rural-midwest-skyrocketing-syphilis/","urlToImage":"https://cdn5.img.sputniknews.com/images/103629/51/1036295191.jpg","publishedAt":"2019-04-22T19:17:00Z","content":"Syphilis, a sexually transmitted disease once largely contained, is now surging in a new demographic suburban and rural parts of the US Midwest, where health care funding cuts, a lack of experience among some small town doctors and conservative attitudes abou… [+5842 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"R.J. White","title":"Chicago Bears mock draft 2019: Seven rounds, picks, team needs, big board, multiple options for every selection","description":"Get ready for the NFL Draft with everything you need to know about the Chicago Bears","url":"https://www.cbssports.com/nfl/draft/news/chicago-bears-mock-draft-2019-seven-rounds-picks-team-needs-big-board-multiple-options-for-every-selection/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/02/04/39d830a4-0a7b-46d7-8f96-e487e2c88920/thumbnail/770x433/5575e7bd0944a10882f2653b2f5d3875/usatsi-11637075-miles-sanders-penn-state-2018-1400.jpg","publishedAt":"2019-04-22T17:11:08Z","content":"If you're a Bears fan, the draft likely won't begin for you until near the end of the second day. That's because the Bears don't have a first-round pick thanks to the Khalil Mack trade. They don't even have a second-round pick after trading up for Anthony Mil… [+3720 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"R.J. White","title":"New York Giants mock draft 2019: Seven rounds, picks, team needs, big board, multiple options for every selection","description":"Get ready for the NFL Draft with everything you need to know about the New York Giants","url":"https://www.cbssports.com/nfl/draft/news/new-york-giants-mock-draft-2019-seven-rounds-picks-team-needs-big-board-multiple-options-for-every-selection/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/26/082ddde9-5f19-413e-bc63-28ea480ba7d9/thumbnail/770x433/995767fe373387ee0d74d62970016d93/c-devin-white.jpg","publishedAt":"2019-04-22T17:02:07Z","content":"The Giants (along with the Raiders) are going to be the storyline of the first round of the draft, holding the sixth and 17th picks after shipping Odell Beckham to Cleveland. But if this class is going to help build the foundation of a playoff contender in fu… [+5590 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Jason La Canfora","title":"2019 NFL Draft: How many quarterbacks will be first-round picks? Setting over/unders for every position","description":"If you're picking in the top half of the draft and need a receiver or corner, you should probably wait until Round 2","url":"https://www.cbssports.com/nfl/news/2019-nfl-draft-how-many-quarterbacks-will-be-first-round-picks-setting-overunders-for-every-position/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/26/87548f72-b338-490e-a79b-57b727daab24/thumbnail/770x433/f73f37c63c10a2e5ea42e322458311e8/kyler-murray-oklahoma.jpg","publishedAt":"2019-04-22T17:29:49Z","content":"The draft is, finally, just a few days away, and things are starting to come into focus. Well, at least somewhat.\r\nTeams are deep into their pre-draft meetings, pouring over each position group as they set the boards for the final time. (Well, final time unle… [+5647 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"2019 NFL Draft receiver rankings: Breaking down skills of top WRs, from route-running to fits on the field","description":"This is the third installment in a series that ranks prospects by the skills most vital to their position","url":"https://www.cbssports.com/nfl/draft/news/2019-nfl-draft-receiver-rankings-breaking-down-skills-of-top-wrs-from-route-running-to-fits-on-the-field/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/02/13/ef043da9-e669-4f94-b274-9d6812a6c2a0/thumbnail/770x433/408185430cd9cbbef801cdd17ac13131/aj-brown-ole-miss.jpg","publishedAt":"2019-04-22T19:30:22Z","content":"I fell in love this wide receiver draft class a long time ago, during the mid-way point of the 2018 season, well before it collectively scorched the turf at Lucas Oil Stadium at the combine. \r\nWith an unusually high amount of big, physical power forwards and … [+5944 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Chris Trapasso","title":"NFL Draft 2019: The running back prospects who compare to James Conner, James White, Reggie Bush and more","description":"This RB class might not be rife with elite talent, but there could be a Maurice Jones-Drew or Dalvin Cook lurking","url":"https://www.cbssports.com/nfl/draft/news/nfl-draft-2019-the-running-back-prospects-who-compare-to-james-conner-james-white-reggie-bush-and-more/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/09/25/4680f23c-7aaa-4876-ba52-1c0c6a61ddae/thumbnail/770x433/af16bd60613045270b1eee06474fdba6/cowboys.jpg","publishedAt":"2019-04-22T15:58:11Z","content":"The 2019 running back draft class pales in comparison to the Saquon Barkley-led group of a year ago. \r\nTo me, the theme of this iteration of running back prospects is more Day Two value selections than highly sought after first-round talents. Important note: … [+9096 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Kyle Boone","title":"2019 NBA Draft Top 100 Big Board: A look at the biggest risers and fallers after the declaration deadline","description":"Who's moving up and down the Top 100 Big Board of NBA Draft prospects","url":"https://www.cbssports.com/college-basketball/news/2019-nba-draft-top-100-big-board-a-look-at-the-biggest-risers-and-fallers-after-the-declaration-deadline/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/03/31/a6e6b4e1-dab8-4890-8196-e1e0393cc565/thumbnail/770x433/8fc8e4a59f9ec8fde0c96c2aba951005/carsen-edwards.png","publishedAt":"2019-04-22T16:19:09Z","content":"The deadline for underclassmen to declare for the upcoming NBA Draft officially came and went Sunday, and with it, only a few surprises have emerged -- none of which are particularly consequential (yet) with the NCAA's new rule that allows for all underclassm… [+10507 chars]"},{"source":{"id":null,"name":"Themarthablog.com"},"author":"Martha Stewart","title":"Preparing and Planting Peas","description":"Everybody is thinking about the spring gardens, including all of us here at my Bedford, New York farm. We’ve already planted many seeds in the vegetable garden - [&hellip...","url":"https://www.themarthablog.com/2019/04/preparing-and-planting-peas.html","urlToImage":null,"publishedAt":"2019-04-22T09:31:35Z","content":"Everybody is thinking about the spring gardens, including all of us here at my Bedford, New York farm. Weve already planted many seeds in the vegetable garden - radishes, carrots, parsnips, and the seasons first peas.\r\nPeas thrive in cool weather, and young p… [+5192 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Bill Weir, CNN Climate Correspondent","title":"Climate candidate Jay Inslee meets resistance in Iowa floods","description":"Washington Gov. Jay Inslee has made tackling climate change the heart of his bid to be the 2020 Democratic nominee for President. But the flood-hit town of Hamburg, Iowa may not be fertile ground for his message.","url":"https://www.cnn.com/2019/04/22/politics/iowa-inslee-climate-weir-wxc/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190419152827-gov-jay-inslee-in-iowa-super-tease.jpg","publishedAt":"2019-04-22T19:29:02Z","content":"Hamburg, Iowa (CNN)Washington Gov. Jay Inslee has staked his 2020 campaign on climate change -- and here, in America's heartland, he looked to test whether the floodwaters of Iowa could prove to be fertile ground for his bid. \r\nIt's a place that demonstrates … [+6137 chars]"},{"source":{"id":null,"name":"Nationalinterest.org"},"author":"James Holmes","title":"Saddam Hussein Could Have Sunk America's Most Powerful Battleship Ever","description":"James Holmes Security, Middle East However, there is a few conditions we need to discuss. Read on. Could Saddam Hussein’s armed forces have sunk a U.S. Navy battleship? That might seem like a question destined to launch an excursion into alt-history, but it w…","url":"https://nationalinterest.org/blog/buzz/saddam-hussein-could-have-sunk-americas-most-powerful-battleship-ever-53722","urlToImage":"https://nationalinterest.org/sites/default/files/main_images/M3.jpg","publishedAt":"2019-04-22T18:13:00Z","content":"Could Saddam Husseins armed forces have sunk a U.S. Navy battleship?\r\nThat might seem like a question destined to launch an excursion into alt-history, but it was far from hypothetical to the 3,200 or so crewmen of the battleships USS Wisconsin and Missouri w… [+9061 chars]"},{"source":{"id":null,"name":"Civileats.com"},"author":"Cinnamon Janzer","title":"After Midwest Flooding, Volunteer Hay Drops Provide a Lifeline for Farmers","description":"“I’ve never had anything like this in my 40 years,” says Brad Cluck, a beef and hay rancher eight miles east of Omaha, whose hay meadow was completely drowned in the wake of the recent Midwest flooding. After losing a season’s worth of feed for his animals, C…","url":"https://civileats.com/2019/04/22/after-midwest-flooding-volunteer-hay-drops-provide-a-lifeline-for-farmers/","urlToImage":"https://civileats.com/wp-content/uploads/2019/04/190422-farm-rescue-midwest-floods-rural-communities-support-Volunteer-and-Farmer-3.jpg","publishedAt":"2019-04-22T09:00:17Z","content":"Ive never had anything like this in my 40 years, says Brad Cluck, a beef and hay rancher eight miles east of Omaha, whose hay meadow was completely drowned in the wake of the recent Midwest flooding.\r\nAfter losing a seasons worth of feed for his animals, Cluc… [+8606 chars]"},{"source":{"id":null,"name":"Denverpost.com"},"author":"Kyle Fredrickson","title":"Why Andrew Wingard is rising on Todd McShay’s NFL draft board","description":"Andrew Wingard entered the interview rounds of the NFL Scouting Combine in February expecting to face difficult questions. The former Wyoming safety had preconceived notions to bust. Let’s begin with the most pressing topic.","url":"https://www.denverpost.com/2019/04/22/andrew-wingard-wyoming-nfl-draft/","urlToImage":"https://www.denverpost.com/wp-content/uploads/2019/04/COWBOYS_DUCKS__1AO2318x.jpg?w=1024&h=683","publishedAt":"2019-04-22T14:28:32Z","content":"Andrew Wingard entered the interview rounds of the NFL scouting combine in February expecting to face difficult questions. The former Wyoming safety had preconceived notions to bust. Lets begin with the most pressing topic.\r\nA lot of people, Wingard said, ask… [+3824 chars]"},{"source":{"id":null,"name":"Hotnewhiphop.com"},"author":"Alexander Cole","title":"Jayson Tatum's Nike Air Max 97 Collab Revealed: Details","description":"The young Celtics star is getting his own non-basketball sneaker. Jayson Tatum is one of the most promising young stars on the Boston Celtics and has already gotten himself a deal with Nike. Tatum is one of many young players, Kyle Kuzma included, who is rock…","url":"https://www.hotnewhiphop.com/jayson-tatums-nike-air-max-97-collab-revealed-details-news.77911.html","urlToImage":"https://www.hotnewhiphop.com/image/740x416/cover/1555946584_f2afec18e732b13ea3bc9aee0b461510.jpg/2a2cafc99467226352d348357355c967/1555946584_818f6c78462deaafc65a1217c3b4b85f.jpg","publishedAt":"2019-04-22T15:40:18Z","content":"Jayson Tatum is one of the most promising young stars on the Boston Celtics and has already gotten himself a deal with Nike. Tatum is one of many young players, Kyle Kuzma included, who is rocking the futuristic Nike Adapt BB out on the court. Now, instead of… [+721 chars]"},{"source":{"id":null,"name":"Bostonherald.com"},"author":"Laurel J. Sweet","title":"Mastermind behind college admissions scandal seeks OK to visit his son at college","description":"The California guidance counselor who admits to being the architect of the biggest college admissions swindle ever prosecuted is asking the feds to cut him some slack so he can spend time with his own son - at college.","url":"https://www.bostonherald.com/2019/04/21/mastermind-behind-college-admissions-scandal-seeks-ok-to-visit-his-son-at-college/","urlToImage":"https://www.bostonherald.com/wp-content/uploads/2019/03/0313-NWS-BHR-L-031119Singerfn06-e1552432646290.jpg?w=1024&h=626","publishedAt":"2019-04-22T00:22:53Z","content":"The California guidance counselor who admits to being the architect of the biggest college admissions scam ever prosecuted is asking the feds to let him travel so he can spend time with his own child — at college.\r\nThe son of “Operation Varsity Blues” masterm… [+2666 chars]"},{"source":{"id":"newsweek","name":"Newsweek"},"author":"Christina Zhao","title":"Teacher Charged With Hiring Hitman to Kill 10-Year-Old Student He Allegedly Molested","description":"Deonte Taylor, 36, he allegedly removed a 7-year-old male student from class and took him to another room where he engaged the boy in oral sex in 2015. Three years later, Taylor allegedly hired a hitman to try and silence the alleged victim and his family.","url":"https://www.newsweek.com/teacher-charged-hiring-hitman-kill-10-year-old-student-he-allegedly-molested-1402361","urlToImage":"https://s.newsweek.com/sites/www.newsweek.com/files/styles/full/public/2019/04/21/screen-shot-2019-04-22-10.png","publishedAt":"2019-04-22T00:09:04Z","content":"A St. Louis, Missouri teacher has been accused of molesting a 7-year-old student outside of class and then attempting to hire a hitman to kill the child and his family three years later.\r\nWhen Deonte Taylor, 36, was a teachers assistant at Lusher Elementary i… [+2618 chars]"},{"source":{"id":null,"name":"Wng.org"},"author":"llangdon","title":"High hopes for abortion survivors in Texas","description":"Amid a nationwide debate over late-term abortion and infantide, Texas became the latest state to draft legal protections for babies born alive after an abortion attempt. Last week, the Texas House of Representatives approved a born-alive bill and sent it to t…","url":"https://world.wng.org/content/high_hopes_for_abortion_survivors_in_texas","urlToImage":"https://world.wng.org/sites/default/files/Vitals4-22.1b_0.jpg","publishedAt":"2019-04-22T20:16:33Z","content":"Amid a nationwide debate over late-term abortion and infantide, Texas became the latest state to draft legal protections for babies born alive after an abortion attempt. Last week, the Texas House of Representatives approved a born-alive bill and sent it to t… [+3439 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Josh Hafner, USA TODAY","title":"Up to 300 teenagers involved in fight at amusement park: 'No one could leave'","description":"Up to 300 teens were drawn into a ruckus that broke out at Worlds of Fun in Kansas City, Missouri, authorities said.","url":"https://www.usatoday.com/story/news/nation/2019/04/22/worlds-fun-fight-kansas-city-300-teenagers-park-police/3538688002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/22/USAT/606b2762-4ac5-4108-bf95-ff1e422e9d6c-spinning_dragons.JPG?crop=3071,1727,x0,y294&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-22T17:03:00Z","content":"Worlds of Fun's Spinning Dragons, a five-story tall roller coaster that debuted in 2004.\r\n (Photo: WORLDS OF FUN/ OCEANS OF FUN)\r\nA massive brawl erupted Saturday night at an amusement park in Missouri that included about 300 teenagers, police said.\r\nAn overw… [+2154 chars]"},{"source":{"id":null,"name":"Counterpunch.org"},"author":"Binoy Kampmark","title":"Julian Assange as Neuroses","description":"Julian Assange continues to ripple and roam as a cipher through the political and media scape of the world. Detained in Belmarsh maximum security prison, the sort of stately abode only reserved for the most dangerous of criminals, many with indeterminate sent…","url":"https://www.counterpunch.org/2019/04/22/julian-assange-as-neuroses/","urlToImage":"https://www.counterpunch.org/wp-content/dropzone/2018/06/cp-og-logo.png","publishedAt":"2019-04-22T08:57:49Z","content":"Julian Assange continues to ripple and roam as a cipher through the political and media scape of the world.  Detained in Belmarsh maximum security prison, the sort of stately abode only reserved for the most dangerous of criminals, many with indeterminate sen… [+5545 chars]"},{"source":{"id":null,"name":"Blcklst.com"},"author":"Scott Myers","title":"Keys to the Screenwriting Craft: Think Concepts","description":"The foundation of a good script is a strong story concept. Continue reading on Go Into The Story »","url":"https://gointothestory.blcklst.com/keys-to-the-screenwriting-craft-think-concepts-512698d239c7","urlToImage":"https://cdn-images-1.medium.com/max/1200/1*EaMR9sinryCMwGrrGdvgjA.jpeg","publishedAt":"2019-04-22T11:11:00Z","content":"The foundation of a good script is a strong story concept.\r\nIt started with this GITS post years ago:\r\nWatch movies. Read scripts. Write pages.\r\nLong-time followers of my blog are familiar with this screenwriting mantra. In fact, Annika Wood was kind enough t… [+3405 chars]"},{"source":{"id":null,"name":"Thegrio.com"},"author":"Kia Morgan-Smith","title":"Parent of boy who was suspended for punching racist bully says school did nothing to prevent it","description":"With heightened awareness about kids committing suicide because of relentless bullying at school, Margo Boyd thinks her son had a right to stand up for himself against racist taunts. But when Boy’s son was reportedly suspended from his Missouri school for pun…","url":"http://thegrio.com/2019/04/22/parent-of-boy-who-was-suspended-for-punching-racist-bully-says-school-did-nothing-to-prevent-it/","urlToImage":"https://thegrio.com/wp-content/uploads/2018/03/racism-e1521124096337.jpg","publishedAt":"2019-04-22T12:24:27Z","content":"With heightened awareness about kids committing suicide because of relentless bullying at school, Margo Boyd thinks her son had a right to stand up for himself against racist taunts.\r\nBut when Boy’s son was reportedly suspended from his Missouri school for pu… [+2651 chars]"},{"source":{"id":null,"name":"Loyaltylobby.com"},"author":"John Ollila","title":"IHG Rewards Club 10,000 Points Per Night Hotels (April 2019)","description":"IHG Rewards Club releases PointBreaks hotels every two to three months that discount the usual award night price by 50%. These hotel go for 5,000, 10,000 and 15,000 points per night after the discount. There are, however, 330 Holiday Inn and Holiday Inn Expre…","url":"https://loyaltylobby.com/2019/04/22/ihg-rewards-club-10000-points-per-night-hotels-april-2019/","urlToImage":"https://loyaltylobby.com/wp-content/uploads/2019/04/IHG-Rewards-Club-10000-Points-Per-Night-Hotels.png","publishedAt":"2019-04-22T04:52:09Z","content":"IHG Rewards Club releases PointBreaks hotels every two to three months that discount the usual award night price by 50%. These hotel go for 5,000, 10,000 and 15,000 points per night after the discount.\r\nThere are, however, 330 Holiday Inn and Holiday Inn Expr… [+3674 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Chris Roling","title":"NFL Draft 2019: Latest Predictions, Odds and Rumors for Top Prospects","description":"NFL  draft week has arrived, which has only thrown a sense of urgency into a process ahead of the 2019 NFL draft that had previously seemed to be in a slumber...","url":"https://bleacherreport.com/articles/2832473-nfl-draft-2019-latest-predictions-odds-and-rumors-for-top-prospects","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/804/176/hi-res-e8ae364a2ad07119de2a1e855748e24c_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-22T15:12:18Z","content":"Brynn Anderson/Associated Press\r\nNFL draft week has arrived, which has only thrown a sense of urgency into a process ahead of the 2019 NFL draft that had previously seemed to be in a slumber. \r\nWith the beginning of the draft only days away, the rumors, specu… [+7746 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"NBC Sports Boston","title":"NFL draft rumors: Patriots have shown a 'ton of interest' in QB Will Grier","description":"NFL draft rumors: Patriots have shown a 'ton of interest' in QB Will Grier originally appeared on nbcsportsboston.com The New England Patriots currently are slated to close out the first round of the 2019 NFL Draft with pick No. and after passing on Louisvill…","url":"https://sports.yahoo.com/nfl-draft-rumors-patriots-shown-210848638.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/G22Oa5wOcnVdhS8ff.QnXg--~B/aD00MjQ7dz03NTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/355826560323b654581f16ce45e71587","publishedAt":"2019-04-22T21:08:48Z","content":"NFL draft rumors: Patriots have shown a 'ton of interest' in QB Will Grier originally appeared on nbcsportsboston.com\r\nThe New England Patriots currently are slated to close out the first round of the 2019 NFL Draft with pick No. 32, and after passing on Loui… [+1800 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Sports Illustrated","title":"Mock Draft: Kyler Murray Goes No. 1, Then Five Players Stand Out From the Pack","description":"With just four days until the draft, some decisions are becoming clear while others remain closely guarded secrets. With not enough players deserving of first-round grades to go around, here's how we see Thursday night playing out. Plus, more analysis of Russ…","url":"https://ca.sports.yahoo.com/news/mock-draft-kyler-murray-goes-061442821.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/_NAY1hgPTEcPSUSMshRxyw--~B/aD03MjQ7dz0xMzAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/sports_illustrated_941/675cac784c441608fddbacbbfcbff596","publishedAt":"2019-04-22T06:14:42Z","content":"The finish line is in sight. In under 100 hours, the Cardinals will take Kyler Murray with the first pick in the 2019 NFL draft. Or they wont. And thats sort of the story for each of the four quarterbacks atop this years classtheres a wide range of outcomes t… [+36010 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"The Associated Press","title":"Arizona joins 47 other states with cellphone-driving law","description":"Arizona ended a decade of resistance to restrictions on using a cellphone while driving when Gov. Doug Ducey signed a law Monday outlawing holding a phone behind the wheel","url":"https://abcnews.go.com/Technology/wireStory/arizona-joins-47-states-cellphone-driving-law-62562950","urlToImage":"https://s.abcnews.com/images/Technology/WireAP_d5959aa2be684d4e8384bf72eb46898c_16x9_992.jpg","publishedAt":"2019-04-22T22:13:27Z","content":"Arizona ended a decade of resistance to restrictions on using a cellphone while driving when Gov. Doug Ducey signed a law Monday outlawing holding a phone behind the wheel.\r\nIt is now the 48th state to ban texting and the 18th to ban hand-held phone use while… [+2470 chars]"},{"source":{"id":null,"name":"Mormonnewsroom.org"},"author":"http://www.mormonnewsroom.org","title":"Public Open House Begins for Oklahoma City Oklahoma Temple","description":"Salt Lake City | Monday, 22 April 2019 | The public is invited to visit the newly renovated Oklahoma City Oklahoma Temple of The Church of Jesus Christ of Latter-day Saints.","url":"http://www.mormonnewsroom.org/article/public-open-house-begins-for-oklahoma-city-oklahoma-temple?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+LDSNewsReleases+%28RSS%3A+LDSNewsReleases%29","urlToImage":"http://www.mormonnewsroom.org/media/1200x675/20190409_1351_CSmith_0915_2grass.jpg","publishedAt":"2019-04-22T00:00:00Z","content":"The public is invited to visit the newly renovated Oklahoma City Oklahoma Temple of The Church of Jesus Christ of Latter-day Saints. An open house begins Wednesday, April 24, 2019, and runs through Wednesday, May 1, 2019, excluding Sunday, April 28, 2019. Res… [+1178 chars]"},{"source":{"id":null,"name":"Houstonchronicle.com"},"author":"HoustonChronicle.com","title":"Breaking down 2019 Texas A&M football: Secondary","description":"Eighth in a position-by-position series looking at the 2019 Texas A&M Aggies. Today: Secondary. Who's back: Larry Pryor, sr.; Myles Jones, jr.; Charles Oliver, sr.; Debione Renfro, jr.; Keldrick Carper, jr.; Derrick Tucker, jr.; Clifford Chattman, jr.; Roney …","url":"https://www.houstonchronicle.com/sports/texas-sports-nation/college/article/Breaking-down-2019-Texas-A-M-football-Secondary-13785434.php","urlToImage":"https://s.hdnux.com/photos/01/01/66/76/17264542/4/rawImage.jpg","publishedAt":"2019-04-22T15:55:38Z","content":"Eighth in a position-by-position series looking at the 2019 Texas A&amp;M Aggies. Today: Secondary.\r\nWho’s back: Larry Pryor, sr.; Myles Jones, jr.; Charles Oliver, sr.; Debione Renfro, jr.; Keldrick Carper, jr.; Derrick Tucker, jr.; Clifford Chattman, jr.; R… [+2659 chars]"},{"source":{"id":null,"name":"Deseretnews.com"},"author":"Deseret News","title":"Morning links: BYU's Kalani Sitake, Matt Wells in SI article; Utah Lt. Gov. Cox pokes fun at James Harden","description":"SALT LAKE CITY — It's always good to go home, right? That's the premise of an angleSports Illustrated took while evaluating the success of college football coaches who returned to lead their alma maters. “While it can certainly be a valuable asset, alumni sta…","url":"https://www.deseretnews.com/article/900066989/morning-links-byus-kalani-sitake-matt-wells-in-si-article-utah-lt-gov-cox-pokes-fun-at-james-harden.html","urlToImage":"https://media.deseretdigital.com/file/758ea24582.jpg?crop=top:0|left:0|width:1200|height:630&quality=100&resize=width:1200&order=resize,crop&c=14&a=19509ab9","publishedAt":"2019-04-22T14:35:00Z","content":"SALT LAKE CITY Its always good to go home, right?\r\nThats the premise of an angle Sports Illustrated took while evaluating the success of college football coaches who returned to lead their alma maters.\r\nWhile it can certainly be a valuable asset, alumni statu… [+2665 chars]"},{"source":{"id":null,"name":"Investmentwatchblog.com"},"author":"alexmark","title":"Churches Have Become The #1 Target For Hate Attacks – An Average Of 105 Every Single Month","description":null,"url":"https://www.investmentwatchblog.com/churches-have-become-the-1-target-for-hate-attacks-an-average-of-105-every-single-month/","urlToImage":null,"publishedAt":"2019-04-22T14:27:59Z","content":"by Michael Snyder\r\nThe bombings in Sri Lanka have once again put a spotlight on the rising tide of violence against Christians all over the world.  According to Open Doors USA, an average of 105 churches and/or Christian buildings are burned or attacked every… [+6583 chars]"},{"source":{"id":null,"name":"Seekingalpha.com"},"author":"SA Dividend Announcements","title":"Southern Missouri declares $0.13 dividend","description":"Southern Missouri (NASDAQ:SMBC) declares $0.13/share quarterly dividend, in line with previous.Forward yield 1.67%Payable May 31; for shareholders of record May 15; ex-div May 14.See SMBC Dividend Sco","url":"https://seekingalpha.com/news/3452641-southern-missouri-declares-0_13-dividend","urlToImage":"https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png","publishedAt":"2019-04-22T22:03:00Z","content":null}]}