{"status":"ok","totalResults":426,"articles":[{"source":{"id":null,"name":"Greenentrepreneur.com"},"author":"Scott McGovern","title":"Pay Attention to These 6 Cannabis Industry Trends","description":"The weed businesses that thrived four years ago don't necessarily yield big profits today as new cannabis industry trends dictate the market.","url":"https://www.greenentrepreneur.com/article/332348","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/20190418180609-GettyImages-899527610-crop.jpeg","publishedAt":"2019-04-19T12:00:00Z","content":"April\r\n19, 2019\r\n7 min read\r\nOpinions expressed by Green Entrepreneur contributors are their own.\r\nCannabis industry trends evolve faster than most markets. Not only haven’t regulations been finalized, but methods of consumption, investment and the geography … [+7350 chars]"},{"source":{"id":"nhl-news","name":"NHL News"},"author":null,"title":"Avalanche seek 'best effort yet' to finish off Flames in Game 5 - NHL.com","description":"Avalanche seek 'best effort yet' to finish off Flames in Game 5 NHL.com Time to give Avalanche credit for meaningful run over Flames Sportsnet.ca Rantanen scores in overtime as Avs edge Flames to take 3-1 series lead TSN Colorado Avalanche's comeback nets 3-2…","url":"https://www.nhl.com/news/colorado-avalanche-look-to-finish-series-vs-calgary-flames-in-game-5/c-306880282","urlToImage":"https://nhl.bamcontent.com/images/photos/306880182/1024x576/cut.jpg","publishedAt":"2019-04-19T00:49:21Z","content":"DENVER -- The Colorado Avalanche are intent on closing out the Calgary Flames in Game 5 of the Western Conference First Round at Scotiabank Saddledome on Friday (10 p.m. ET; NBCSN, CBC, SN, TVAS, ALT).Colorado has won three straight games to take a 3-1 lead i… [+3524 chars]"},{"source":{"id":"nhl-news","name":"NHL News"},"author":null,"title":"Jets' third-period woes continue in Game 5 loss to Blues - NHL.com","description":"Jets' third-period woes continue in Game 5 loss to Blues NHL.com Schwartz's late goal completes Blues' comeback to shock Jets TSN Jets’ failure to show up at home pushes them to brink of elimination Sportsnet.ca Jets squander yet another early lead, lose 3-2 …","url":"https://www.nhl.com/news/winnipeg-jets-third-period-woes-in-game-5-vs-st-louis-blues/c-306887784","urlToImage":"https://nhl.bamcontent.com/images/photos/306888420/1024x576/cut.jpg","publishedAt":"2019-04-19T06:25:02Z","content":"WINNIPEG -- It's said the Stanley Cup Playoffs are a whole new pressure and intensity, a different kind of game.That may be, but Game 5 of the Western Conference First Round between the Winnipeg Jets and St. Louis Blues looked a whole lot like each team's reg… [+4390 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"David Pescovitz","title":"Where pinball machines live forever","description":"Michael Schiess is the founder of the Pacific Pinball Museum in Alameda, California where he cares for nearly 2,000 pinball machines from across time. Schiess's mission in life? \"To inspire an interest in science, art and history through pinball, and to prese…","url":"https://boingboing.net/2019/04/19/where-pinball-machines-live-fo.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/screenshot-49.jpg","publishedAt":"2019-04-19T14:40:40Z","content":"A pixel-perfect implementation of Super Mario Bros. is now available for the Commodore 64, a good three decades after that computer’s (and the Nintendo Entertainment System’s) heydey. This is a Commodore 64 port of the 1985 game SUPER MARIO BROS. for the Fami… [+1697 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Rob Beschizza","title":"Super Mario Bros. released for C64","description":"A pixel-perfect implementation of Super Mario Bros. is now available for the Commodore 64, a good three decades after that computer's (and the Nintendo Entertainment System's) heydey. This is a Commodore 64 port of the 1985 game SUPER MARIO BROS. for the Fami…","url":"https://boingboing.net/2019/04/19/super-mario-bros-released-for.html","urlToImage":"https://media.boingboing.net/wp-content/uploads/2019/04/c64-mario.jpg","publishedAt":"2019-04-19T13:14:21Z","content":"A pixel-perfect implementation of Super Mario Bros. is now available for the Commodore 64, a good three decades after that computer's (and the Nintendo Entertainment System's) heydey. \r\nThis is a Commodore 64 port of the 1985 game SUPER MARIO BROS. for the Fa… [+2611 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Rina Raphael","title":"Mental health concerns by state: This map shows the most googled terms","description":"A new report examined Americans’ most googled mental health concerns and found that geography certainly plays a roll. How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health conc…","url":"https://www.fastcompany.com/90337315/mental-health-concerns-by-state-this-map-shows-the-most-googled-terms?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcompany%2Fheadlines+%28Fast+Company%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-2-90337315-the-most-googled-mental-health-concernsand8211by-state.jpg","publishedAt":"2019-04-19T11:08:04Z","content":"How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health concerns among Americans and found that geography certainly plays a roll.[Image: TermLife2Go]\r\nAnalysts at TermLife2Go.com… [+1028 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"The 11 mass deadly school shootings that happened since Columbine","description":"The images of teenagers running from their school with their hands up – as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight.","url":"https://abcnews.go.com/US/11-mass-deadly-school-shootings-happened-columbine/story?id=62494128","urlToImage":"https://s.abcnews.com/images/US/GTY_columbine_jtm_141007_hpMain_5_16x9_992.jpg","publishedAt":"2019-04-19T13:46:35Z","content":"The images of teenagers running from their school with their hands up as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight at subsequent school shootings.\r\nAnd for many, including eventual school shooters, there was so… [+9433 chars]"},{"source":{"id":null,"name":"Northjersey.com"},"author":"North Jersey Record, Abbey Mastracco, North Jersey Record","title":"Mets' Jacob deGrom returns to New York for tests after experiencing elbow discomfort","description":"NL Cy Young winner Jacob deGrom will be sent back to New York because of elbow discomfort, as well as fatigue from strep throat, the Mets said.","url":"https://www.northjersey.com/story/sports/mlb/mets/2019/04/19/ny-mets-jacob-degrom-sent-back-new-york-elbow-discomfort/3517793002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/15/PNJM/941eb5af-e813-44fc-8177-7dc9df472757-AP19105065998218.jpg?crop=4846,2726,x1,y83&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T22:07:00Z","content":"What I'm Hearing: USA TODAY Sports' Bob Nightengale on how the New York Mets clubhouse is relieved that Jacob DeGrom signed an extension with the team.\r\n USA TODAY Sports\r\nJacob deGrom will be sent back to New York because of some elbow discomfort, as well as… [+1262 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Christal Hayes, USA TODAY","title":"Trump supporter threatens to kill Democratic lawmakers over Rep. Omar's 9/11 comments, docs say","description":"A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmakers, specifically citing his support for President Donald Trump and his disdain for Rep. Ilhan Omar in light of her comments about the 9/11 terr…","url":"https://www.usatoday.com/story/news/politics/2019/04/19/rep-ilhan-omar-rashida-tlaib-targeted-racist-death-threats-man-arrested/3522754002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/17/USAT/87ba844a-78fb-4eb4-aafc-b7ef974a0530-AP_Trump_Jewish_Politics.JPG?crop=3681,2061,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T20:17:23Z","content":"Rep. Ilhan Omar said since President Donald Trump tweeted about her, she's received an increase in \"direct threats.\"\r\n USA TODAY\r\nWASHINGTON  A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmaker… [+4321 chars]"},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Evan Minsker","title":"Watch Lizzo Perform “Juice” on “Kimmel”","description":"The Minnesota artist’s new album, CUZ I LOVE YOU, is out today","url":"https://pitchfork.com/news/watch-lizzo-perform-juice-on-kimmel","urlToImage":null,"publishedAt":"2019-04-19T18:59:35Z","content":null},{"source":{"id":null,"name":"Pitchfork.com"},"author":"Madison Bloom","title":"7 Albums Out Today You Should Listen to Now: Beyoncé, Lizzo, Kelsey Lu, and More","description":"Also stream releases from 03 Greedo, Caroline Shaw and Attacca Quartet, Body Meat, and Slauson Malone","url":"https://pitchfork.com/news/7-albums-out-today-you-should-listen-to-now-beyonce-lizzo-kelsey-lu-and-more/","urlToImage":"https://media.pitchfork.com/photos/5cb875b2bc6e725e78682438/2:1/w_1280,c_limit/Homecoming.jpg","publishedAt":"2019-04-19T13:55:16Z","content":"With so much good music being released all the time, it can be hard to determine what to listen to first. Every week, Pitchfork offers a run-down of significant new releases available on streaming services. This weeks batch includes new albums from Beyoncé, L… [+3289 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"dstrauss@politico.com (Daniel Strauss)","title":"Buttigieg plans aggressive fundraising push in California","description":"Buttigieg also held three fundraisers in New York City this week.","url":"https://www.politico.com/story/2019/04/19/buttigieg-fundraising-california-1282196","urlToImage":"https://static.politico.com/b2/52/dce464a54a308f81b08a3432bce5/19418-pete-buttigieg-gty-773.jpg","publishedAt":"2019-04-19T09:02:49Z","content":"The fundraisers range from more casual gatherings to a meeting of Pete Buttigieg's \"national investment circle,\" | Scott Olson/Getty Images\r\nDemocrat Pete Buttigieg is planning a series of 11 fundraisers over three days in California next month, as the rising… [+1917 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"gross@politico.com (Garrett Ross)","title":"POLITICO Playbook PM: Next up: Nadler’s subpoena","description":"And House Dems talk with the Justice Department about Robert Mueller testifying.","url":"https://www.politico.com/newsletters/playbook-pm/2019/04/19/next-up-nadlers-subpoena-426826","urlToImage":"https://static.politico.com/71/73/a426be6c4c1d861a480dcc79736d/gettyimages-1135937114.jpg","publishedAt":"2019-04-19T17:00:07Z","content":"House Judiciary Chairman Jerry Nadler (D-N.Y.) followed up the release of the redacted Mueller report with a subpoena for more. | Zach Gibson/Getty Images\r\nDEPT. OF ESCALATION Nadler subpoenas DOJ for full version of the Mueller report, by Caitlin Oprysko and… [+9666 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"POLITICO MAGAZINE","title":"The Surprises in the Mueller Report","description":"So what did we really learn about Trump, Russia and  the power of the presidency? Some of the nation’s top legal minds unpack the document of the decade.","url":"https://www.politico.com/magazine/story/2019/04/19/mueller-report-analysis-legal-experts-226662","urlToImage":"https://static.politico.com/96/9b/938b48c9473f817b78483c4d46d2/mag-final.jpg","publishedAt":"2019-04-19T04:01:08Z","content":"From the instant Robert Muellers report landed yesterday, a nation of legal experts and analysts began tearing into its 432 pages, skipping past the heavy black ink of redactions, and weighing the special counsels findings and conclusions against the presiden… [+27094 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Tim Daniels","title":"NBA Rumors: Chauncey Billups Interviewing for Timberwolves President Role","description":"The  Minnesota Timberwolves  are reportedly planning to interview former All-Star point guard  Chauncey Billups  about their president of basketball operations vacancy...","url":"https://bleacherreport.com/articles/2832161-nba-rumors-chauncey-billups-interviewing-for-timberwolves-president-role","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/771/hi-res-4e28803641b9e911124b5890b0d58bdb_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T18:20:04Z","content":"Carlos Osorio/Associated Press\r\nThe Minnesota Timberwolves are reportedly planning to interview former All-Star point guard Chauncey Billups about their president of basketball operations vacancy.\r\nShams Charania of Stadium and The Athletic reported the updat… [+264 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Grant Hughes","title":"NBA Power Rankings: James Harden, Houston Rockets Blasting Their Way to the Top","description":"For this edition of  NBA  power rankings, we'll be prisoners of the moment a bit more than we were during the regular season.   There's this idea that the playoffs are when teams' true quality is revealed...","url":"https://bleacherreport.com/articles/2831792-nba-power-rankings-james-harden-houston-rockets-blasting-their-way-to-the-top","urlToImage":"https://img.bleacherreport.net/img/slides/photos/004/344/822/bf3d90cddf1bcc2c93f8fdbe7c118183_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T11:10:36Z","content":"Layne Murdoch Jr./Getty Images\r\n25. Los Angeles Lakers (25)\r\nMarc Stein of the New York Times reports, \"In numerous rival organizations, there is both shock and relief that the Lakers haven't responded to events of the past week by chasing the likes of Golden… [+3678 chars]"},{"source":{"id":null,"name":"Stereogum.com"},"author":"Chris DeVille","title":"Stream Lizzo’s New Album & Watch Her Pay Tribute To Nipsey Hussle On Kimmel","description":"According to Lizzo's contagiously fun single \" Juice,\" she's \"not a snack at all -- baby I'm the whole damn meal!\" It's a conclusion we agree with: Her new album Cuz I Love You, out today, is further evidence that the Minnesota singer/rapper/dancer/flautist i…","url":"https://www.stereogum.com/2040485/lizzo-cuz-i-love-you-kimmel-juice-nipsey-hussle/video/","urlToImage":"https://static.stereogum.com/uploads/2019/04/Lizzo-Cuz-I-Love-You-1555681389-608x608.jpg","publishedAt":"2019-04-19T13:46:01Z","content":"According to Lizzo’s contagiously fun single “Juice,” she’s “not a snack at all — baby I’m the whole damn meal!” It’s a conclusion we agree with: Her new album Cuz I Love You, out today, is further evidence that the Minnesota singer/rapper/dancer/flautist is … [+947 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Laken Litman","title":"Gauging the Success Rate of College Football Head Coaches Who Are Also Alumni","description":"College football programs that hire alumni set up their school legends for rousing second acts ... but it doesn't always go according to plan.","url":"https://www.si.com/college-football/2019/04/19/alumni-head-coaches-jim-harbaugh-pat-fitzgerald","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/college-football-coaches-alumni-jim-harbaugh-pat-fitzgerald.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T17:07:19Z","content":"When Jim Harbaugh came home to Michigan, he told stories of sitting in Bo Schembechlers office with his feet propped up on his desk. When Scott Frost came home to Nebraska, Cornhuskers fans broke the spring game attendance record. When Kirby Smart came home t… [+15717 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Tim Rohan","title":"When the Canes Ruled the Draft: The Year Miami Had Six First-Rounders","description":"The story of Miami’s record six first-rounders in 2004 perfectly captures the unpredictability of the draft process.","url":"https://www.si.com/nfl/2019/04/19/miami-hurricanes-2004-nfl-draft-record-six-players-first-round","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/miami-2004-draft-class-pileup-big.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:42:09Z","content":"Toward the end of February 2004, the entire football world descended on the University of Miami for the Hurricanes pro day. Some estimate there were several hundred people in attendance, including coaches, executives, and scouts from every organization, it se… [+25631 chars]"},{"source":{"id":null,"name":"Theintercept.com"},"author":"Rachel M. Cohen","title":"House Majority Leader Steny Hoyer Is Facing a Primary Challenge","description":"“I honestly don’t think in this environment anyone is safe, and certainly not Congressman Hoyer.” The post House Majority Leader Steny Hoyer Is Facing a Primary Challenge appeared first on The Intercept.","url":"https://theintercept.com/2019/04/19/steny-hoyer-primary-challenger/","urlToImage":"https://theintercept.imgix.net/wp-uploads/sites/1/2019/04/hoyer-wilkes-1555692376.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800","publishedAt":"2019-04-19T16:51:42Z","content":"Mckayla Wilkes,\r\n a 28-year-old administrative assistant, part-time student, and mother of two, has had enough. In late March, she announced that she was mounting a bid for Marylands 5th Congressional District, aiming to unseat one of the oldest and most powe… [+10973 chars]"},{"source":{"id":null,"name":"Businessoffashion.com"},"author":"BoF Team","title":"Why Fashion’s Giant Notre-Dame Pledges Are Good for Business","description":"Both LVMH and Kering stand to benefit from their donations to save Notre-Dame, though a political backdrop of populism has raised the risk of a backlash.","url":"https://www.businessoffashion.com/articles/professional/why-fashions-giant-notre-dame-pledges-are-good-for-business","urlToImage":"https://images.businessoffashion.com/site/uploads/2019/04/Notre-Dame-after-fire.jpg?auto=format%2Ccompress&crop=faces%2Centropy&fit=crop&max-h=512&w=1024","publishedAt":"2019-04-19T14:27:17Z","content":"Hello BoF Professionals, your exclusive 'This Week in Fashion' briefing is ready, with members-only analysis on the key topic of the week and a digest of the week's top news.\r\nPARIS, France This week, a horrific fire engulfed Notre-Dame de Paris, the 856-year… [+11433 chars]"},{"source":{"id":null,"name":"Fivethirtyeight.com"},"author":"Adam Kelsey and Will Steakin, Adam Kelsey https://fivethirtyeight.com/contributors/adam-kelsey/ Adam.M.Kelsey@abc.com","title":"What The Potential 2020 Candidates Are Doing And Saying, Vol. 15","description":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 — Democrats and even some Republicans — we’re keeping tabs on the field as it develops. Each week, we’ll run…","url":"https://fivethirtyeight.com/features/what-the-potential-2020-candidates-are-doing-and-saying-vol-15/","urlToImage":"https://fivethirtyeight.com/wp-content/uploads/2019/04/2020roundup-0419-16x9.png?w=1600","publishedAt":"2019-04-19T09:59:29Z","content":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 Democrats and even some Republicans were keeping tabs on the field as it develops. Each week, well run throu… [+15151 chars]"},{"source":{"id":null,"name":"Geek.com"},"author":"Simone M. Scully","title":"Watch: Rare Trio of Bald Eagles Raise Eaglets Together on the Mississippi River","description":"They say it takes a village to raise a child — but in a nest along the Mississippi River, three bald eagles have decided that it takes a trio to raise newly hatched […] The post Watch: Rare Trio of Bald Eagles Raise Eaglets Together on the Mississippi River a…","url":"https://www.geek.com/news/watch-rare-trio-of-bald-eagles-raise-eaglets-together-on-the-mississippi-river-1783794/","urlToImage":"https://www.geek.com/wp-content/uploads/2019/04/baldeagletrio1.jpg","publishedAt":"2019-04-19T16:00:27Z","content":"They say it takes a village to raise a child but in a nest along the Mississippi River, three bald eagles have decided that it takes a trio to raise newly hatched downy eaglets.\r\nNot only did all three eagles two dads and a mom work together to build the nest… [+7365 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Mary Elizabeth Williams","title":"Lake Bell on why New York and Nebraska need to laugh together over \"Bless This Mess\"","description":"\"This show by no means is going to cure the country of all ailments,\" the \"Bless This Mess\" co-creator tells Salon","url":"https://www.salon.com/2019/04/19/lake-bell-on-why-new-york-and-nebraska-need-to-laugh-together-over-bless-this-mess/","urlToImage":"https://media.salon.com/2019/04/lake-bell.jpg","publishedAt":"2019-04-19T16:00:21Z","content":"Lake Bell would like to meet you in the middle. The actor, director, producer and writer has long been a familiar face in the independent film world (\"Man Up,\"\"In a World,\"), but for her first network television show, she's teamed up with a sitcom veteran for… [+9715 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Marianne Eloise","title":"9 Great College Acceptance Scenes From TV Shows","description":"Gossip Girl, Sabrina the Teenage Witch, and our other favorite college-bound TV characters.","url":"http://www.vulture.com/article/college-acceptance-tv-shows.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/18/18-college-acceptance-the-oc.w1200.h630.jpg","publishedAt":"2019-04-19T15:03:45Z","content":"If youve ever applied to college, you know how it feels around this time of year. Its a pivotal time in any young persons life working hard through high school (or not) to maintain perfect grades, write the perfect college essay, and get into your dream schoo… [+7780 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Char Adams","title":"11-Year-Old Girl Dies After Allergic Reaction to Toothpaste: 'I Feel Like I Failed Her,' Says Mom","description":"Denise Saldate’s family has always been adamant about checking labels to ensure products contained no dairy before giving them to the 11-year-old, who is allergic. Now, the West Covina, California, family is mourning Saldate’s death after she suffered a fatal…","url":"https://people.com/human-interest/denise-saldate-dead-allergic-toothpaste-california/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/denise-saldate.jpg?crop=0px%2C382px%2C2700px%2C1419px&resize=1200%2C630","publishedAt":"2019-04-19T15:53:27Z","content":"Denise Saldate’s family has always been adamant about checking labels to ensure products contained no dairy before giving them to the 11-year-old, who is allergic. Now, the West Covina, California, family is mourning Saldate’s death after she suffered a fatal… [+2802 chars]"},{"source":{"id":null,"name":"Nba.com"},"author":"NBA.com","title":"Report: Wolves to discuss POBO opening with Billups, others","description":"The Minnesota Timberwolves and former guard Chauncey Billups will soon meet to discuss a front-office job with the team.","url":"http://www.nba.com/article/2019/04/19/report-chauncey-billups-meet-wolves-pobo-job","urlToImage":"https://cdn.nba.net/nba-drupal-prod/styles/landscape_1045w/s3/2019-04/chauncey-billups-iso-sideline-0419.jpg?itok=MrqGcMVM","publishedAt":"2019-04-19T18:44:57Z","content":"The Minnesota Timberwolves and former guard Chauncey Billups will soon meet to discuss a front-office job with the team.\r\nPer Shams Charania and Jon Krawczynski of The Athletic, Billups will meet with the team to discuss Minnesota's vacant President of Basket… [+2560 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Bill Whalen, Contributor, Bill Whalen, Contributor https://www.forbes.com/sites/billwhalen/","title":"Now That Bernie Has Discovered Fox News, Will He Further Explore Red-State America?","description":"Now that he's conquered the beast that is Fox News -- more the holding his own in a town hall event earlier this week -- what's the next move for Bernie Sanders if he wants to learn more about red-state America? Try: dining at Chick-fil-A, attending a \"megach…","url":"https://www.forbes.com/sites/billwhalen/2019/04/18/now-that-bernie-has-discovered-fox-news-will-he-further-explore-red-state-america/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2Fa0a315e402db4935ae25025ce8fe640f%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T02:22:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nSen. Bernie Sanders did something unusual for a Democratic presidential hopeful: a town hall interview with Fox News anchors Bret Baier and Martha MacCallum. (Photo: Matt Rourke/Associated Press)\r\nIn new… [+12783 chars]"},{"source":{"id":null,"name":"Abc12.com"},"author":"WJRT","title":"Family: Boy thrown from Mall of America balcony recovering - ABC 12 News","description":"Family: Boy thrown from Mall of America balcony recovering ABC 12 News 5-year-old boy thrown off Mall of America balcony showing 'real signs of recovery' CNN Boy thrown from balcony at Mall of America showing signs of recovery WFLA 'Miracle child' thrown from…","url":"https://www.abc12.com/content/news/508821002.html","urlToImage":"https://media.graytvinc.com/images/Mall+of+America+balcony+throw.jpg","publishedAt":"2019-04-19T21:31:21Z","content":"MINNEAPOLIS (AP) -- The family of a 5-year-old boy thrown off a third-floor balcony at the Mall of America last week says he's \"showing real signs of recovery\" but remains in intensive care.\r\nThe boy's family posted the update Friday on a GoFundMe page that h… [+506 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":null,"title":"Embattled US Rep. Ilhan Omar tweets 'happy Passover' - Fox News","description":"Embattled US Rep. Ilhan Omar tweets 'happy Passover' Fox News Omar mocks Trump's claims of 'presidential harassment': 'Just lived through one!' | TheHill The Hill Ilhan Omar once addressed gender-segregated audience in Somalia Fox News Is US Congresswoman Ilh…","url":"https://www.foxnews.com/us/embattled-us-rep-ilhan-omar-tweets-happy-passover","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-2b21eb0892464ee7b7f9809a0a49b63a.png","publishedAt":"2019-04-19T20:37:40Z","content":"MINNEAPOLIS U.S. Rep. Ilhan Omar is wishing \"happy Passover\" to Jews commemorating the holiday in her home state of Minnesota and around the world.\r\nOmar is a Somali American and one of the first Muslims elected to Congress. She's been criticized for remarks … [+556 chars]"},{"source":{"id":null,"name":"Bbc.com"},"author":"https://www.facebook.com/bbcnews","title":"Militia detains migrants at gunpoint along the US-Mexico border - BBC News","description":"Militia detains migrants at gunpoint along the US-Mexico border BBC News New Mexico militia detains migrants at gunpoint until Border Patrol arrives: report Fox News A Right-Wing Militia Has Allegedly Been Holding Migrant Families at Gunpoint Near Border Slat…","url":"https://www.bbc.com/news/world-us-canada-47980143","urlToImage":"https://ichef.bbci.co.uk/images/ic/1024x576/p076sjds.jpg","publishedAt":"2019-04-19T15:50:13Z","content":"Media captionFive numbers that explain US border crisis\r\nA video has emerged of armed right-wing militia members stopping over 300 migrants as they cross the Mexico border into the US state of New Mexico.\r\nThe group calls itself the United Constitutional Patr… [+2624 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Charles Rabin","title":"Florida man charged with threatening Cory Booker, Rashida Tlaib, Eric Swalwell - Miami Herald","description":"Florida man charged with threatening Cory Booker, Rashida Tlaib, Eric Swalwell Miami Herald Florida man arrested over violent threats against Swalwell, Booker, Tlaib POLITICO Man arrested for threatening Dems, citing Omar comments | TheHill The Hill Florida m…","url":"https://www.miamiherald.com/news/politics-government/article229463414.html","urlToImage":"https://www.miamiherald.com/latest-news/4u6pfn/picture229003569/alternates/LANDSCAPE_1140/swalwell.jpeg","publishedAt":"2019-04-19T17:24:00Z","content":"Florida man charged with threatening Cory Booker, Rashida Tlaib, Eric Swalwell\r\nFederal authorities have arrested a South Florida man and accused him of leaving menacing, racist and homophobic messages on the office voicemails of several Democratic members of… [+2803 chars]"},{"source":{"id":null,"name":"Boston25news.com"},"author":"EndPlay","title":"Boy thrown from Mall of America balcony making 'small steps' toward healing - Boston 25 News","description":"Boy thrown from Mall of America balcony making 'small steps' toward healing Boston 25 News Child who plunged from Mall of America balcony showing \"real signs of recovery\" CBS News Boy, 5, thrown from mall balcony 'showing real signs of recovery' UPI News 5-ye…","url":"https://www.boston25news.com/news/trending-now/boy-thrown-from-mall-of-america-balcony-making-small-steps-toward-healing/941718774","urlToImage":"https://media-ncd.cmgdigital.com/photo/2019/04/19/Boy_Thrown_from_Third_Floor_Balcony_of_M_0_15064503_ver1.0_640_360.jpg","publishedAt":"2019-04-19T18:11:42Z","content":"BLOOMINGTON, Minn. - The family of a 5-year-old boy thrown from a third-floor balcony at the Mall of America last week says he is making “small steps” as he recovers from his devastating injuries.\r\nLanden Hoffman was shopping with his mother and friends aroun… [+9113 chars]"},{"source":{"id":null,"name":"Brooklynvegan.com"},"author":"BrooklynVegan Staff","title":"What's going on Saturday (4/20)?","description":"Tonight's NYC-area shows include Amanda Palmer, Laura Jane Grace, Black Lips, Gus Dapperton, Tommy Genesis, The Movielife, Bush Tetras, and more. Continue reading…","url":"http://www.brooklynvegan.com/whats-going-on-saturday-162/","urlToImage":"http://www.brooklynvegan.com/files/2019/03/lostweekend-2019-mohawk-016.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89","publishedAt":"2019-04-19T21:41:57Z","content":"Amanda Palmer at Lost Weekend 2019 at SXSW (more by Amanda Hatfield)\r\nYou can browse our full NYC show calendar for all of tonights shows, but here are some highlights\r\nAmanda Palmer @ Beacon TheatreAfter a seven year gap between solo albums, Amanda Palmer re… [+5080 chars]"},{"source":{"id":null,"name":"Gearpatrol.com"},"author":"John Zientek","title":"These Classic Red Wing Heritage Boots Are Now 36% Off","description":"Now at Nordstrom Rack, you can save 36 percent on a pair of classic Red Wing Heritage Moc-Toe boots.","url":"https://gearpatrol.com/2019/04/19/red-wing-heritage-deal/","urlToImage":"https://cdn.gearpatrol.com/wp-content/uploads/2018/12/Red-Wing-6-Inch-Moc-Toe-Gear-Patrol-Feature.jpg","publishedAt":"2019-04-19T15:50:04Z","content":"When youre presented with the chance to save on Red Wing Heritage boots, youd be foolish to pass it up. The brands boots are rarely on sale and when they are, sizes are often limited. But now at Nordstrom Rack, you can save 36 percent on a pair of classic Red… [+352 chars]"},{"source":{"id":null,"name":"Eonline.com"},"author":"Cydney Contreras","title":"Travis Scott Owes Nearly $400,000 After Losing Cancelled Concert Lawsuit","description":"Travis Scott is going to have to fork over a big chunk of change after a jury deemed him responsible for paying $382,932.79 in damages. In a statement to TMZ, Scott's attorney said,...","url":"https://www.eonline.com/news/1033964/travis-scott-owes-nearly-400-000-after-losing-cancelled-concert-lawsuit","urlToImage":"https://akns-images.eonline.com/eol_images/Entire_Site/2019014/rs_600x600-190114062755-600.travis-scott.11419.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90","publishedAt":"2019-04-19T01:51:22Z","content":"Travis Scott is going to have to fork over a big chunk of change after a jury deemed him responsible for paying $382,932.79 in damages.\r\nIn a statement to TMZ, Scott's attorney said, \"The jury verdict of $383k is disappointing, but far less than the seven fig… [+750 chars]"},{"source":{"id":null,"name":"Espnfc.com"},"author":null,"title":"Toronto's Jordan Hamilton scores 2 in 2 minutes to reclaim lead","description":"Major League Soccer: Jordan Hamilton (77', 79') Toronto FC 4-3 Minnesota United","url":"http://www.espnfc.com/video/latest-videos/600/video/3829809","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2FESPNi%2F2019%2F0419%2Fint_190419_fc_jordan_hamilton_brace%2Fint_190419_fc_jordan_hamilton_brace.jpg","publishedAt":"2019-04-19T06:52:28Z","content":"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"},{"source":{"id":null,"name":"Espnfc.com"},"author":"Reuters","title":"Toronto FC rallies for thrilling win over Minnesota","description":"Toronto FC get braces from Alejandro Pozuelo and Jordan Hamilton to turn a 2-3 deficit into a 4-3 win for their fourth win of the season. Major League Soccer: Alejandro Pozuelo (28', 30') Toronto FC 2-1 Minnesota United Major League Soccer: Darwin Quintero (1…","url":"http://www.espnfc.com/major-league-soccer/story/3829816/toronto-fc-rallies-for-thrilling-win-over-minnesota","urlToImage":"https://a.espncdn.com/photo/2019/0420/r531685_1296x729_16-9.jpg","publishedAt":"2019-04-19T07:15:00Z","content":"Jordan Hamilton scored two goals in less than three minutes late in the second half, leading Toronto FC to a 4-3 home win over Minnesota United on Friday night.\r\nAlejandro Pozuelo scored two first-half goals for TFC. Darwin Quintero had a pair of goals for th… [+1800 chars]"},{"source":{"id":null,"name":"Espnfc.com"},"author":"ESPN","title":"Jozy Altidore blasts Toronto FC president over 'games of ego'","description":"Toronto FC get braces from Alejandro Pozuelo and Jordan Hamilton to turn a 2-3 deficit into a 4-3 win for their fourth win of the season. After limping out of Friday night's game, Toronto FC striker Jozy Altidore said his injury could have been avoided had cl…","url":"http://www.espnfc.com/major-league-soccer/story/3829853/jozy-altidore-blasts-toronto-fc-president-over-games-of-ego","urlToImage":"http://a.espncdn.com/combiner/i/?img=/photo/2017/1209/r300574_1296x729_16-9.jpg&site=espnfc","publishedAt":"2019-04-19T09:53:00Z","content":"After limping out of Friday night's game, Toronto FC striker Jozy Altidore said his injury could have been avoided had club president Bill Manning \"put his ego aside\" and allowed a former trainer to stay with the club.\r\nAltidore left Toronto's 4-3 win over Mi… [+2192 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"https://facebook.com/WGR550","title":"CAPACCIO: 2019 Mock Draft No. 2 - WBEN","description":"CAPACCIO: 2019 Mock Draft No. 2 WBEN Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots take QBs on Day 2 CBS Sports Cardinals Can't and Won't Pass on QB Kyler Murray at No. 1 in 2019 NFL Draft Bleacher Report NFL New York Giant…","url":"https://wgr550.radio.com/articles/opinion/capaccio-2019-mock-draft-no-2","urlToImage":"https://s3.amazonaws.com/s3.wgr550.com/Irv.jpg","publishedAt":"2019-04-19T04:05:39Z","content":"Let me be upfront and clear about this mock draft.  I changed the top pick for the sake of it possibly happening.  Even though I still beleieve, as of right now, that the Arizona Cardinals will take Oklahoma QB Kyler Murray first overall, that certainly isn't… [+4468 chars]"},{"source":{"id":null,"name":"Kcrg.com"},"author":"Josh Christensen","title":"Former Hawkeye Chad Greenway finds success in the business world - KCRG","description":"Former Hawkeye Chad Greenway finds success in the business world KCRG CEDAR RAPIDS, Iowa (KCRG) - Former Iowa linebacker Chad Greenway spent 11 years in the NFL and was the face of the Minnesota Vikings' linebacker...","url":"https://www.kcrg.com/content/sports/Former-Hawkeye-Chad-Greenway-finds-success-in-the-business-world-508785451.html","urlToImage":"https://media.graytvinc.com/images/Chad+Greenway1.jpg","publishedAt":"2019-04-19T02:44:16Z","content":"CEDAR RAPIDS, Iowa (KCRG) - Former Iowa linebacker Chad Greenway spent 11 years in the NFL and was the face of the Minnesota Vikings' linebacker group. He retired in 2017, but has found success in the business world.\r\nOn Thursday, he visited Cedar Rapids, Nor… [+549 chars]"},{"source":{"id":null,"name":"Telegraphherald.com"},"author":"TH wire services","title":"Business news in brief | Business - telegraphherald.com","description":"Business news in brief | Business telegraphherald.com NEW YORK — The National Enquirer is being sold to the former head of the airport newsstand company Hudson News following a rocky year in which the...","url":"http://www.telegraphherald.com/news/business/article_921fe24a-660e-5b9c-9be9-2aed9e3d6fe1.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/telegraphherald.com/content/tncms/custom/image/646a89a2-fd9d-11e5-9db5-4b01910bfaa0.jpg","publishedAt":"2019-04-19T05:30:00Z","content":"National Enquirer will have new owner\r\nNEW YORK The National Enquirer is being sold to the former head of the airport newsstand company Hudson News following a rocky year in which the tabloid was accused of burying stories that could have hurt Donald Trumps 2… [+2665 chars]"},{"source":{"id":null,"name":"Inforum.com"},"author":null,"title":"Want to be a rock star? Be careful when using business buzzwords - INFORUM","description":"Want to be a rock star? Be careful when using business buzzwords INFORUM FARGO - There are a lot of business buzzwords out there, but if you want to make Renee Redenius barking mad, sneak “circle back” into the conversation.","url":"https://www.inforum.com/business/1007172-Want-to-be-a-rock-star-Be-careful-when-using-business-buzzwords","urlToImage":"https://www.inforum.com/1007408-cpki9i-042019.B.FF.BUZZWORDSwebJPG.jpg/alternates/BASE_LANDSCAPE/042019.B.FF.BUZZWORDSwebJPG.jpg","publishedAt":"2019-04-19T18:00:00Z","content":"FARGO - There are a lot of business buzzwords out there, but if you want to make Renee Redenius barking mad, sneak circle back into the conversation.Every time I'm asked to circle back to a subject/task, I immediately feel like a dog chasing their tail, Reden… [+6097 chars]"},{"source":{"id":null,"name":"Fantasypros.com"},"author":null,"title":"NFL Mock Draft 2019 – First Round (2.0) - FantasyPros","description":"NFL Mock Draft 2019 – First Round (2.0) FantasyPros With the NFL Draft just days away I am excited to release my final mock draft of the season. There are quite a bit few changes from my first mock from back in... View full coverage on Google News","url":"https://www.fantasypros.com/2019/04/nfl-mock-draft-2019-first-round-2-0/","urlToImage":"https://www.fantasypros.com//cdn.fantasypros.com/wp-content/uploads/full_193666.jpg","publishedAt":"2019-04-19T13:20:50Z","content":"With the NFL Draft just days away I am excited to release my final mock draft of the season. There are quite a bit few changes from my first mock from back in February. The first wide receiver taken has changed. Numerous players have dropped out of the first … [+26088 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Rina Raphael","title":"Mental health concerns by state: This map shows the most googled terms","description":"A new report examined Americans’ most googled mental health concerns and found that geography certainly plays a roll. How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health conc…","url":"https://www.fastcompany.com/90337315/mental-health-concerns-by-state-this-map-shows-the-most-googled-terms?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcocreate%2Ffeed+%28Co.Create%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-2-90337315-the-most-googled-mental-health-concernsand8211by-state.jpg","publishedAt":"2019-04-19T11:08:04Z","content":"How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health concerns among Americans and found that geography certainly plays a roll.[Image: TermLife2Go]\r\nAnalysts at TermLife2Go.com… [+1028 chars]"},{"source":{"id":null,"name":"Thedailybeast.com"},"author":"By tanya.basu@thedailybeast.com (Tanya Basu)","title":"Doctors Finally Figure Out What's Causing the Mysterious AFM Illness Among Kids","description":"Shutterstock Federal researchers have confirmed for the first time a frightening polio-like condition that strikes children can be caused by a respiratory infection called enterovirus D68—a step toward unraveling the mystery of the paralyzing illness. Scienti…","url":"https://www.thedailybeast.com/doctors-finally-figure-out-whats-causing-the-mysterious-afm-illness-among-kids","urlToImage":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1555637286/190418-Basu-AFM-tease_ghd2eh","publishedAt":"2019-04-19T01:30:14Z","content":"Federal researchers have confirmed for the first time a frightening polio-like condition that strikes children can be caused by a respiratory infection called enterovirus D68a step toward unraveling the mystery of the paralyzing illness.\r\nScientists have long… [+2185 chars]"},{"source":{"id":null,"name":"Fastcompany.com"},"author":"Rina Raphael","title":"Mental health concerns by state: This map shows the most googled terms","description":"A new report examined Americans’ most googled mental health concerns and found that geography certainly plays a roll. How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health conc…","url":"https://www.fastcompany.com/90337315/mental-health-concerns-by-state-this-map-shows-the-most-googled-terms?partner=feedburner&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+fastcoexist%2Ffeed+%28Co.Exist%29","urlToImage":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2019/04/p-2-90337315-the-most-googled-mental-health-concernsand8211by-state.jpg","publishedAt":"2019-04-19T11:08:04Z","content":"How do New Yorkers’ psychological concerns differ from those in, say, South Dakota? A new report examined the most googled mental health concerns among Americans and found that geography certainly plays a roll.[Image: TermLife2Go]\r\nAnalysts at TermLife2Go.com… [+1028 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"","title":"Cobb gets the start for Orioles in series opener against Twins","description":"Baltimore hosts Minnesota to begin a three-game series","url":"https://www.foxsports.com/mlb/story/cobb-gets-the-start-for-orioles-in-series-opener-against-twins-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T07:05:00Z","content":"Minnesota Twins (9-7, second in the AL Central) vs. Baltimore Orioles (8-12, third in the AL East)\r\nBaltimore; Friday, 7 p.m. EDT\r\nLINE: Twins favored by 1 1/2 runs; over/under is 8 1/2 runs\r\nBOTTOM LINE: Baltimore and Minnesota are set to begin a three-game … [+1246 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Twins-Orioles postponed, doubleheader scheduled for Saturday","description":"The Baltimore Orioles' game against the Minnesota Twins was rained out and rescheduled as part of a doubleheader Saturday.","url":"https://www.foxsports.com/north/story/minnesota-twins-baltimore-orioles-postponed-doubleheader-scheduled-for-saturday-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/pi-fsn-twins-orioles-camden-yards-postponed-041919.vresize.1200.630.high.27.jpg","publishedAt":"2019-04-19T19:55:18Z","content":"BALTIMORE The Baltimore Orioles‘ game against the Minnesota Twins was rained out and rescheduled as part of a doubleheader Saturday starting at 3:05 p.m.\r\nAlex Cobb (0-0) had been scheduled to start for Orioles on Friday and Jose Berrios (2-1) for the Twins. … [+206 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports North","title":"Astudillo leading charge of Twins' aggressive approach at plate","description":"The Minnesota Twins see just 3.71 pitches per plate appearance, the lowest mark in all of baseball.","url":"https://www.foxsports.com/north/story/minnesota-twins-willians-astudillo-aggressive-approach-mlb-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/pi-fsn-twins-willians-astudillo-041919.vresize.1200.630.high.49.jpg","publishedAt":"2019-04-19T19:03:02Z","content":"The Minnesota Twins are taking a different approach at the plate this season.\r\nGone are the days of patiently waiting for a perfect fastball or routinely letting the first pitch fly by. Under new manager Rocco Baldelli in 2019, the Twins have morphed into bas… [+2210 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Vikings will look to address O-line needs in draft","description":"With the offensive line still in flux, the Minnesota Vikings have a clear need to address yet again in NFL draft","url":"https://www.foxsports.com/north/story/minnesota-vikings-will-look-to-address-o-line-needs-through-draft-kirk-cousins-adam-thielen-stefon-diggs-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/274fe79e312543aa85d8914a36d0671f.vresize.1200.630.high.51.jpg","publishedAt":"2019-04-19T17:06:17Z","content":"MINNEAPOLIS The Minnesota Vikings will be constructing a new front five yet again this year.\r\nPerhaps this will be the spring they can finally plant a couple of seeds for stability.\r\nThe Vikings have consistently fielded one of the NFL’s best defenses since c… [+6106 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"7 Big Ten teams will extend QB competitions into preseason","description":"7 of 14 Big Ten teams coming out of spring planning to continue quarterback auditions in preseason practices","url":"https://www.foxsports.com/college-football/story/7-big-ten-teams-will-extend-qb-competitions-into-preseason-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/c38cfc6b693c4045af601df963be3e3d.vresize.1200.630.high.90.jpg","publishedAt":"2019-04-19T15:16:09Z","content":"The week started with nine of the 14 Big Ten teams coming out of spring practices planning to continue quarterback auditions in August. The number was down to seven by Friday.\r\nFirst-year coach Ryan Day of defending conference champion Ohio State insisted aft… [+4876 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Rays can't complete sweep, fall to Orioles 6-5 in extra innings","description":"The Tampa Bay Rays couldn't complete the sweep of the Baltimore Orioles, falling 6-5 in the 11th inning at Tropicana Field.","url":"https://www.foxsports.com/florida/story/tampa-bay-ray-baltimore-orioles-score-recap-041819","urlToImage":"https://b.fssta.com/uploads/2019/04/041819-fsf-mlb-tampa-bay-rays-orioles.vresize.1200.630.high.92.jpg","publishedAt":"2019-04-19T04:00:49Z","content":"ST. PETERSBURG, Fla. (AP) Joey Rickard drove in the winning run in the 11th inning with an RBI double, his fourth hit of the game, and the Baltimore Orioles beat the Tampa Bay Rays 6-5 on Thursday night.\r\nRickard doubled off Diego Castillo (0-1) after two-out… [+2318 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Schwartz caps Blues' rally in 3-2 win over Jets 1 in Games 5","description":"Schwartz caps Blues' rally in 3-2 win over Jets 1 in Games 5","url":"https://www.foxsports.com/nhl/story/schwartz-caps-blues-rally-in-3-2-win-over-jets-1-in-games-5-041819","urlToImage":"https://b.fssta.com/uploads/2019/04/e70924464dfa43dea460c69a32be0a5c.vresize.1200.630.high.93.jpg","publishedAt":"2019-04-19T03:48:42Z","content":"WINNIPEG, Manitoba (AP) — Jaden Schwartz scored with 15 seconds remaining in the third period to cap St. Louis’ three-goal third period in a 3-2 win over the Winnipeg Jets on Thursday night, giving the Blues a 3-2 lead in their Western Conference playoff seri… [+3529 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Hobbled Yanks reach minors deal with Morrison","description":"First baseman Logan Morrison, who is coming off hip surgery and hit a career-high 38 home runs just two seasons ago, has agreed to a minor league deal with the Yankees.","url":"http://www.espn.com/mlb/story/_/id/26560662/hobbled-yanks-reach-minors-deal-morrison","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0315%2Fr341300_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T23:26:20Z","content":"The New York Yankees have agreed to a minor league deal with first baseman Logan Morrison, the team announced Friday.\r\nThe deal includes an opt-out date of July 1, and Morrison, 31, will make $1 million if he's added to the major league roster, sources told E… [+2094 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Daily notes: Pitcher projections and hitter ratings for Friday","description":"Prepare your fantasy baseball lineups with confidence with our daily preview, including pitcher projections, hitter matchup ratings and more.","url":"http://www.espn.com/fantasy/baseball/story/_/id/26554624/fantasy-baseball-daily-notes-pitcher-rankings-hitter-ratings-plus-players-add-friday","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0418%2Fr531166_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T12:23:39Z","content":"With the MLB season heading into its fourth week, the major storyline remains the record-setting home run pace. Secondarily, it's another injury-riddled campaign with 110 players on the 10-day IL and another 47 on the 60-day through Thursday afternoon. This m… [+7067 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Associated Press","title":"Minnesota police shooting case leaves jurors with multiple options for charges","description":"When a Minneapolis police officer shot and killed an unarmed woman who approached his squad car after calling 911, it was catastrophic. But was it murder? Prosecutors have given jurors hearing the case against Mohamed Noor multiple options: second-degree murd…","url":"https://www.latimes.com/nation/la-na-minnesota-police-shooting-trial-20190419-story.html","urlToImage":"https://www.latimes.com/resizer/LhsjRcMPC7r9rU2HfwrLkNIzdtY=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/EVMSSWVD6ZBFLGJXUOKVTFERSY.jpg","publishedAt":"2019-04-19T21:55:00Z","content":"When a Minneapolis police officer shot and killed an unarmed woman who approached his squad car after calling 911, it was catastrophic. But was it murder?\r\nProsecutors have given jurors hearing the case against Mohamed Noor multiple options: second-degree mur… [+4214 chars]"},{"source":{"id":null,"name":"Latimes.com"},"author":"Leila Miller","title":"A wellness program at work may make you feel good, but it won’t improve your health","description":"More than half of U.S. companies offer workplace wellness programs to their employees, but a new study suggests they do very little — if anything — to improve workers’ health. In an unusual clinical trial involving more than 8,000 employees of a warehouse ret…","url":"https://www.latimes.com/science/la-sci-wellness-program-at-work-clinical-trial-20190419-story.html","urlToImage":"https://www.latimes.com/resizer/eypZe_wK6o9FHZJG185qDkpirJw=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/KUP3K3UFZZH6ZIUVD3JZ2FDIRU.jpg","publishedAt":"2019-04-19T12:00:00Z","content":"More than half of U.S. companies offer workplace wellness programs to their employees, but a new study suggests they do very little if anything to improve workers health.\r\nIn an unusual clinical trial involving more than 8,000 employees of a warehouse retail … [+5289 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Sources: Yanks reach minors deal with Morrison","description":"First baseman Logan Morrison, who hit a career-high 38 home runs just two seasons ago, has agreed to a minor league deal with the Yankees, sources told ESPN.","url":"http://www.espn.com/mlb/story/_/id/26560662/sources-yanks-reach-minors-deal-morrison","urlToImage":"https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0315%2Fr341300_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T16:52:42Z","content":"The New York Yankees have agreed to a minor league deal with first baseman Logan Morrison, sources told ESPN's Jeff Passan on Friday.\r\nThe deal includes an opt-out date of July 1, and Morrison, 31, will make $1 million if he's added to the major league roster… [+1483 chars]"},{"source":{"id":"nbc-news","name":"NBC News"},"author":"Jimmy Im, CNBC","title":"These are the 10 best places to live in the U.S. in 2019","description":"When it comes to value for the money, strong job markets, quality of life and being desirable places to live, these American cities come out on top, according to U.S. News & World Report.","url":"https://www.nbcnews.com/better/lifestyle/these-are-10-best-places-live-us-2019-ncna996331","urlToImage":"https://media1.s-nbcnews.com/j/newscms/2019_16/2433616/180515-austin-texas-skyline-2016-ac-513p_79e83dae95266af38e4f85e6ee0b663d.nbcnews-fp-1200-630.jpg","publishedAt":"2019-04-19T14:06:00Z","content":"Get the Better newsletter.\r\nSUBSCRIBE\r\nApril 19, 2019, 2:06 PM GMT\r\nAustin, Texas is the No. 1 place to live in America for 2019, according to U.S. News &amp; World Reports 125 Best Places to Live in the USA.\r\nFor the second year in a row Austin tops the list… [+2600 chars]"},{"source":{"id":null,"name":"Ramblinwreck.com"},"author":null,"title":"Georgia Tech #ProJackets Basketball – Men's Basketball — Georgia Tech Yellow Jackets - Georgia Tech Official Athletic Site","description":"Georgia Tech #ProJackets Basketball – Men's Basketball — Georgia Tech Yellow Jackets Georgia Tech Official Athletic Site Shumpert and the Rockets have a 2-0 lead in round one of the NBA playoffs.","url":"https://ramblinwreck.com/georgia-tech-projackets-basketball/","urlToImage":"https://ramblinwreck.com/amt-media/330459","publishedAt":"2019-04-19T04:33:51Z","content":"THE FLATS — Derrick Favors posted a double-double, Iman Shumpert and the Rockets to face the Jazz on Saturday at 10:30 p.m. in Utah,  That and more in this edition of the Georgia Tech #ProJackets Basketball Report.\r\nFavors scored 14 points and grabbed 12 rebo… [+9800 chars]"},{"source":{"id":null,"name":"Yellowjackedup.com"},"author":"Dylan Callaghan-Croley","title":"Georgia Tech Football Spring Game Players to Watch: The Quarterbacks - Yellow Jacked Up","description":"Georgia Tech Football Spring Game Players to Watch: The Quarterbacks Yellow Jacked Up The Georgia Tech quarterbacks will be the stars of the Jackets annual spring game on April 26th.","url":"https://yellowjackedup.com/2019/04/19/georgia-tech-football-spring-game-players-to-watch-the-quarterback/","urlToImage":"https://imagesvc.timeincapp.com/v3/fan/image?url=https://yellowjackedup.com/wp-content/uploads/getty-images/2017/07/1053644050.jpeg&","publishedAt":"2019-04-19T19:41:43Z","content":"Over the course of the next week, we’ll be highlighting one player to watch each day as Georgia Tech is set to play their spring game on April 26th.\r\nThe Georgia Tech spring game is just one week away and that means it’s time to start heading into prep-mode f… [+3395 chars]"},{"source":{"id":null,"name":"Juancole.com"},"author":"Middle East Monitor","title":"Alexandria Ocasio-Cortez calls for slashing US Aid to Israel over Netanyahu Reelection","description":"US Congresswoman, Alexandria Ocasio-Cortez, has proposed the US cut military and economic aid worth $3 billion a year from Israel in response to the re-election of Benjamin Netanyahu as prime minister. “I think these are part of conversations we are having in…","url":"https://www.juancole.com/2019/04/alexandria-netanyahu-reelection.html","urlToImage":"https://www.juancole.com/images/2019/04/alexandria-ocasio-cortez-calls-f.jpg","publishedAt":"2019-04-19T04:07:30Z","content":"US Congresswoman, Alexandria Ocasio-Cortez, has proposed the US cut military and economic aid worth $3 billion a year from Israel in response to the re-election of Benjamin Netanyahu as prime minister.\r\nI think these are part of conversations we are having in… [+1654 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports North","title":"Minnesota Vikings’ 2019 schedule breakdown","description":"A game-by-game capsule summary of each of the Minnesota Vikings' opponents in 2019","url":"https://www.foxsports.com/north/gallery/minnesota-vikings-2019-schedule-breakdown-adam-thielen-kirk-cousins-041819","urlToImage":"https://b.fssta.com/uploads/2019/04/pi-fsn-vikings-stefon-diggs-adam-thielen-041819.vresize.1200.630.high.94.jpg","publishedAt":"2019-04-19T00:19:33Z","content":"Week 16: Dec. 23 vs. Green Bay Packers, 7:15 p.m.\r\nSeries: 54-60-3\r\nLast matchup (home): Vikings 24, Packers 17 (2018)\r\nSkinny: The Vikings third prime-time game in four weeks will bring Rodgers and Green Bay back into Minneapolis on a Monday evening, just tw… [+532 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports North","title":"Top Tweets: Cousins shows off Vikings massive playbook","description":"FOX Sports North compiles the top tweets from the past week of Minnesota sports.","url":"https://www.foxsports.com/north/gallery/top-tweets-cousins-shows-off-vikings-massive-playbook-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/6.vresize.1200.630.high.27.jpg","publishedAt":"2019-04-19T14:23:32Z","content":"TWITTER HANDLE: @dbremer_pxp\r\nTWEET: Pheasant fajitas are on tonight's menu. Jose Berrios was on today's mound, pitching the Twins to a 6-4 win over the Tigers. So, a left-hand toast with a margarita to the winning Twins. @t_hildy will warrant a second left-h… [+170 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Orioles, Twins rained out; doubleheader Saturday","description":"The Baltimore Orioles' game against the Minnesota Twins was rained out and rescheduled as part of a doubleheader Saturday starting at 4:05 p.m. EDT","url":"https://www.foxsports.com/mlb/story/orioles-twins-rained-out-doubleheader-saturday-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T19:43:54Z","content":"BALTIMORE (AP) — The Baltimore Orioles‘ game against the Minnesota Twins was rained out and rescheduled as part of a doubleheader Saturday starting at 4:05 p.m. EDT.\r\nAlex Cobb (0-0) had been scheduled to start for Orioles on Friday and Jose Berrios (2-1) for… [+10 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Logan Morrison agrees to minor league deal with Yankees","description":"Logan Morrison agrees to minor league contract with New York Yankees","url":"https://www.foxsports.com/mlb/story/logan-morrison-agrees-to-minor-league-deal-with-yankees-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/f11835d4c3944c1c8470b04b8833c12e.vresize.1200.630.high.88.jpg","publishedAt":"2019-04-19T18:25:11Z","content":"NEW YORK (AP) — Logan Morrison has agreed to a minor league contract with the New York Yankees, who sought another first base option with Greg Bird again on the injured list.\r\nIf added to the 40-man roster, Morrison would get a one-year contract with a $1 mil… [+1503 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Falcons give second chance to Hageman following 2017 release","description":"Falcons give second chance to defensive tackle Ra'Shede Hageman following 2017 release due to domestic violence charge","url":"https://www.foxsports.com/nfl/story/falcons-give-second-chance-to-hageman-following-2017-release-041919","urlToImage":"https://b.fssta.com/uploads/2016/12/default_image.vresize.1200.630.high.0.png","publishedAt":"2019-04-19T16:30:54Z","content":"FLOWERY BRANCH, Ga. (AP) — The Atlanta Falcons have signed Ra’Shede Hageman, giving a second chance to the defensive tackle the team released in 2017 after he was charged with domestic violence.\r\nThe 28-year-old Hageman, a second-round pick from Minnesota in … [+646 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Rickard's RBI double in 11th lifts Rays past Orioles 6-5","description":"Joey Rickard drove in the winning run with an RBI double and the Baltimore Orioles beat the Tampa Bay Rays 6-5 in 11 innings","url":"https://www.foxsports.com/mlb/story/rickard-s-rbi-double-in-11th-lifts-rays-past-orioles-6-5-041819","urlToImage":"https://b.fssta.com/uploads/2019/04/e8b5b430ba7a424c8969ea85ed988424.vresize.1200.630.high.35.jpg","publishedAt":"2019-04-19T03:52:25Z","content":"ST. PETERSBURG, Fla. (AP) — Joey Rickard drove in the winning run in the 11th inning with an RBI double, his fourth hit of the game, and the Baltimore Orioles beat the Tampa Bay Rays 6-5 on Thursday night.\r\nRickard doubled off Diego Castillo (0-1) after two-o… [+2320 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"AP","title":"Column: In retrospect, ‘Field of Dreams’ is a terrible film","description":"Column: 30 years removed from the release of 'Field of Dreams,' it's time to acknowledge the harsh truth: This is just another terrible movie","url":"https://www.foxsports.com/mlb/story/column-in-retrospect-field-of-dreams-is-a-terrible-film-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/c5cd4edf456b4f38a7e84431edd9793d.vresize.1200.630.high.53.jpg","publishedAt":"2019-04-19T20:51:43Z","content":"“If you build it, he will come.”\r\nPuh-lease.\r\nThirty years after the release of “Field of Dreams,” it’s time for a major reassessment.\r\nSorry, all you folks who view baseball — and this movie — as some sort of timeless metaphor for connecting to your past and… [+5243 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Believe it: Blues earn wild 3-2 comeback win over Jets in Game 5, lead series","description":"The St. Louis Blues got a 3-2 win over the Winnipeg Jets on Thursday night, giving the Blues a 3-2 lead in their Western Conference playoff series.","url":"https://www.foxsports.com/midwest/story/believe-it-blues-earn-wild-3-2-comeback-win-over-jets-in-game-5-lead-series-041919","urlToImage":"https://b.fssta.com/uploads/2019/04/pi-nhl-blues-jaden-schwartz-041819.vresize.1200.630.high.77.jpg","publishedAt":"2019-04-19T04:04:36Z","content":"WINNIPEG, Manitoba (AP) Jaden Schwartz scored with 15 seconds remaining in the third period to cap St. Louis’ three-goal third period in a 3-2 win over the Winnipeg Jets on Thursday night, giving the Blues a 3-2 lead in their Western Conference playoff series… [+3527 chars]"},{"source":{"id":null,"name":"Vanityfair.com"},"author":"Abigail Tracy","title":"Robert Mueller’s Six Cases for Collusion","description":"A closer reading of the Mueller report reveals a series of episodes that are, if not criminal, deeply corrupt.","url":"https://www.vanityfair.com/news/2019/04/donald-trump-robert-mueller-report-collusion","urlToImage":"https://media.vanityfair.com/photos/5c49f4bdb6173e6d16293c6f/16:9/w_1200,h_630,c_limit/Mueller-vs-BuzzFeed.jpg","publishedAt":"2019-04-19T02:17:24Z","content":"Nowhere the sprawling first volume of Robert Mueller’s report does the special counsel exonerate Donald Trump on “collusion.” And yet, there is an obvious tension between the contents of the report and the breezy, seemingly exculpatory introduction given by A… [+11883 chars]"},{"source":{"id":null,"name":"Mprnews.org"},"author":null,"title":"How many cherries in frozen pie? FDA may soon drop rules - Minnesota Public Radio News","description":"How many cherries in frozen pie? FDA may soon drop rules Minnesota Public Radio News Trump's next deregulation target: Frozen cherry pies NOLA.com Dining room deregulation: Trump's FDA may revamp rules for cherry pie, milk, French dressing NBC News Cherry pie…","url":"https://www.mprnews.org/story/2019/04/19/how-many-cherries-in-frozen-pie-fda-may-soon-drop-rules","urlToImage":"https://img.apmcdn.org/4d0362fc8c214ff383a92b48e3b78f77163168ac/uncropped/763442-20190419-cherry-pie.jpg","publishedAt":"2019-04-19T22:49:25Z","content":"President Trump may soon be able to claim a sweet victory for his deregulation push, with officials preparing to get rid of the decades-old rules for frozen cherry pies.\r\nEmails show the Food and Drug Administration planned to start the process for revoking t… [+2450 chars]"},{"source":{"id":null,"name":"Matadornetwork.com"},"author":"Matthew Meltzer","title":"Best hotel libraries","description":"The best places to escape your great escape. The post 11 of the most beautiful hotel libraries in the world appeared first on Matador Network.","url":"https://matadornetwork.com/read/most-beautiful-hotel-libraries-world/","urlToImage":"https://s3.amazonaws.com/cdn.matadornetwork.com/blogs/1/2019/04/The-Jefferson.jpg","publishedAt":"2019-04-19T19:30:12Z","content":"Even for those who love books, a good library is usually not one of the most sought-after hotel amenities. But if you’re on vacation, or even traveling for business, sometimes it’s nice to have a handy resource for downtime reading material or just a place to… [+6038 chars]"},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Sarah Lynch Baldwin","title":"\"Armed vigilantes unlawfully detaining migrants\" near border, ACLU says","description":"CBP said it \"does not endorse or condone private groups or organizations that take enforcement matters into their own hands\"","url":"https://www.cbsnews.com/news/united-constitutional-patriots-aclu-says-armed-vigilantes-unlawfully-detaining-migrants-near-u-s-mexico-border/","urlToImage":"https://cbsnews2.cbsistatic.com/hub/i/r/2019/04/19/b2a5df92-6725-4825-903e-49e3179d075e/thumbnail/1200x630/c50788cf376221a349a586715622f9a2/militia.jpg","publishedAt":"2019-04-19T18:37:01Z","content":"The American Civil Liberties Union (ACLU) of New Mexico says \"armed vigilantes\" are detaining migrants near the U.S.-Mexico border and is calling on officials to launch a probe into the group it calls a \"fascist militia.\"\r\n\"[W]e cannot allow racist and armed … [+3085 chars]"},{"source":{"id":null,"name":"Thenation.com"},"author":"John Nichols","title":"AOC, Ilhan Omar and Rashida Tlaib Call for an Impeachment Inquiry","description":"John Nichols After reviewing the Mueller report, the congresswomen recognized a demand for congressional action. The post AOC, Ilhan Omar and Rashida Tlaib Call for an Impeachment Inquiry appeared first on The Nation.","url":"https://www.thenation.com/article/aoc-ilhan-omar-rashida-tlaib-impeachment-trump-mueller-report/","urlToImage":"https://www.thenation.com/wp-content/uploads/2019/04/impeach-trump-protest-sign-ap-img-1440x756.jpg","publishedAt":"2019-04-19T19:07:41Z","content":"Protesters gather in front of the White House for a protest against Trump in 2018. (Bill Clark / CQ Roll Call via AP Images)\r\nThank you for signing up. For more from The Nation, check out our latest issue.\r\nThank you for signing up. For more from The Nation, … [+6173 chars]"},{"source":{"id":null,"name":"Nbcsports.com"},"author":"Michael David Smith","title":"Keeping tabs on the fifth-year options for 2016 first-round draft picks","description":"Twenty-nine players who were first-round draft picks in 2016 have fifth-year options for the 2020 season, and their teams must decide by May 3 whether to pick up those options. We’ll list each first-round pick here and the status of that option year. The Patr…","url":"https://profootballtalk.nbcsports.com/2019/04/19/keeping-tabs-on-the-fifth-year-options-for-2016-first-round-draft-picks/","urlToImage":"https://nbcprofootballtalk.files.wordpress.com/2019/04/gettyimages-1093466870-1-e1555684578883.jpg","publishedAt":"2019-04-19T14:36:36Z","content":"Twenty-nine players who were first-round draft picks in 2016 have fifth-year options for the 2020 season, and their teams must decide by May 3 whether to pick up those options. We’ll list each first-round pick here and the status of that option year.\r\nThe Pat… [+4299 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump supporter threatens to kill Democratic lawmakers over Rep. Omar's 9/11 comments, docs say","description":"A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmakers, specifically citing his support for President Donald Trump and his disdain for Rep. Ilhan Omar in light of her comments about the 9/11 terr…","url":"https://news.yahoo.com/trump-supporter-threatens-kill-democratic-201723763.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/0fvwBVNbQlZYUaLG_0OuNg--~B/aD00NTA7dz0zNjA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/1009217/bd1b27ef-afd3-41b4-b904-8cb227629480/8ce0f333-17f0-526a-9820-440ce7aba0c2/data_3_0.jpg?s=934c5e1659a520308f7ee1ea4564f157&c=af989f8e3f7097cd81c68e10f256e2bf&a=tripleplay4us&mr=0","publishedAt":"2019-04-19T20:17:23Z","content":"WASHINGTON  A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmakers, specifically citing his support for President Donald Trump and his disdain for Rep. Ilhan Omar in light of her comments about t… [+4059 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Diaz-Canel's first year as Cuba president in five events","description":"A deadly plane crash, economic woes, a new constitution, US sanctions and taking to social media: Miguel Diaz-Canel's first year as president of Cuba has been anything but straightforward. The 58-year-old entered office on April 19, 2018 as the first person o…","url":"https://news.yahoo.com/diaz-canels-first-cuba-president-five-events-145518482.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/RKpYGGVyHKBmGVSNpVIBJw--~B/aD02OTA7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/58b12bf3801db1eb012332a6816c8e20bbcd1456.jpg","publishedAt":"2019-04-19T14:55:18Z","content":"Havana (AFP) - A deadly plane crash, economic woes, a new constitution, US sanctions and taking to social media: Miguel Diaz-Canel's first year as president of Cuba has been anything but straightforward.\r\nThe 58-year-old entered office on April 19, 2018 as th… [+4434 chars]"},{"source":{"id":null,"name":"Advocate.com"},"author":"Trudy Ring","title":"Pete Buttigieg Rises to Third in National Presidential Poll","description":"The gay mayor had the support of 17 percent of respondents, narrowly trailing Joe Biden and Bernie Sanders.","url":"https://www.advocate.com/politics/2019/4/19/pete-buttigieg-rises-third-national-presidential-poll","urlToImage":"https://www.advocate.com/sites/advocate.com/files/2019/04/19/biden-sanders-buttigieg750x.jpg","publishedAt":"2019-04-19T19:26:56Z","content":"Pete Buttigieg has risen to third place in a new national poll on Democratic presidential contenders.\r\nFormer Vice President Joe Biden, who is expected to announce his presidential campaign next week, came in first in the Change Research poll of more than 2,5… [+2113 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Rep. Ilhan Omar tweets 'happy Passover' amid criticism","description":"U.S. Rep. Ilhan Omar is wishing \"happy Passover\" to Jews commemorating the holiday in her home state of Minnesota and around the world.","url":"https://news.yahoo.com/rep-ilhan-omar-tweets-happy-233355180.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/JAquEuXhDDJrlU0lbu6dsA--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://slick-prod.s3-us-west-2.amazonaws.com/slick_thumb/giraffe-275922-1555716334419.jpg","publishedAt":"2019-04-19T23:33:55Z","content":"U.S. Rep. Ilhan Omar is wishing \"happy Passover\" to Jews commemorating the holiday in her home state of Minnesota and around the world."},{"source":{"id":null,"name":"Nbcbayarea.com"},"author":"NBC Bay Area","title":"NFL Admits Raiders' Early Schedule Isn't Entirely Fair","description":"The Raiders schedule in 2019 will be a challenge. How challenging? So challenging that one NFL executive believes it may not be fair to the team. The schedule of every NFL regular-season game was released by the NFL Wednesday evening. Immediately, the Raiders…","url":"https://www.nbcbayarea.com/news/local/NFL-Admits-Raiders-Early-Schedule-Isnt-Entirely-Fair-508805391.html","urlToImage":"https://media.nbcbayarea.com/images/1200*800/GruSkkedd.jpg","publishedAt":"2019-04-19T18:01:47Z","content":"The Raiders schedule in 2019 will be a challenge. How challenging? So challenging that one NFL executive believes it may not be fair to the team.\r\nThe schedule of every NFL regular-season game was released by the NFL Wednesday evening. Immediately, the Raider… [+1479 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"The Associated Press","title":"Falcons give second chance to Hageman following 2017 release","description":"The Atlanta Falcons signed Ra'Shede Hageman to a one-year deal on Friday, giving a second chance to the defensive tackle the team released in 2017 after he was charged with domestic violence.  NFL spokesman Brian McCarthy told The Associated Press all teams w…","url":"https://ca.sports.yahoo.com/news/falcons-second-chance-hageman-following-2017-release-163201674--nfl.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/uuvwULfLojpfXMdcS.y0HA--~B/aD0zNTI7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201904191142421488882","publishedAt":"2019-04-19T18:30:49Z","content":"FLOWERY BRANCH, Ga. (AP) -- The Atlanta Falcons signed Ra'Shede Hageman to a one-year deal on Friday, giving a second chance to the defensive tackle the team released in 2017 after he was charged with domestic violence.\r\nHageman, 28, was a second-round pick f… [+1999 chars]"},{"source":{"id":null,"name":"Nbcbayarea.com"},"author":"NBC Bay Area","title":"NFL Executive Would 'love Redo' on Raiders' Tough 2019 Schedule","description":"We're not sure if you have heard, but the Raiders have a tough schedule in 2019. In fact, it's projected to be the toughest schedule in the NFL. Besides facing their AFC West rivals twice each, the Raiders have cross-division matchups with the AFC South and N…","url":"https://www.nbcbayarea.com/news/sports/csn/raiders/NFL_executive_would__love_redo__on_Raiders__tough_2019_schedule_BAY-508814452.html","urlToImage":"https://media.nbcbayarea.com/images/1200*675/grudencarr_ap.jpg","publishedAt":"2019-04-19T16:01:20Z","content":"We're not sure if you have heard, but the Raiders have a tough schedule in 2019. In fact, it's projected to be the toughest schedule in the NFL. \r\nBesides facing their AFC West rivals twice each, the Raiders have cross-division matchups with the AFC South and… [+1761 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"NBC Sports BayArea","title":"NFL executive would 'love redo' on Raiders' tough 2019 schedule","description":"Woulda ... coulda ... shoulda.","url":"https://sports.yahoo.com/nfl-executive-love-redo-raiders-185702749.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/KcnYvZDPqrCHB4_LQjAuvA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/14d6ace9d9e123453b4d927da99222d9","publishedAt":"2019-04-19T18:57:02Z","content":"NFL executive would 'love redo' on Raiders' tough 2019 schedule originally appeared on nbcsportsbayarea.com\r\nWe're not sure if you've heard, but the Raiders have a tough schedule in 2019. In fact, it's projected to be the toughest in the NFL.\r\nBesides facing … [+1876 chars]"},{"source":{"id":null,"name":"Sportingnews.com"},"author":"Sporting News","title":"Who has the hardest NFL schedule in 2019? Strength of schedule for all 32 teams","description":"Each year, the release of the NFL regular-season schedule comes with surprises in terms of dates for each team's 16 games, and the order in which those games will fall on the schedule. What does not come as a surprise with the NFL schedule release, though, is…","url":"https://www.sportingnews.com/au/nfl/news/who-has-the-hardest-nfl-schedule-in-2019-strength-of-schedule-for-all-32-teams/mdhuqscrve3b17muemuvolhg6","urlToImage":"https://images.performgroup.com/di/library/sporting_news/e3/ce/carr-gruden-041619-getty-ftrjpg_u93cipyctbhn1mwwqpu5npq93.jpg?t=653014570&quality=100","publishedAt":"2019-04-19T13:24:35Z","content":"Each year, the release of the NFL regular-season schedule comes with surprises in terms of dates for each team's 16 games, and the order in which those games will fall on the schedule. What does not come as a surprise with the NFL schedule release, though, is… [+5237 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"WGR 550 SportsRadio","title":"CAPACCIO: 2019 Mock Draft No. 2","description":"Let me be upfront and clear about this mock draft. I changed the top pick for the sake of it possibly happening. Even though I still beleieve, as of right now, that the Arizona Cardinals will take Oklahoma QB Kyler Murray first overall, that certainly isn't a…","url":"https://wgr550.radio.com/articles/opinion/capaccio-2019-nfl-mock-draft-no-2","urlToImage":"https://s3.amazonaws.com/s3.wgr550.com/Irv.jpg","publishedAt":"2019-04-19T04:05:39Z","content":"Let me be upfront and clear about this mock draft. I changed the top pick for the sake of it possibly happening. Even though I still believe, as of right now, that the Arizona Cardinals will take Oklahoma quarterback Kyler Murray first overall, that certainly… [+4495 chars]"},{"source":{"id":null,"name":"Oregonlive.com"},"author":"OregonLive.com","title":"Breaking down Seattle Seahawks' 2019 schedule","description":"Earlier this week, the NFL released the full schedule for the 2019 season. Based on the winning percentage of last season's opponents, the Seattle Seahawks face the eighth-easiest schedule in the league. Combined, opponents on the schedule for this season won…","url":"https://www.oregonlive.com/sports/2019/04/breaking-down-seattle-seahawks-2019-schedule.html","urlToImage":"https://www.oregonlive.com/resizer/zgPG8-dFHW9T5ZZUD0JDRMH65H0=/1200x0/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/KFDMIWSL4FAIFFRCKD3VAT5AZI.jpg","publishedAt":"2019-04-19T23:10:35Z","content":"Earlier this week, the NFL released the full schedule for the 2019 season. Based on the winning percentage of last seasons opponents, the Seattle Seahawks face the eighth-easiest schedule in the league.\r\nCombined, opponents on the schedule for this season won… [+6032 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":"ESPN.com","title":"What will a real (not a mock) Mike Mayock NFL draft look like for the Raiders?","description":"Paul Gutierrez ESPN Staff Writer Close Covered Oakland Raiders for CSNBayArea.com and Sacramento Bee for eight years Member of Pro Football Writers Association Previously worked at Los Angeles Times, Las Vegas Review-Journal and Sports Illustrated Follow on T…","url":"http://www.espn.com/blog/oakland-raiders/post/_/id/22987/what-will-a-real-not-a-mock-mike-mayock-nfl-draft-look-like-for-the-raiders","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1231%2Fr483607_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:00:38Z","content":"ALAMEDA, Calif. -- We already know that Mike Mayock likes “Bubble Butts” and “Dancing Bears” who are “Natural Benders” and “High Motor Guys” with plenty of “Get-Off” that can serve as a “Road Grader” if he’s not already a “Dancing Bear.”\r\nStudying Mayock and … [+7365 chars]"},{"source":{"id":null,"name":"Freep.com"},"author":"Detroit Free Press","title":"NFL mock draft 4.0: Detroit Lions get the trade down they desire","description":"Dave Birkett, Carlos Monarrez debate takeaways from Bob Quinn's predraft Q&A, guess which player Lions will draft at No. 8. Filmed April 18, 2019. Detroit Lions general manager Bob Quinn's desire to trade down in Round 1 is real, so I thought I'd try and inco…","url":"https://www.freep.com/story/sports/nfl/lions/2019/04/19/nfl-mock-draft-detroit-lions/3516601002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/0718e83113651d4c86a6bf8e49b0e1d5ed22dc11/c=0-412-4776-3098/local/-/media/2019/02/05/USATODAY/usatsports/usatsi_11966306.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T13:27:08Z","content":"Dave Birkett, Carlos Monarrez debate takeaways from Bob Quinn's predraft Q&amp;A, guess which player Lions will draft at No. 8. Filmed April 18, 2019.\r\n Dave Birkett and Carlos Monarrez, Detroit Free Press\r\nDetroit Lions general manager Bob Quinn’s desire to … [+7897 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":"ESPN.com","title":"What will a real (not a mock) Mike Mayock NFL draft look like for the Raiders?","description":"Paul Gutierrez ESPN Staff Writer Close Covered Oakland Raiders for CSNBayArea.com and Sacramento Bee for eight years Member of Pro Football Writers Association Previously worked at Los Angeles Times, Las Vegas Review-Journal and Sports Illustrated Follow on T…","url":"http://www.espn.com/blog/nflnation/post/_/id/296173/what-will-a-real-not-a-mock-mike-mayock-nfl-draft-look-like-for-the-raiders","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1231%2Fr483607_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:00:38Z","content":"ALAMEDA, Calif. -- We already know that Mike Mayock likes “Bubble Butts” and “Dancing Bears” who are “Natural Benders” and “High Motor Guys” with plenty of “Get-Off” that can serve as a “Road Grader” if he’s not already a “Dancing Bear.”\r\nStudying Mayock and … [+7365 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"NOT REAL NEWS: A look at what didn't happen this week","description":"A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these is legit, even though they were shared widely on social media. The Associated Press checked these out. Here are the real facts:","url":"https://news.yahoo.com/not-real-news-look-didnt-happen-week-191728628.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/CJLoQxDAT5_h_t33YxvG8A--~B/aD0zNTU4O3c9NTAyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/8fdcfcef9404459d88392ac406bb1390.jpg","publishedAt":"2019-04-19T20:11:30Z","content":"A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these is legit, even though they were shared widely on social media. The Associated Press checked these out. Here are the real facts:\r\n__\r\nCLAIM: Man who thre… [+5009 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"What We Learned—and Didn’t Learn—From the Mueller Report","description":"The document sheds new light on Mueller’s exhaustive investigation into whether Donald Trump or his campaign colluded with Russia in the 2016 election and whether the president obstructed justice. Did Trump conspire in Russia’s efforts to help him? Mueller fo…","url":"https://news.yahoo.com/learned-didn-t-learn-mueller-231510197.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/htt_CrFsFEvqZx3r5wvINw--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/bloomberg_politics_602/0db6ff10d936476d977317a727dd1da8","publishedAt":"2019-04-19T15:53:37Z","content":"(Bloomberg) -- Most of Special Counsel Robert Muellers 448-page report became public Thursday when Attorney General William Barr released a version to Congress and the public. The document sheds new light on Muellers exhaustive investigation into whether Dona… [+11444 chars]"},{"source":{"id":"daily-mail","name":"Daily Mail"},"author":"https://www.facebook.com/DailyMail","title":"Joe Biden will announce he's running for president next week","description":"Former Vice President Joe Biden will formally announce next week he is running for the Democratic nomination as Sen. Bernie Sanders has made an early mark in the crowded Democratic field.","url":"https://www.dailymail.co.uk/news/article-6940345/Joe-Biden-announce-hes-running-president-week.html","urlToImage":"https://i.dailymail.co.uk/1s/2019/04/19/15/12479804-0-image-a-25_1555683928299.jpg","publishedAt":"2019-04-19T14:43:38Z","content":"CORY BOOKER\r\nAge on Inauguration Day: 51\r\nEntered race: February 1, 2019\r\nCareer: Currently New Jersey senator. High school football star who went to Stanford or undergraduate and masters degrees before studying in Oxford as a Rhodes scholar and Yale Law Scho… [+24164 chars]"},{"source":{"id":null,"name":"Truthdig.com"},"author":"Sonali Kolhatkar","title":"Anti-Vaxxers Are Just as Bad as Climate Deniers","description":"Ignorance on this key health issue isn’t just dangerous—it can be fatal.","url":"https://www.truthdig.com/articles/anti-vaxxers-are-just-as-bad-as-climate-deniers/","urlToImage":"https://www.truthdig.com/wp-content/uploads/2019/04/measles.jpeg","publishedAt":"2019-04-19T11:30:19Z","content":"There have been at least 555 confirmed cases of the highly contagious measles virus since January alone, prompting officials from the Centers for Disease Control and Prevention to call this sudden eruption the worst outbreak of the disease in nearly 20 years.… [+7528 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Orioles, Twins rained out; doubleheader Saturday","description":"BALTIMORE (AP) — The Baltimore Orioles’ game against the Minnesota Twins was rained out and rescheduled as part of a doubleheader Saturday starting at 4:05 p.m. EDT. Alex Cobb (0-0) had been scheduled to start for Orioles on Friday and Jose Berrios (2-1) for …","url":"https://www.seattletimes.com/sports/orioles-twins-rained-out-doubleheader-saturday/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-19T19:43:54Z","content":"BALTIMORE (AP) The Baltimore Orioles’ game against the Minnesota Twins was rained out and rescheduled as part of a doubleheader Saturday starting at 4:05 p.m. EDT.\r\nAlex Cobb (0-0) had been scheduled to start for Orioles on Friday and Jose Berrios (2-1) for t… [+84 chars]"},{"source":{"id":null,"name":"Seattletimes.com"},"author":"The Associated Press","title":"Falcons give second chance to Hageman following 2017 release","description":"FLOWERY BRANCH, Ga. (AP) — The Atlanta Falcons have signed Ra’Shede Hageman, giving a second chance to the defensive tackle the team released in 2017 after he was charged with domestic violence. The 28-year-old Hageman, a second-round pick from Minnesota in 2…","url":"https://www.seattletimes.com/sports/falcons-give-second-chance-to-hageman-following-2017-release/","urlToImage":"https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png","publishedAt":"2019-04-19T16:30:54Z","content":"FLOWERY BRANCH, Ga. (AP) The Atlanta Falcons have signed Ra’Shede Hageman, giving a second chance to the defensive tackle the team released in 2017 after he was charged with domestic violence.\r\nThe 28-year-old Hageman, a second-round pick from Minnesota in 20… [+721 chars]"},{"source":{"id":null,"name":"Rawstory.com"},"author":"David Badash, The New Civil Rights Movement","title":"‘You’re gonna die’: Trump supporter arrested over deranged threats to prominent Democrats","description":"A South Florida supporter of President Donald Trump has been arrested for allegedly threatening to murder four prominent, top Democratic lawmakers, after he reportedly left vile, profane, threatening, racist, and homophobic voicemails for three of them. He al…","url":"https://www.rawstory.com/2019/04/youre-gonna-die-trump-supporter-arrested-deranged-threats-prominent-democrats/","urlToImage":"https://www.rawstory.com/wp-content/uploads/2019/01/Rashida-Tlaib-1-800x430.jpg","publishedAt":"2019-04-19T18:18:17Z","content":"A South Florida supporter of President Donald Trump has been arrested for allegedly threatening to murder four prominent, top Democratic lawmakers, after he reportedly left vile, profane, threatening, racist, and homophobic voicemails for three of them. He al… [+3363 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Kyle Boone","title":"Matthew Hurt, the No. 8 recruit in the nation, commits to Duke over Kansas, Kentucky and UNC","description":"By landing Hurt, the Blue Devils are poised to have the no. 1 recruiting class in the nation","url":"https://www.cbssports.com/college-basketball/news/matthew-hurt-the-no-8-recruit-in-the-nation-commits-to-duke-over-kansas-kentucky-and-unc/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2019/04/17/1b029104-28ec-4ab7-8291-2f11048e191f/thumbnail/770x433/37922452e0140d04beeaeda62080440b/usatsi-12407414.jpg","publishedAt":"2019-04-19T20:23:10Z","content":"Duke is poised to finish with the No. 1 recruiting class for a fourth consecutive cycle after adding five-star Matthew Hurt, the No. 8 overall prospect in the Class of 2019, to its recruiting class on Friday. Hurt chose the Blue Devils over Kansas, Kentucky a… [+1470 chars]"},{"source":{"id":null,"name":"Cbssports.com"},"author":"Katherine Acquavella","title":"Yankees reportedly sign Logan Morrison, who once beefed with Gary Sanchez and called their fans 'stupid'","description":"The Yankees have been bit by the injury bug and could use some help at first base and left field","url":"https://www.cbssports.com/mlb/news/yankees-reportedly-sign-logan-morrison-who-once-beefed-with-gary-sanchez-and-called-their-fans-stupid/","urlToImage":"https://sportshub.cbsistatic.com/i/r/2018/04/25/194b1e3c-51d3-4721-af00-dd5a3ce0fd01/thumbnail/770x433/acc03bd3c4f827e2736f9b10f0935a5b/morrisontwins.jpg","publishedAt":"2019-04-19T18:42:42Z","content":"The New York Yankees have signed veteran first baseman Logan Morrison to a minor-league deal, according to MassLive.com's Chris Cotillo. He will go to extended spring training before he ends up with the Yankees' Triple-A affiliate Scranton/Wilkes-Barre RailRi… [+2491 chars]"}]}