{"status":"ok","totalResults":1028,"articles":[{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"MICHELLE GOLDBERG","title":"Mueller Did His Job. Now It’s the Democrats’ Turn.","description":"President Trump in Florida, hours after the release of the Mueller report.","url":"https://www.nytimes.com/2019/04/19/opinion/mueller-report-trump-barr-impeachment.html","urlToImage":"https://static01.nyt.com/images/2019/05/18/opinion/18goldbergWeb2/18goldbergWeb2-facebookJumbo.jpg","publishedAt":"2019-04-19T18:37:48Z","content":"He and his team have now given us the clearest picture yet of the murky events surrounding Trumps ascension. The Russian government interfered in the 2016 presidential election in sweeping and systematic fashion, they wrote. The Trump campaign welcomed this i… [+3745 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"EILEEN SULLIVAN","title":"Live Briefing: A Post-Mueller-Report America","description":"President Trump and Melania Trump, the first lady, departing the White House for a trip to their Mar-a-Lago resort in Florida on Thursday.","url":"https://www.nytimes.com/2019/04/19/us/mueller-report-trump-briefing.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/us/politics/19dc-muellerbriefing/19dc-muellerbriefing-facebookJumbo.jpg","publishedAt":"2019-04-19T10:04:20Z","content":"At an event at the White House on Thursday for wounded American troops, Mr. Trump said the investigation vindicated him. Its called no collusion, no obstruction, he said. \r\nBut the report itself, even with redactions, describes a much more complicated conside… [+1042 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"EILEEN SULLIVAN and MICHAEL TACKETT","title":"Mueller Report Updates: Questions Remain After Special Counsel’s Findings","description":"President Trump and Melania Trump, the first lady, departing the White House for a trip to their Mar-a-Lago resort in Florida on Thursday.","url":"https://www.nytimes.com/2019/04/19/us/mueller-report-trump-live-updates.html","urlToImage":"https://static01.nyt.com/images/2019/04/19/us/politics/19dc-muellerbriefing/19dc-muellerbriefing-facebookJumbo.jpg","publishedAt":"2019-04-19T11:45:16Z","content":"At an event at the White House on Thursday for wounded American troops, Mr. Trump said the investigation vindicated him. Its called no collusion, no obstruction, he said. \r\nBut the report itself, even with redactions, describes a much more complicated conside… [+1042 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"(Deleted account)","title":"Sorry iPhone X owners, but Pixel takes way better Aurora photos","description":"It was dark and my feet were freezing, despite my winter boots and Alaska-themed wool socks. Up on a hillside, the city lights of Anchorage far below, I saw a milky sheen striped across the sky. Were those the Northern Lights I had been looking for? I turned …","url":"https://mashable.com/article/which-phone-take-pictures-aurora-northern-lights-pixel-iphonex/","urlToImage":"https://mondrian.mashable.com/2019%252F04%252F18%252F1a%252F023966064b7a40b4b8b43ce8fc5e7b1c.7eda4.jpg%252F1200x630.jpg?signature=8nE2JfgUlDziYBom06BnsoZedZc=","publishedAt":"2019-04-19T11:00:00Z","content":"It was dark and my feet were freezing, despite my winter boots and Alaska-themed wool socks. Up on a hillside, the city lights of Anchorage far below, I saw a milky sheen striped across the sky. Were those the Northern Lights I had been looking for? \r\nI turne… [+5514 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Killed reporter's commitment to truth 'absolute'","description":"Lyra McKee was \"a rising star\" in journalism, whose killing has left friends \"numb with grief\".","url":"https://www.bbc.co.uk/news/uk-northern-ireland-47987807","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/0FA2/production/_106520040_01aaa1.jpg","publishedAt":"2019-04-19T10:07:10Z","content":"Image caption\r\n Lyra McKee gave a TED talk in 2017 about the Orlando gay nightclub shootings the previous year\r\n\"Kid, it's gonna be okay... it's going to get better.\r\n\"You're going to join a scheme that trains people your age to be journalists... for the firs… [+4991 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Daniel Burke, CNN Religion Editor","title":"DC attorney general investigating preschool at prominent Washington synagogue","description":"The attorney general of Washington is investigating the preschool at Washington Hebrew Congregation, a prominent synagogue in the nation's capital, several days after parents filed a civil suit against the school alleging their children were sexually abused b…","url":"https://www.cnn.com/2019/04/19/us/washington-hebrew-ag/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190416081321-boy-reading-torah-stock-super-tease.jpg","publishedAt":"2019-04-19T20:20:17Z","content":"(CNN)The attorney general of Washington is investigating the preschool at Washington Hebrew Congregation, a prominent synagogue in the nation's capital, several days after parents filed a civil suit against the school alleging their children were sexually abu… [+4547 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Hurricane Michael upgraded to Category Five storm","description":"October's Hurricane Michael was the strongest to strike the US since 1992, new analysis shows.","url":"https://www.bbc.co.uk/news/world-us-canada-47991658","urlToImage":"https://ichef.bbci.co.uk/images/ic/1024x576/p06nljm9.jpg","publishedAt":"2019-04-19T16:34:11Z","content":"Media captionAerial footage shows the destruction in Mexico Beach, Florida\r\nA hurricane that hit Florida last year was the strongest to make landfall in the US in 26 years, new analysis shows.\r\nHurricane Michael struck in early October, causing 59 deaths and … [+2875 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Eric Berger","title":"Rocket Report: A new Delta 2, Blue Origin inks with NASA, a fiery Falcon Heavy","description":"\"Do everything in your power to keep the acquisition on schedule.”","url":"https://arstechnica.com/science/2019/04/rocket-report-a-new-delta-2-blue-origin-inks-with-nasa-a-fiery-falcon-heavy/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2018/07/Rocket-Report-Intro-3-760x380.jpg","publishedAt":"2019-04-19T11:00:28Z","content":"Enlarge/ The Rocket Report is published weekly.\r\n0 with 0 posters participating\r\nWelcome to Edition 1.45 of the Rocket Report! This week, half of our stories concern the biggest rockets on the planet, from Blue Origin engine tests at Marshall Space Flight Cen… [+11910 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Sarah N. Lynch","title":"Mueller gives Democrats political ammunition but they are split on how to use it","description":"Special Counsel Robert Mueller's report into Russia's role in the 2016 U.S. election provided extensive details on President Donald Trump's efforts to thwart a federal investigation, giving Democrats plenty of political ammunition against the Republican but n…","url":"https://www.reuters.com/article/us-usa-trump-russia-idUSKCN1RV094","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20190419&t=2&i=1378567858&w=1200&r=LYNXNPEF3I0HU","publishedAt":"2019-04-19T12:05:29Z","content":"WASHINGTON (Reuters) - Special Counsel Robert Mueller’s report into Russia’s role in the 2016 U.S. election provided extensive details on President Donald Trump’s efforts to thwart a federal investigation, giving Democrats plenty of political ammunition again… [+6751 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Kelly McLaughlin","title":"2 middle school girls are accused of plotting to kill other students using a 'hit list'","description":"Two 14-year-old girls were taken into custody at Avon Park Middle School in Avon Park, Florida, on Wednesday, after being accused of plotting to kill other students. Each girl has been arrested on charges of attempting to conspire to kidnap and attempting to …","url":"https://www.thisisinsider.com/avon-park-middle-school-girls-accused-of-plotting-to-kill-students-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9df1bd2ce7808d1504e19-960-480.jpg","publishedAt":"2019-04-19T14:43:55Z","content":"Two girls at a Florida middle school have been accused of plotting to kill other students that authorities said they had put on a \"hit list.\" \r\n The 14-year-old girls, who have not been publicly named, were taken into custody at Avon Park Middle School in Avo… [+1382 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Amanda Krause","title":"You'll soon be able to buy churros that look like lightsabers and cake that looks like Sorcerer Mickey at Disney World","description":"Hollywood Studios in Orlando, Florida, is celebrating its 30th anniversary at the Walt Disney World theme park. In honor of the occasion, Disney has unveiled a new line of food that will be sold throughout the park starting May 1. Parkgoers will be able to bu…","url":"https://www.thisisinsider.com/hollywood-studios-30th-anniversary-desserts-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cba3e052730ca0f19523a6a-1136-568.jpg","publishedAt":"2019-04-19T21:30:00Z","content":"In addition to its magical rides and attractions, Walt Disney World is also known for selling top-of-the-line food throughout the year. And on special occasions, the theme park has been know to introduce a new dish or two. \r\n Starting May 1, the Florida theme… [+468 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Michelle Mark","title":"How Columbine changed American schools forever","description":"The 1999 mass shooting at Columbine High School transformed the way American schools and law-enforcement agencies prepare for violent or deadly incidents. Though school shootings are still relatively rare, fear that one could occur has sparked a number of pre…","url":"https://www.thisisinsider.com/how-columbine-changed-american-schools-forever-2019-4","urlToImage":"https://static.businessinsider.com/image/5cba32c7d2ce78102e1a6e0f-750.jpg","publishedAt":"2019-04-19T20:42:05Z","content":"Twenty years ago, two students clad in black trench coats and armed with sawed-off shotguns approached Columbine High School in Littleton, Colorado, and opened fire on dozens of their classmates. \r\n Eric Harris and Dylan Klebold killed 13 people and left more… [+8897 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Kelly McLaughlin","title":"After weeks of speculation, officials say that a fifth grader who was hospitalized after a school fight actually died from a rare brain condition","description":"RaNiya Wright died on March 27, two days after getting into a fight with a classmate at Forest Hills Elementary in Walterboro, South Carolina. She was taken to the hospital on March 25, when she started vomiting and passed out. 14th Circuit Solicitor Duffie S…","url":"https://www.thisisinsider.com/raniya-wright-hospitalized-school-fight-died-of-natural-causes-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9ffaf2730ca08e0572bc4-1536-768.jpg","publishedAt":"2019-04-19T17:04:14Z","content":"A 10-year-old girl in South Carolina who was hospitalized after a school fight died from a rare brain condition, officials said. \r\n RaNiya Wright was taken to Medical University of South Carolina on March 25, after getting into a fight at Forest Hills Element… [+2113 chars]"},{"source":{"id":null,"name":"Thisisinsider.com"},"author":"Susanna Heller","title":"An 18-foot-long snake escaped captivity and climbed onto a roof, scaring neighbors","description":"An 18-foot-long python got loose in Detroit on Thursday. People were scared. The snake is an 8-year-old python named Juliet, by the way. Her owner, 25-year-old Devin Jones-White, got her off the roof. He believes she got out of her cage. He has a snake becaus…","url":"https://www.thisisinsider.com/18-foot-long-on-roof-scares-detroit-neighborhood-2019-4","urlToImage":"https://amp.businessinsider.com/images/5cb9ee14d2ce780a3c279b1d-960-480.jpg","publishedAt":"2019-04-19T15:49:24Z","content":"It's a bird ... It's a plane ... It's an 18-foot-snake ... and people are scared! \r\n Let's get some key details out of the way: That snake is a python, her name is Juliet, and she had escaped her home in Detroit and ended up on a neighbor's roof, giving every… [+2019 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Howard Cohen","title":"Florida knew Hurricane Michael was bad. Now, scientists reveal just how strong it was - Miami Herald","description":"Florida knew Hurricane Michael was bad. Now, scientists reveal just how strong it was Miami Herald Hurricane Michael Was a Category 5 at Landfall, Only the Fourth in US Records, National Hurricane Center Says The Weather Channel Hurricane Michael upgraded to …","url":"https://www.miamiherald.com/news/weather/hurricane/article229458004.html","urlToImage":"https://cf-images.us-east-1.prod.boltdns.net/v1/jit/5615998039001/f477f330-d175-4e92-833e-3e1005840f08/main/1280x720/12s704ms/match/image.jpg","publishedAt":"2019-04-19T15:52:00Z","content":"Florida knew Hurricane Michael was bad. Now, scientists reveal just how strong it was\r\n×\r\nCameras outside the International Space Station captured views of Hurricane Michael.\r\nBy \r\nWith just a little over a month to the start of hurricane season, scientists h… [+2459 chars]"},{"source":{"id":"nfl-news","name":"NFL News"},"author":"Chad Reuter","title":"Chad Reuter seven-round mock draft - NFL.com","description":"Chad Reuter seven-round mock draft NFL.com Devin Bush on cusp of NFL with a style all his own: 'You won't break' him Detroit Free Press 2019 NFL Mock Draft: Falcons' blockbuster move into top five headlines nine projected trades CBS Sports Which Positions Do …","url":"http://www.nfl.com/news/story/0ap3000001027100/article/chad-reuter-2019-sevenround-nfl-mock-draft-round-1","urlToImage":"http://static.nfl.com/static/content/public/photo/2019/04/18/0ap3000001027062_thumbnail_200_150.jpg","publishedAt":"2019-04-19T16:16:00Z","content":"Seven-round mock drafts are similar to a pitch of a TV series to a network executive. We see the characters and the general plot, but the details will be worked out when the final scripts are written.\r\nTrades and surprising selections are the plot twists that… [+7602 chars]"},{"source":{"id":null,"name":"Radio.com"},"author":"https://facebook.com/WEEI, https://facebook.com/WEEI","title":"Hannable: Next Thursday's NFL draft can't come soon enough for Patriots - WEEI","description":"Hannable: Next Thursday's NFL draft can't come soon enough for Patriots WEEI 2019 NFL Draft: late-round targets who are just as good as early-round prospects Buffalo Rumblings Seven-round 2019 NFL Mock Draft: Raiders surprise at No. 4, Panthers and Patriots t…","url":"https://weei.radio.com/articles/column/nfl-draft-hannable-next-thursday-can-t-come-soon-enough-patriots","urlToImage":"https://s3.amazonaws.com/s3.weei.com/s3fs-public/belichickheadphone.jpg","publishedAt":"2019-04-19T02:38:57Z","content":"While the Patriots are fresh off a Super Bowl win over the Rams, the weeks and months after Feb. 3 havent exactly been great for New England.\r\nThe offseason has featured a mass exodus of coaches, the likely defensive coordinator coming and going before he was… [+3338 chars]"},{"source":{"id":"nhl-news","name":"NHL News"},"author":null,"title":"Jets' third-period woes continue in Game 5 loss to Blues - NHL.com","description":"Jets' third-period woes continue in Game 5 loss to Blues NHL.com Schwartz's late goal completes Blues' comeback to shock Jets TSN Jets’ failure to show up at home pushes them to brink of elimination Sportsnet.ca Jets squander yet another early lead, lose 3-2 …","url":"https://www.nhl.com/news/winnipeg-jets-third-period-woes-in-game-5-vs-st-louis-blues/c-306887784","urlToImage":"https://nhl.bamcontent.com/images/photos/306888420/1024x576/cut.jpg","publishedAt":"2019-04-19T06:25:02Z","content":"WINNIPEG -- It's said the Stanley Cup Playoffs are a whole new pressure and intensity, a different kind of game.That may be, but Game 5 of the Western Conference First Round between the Winnipeg Jets and St. Louis Blues looked a whole lot like each team's reg… [+4390 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Mueller report: House issues subpoena for full unredacted version","description":"Jerry Nadler issues subpoena for Robert Mueller’s full report and the underlying documents ‘to make informed decisions’ * Mueller report latest – live updates * Support the Guardian’s independent journalism and make a contributionThe House judiciary chairman,…","url":"https://news.yahoo.com/democrats-vow-investigate-trump-wake-120249647.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/swgg_iJ7YN0yXeR5Aqgjcg--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/ef59082d6c3f48c7e288394da65393f7","publishedAt":"2019-04-19T13:23:36Z","content":"The House judiciary chairman, Jerry Nadler, on Friday issued a subpoena for the full, unredacted report by special counsel Robert Mueller on Russian interference in the 2016 US election and the Trump campaign.\r\nRelated: 'No new information': Russia shrugs off… [+6462 chars]"},{"source":{"id":"time","name":"Time"},"author":"Associated Press","title":"Hurricane Michael Upgraded to Rare Category 5 Months After It Ravaged Florida Panhandle","description":"Hurricane Michael, which devastated the Florida Panhandle last fall, has been posthumously upgrade from a Category 4 storm to a Category 5.","url":"http://time.com/5574040/hurricane-michael-upgraded-category-5/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/hurricane-michael-upgraded-category-5.jpg?quality=85","publishedAt":"2019-04-19T14:42:41Z","content":"(MIAMI) — Hurricane Michael, which devastated the Florida Panhandle last fall, was actually stronger than initially measured, prompting forecasters to posthumously upgrade it from a Category 4 storm to a Category 5, the National Oceanic and Atmospheric Admini… [+2421 chars]"},{"source":{"id":"time","name":"Time"},"author":"Kathleen Foody and Kelli Kennedy / AP","title":"A Friend of the Teen ‘Infatuated’ With Columbine Says She ‘Never Threatened Anyone’","description":"Many questions remained unanswered about 18-year-old Sol Pais, but a friend disputed the contention by authorities that she posed a threat.","url":"http://time.com/5573873/columbine-anniversary-sol-pais/","urlToImage":"https://timedotcom.files.wordpress.com/2019/04/ap19106795612246.jpg?quality=85","publishedAt":"2019-04-19T04:22:03Z","content":"(LITTLETON, Colo.) — A Colorado community changed forever by the attack that killed 13 people at Columbine High School moved ahead Thursday with ceremonies marking the anniversary of the tragedy while awaiting more details on what led a Florida teen “infatuat… [+4880 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Petrana Radulovic","title":"Anime voice actor Vic Mignogna sues Funimation after sexual misconduct fallout","description":"Mignogna, facing several sexual misconduct allegations, was removed from Funimation series, Rooster Teeth series, and several convention opportunities. He classifies allegations against him as ‘defamation,’ and is suing several people involved with exposing t…","url":"https://www.polygon.com/2019/4/19/18507692/vic-mignogna-funimation-defamation-lawsuit-sexual-misconduct","urlToImage":"https://cdn.vox-cdn.com/thumbor/jRcKAdtOpaSwa9SDmrBMXhlpB9A=/0x724:1997x1770/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13738647/531762348.jpg.jpg","publishedAt":"2019-04-19T17:45:00Z","content":"Anime voice actor Vic Mignogna has filed a million-dollar lawsuit against Funimation and industry colleagues Monica Rial, Jamie Marchi, and Ronald Toye in Tarrant County, Texas District Court. In the suit, Mignogna claims that a sexual harassment investigatio… [+2084 chars]"},{"source":{"id":null,"name":"Huffpost.com"},"author":"Antonia Blumberg","title":"Judge Orders Florida To Start Treating Inmates Who Have Hepatitis C","description":"The state was reportedly neglecting to treat patients with the disease due to the cost of the drugs that cure it.","url":"https://www.huffpost.com/entry/florida-inmates-hepatitis-c_n_5cb9f690e4b032e7ceb7ef6d","urlToImage":"https://img.huffingtonpost.com/asset/5cba0e26240000fb00c8997d.jpeg?cache=8cGpku0MyK&ops=1200_630","publishedAt":"2019-04-19T18:55:00Z","content":"A judge has ordered the Florida Department of Corrections to begin treating all inmates with hepatitis C something the state had reportedly not been doing due to the cost of the drug used to treat the disease.\r\nU.S. District Court Judge Mark Walker in an orde… [+3197 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"College football spring games: How to watch, what to expect","description":"Here are this weekend's spring games, featuring playoff hopefuls Georgia and Oregon, plus Washington State, UCLA, new-look Miami and more.","url":"http://www.espn.com/college-football/story/_/id/26559717/college-football-spring-games-how-watch-expect","urlToImage":"https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1128%2Fr470198_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T14:59:08Z","content":"The last big weekend of college football spring games is upon us, with playoff hopefuls such as Georgia and Oregon taking the field. We'll also get to see Mike Leach and Washington State, Chip Kelly and UCLA, plus new-look Miami under first-year coach Manny D… [+4015 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Matt Zarrell","title":"8-year-old girl killed after tree crashes through home","description":"An 8 year old Florida girl","url":"https://abcnews.go.com/US/year-girl-killed-storm-large-tree-crash-florida/story?id=62517335","urlToImage":"https://s.abcnews.com/images/International/tree-gty-jpo-190419_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T21:06:03Z","content":"An 8-year-old girl in Florida was killed after a morning storm caused a tree to crash through her house, fatally injuring her and another child in the home, police said.\r\nOfficers responded to a 911 call from the home just after 8 a.m. Friday, the Leon County… [+504 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Christina Carrega","title":"Officials accused of trying to sell alleged Robert Kraft sex tape","description":"Prosecutors in Palm Beach County and Jupiter Police Department accused of trying to sell video footage where Robert Kraft solicited a prostitute.","url":"https://abcnews.go.com/US/florida-officials-accused-defense-attorneys-peddling-alleged-kraft/story?id=62506512","urlToImage":"https://s.abcnews.com/images/US/robert-kraft-massage-parlor-01-ap-jc-190419_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T21:20:21Z","content":"Attorneys for the owner and manager of a Florida day spa, where New England Patriots owner Robert Kraft and other men were allegedly caught on camera receiving sexual favors are claiming either prosecutors or police are trying to profit from the unauthorized … [+4948 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Max Golembo","title":"Severe weather outbreak hits East Coast just before long weekend","description":"Over the last two days, 18 tornadoes have been reported over five states.","url":"https://abcnews.go.com/US/severe-weather-outbreak-hits-east-coast-long-weekend/story?id=62503531","urlToImage":"https://s.abcnews.com/images/US/weather-2-ap-er-190414_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T10:29:55Z","content":"The major storm is moving east, leaving in its wake at least 18 tornadoes and more than 300 damaging storm reports over two days in five states, as the East Coast braces for severe weather.\r\nNine of those tornadoes, reported yesterday, were in Texas, Oklahoma… [+713 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Matt Gutman, Emily Shapiro","title":"Exclusive video goes inside daring underwater cave rescue","description":"Josh Bratchley, an experienced diver, was said to be in good health.","url":"https://abcnews.go.com/US/exclusive-video-inside-daring-underwater-cave-rescue-british/story?id=62504262","urlToImage":"https://s.abcnews.com/images/US/cave3-rescue-ht-ml-190419_hpMain_16x9_992.jpg","publishedAt":"2019-04-19T12:26:30Z","content":"Exclusive video obtained by ABC News goes inside a murky, underwater cave in Tennessee during the daring rescue of a highly trained British diver who went missing while exploring.\r\nJosh Bratchley, a member of the elite international team that helped save 12 b… [+1070 chars]"},{"source":{"id":"abc-news","name":"ABC News"},"author":"Meghan Keneally","title":"The 11 mass deadly school shootings that happened since Columbine","description":"The images of teenagers running from their school with their hands up – as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight.","url":"https://abcnews.go.com/US/11-mass-deadly-school-shootings-happened-columbine/story?id=62494128","urlToImage":"https://s.abcnews.com/images/US/GTY_columbine_jtm_141007_hpMain_5_16x9_992.jpg","publishedAt":"2019-04-19T13:46:35Z","content":"The images of teenagers running from their school with their hands up as seen on April 20, 1999, at Columbine High School -- has become a hauntingly familiar sight at subsequent school shootings.\r\nAnd for many, including eventual school shooters, there was so… [+9433 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Christal Hayes, USA TODAY","title":"Trump supporter threatens to kill Democratic lawmakers over Rep. Omar's 9/11 comments, docs say","description":"A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmakers, specifically citing his support for President Donald Trump and his disdain for Rep. Ilhan Omar in light of her comments about the 9/11 terr…","url":"https://www.usatoday.com/story/news/politics/2019/04/19/rep-ilhan-omar-rashida-tlaib-targeted-racist-death-threats-man-arrested/3522754002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/03/17/USAT/87ba844a-78fb-4eb4-aafc-b7ef974a0530-AP_Trump_Jewish_Politics.JPG?crop=3681,2061,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T20:17:23Z","content":"Rep. Ilhan Omar said since President Donald Trump tweeted about her, she's received an increase in \"direct threats.\"\r\n USA TODAY\r\nWASHINGTON  A South Florida man was arrested Friday after accused of threatening to kill several high-profile Democratic lawmaker… [+4321 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, David Jackson, USA TODAY","title":"Donald Trump golfs with Rush Limbaugh day after Mueller report is released","description":"The conservative radio talk show host has been another critic of the Robert Mueller report.","url":"https://www.usatoday.com/story/news/politics/2019/04/19/trump-golfs-rush-limbaugh-day-after-mueller-report-released/3523021002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/9575d7ff-9432-44f3-b7ff-7adbe9d04cfc-AFP_AFP_1AL749.JPG?crop=5567,3117,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T19:46:33Z","content":"The redacted version of the Mueller report is now available from the attorney general. Here are the key takeaways from it.\r\n USA TODAY\r\nWASHINGTON  President Donald Trump certainly found a sympathetic ear Friday for his frustrations over the Robert Mueller re… [+1062 chars]"},{"source":{"id":null,"name":"Azcentral.com"},"author":"Arizona Republic, Scott Craven, Arizona Republic","title":"New Mickey Mouse attraction delayed until 2020 at Disney World, is coming to Disneyland in 2022","description":"Mickey and Minnie's Runaway Railway, which whisks guests along a wild train ride will open at Disney World in 2020 and Disneyland in 2022.","url":"https://www.azcentral.com/story/travel/destinations/california/2019/04/19/disneyland-toontown-mickey-and-minnie-runaway-railway/3521178002?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/PPHX/8a7db480-840c-427a-819d-7f6c90fe8c9e-MickeyMinniesRunawayRailway52.jpg?crop=3211,1799,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T19:51:21Z","content":"Star Wars: Galaxy's Edge will open at Disneyland on May 31and Walt Disney World on August 29.\r\n USA TODAY\r\nWith all the hype surrounding Disneyland and Disney World's new Star Wars land, one of Disneyland's most overlooked areas is about to get a much-needed … [+2037 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Editors, USA TODAY","title":"Good Friday, Passover, New York International Auto Show: 5 things to know Friday","description":"Good Friday and the start of Passover, the New York International Auto Show opens to the public and more things to start your Friday morning.","url":"https://www.usatoday.com/story/news/2019/04/19/good-friday-passover-new-york-international-auto-show/3490392002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/19/USAT/47cf4bae-c9c4-44e0-a778-e3f58b7b602c-EPA_EAST_TIMOR_BELIEF_GOOD_FRIDAY.JPG?crop=4623,2600,x0,y56&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T07:50:18Z","content":"Good Friday and start of Passover\r\nGood Friday, the Christian holiday that remembers the date of Jesus Christ's crucifixion, and the start of Passover, a nearly week-long commemoration of the Jews liberation from slavery, both take place Friday. Although it's… [+3853 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Special to USA TODAY, Peter Dunn, Special to USA TODAY","title":"Pete the Planner: Should I pay off my mortgage before retirement?","description":"The choice really comes down to the known or unknown.","url":"https://www.usatoday.com/story/money/columnist/2019/04/19/pete-planner/3481966002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"","publishedAt":"2019-04-19T10:00:06Z","content":"Dear Pete,\r\nI have seven years until retirement, and I still owe about $63,000 on my mortgage. My home is slated to be paid off in just under 10 years. I have an extra $750 per month right now, and Im trying to decide whether to pay more on my mortgage or inv… [+4143 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Ashley May, USA TODAY","title":"Why you should avoid raking grass clippings after mowing the lawn, and more mower taboos","description":"You could be losing money and wasting time doing something that doesn't benefit your yard.","url":"https://www.usatoday.com/story/news/2019/04/19/mowing-lawn-dont-rake-grass-clippings-mow-same-direction/3506201002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/18/USAT/e6ff1745-9489-4bb0-83e2-458666174b82-GettyImages-96926811.jpg?crop=2999,1687,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T11:03:22Z","content":"If you're cleaning up grass clippings after mowing the lawn, you're likely losing money and wasting time. \r\nThat's because grass clippings hold valuable nutrients that can fertilize your lawn, experts say. \r\nBob Mann, an agronomist with the National Associati… [+2449 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"Opinion columnist and opinion contributor, James Alan Fox and Kristy Kellom, Opinion columnist and opinion contributor","title":"Columbine tragedy 20 years later: Despite fears, risk of dying in school shooting is low","description":"Obsessing over the risk and frequent reminders that a Columbine-style shooting could happen anywhere do more to elevate fear than alleviate it.","url":"https://www.usatoday.com/story/opinion/2019/04/19/columbine-20th-anniversary-school-shooting-risk-low-safety-scares-column/3498232002/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/presto/2019/04/17/USAT/2c0542cd-f662-4b53-a84b-356cb889aff6-A02_SECURITY_04.JPG?crop=1991,1116,x0,y0&width=3200&height=1680&fit=bounds","publishedAt":"2019-04-19T07:15:01Z","content":"Saturday marks the 20th anniversary of Columbine High School massacre in which a dozen students and one teacher were killed during a coldly-calculated assault with high-powered firearms. The images of the horrific event, broadcast live via satellite trucks an… [+5320 chars]"},{"source":{"id":"usa-today","name":"USA Today"},"author":"AP, AP","title":"Penguins and Lightning exits show playoff hockey differences","description":"First-round sweeps of the NHL-best Lightning and two-time champion Penguins show just how different playoff hockey is from the regular season","url":"https://www.usatoday.com/story/sports/nhl/2019/04/18/penguins-and-lightning-exits-show-playoff-hockey-differences/39364433/?utm_source=google&utm_medium=amp&utm_campaign=speakable","urlToImage":"https://www.gannett-cdn.com/-mm-/eb82a1d6b7d420155ae26c7d27be26168760b0f8/c=0-146-4500-2677/local/-/media/2019/04/18/USATODAY/usatsports/3c3d8925f8d04de0bb7ffe71d93fed57.jpg?width=3200&height=1680&fit=crop","publishedAt":"2019-04-19T02:05:45Z","content":"Scotty Bowman had already coached six teams to the Stanley Cup championship when his high-powered Detroit Red Wings that won 12 of their first 14 playoff games couldn't get the puck away from the New Jersey Devils and got swept in the 1995 final.\r\n\"They just … [+6818 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Ann Schmidt","title":"North Carolina girl finds megalodon shark tooth buried on beach: 'Is this a dream?'","description":"A middle school girl found a megalodon shark tooth while she was spending her spring break on the beach in North Carolina.","url":"https://www.foxnews.com/science/megalodon-shark-tooth-north-carolina-beach","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Megalodon20tooth20iStock.jpg","publishedAt":"2019-04-19T16:37:00Z","content":"A middle school girl stumbled upon a buried treasure while spending her spring break on a beach in North Carolina.\r\nAvery Fauth and her family love to scour the sand for shark teeth whenever they’re on a beach. But Fauth attributes her recent prehistoric find… [+1548 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Jennifer Earl","title":"Great white shark reveals razor-like teeth as it attempts to chomp photographer's camera","description":"This time, it's personal.","url":"https://www.foxnews.com/science/great-white-shark-bites-photographers-camera","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rtxl60q.jpg","publishedAt":"2019-04-19T14:23:35Z","content":"This time, it's personal.\r\nA giant great white shark opened wide as it attempted to make a meal out of wildlife photographer Peter Kragh's camera. Kragh shared the jaw-dropping footage taken during a trip off Guadalupe Island in Mexico on social media last mo… [+2044 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Frank Miles","title":"America’s first woman astronaut candidate dead at 88","description":"America’s first female astronaut candidate, pilot Jerrie Cobb, who pushed for equality in space but never reached its heights, has died.","url":"https://www.foxnews.com/science/americas-1st-woman-astronaut-candidate-dead-88","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Jerrie-Cobb-1.jpg","publishedAt":"2019-04-19T02:58:35Z","content":"America’s first female astronaut candidate who pushed for women in space but never reached its heights has died, reports said.\r\nPilot Jerrie Cobb died in Florida on March 18 following a brief illness. She was 88.\r\nNews of her death came Thursday from journali… [+2730 chars]"},{"source":{"id":null,"name":"Theatlantic.com"},"author":"Annika Neklason","title":"The Columbine Blueprint","description":"As the first school shooting to become a nationwide media spectacle, Columbine shaped a generation of mass-consumed tragedies.","url":"https://www.theatlantic.com/education/archive/2019/04/columbines-20th-anniversary-mass-media-shooting/587359/","urlToImage":"https://cdn.theatlantic.com/assets/media/img/mt/2019/04/Columbine-1/facebook.jpg?1555691753","publishedAt":"2019-04-19T16:43:52Z","content":"On that day two decades ago, news spread from Columbine quickly, and widely. By the time the killers concluded their shooting spree by turning their guns on themselves, less than an hour after firing their first shots, the attack had already become a media ev… [+12561 chars]"},{"source":{"id":null,"name":"Aynuriev.com"},"author":null,"title":"How to register a comany in the USA: the most comprehensive guide for founders","description":"Read the most comprehensive guide on How to Register a Company in the USA for a sturtup. All the details that make an incorporation of a company smooth.","url":"http://aynuriev.com/how-to-register-company-usa/","urlToImage":"http://aynuriev.com/wp-content/uploads/2019/03/ein_template-740x1024.jpg","publishedAt":"2019-04-19T09:35:59Z","content":"I am sure that anyone who ended up here had spent much time already trying to figure out how to incorporate a company in the USA for their startups. At least it was my case as we were initially located in Russia. I personally read tens of articles, instructio… [+29222 chars]"},{"source":{"id":null,"name":"Scientificamerican.com"},"author":"Alex Gilbert, Morgan D. Bazilian","title":"We Need a Space Resources Institute","description":"The moon and other bodies will ultimately be exploited; it’s crucial to do so in a thoughtful and organized way -- Read more on ScientificAmerican.com","url":"https://blogs.scientificamerican.com/observations/we-need-a-space-resources-institute/","urlToImage":"https://static.scientificamerican.com/blogs/cache/file/ED0C36A9-E128-47DE-881ADB5D05E8611A.jpg","publishedAt":"2019-04-19T11:00:00Z","content":"Fifty years ago this July, Apollo 11 delivered the first crewed mission to the surface of the moon. Today, the United States is on the verge of a space renaissance—returning astronauts to the moon, first on an orbiting space station and then a return to the s… [+7602 chars]"},{"source":{"id":null,"name":"Food52.com"},"author":"Erin Alexander","title":"9 Breezy, Beautiful Airbnb Beach Homes for a Quick Weekend Getaway","description":"Happy Friday! We’re here to make it even happier with our mini-series, The Weekend Has Landed. All month long we’re sharing ideas to help you make the most of those precious 50-something hours. I've been dreaming of palm trees, sunshine, and warm, crystal-blu…","url":"https://food52.com/blog/24057-best-airbnb-beach-houses-weekend-getaway?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+food52-TheAandMBlog+%28The+A%2BM+Blog%29","urlToImage":"https://images.food52.com/chNEI2OR5B61HbvlRTcnMjV8HJw=/fit-in/1200x1200/d8f2c636-3701-4ec7-b9ad-83349f666d4a--19a38adc-f6c7-441b-b523-bd587ceee1c2.jpg","publishedAt":"2019-04-19T14:00:00Z","content":"Happy Friday! Were here to make it even happier with our mini-series, The Weekend Has Landed. All month long were sharing ideas to help you make the most of those precious 50-something hours.\r\nI've been dreaming of palm trees, sunshine, and warm, crystal-blue… [+3569 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump slams 'fabricated' testimony in Mueller report","description":"\"Statements are made about me by certain people in the Crazy Mueller Report, in itself written by 18 Angry Democrat Trump Haters, which are fabricated & totally untrue,\" the president tweeted. A 400-page document outlining the findings of Special Counsel Robe…","url":"https://news.yahoo.com/trump-slams-fabricated-testimony-mueller-report-003156356.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/AAZy_9KXP.210dFfVP_vGw--~B/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/40960e9400026639a4b557c6cc3937cc7e3a5943.jpg","publishedAt":"2019-04-19T00:58:58Z","content":"Washington (AFP) - US President Donald Trump on Friday dismissed unfavorable testimony in the Mueller report on Russian election interference as \"fabricated\" and labelled the document \"crazy.\"\r\n\"Statements are made about me by certain people in the Crazy Muel… [+2753 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Trump ordered Michael Flynn to find Clinton’s emails during campaign, Mueller report finds","description":"Donald Trump ordered the man who would later serve briefly as his national security adviser, Michael Flynn, to find thousands of missing emails from Hillary Clinton’s computer server at the height of the 2016 presidential campaign, the special counsel’s repor…","url":"https://news.yahoo.com/trump-ordered-michael-flynn-clinton-092707593.html","urlToImage":null,"publishedAt":"2019-04-19T09:27:07Z","content":null},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Steve Goldstein","title":"Trump Today: Trump Today: President attacks notetakers in broadside against Mueller report he says exonerates him","description":"President Donald Trump on Friday, from his vacation home in Florida, on Friday said the Mueller report which he also said exonerated him was full of “bullshit.”","url":"https://www.marketwatch.com/story/trump-today-president-attacks-notetakers-in-broadside-against-mueller-report-he-says-exonerates-him-2019-04-19","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HH934_trump__ZG_20190419091546.jpg","publishedAt":"2019-04-19T13:51:00Z","content":"US President Donald Trump walks to speak with supporters after arriving on Air Force One at the Palm Beach International Airport to spend Easter weekend at his Mar-a-Lago resort on April 18, 2019 in West Palm Beach, Florida. \r\nPresident Donald Trump on Friday… [+1566 chars]"},{"source":{"id":null,"name":"Mentalfloss.com"},"author":"Michele Debczak","title":"Middle School Student Discovers Megalodon Tooth Fossil on Spring Break","description":"Avery Fauth was looking for shark teeth at North Topsail Beach in North Carolina when she found a Megalodon fossil the length of her palm.","url":"http://mentalfloss.com/article/580859/middle-school-student-discovers-megalodon-tooth-fossil","urlToImage":"https://images2.minutemediacdn.com/image/upload/c_crop,h_2914,w_5184,x_0,y_271/v1555685045/shape/mentalfloss/istock-478352665.jpg?itok=V329tyLA","publishedAt":"2019-04-19T15:45:00Z","content":"If you love ancient history and eerie, abandoned places, it might be time to break out the scuba diving gear and book a flight to Greece. As AFAR reports, the site of an ancient shipwreck near Alonissos, a Greek island in the Aegean Sea, has been turned into … [+1944 chars]"},{"source":{"id":null,"name":"Techdirt.com"},"author":"Tim Cushing","title":"Sixth Circuit Court Dumps Lawsuit Seeking To Hold Twitter Responsible For The Pulse Nightclub Shooting","description":"Another one of 1-800-LAW-FIRM's lawsuits has been tossed for a second time. After being shut down at the district level for attempting to hold social media companies responsible for the Pulse nightclub shooting in Orlando, Florida, the law firm asked the Sixt…","url":"https://www.techdirt.com/articles/20190418/13443542038/sixth-circuit-court-dumps-lawsuit-seeking-to-hold-twitter-responsible-pulse-nightclub-shooting.shtml","urlToImage":"https://ii.techdirt.com/s/t/i/td_icon_300.png","publishedAt":"2019-04-19T20:32:54Z","content":"from the another-attack-victim-taken-for-a-ride dept\r\nAnother one of 1-800-LAW-FIRM's lawsuits has been tossed for a second time. After being shut down at the district level for attempting to hold social media companies responsible for the Pulse nightclub sho… [+3617 chars]"},{"source":{"id":null,"name":"Slashfilm.com"},"author":"Ben Pearson","title":"Mickey and Minnie’s Runaway Railway, a New Mickey Mouse-Themed Attraction, Officially Coming to Disneyland","description":"During the 2017 D23 Expo, we learned that Mickey and Minnie’s Runaway Railway, the first-ever Mickey Mouse-themed ride-through theme park attraction, was coming to Walt Disney World. The ride was supposed to be ready by this fall to help with crowd management…","url":"https://www.slashfilm.com/mickey-and-minnies-runaway-railway-coming-to-disneyland/","urlToImage":"https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/Mickey-and-Minnies-Runaway-Railway-concept-art.jpg","publishedAt":"2019-04-19T19:00:00Z","content":"During the 2017 D23 Expo, we learned that Mickey and Minnie’s Runaway Railway, the first-ever Mickey Mouse-themed ride-through theme park attraction, was coming to Walt Disney World. The ride was supposed to be ready by this fall to help with crowd management… [+3142 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"gfineout@politico.com (Gary Fineout)","title":"Scott demands FBI information on Russian hacking","description":"'It is my goal to have free and fair elections with zero fraud,' wrote Scott.","url":"https://www.politico.com/states/florida/story/2019/04/19/floridas-scott-asks-fbi-hand-over-information-on-russian-hacking-979915","urlToImage":"https://static.politico.com/0f/fa/a5c6023942b683142b5eebb41999/polling-site.png","publishedAt":"2019-04-19T17:34:30Z","content":"The Florida Republican, in a letter to FBI Director Christopher Wray, asked the agency to provide information to both Congress and the Florida Department of State. | AP Photo\r\nTALLAHASSEE Sen. Rick Scott today demanded that the FBI release information about a… [+2069 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Matt Miller","title":"Matt Miller's Scouting Notebook: Biggest Insider Rumors of the 2019 NFL Draft","description":"The week before the  NFL  draft kicks off is a madhouse. Every agent wants information on where their players will be drafted...","url":"https://bleacherreport.com/articles/2831952-matt-millers-scouting-notebook-biggest-insider-rumors-of-the-2019-nfl-draft","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/571/hi-res-721aabc9f766ac5b067c78b0492e19d5_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T12:42:54Z","content":"Jonathan Bachman/Getty Images\r\nThe week before the NFL draft kicks off is a madhouse. Every agent wants information on where their players will be drafted. Every team source you have wants to know what you're hearing other teams will dowhich is where informat… [+10596 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Steve Silverman","title":"Jordan Brand Classic 2019: Rosters, Live Stream Schedule and Preview","description":"The 18th annual Jordan Classic will be held in a new venue Saturday, as many of the nation's top high school seniors will descend on the T-Mobile Arena in Las Vegas with an opportunity ...","url":"https://bleacherreport.com/articles/2832082-jordan-brand-classic-2019-rosters-live-stream-schedule-and-preview","urlToImage":"https://img.bleacherreport.net/img/images/photos/003/803/688/hi-res-525c30ae2921b4805854d0d3f64b3d7b_crop_exact.jpg?w=1200&h=1200&q=75","publishedAt":"2019-04-19T11:10:36Z","content":"James Wiseman will be competing in the Jordan Brand Classic Saturday in Las Vegas.Sam Forencich/Getty Images\r\nThe 18th annual Jordan Classic will be held in a new venue Saturday, as many of the nation's top high school seniors will descend on the T-Mobile Are… [+5847 chars]"},{"source":{"id":null,"name":"Medium.com"},"author":"Caroline Cox","title":"The Dark Side Of Fitness Tracking","description":"When health-focused wearable devices spark obsession, anxiety, and shame.","url":"https://elemental.medium.com/the-dark-side-of-fitness-tracking-9b218989bc47","urlToImage":"https://cdn-images-1.medium.com/focal/1200/632/42/31/1*fP_dLiy3GItI0OKkz8OEfQ.jpeg","publishedAt":"2019-04-19T16:50:57Z","content":"Since the first Bluetooth headset sold in 2000, the wearable tech industry has been hard at work inserting itself into our daily lives. And by all accounts, its working: The number of connected wearable devices worldwide is expected to jump to 1.1 billion or … [+4227 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Tim Rohan","title":"When the Canes Ruled the Draft: The Year Miami Had Six First-Rounders","description":"The story of Miami’s record six first-rounders in 2004 perfectly captures the unpredictability of the draft process.","url":"https://www.si.com/nfl/2019/04/19/miami-hurricanes-2004-nfl-draft-record-six-players-first-round","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/images/miami-2004-draft-class-pileup-big.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T13:42:09Z","content":"Toward the end of February 2004, the entire football world descended on the University of Miami for the Hurricanes pro day. Some estimate there were several hundred people in attendance, including coaches, executives, and scouts from every organization, it se… [+25631 chars]"},{"source":{"id":null,"name":"Si.com"},"author":"Laken Litman","title":"Gauging the Success Rate of College Football Head Coaches Who Are Also Alumni","description":"College football programs that hire alumni set up their school legends for rousing second acts ... but it doesn't always go according to plan.","url":"https://www.si.com/college-football/2019/04/19/alumni-head-coaches-jim-harbaugh-pat-fitzgerald","urlToImage":"https://imagesvc.timeincapp.com/v3/mm/image?url=https://cdn-s3.si.com/s3fs-public/2019/04/19/college-football-coaches-alumni-jim-harbaugh-pat-fitzgerald.jpg&w=1200&h=628&c=sc&poi=face&q=85","publishedAt":"2019-04-19T17:07:19Z","content":"When Jim Harbaugh came home to Michigan, he told stories of sitting in Bo Schembechlers office with his feet propped up on his desk. When Scott Frost came home to Nebraska, Cornhuskers fans broke the spring game attendance record. When Kirby Smart came home t… [+15717 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Science X staff","title":"Hurricane Michael gets an upgrade to rare Category 5 status","description":"Hurricane Michael, which devastated the Florida Panhandle last fall, was actually stronger than initially measured, prompting forecasters to posthumously upgrade it from a Category 4 storm to a Category 5, the National Oceanic and Atmospheric Administration a…","url":"https://phys.org/news/2019-04-hurricane-michael-rare-category-status.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2019/hurricanemic.jpg","publishedAt":"2019-04-19T15:08:56Z","content":"Hurricane Michael, which devastated the Florida Panhandle last fall, was actually stronger than initially measured, prompting forecasters to posthumously upgrade it from a Category 4 storm to a Category 5, the National Oceanic and Atmospheric Administration a… [+4252 chars]"},{"source":{"id":null,"name":"Phys.org"},"author":"Dave Heller","title":"Airbnb's explosive growth jolts hotel industry's bottom line","description":"Hospitality service Airbnb is fast becoming the 800-pound gorilla that's shaking up the hotel industry and forever changing it.","url":"https://phys.org/news/2019-04-airbnb-explosive-growth-jolts-hotel.html","urlToImage":"https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2018/airbnb.jpg","publishedAt":"2019-04-19T09:57:39Z","content":"Hospitality service Airbnb is fast becoming the 800-pound gorilla that's shaking up the hotel industry and forever changing it.\r\nNew research from Florida State University finds Airbnb's exponential growth worldwide is devouring an increasing share of hotel r… [+4468 chars]"},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Jonathan Sawyer","title":"Eric Emanuel & UNKNWN’s Tie-Dye Shorts Are Straight Miami","description":"Designer Eric Emanuel partners with South Florida boutique UNKNWN to release a new pair of the essential summer shorts. Serving as a modern interpretation of the high school gym uniform, the shorts are a nod to the Miami Dolphins. Eric Emanuel and UNKNWN’s co…","url":"https://www.highsnobiety.com/p/eric-emanuel-unknwn-miami-shorts-summer-2019/","urlToImage":"https://static.highsnobiety.com/thumbor/J_MjHQBcVmqA9JMzP-noRiwMsI0=/fit-in/800x480/smart/static.highsnobiety.com/wp-content/uploads/2019/04/18235202/eric-emanuel-unknwn-miami-shorts-summer-2019-feature.jpg","publishedAt":"2019-04-19T17:10:28Z","content":null},{"source":{"id":null,"name":"Highsnobiety.com"},"author":"Chris Danforth","title":"Smokepurpp Talks Losing Jewelry & Shops For New Necklaces With GQ","description":"GQ sat down with none other than Smokepurpp to highlight his jewelry collection, before being joined by Avianne & Co who supplied the Florida rapper with some new pieces. While wearing around $275,000 worth of iced-out pieces including a flooded $60K-70K Aude…","url":"https://www.highsnobiety.com/p/smokepurpp-jewelry-collection/","urlToImage":"https://static.highsnobiety.com/thumbor/LoVK7Z-iMf9eEBsg9DXt8CpSi1M=/fit-in/960x576/smart/static.highsnobiety.com/wp-content/uploads/2019/04/19104217/smokepurpp-jewelry-collection-00.jpg","publishedAt":"2019-04-19T09:21:10Z","content":null},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"Lindsay Gibbs","title":"Releasing the Robert Kraft tape would further harm sex workers","description":"A few weeks after the New England Patriots won their sixth Super Bowl in February, Florida prosecutors charged Patriots owner Robert Kraft with two counts of soliciting a prostitute at the Orchids of Asia day spa, a massage parlor in Jupiter, Florida. In head…","url":"https://thinkprogress.org/releasing-robert-kraft-tape-would-harm-sex-workers-ffa106b5a689/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1137183198.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-19T20:48:43Z","content":"A few weeks after the New England Patriots won their sixth Super Bowl in February, Florida prosecutors charged Patriots owner Robert Kraft with two counts of soliciting a prostitute at the Orchids of Asia day spa, a massage parlor in Jupiter, Florida. In head… [+6833 chars]"},{"source":{"id":null,"name":"Thinkprogress.org"},"author":"E.A. Crunden","title":"2020 Democratic contenders seize on opposition to offshore drilling in South Carolina","description":"Democratic presidential contenders are taking note of swelling opposition to offshore drilling in the Southeast, especially in the early primary state of South Carolina, where lawmakers are working to head off federal drilling efforts. The issue is emerging a…","url":"https://thinkprogress.org/offshore-drilling-warren-2020-south-carolina-trump-3cd0f9640132/","urlToImage":"https://thinkprogress.org/wp-content/uploads/2019/04/GettyImages-1133048933.jpg?w=1920&h=1080&crop=1","publishedAt":"2019-04-19T17:08:41Z","content":"Democratic presidential contenders are taking note of swelling opposition to offshore drilling in the Southeast, especially in the early primary state of South Carolina, where lawmakers are working to head off federal drilling efforts.\r\nThe issue is emerging … [+6375 chars]"},{"source":{"id":null,"name":"Wfla.com"},"author":"WFLA 8 On Your Side Staff","title":"CNN reporter stomps on lizard while doing live TV...","description":"A frisky Florida lizard made a brief appearance on CNN Friday and got \"stomped out\" on live television.","url":"https://www.wfla.com/news/florida/watch-cnn-reporter-stomps-florida-lizard-during-live-report/1938912247","urlToImage":"https://media.wfla.com/nxs-wflatv-media-us-east-1/photo/2019/04/19/florida%20lizard_1555691132854_83277829_ver1.0_1280_720.jpg","publishedAt":"2019-04-19T17:34:40Z","content":"A brown anole sits on a tree branch in the Corkscrew Swamp Sanctuary, Thursday, June 7, 2018, near Naples, Fla. (AP Photo/Brynn Anderson)\r\nA frisky Florida lizard made a brief appearance on CNN Friday and got \"stomped out\" on live television.\r\nCNN White House… [+1209 chars]"},{"source":{"id":null,"name":"Trust.org"},"author":"Thomson Reuters Foundation","title":"TRIBAL GRIDLOCK CONTINUES...","description":"TRIBAL GRIDLOCK CONTINUES... (Top headline, 9th story, link ) Related stories: REUTERS POLL: TRUMP APPROVAL FALLS TO 37%... ELIZABETH WARREN CALLS FOR IMPEACHMENT... ROMNEY: I Am Sickened... NAPOLITANO: Mueller Report Might Be Enough to Prosecute... Could be …","url":"http://news.trust.org/item/20190419204919-ugqh1","urlToImage":"https://d2sh4fq2xsdeg9.cloudfront.net/contentAsset/image/93ac5432-ded1-4e5f-881f-0834f8a424dc/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100","publishedAt":"2019-04-19T21:40:36Z","content":"(Adds new poll)\r\nBy Letitia Stein and Tim Reid\r\nCLEARWATER, Florida/LAS VEGAS, April 19 (Reuters) - After months as volunteer activists demanding that U.S. President Donald Trump be impeached, Eileen and Michael O'Brien sat on their couch on Thursday, cracked… [+4767 chars]"},{"source":{"id":null,"name":"Pressherald.com"},"author":null,"title":"Living on wrong side of a time zone hazardous to health...","description":"Living on wrong side of a time zone hazardous to health... (Second column, 11th story, link ) Related stories: Found! Genes that stop us from getting fat... Advertise here","url":"https://www.pressherald.com/2019/04/19/living-on-the-wrong-side-of-a-time-zone-can-be-hazardous-to-your-health/","urlToImage":"https://multifiles.pressherald.com/uploads/sites/10/2019/04/clock-1024x664.jpg","publishedAt":"2019-04-19T17:19:40Z","content":"To understand the study, co-authored by Osea Giuntella of the University of Pittsburgh and Fabrizio Mazzonna of the Universita della Svizzera Italiana, it is important to understand how time zones affect local sunset times. Traveling east to west, sunrise and… [+3651 chars]"},{"source":{"id":null,"name":"Fivethirtyeight.com"},"author":"Adam Kelsey and Will Steakin, Adam Kelsey https://fivethirtyeight.com/contributors/adam-kelsey/ Adam.M.Kelsey@abc.com","title":"What The Potential 2020 Candidates Are Doing And Saying, Vol. 15","description":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 — Democrats and even some Republicans — we’re keeping tabs on the field as it develops. Each week, we’ll run…","url":"https://fivethirtyeight.com/features/what-the-potential-2020-candidates-are-doing-and-saying-vol-15/","urlToImage":"https://fivethirtyeight.com/wp-content/uploads/2019/04/2020roundup-0419-16x9.png?w=1600","publishedAt":"2019-04-19T09:59:29Z","content":"Welcome to a weekly collaboration between FiveThirtyEight and ABC News. With 5,000 people seemingly thinking about challenging President Trump in 2020 Democrats and even some Republicans were keeping tabs on the field as it develops. Each week, well run throu… [+15151 chars]"},{"source":{"id":null,"name":"Boredpanda.com"},"author":"Rokas L","title":"Owl Brings Up Duckling After Mistaking The Bird’s Egg For Its Own","description":"Recently, artist and photographer Laurie Wolf was in her backyard in Jupiter, Florida, inspecting all the different birdhouses (also known as nesting boxes) she and her family have put together. To her surprise, Laurie noticed a mother wood duck moving her eg…","url":"https://www.boredpanda.com/owl-ducking-egg-raises-capture-laurie-wolf/","urlToImage":"https://static.boredpanda.com/blog/wp-content/uploads/2019/04/owl-ducking-egg-raises-capture-laurie-wolf-fb.png","publishedAt":"2019-04-19T14:02:21Z","content":"Recently, artist and photographer Laurie Wolf was in her backyard in Jupiter, Florida, inspecting all the different birdhouses (also known as nesting boxes) she and her family have put together. To her surprise, Laurie noticed a mother wood duck moving her eg… [+3069 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"Home Bancshares Inc (HOMB) Q1 2019 Earnings Call Transcript","description":"HOMB earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/18/home-bancshares-inc-homb-q1-2019-earnings-call-tra.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519721/featured-transcript-logo.png","publishedAt":"2019-04-19T03:36:23Z","content":"Image source: The Motley Fool.\r\nHome Bancshares Inc  (NASDAQ:HOMB)Q1 2019 Earnings CallApril 18, 2019, 2:00 p.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGreetings, ladies and gentlemen. Welcome t… [+69352 chars]"},{"source":{"id":null,"name":"Fool.com"},"author":"newsfeedback@fool.com (Motley Fool Transcribers)","title":"RLI Corp (RLI) Q1 2019 Earnings Call Transcript","description":"RLI earnings call for the period ending March 31, 2019.","url":"https://www.fool.com/earnings/call-transcripts/2019/04/18/rli-corp-rli-q1-2019-earnings-call-transcript.aspx","urlToImage":"https://g.foolcdn.com/editorial/images/519694/featured-transcript-logo.png","publishedAt":"2019-04-19T00:24:47Z","content":"Image source: The Motley Fool.\r\nRLI Corp  (NYSE:RLI)Q1 2019 Earnings CallApril 18, 2019, 11:00 a.m. ET\r\nContents:\r\nPrepared Remarks\r\nQuestions and Answers\r\nCall Participants\r\nPrepared Remarks:\r\nOperator\r\nGood morning, and welcome, ladies and gentlemen to the … [+36914 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Igor Derysh","title":"Mueller: Russians breached a Florida county's computer system ahead of 2016 election","description":"Former Sen. Bill Nelson's 2018 warning on Russian cyberattacks might not have deserved those \"Pinocchios\"","url":"https://www.salon.com/2019/04/19/mueller-russians-breached-a-florida-countys-computer-system-ahead-of-2016-election/","urlToImage":"https://media.salon.com/2018/11/florida-recount.jpg","publishedAt":"2019-04-19T18:10:45Z","content":"Russia’s military intelligence agency gained access to at least one Florida county government’s computer system in a sweeping cyberattack targeting Florida election officials, special counsel Robert Mueller revealed in his final report.\r\nAccording to Mueller’… [+3655 chars]"},{"source":{"id":null,"name":"Salon.com"},"author":"Cody Fenwick","title":"Donald Trump just tried to blame Barack Obama for Russia’s 2016 election interference","description":"To make this claim on the day when Mueller revealed so much about his campaign’s duplicity is brazen, even for him","url":"https://www.salon.com/2019/04/19/donald-trump-just-tried-to-blame-barack-obama-for-russias-2016-election-interference_partner/","urlToImage":"https://media.salon.com/2017/06/trump-obama3.jpg","publishedAt":"2019-04-19T10:45:35Z","content":"As analysts and reporters continue to pore over Special Counsel Robert Mueller’s report, President Donald Trump is in Florida, and he’s — what else? — tweeting out nonsense:\r\nTrump has tried to blame President Barack Obama for Russia’s efforts to interfere in… [+1580 chars]"},{"source":{"id":null,"name":"Espn.com"},"author":null,"title":"Panthers' brass needs a strong draft to avoid facing the music","description":"With losing seasons in two of the past three years, GM Marty Hurney and coach Ron Rivera seem to be at a fork in the road heading into the draft.","url":"http://www.espn.com/blog/carolina-panthers/post/_/id/32028/panthers-brass-needs-a-strong-draft-to-avoid-facing-the-music","urlToImage":"https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0418%2Fr531180_1296x729_16%2D9.jpg","publishedAt":"2019-04-19T05:40:26Z","content":"CHARLOTTE, N.C. -- The Carolina Panthers were set to begin their pre-draft news conference on Wednesday when general manager Marty Hurney blurted, “Fire away.\"\r\nCoach Ron Rivera laughed and responded, “What do you think this is, a firing squad? Fire away and … [+3943 chars]"},{"source":{"id":null,"name":"Indianexpress.com"},"author":"AP","title":"‘A good day’: Donald Trump claims victory with Mueller report out","description":"Twelve times Trump took to Twitter in the hours before Attorney General William Barr outlined the findings of the report. The president proclaimed his innocence and insisted that the investigation was politically motivated.","url":"https://indianexpress.com/article/world/a-good-day-donald-trump-claims-victory-with-mueller-report-out-5683416/","urlToImage":"https://images.indianexpress.com/2019/04/william-barr.jpg?w=759","publishedAt":"2019-04-19T02:58:43Z","content":"FILE PHOTO: U.S. Attorney General William Barr departs after speaking at a news conference to discuss Special Counsel Robert Mueller’s report on Russian interference in the 2016 U.S. presidential race, in Washington, U.S., April 18, 2019. REUTERS/Jonathan Ern… [+5160 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Rachel Handler","title":"The File: Ariana Grande","description":"In less than six years, she has become one of the most successful pop artists of all time. Who is she?","url":"http://www.vulture.com/2019/04/a-guide-to-ariana-grande-pop-stardom.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/11/magazine/11-ariana-lede.w1200.h630.jpg","publishedAt":"2019-04-19T10:00:09Z","content":"Ariana Grande grew up in what she has called a stereotypical poker-playing, loud, friendly, food-shoving, loving Italian family. Her mother was the CEO of a company that manufactures military communications equipment and her father a graphic designer. In 2010… [+5309 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Rachel Handler","title":"Penny Lane Wants You to Hail Satan?","description":"Lane’s breakout film is about the misunderstood world of Satanism. In a Halloween store in New York, we discuss how the Satanic Temple got serious.","url":"http://www.vulture.com/2019/04/penny-lane-wants-you-to-hail-satan.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/18/18-penny-lane-2.w1200.h630.jpg","publishedAt":"2019-04-19T15:59:54Z","content":"Penny Lane and I are standing in the middle of Abracadabra, a Halloween store in New Yorks Flatiron District, watching a life-size animatronic zombie puke into a trash can. Moments earlier, wed both thought it was a real person and almost greeted it formally.… [+11747 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Paul Thompson","title":"This Week in Rap: Kodak Black Just Keeps on Imploding","description":"In less than two weeks, Kodak Black has more or less spit on Nipsey Hussle’s grave, briefly gone missing, and then got arrested at the border.","url":"http://www.vulture.com/2019/04/this-week-in-rap-kodak-black-nipsey-laura-ingraham-anderson-paak.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/19/19-kodak-black.w1200.h630.jpg","publishedAt":"2019-04-19T18:11:23Z","content":"Every week, Vulture runs through the best, most interesting, and sometimes most confusing rap releases and other news.In this installment: Kodak Blacks messy last two weeks, Anderson .Paak gets back on track, Laura Ingraham hits a new low in discussing the la… [+7320 chars]"},{"source":{"id":null,"name":"Vulture.com"},"author":"Rebecca Alter","title":"11 TV Seders, Ranked in Order of Accuracy","description":"From Curb Your Enthusiasm to Sesame Street.","url":"http://www.vulture.com/article/best-tv-seders-passover.html","urlToImage":"https://pixel.nymag.com/imgs/daily/vulture/2019/04/19/seder/19-seder-gossip-girl.w1200.h630.jpg","publishedAt":"2019-04-19T19:43:37Z","content":"Why is this list different from all other lists? For one, it rounds up Passover episodes, a rare and under-examined breed of holiday special. Im happy to be corrected (I do self-identify as a Simple ChildWicked Child cusp), but Passover representation in tele… [+9555 chars]"},{"source":{"id":null,"name":"People.com"},"author":"Nancy Kruh","title":"What's Making Devin Dawson Smile? For Starters, Blake Shelton Performing His Song","description":"For a guy who’s known for not smiling much, Devin Dawson has noticed his face is acting pretty strange these days. “I’m smiling as much as I ever have in my life,” he tells PEOPLE. But then he has a lot to smile about. Last month he proposed to his girlfriend…","url":"https://people.com/country/devin-dawson-california-fire-benefit-tour/","urlToImage":"https://peopledotcom.files.wordpress.com/2019/04/devin-dawson-1.jpg?crop=0px%2C61px%2C1800px%2C946px&resize=1200%2C630","publishedAt":"2019-04-19T20:35:00Z","content":"For a guy who’s known for not smiling much, Devin Dawson has noticed his face is acting pretty strange these days. Im smiling as much as I ever have in my life, he tells PEOPLE. But then he has a lot to smile about.\r\nLast month he proposed to his girlfriend o… [+5634 chars]"},{"source":{"id":null,"name":"Nba.com"},"author":"NBA.com","title":"About Last Night: White's revenge","description":"One game after being torched by Jamal Murray, who scored 22 of his 24 points in the fourth quarter in the Nuggets' Game 2 win over the Spurs, Derrick White showed up for Game 3 like a fire-breathing dragon. The result was a 118-108 home-court victory for the …","url":"http://www.nba.com/article/2019/04/18/about-last-night-4-18-19","urlToImage":"https://cdn.nba.net/nba-drupal-prod/styles/landscape_1045w/s3/2019-04/derrick-white-vs-nuggest-gm3.jpg?itok=Ty4jMb9i","publishedAt":"2019-04-19T06:10:52Z","content":"My, how the pendulum swings in playoff basketball.\r\nOne game after being torched by Jamal Murray, who scored 22 of his 24 points in the fourth quarter in the Nuggets' Game 2 win over the Spurs, Derrick White showed up for Game 3 like a fire-breathing dragon. … [+5326 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Priya Shukla, Contributor, Priya Shukla, Contributor https://www.forbes.com/sites/priyashukla/","title":"Sturgeon Aquafarms Aims To Sustainably Produce Caviar While Restoring Wild Sturgeon Populations","description":"Sturgeon Aquafarms is the only beluga sturgeon aquaculture facility in the United States and aims to provide sustainably farmed caviar while helping restore wild beluga sturgeon populations in the Caspian Sea.","url":"https://www.forbes.com/sites/priyashukla/2019/04/19/sturgeon-aquafarms-aims-to-sustainably-produce-caviar-while-restoring-wild-sturgeon-populations/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fthumbnails%2Fblog_5997%2Fpt_5997_1354_o.jpg%3Ft%3D1555687802","publishedAt":"2019-04-19T15:30:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nSturgeon&amp;nbsp;have been on this planet for over&amp;nbsp;200 million years, coming into existence long before the dinosaurs evolved and outlasting them into the present day. Like salmon, sturgeon spe… [+6159 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Jon Marks, Contributor, Jon Marks, Contributor https://www.forbes.com/sites/jonmarks/","title":"New Coach Vigneault Says Flyers Will Win A Stanley Cup To Complete His Bucket List","description":"New Flyers coach Alain Vigneault thinks his team, which just missed the playoffs for the 4th time in 7 years, isn't that far away from being a Stanley Cup threat.  With a solid mix of youth and veterans. plus enough cap space to improve the roster the Flyers,…","url":"https://www.forbes.com/sites/jonmarks/2019/04/19/new-coach-vigneault-says-flyers-will-win-a-stanley-cup-to-complete-his-bucket-list/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F486538939%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T15:31:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nAfter a year away from the game Alain Vigneault has been hired as coach of the Flyers. He replaces interim coach Scott Gordon, who took over from Dave Hakstol in December.&amp;nbsp; The Flyers, who finis… [+11765 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Fiona Tapp, Contributor, Fiona Tapp, Contributor https://www.forbes.com/sites/fionatapp/","title":"These Are The 12 Best Easter Egg Hunts Happening This Weekend","description":"It's not too late to organize a fun Easter weekend away. Check out these Easter egg hunts across the country and beyond.","url":"https://www.forbes.com/sites/fionatapp/2019/04/19/these-are-the-12-best-easter-egg-hunts-happening-this-weekend/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1141777395%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T17:09:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nEaster. Two little girls with a bunny ears and colorful eggs have fun in the meadow\r\nGetty\r\nThe best Easter childhood memories center around chocolate, a big dandy bunny and of course an exciting Easter … [+14406 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"JV Chamary, Contributor, JV Chamary, Contributor https://www.forbes.com/sites/jvchamary/","title":"Why Do Spoilers For 'Game of Thrones' Make You Angry?","description":"The science behind why revealing plot twists can trigger 'psychological reactance'.","url":"https://www.forbes.com/sites/jvchamary/2019/04/19/game-of-thrones-science-spoilers-anger/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fjvchamary%2Ffiles%2F2019%2F04%2Fspoilers11-1200x675.jpg","publishedAt":"2019-04-19T17:12:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nKit Harington as Jon Snow in 'Game of Thrones'\r\nHBO\r\nImagine this: you're waiting in line at the store or scrolling through your Facebook feed when, out of the blue, somebody mentions what happened on la… [+19685 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Adrienne Jordan, Contributor, Adrienne Jordan, Contributor https://www.forbes.com/sites/adriennejordan/","title":"How to Spend An Active Weekend In Jacksonville, Florida","description":"How to do a weekend retreat in one of the hottest southern cities","url":"https://www.forbes.com/sites/adriennejordan/2019/04/19/how-to-spend-an-active-weekend-in-jacksonville-florida/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fadriennejordan%2Ffiles%2F2019%2F04%2FJAX2-12-1200x763.jpg","publishedAt":"2019-04-19T15:07:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nE2Ride.com bike tours\r\nJynarra Brinson\r\nFor a southern getaway jam-packed with healthy pursuits and active adventure, look no further than Jacksonville. From its&amp;nbsp;22 miles of beaches, designated … [+10504 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Carrie Coolidge, Contributor, Carrie Coolidge, Contributor https://www.forbes.com/sites/carriecoolidge/","title":"This Resort-Style $5.4 million Mansion In Parkland Florida Has Its Own Hair Salon","description":"A $5.4 million mansion in a resort-like setting in Parkland, Florida has its own professional-level hair salon. Owned by Jeff Aronson, owner of MMA team TitanFC and wife Carolyn, founder and chief executive of \"it's a 10 Haircare\", the home is listed with ONE…","url":"https://www.forbes.com/sites/carriecoolidge/2019/04/19/this-resort-style-5-4-million-mansion-in-parkland-florida-has-its-own-hair-salon/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fcarriecoolidge%2Ffiles%2F2019%2F04%2F9136-NW-66th-Ln-Parkland-FL-large-054-35-Front-Yard-1500x1000-72dpi.jpg","publishedAt":"2019-04-19T14:00:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nBuilt in 2009, the 17,280-square foot estate offers a resort-like setting with landscaped gardens, water fountains and a koi pond.\r\nCourtesy of ONE Sothebys International Realty\r\nTo be sure, mansions all… [+7362 chars]"},{"source":{"id":null,"name":"Forbes.com"},"author":"Erik Kobayashi-Solomon, Contributor, Erik Kobayashi-Solomon, Contributor https://www.forbes.com/sites/erikkobayashisolomon/","title":"Climate Change: The Greatest Opportunity Of All Time","description":"The climate is changing in ways that will not be kind to those clinging to the status quo. Intelligent investors take note.","url":"https://www.forbes.com/sites/erikkobayashisolomon/2019/04/19/climate-change-the-greatest-opportunity-of-all-time/","urlToImage":"https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1143131472%2F960x0.jpg%3Ffit%3Dscale","publishedAt":"2019-04-19T17:49:00Z","content":"Share to facebook\r\nShare to twitter\r\nShare to linkedin\r\nBriksdal glacier with melting blue ice. Jostedalsbreen National Park, Norway.\r\nGetty\r\nWhat a wonderful opportunity climate change represents for intelligent investors and entrepreneurs!\r\nClimate change i… [+8483 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Charles Rabin","title":"Florida man charged with threatening Cory Booker, Rashida Tlaib, Eric Swalwell - Miami Herald","description":"Florida man charged with threatening Cory Booker, Rashida Tlaib, Eric Swalwell Miami Herald Florida man arrested over violent threats against Swalwell, Booker, Tlaib POLITICO Man arrested for threatening Dems, citing Omar comments | TheHill The Hill Florida m…","url":"https://www.miamiherald.com/news/politics-government/article229463414.html","urlToImage":"https://www.miamiherald.com/latest-news/4u6pfn/picture229003569/alternates/LANDSCAPE_1140/swalwell.jpeg","publishedAt":"2019-04-19T17:24:00Z","content":"Florida man charged with threatening Cory Booker, Rashida Tlaib, Eric Swalwell\r\nFederal authorities have arrested a South Florida man and accused him of leaving menacing, racist and homophobic messages on the office voicemails of several Democratic members of… [+2803 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Anna Hopkins","title":"Florida middle school girls arrested after teacher discovered their plans to kill nine people, police say - Fox News","description":"Florida middle school girls arrested after teacher discovered their plans to kill nine people, police say Fox News Florida students arrested for conspiracy to commit murder ABC15 Arizona Deputies: Avon Park girls created hit list, planned to kill 9 students F…","url":"https://www.foxnews.com/us/florida-middle-school-girls-arrested-after-teacher-discovered-their-plans-to-kill-nine-people-police-say","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/school.jpg","publishedAt":"2019-04-19T17:38:07Z","content":"Two female students at a Florida middle school were arrested this week after a teacher discovered their plans to kill at least nine people, police say.\r\nThe teacher reportedly became suspicious when she noticed the two 14-year-old girls acting \"hysterical\" wh… [+2527 chars]"},{"source":{"id":null,"name":"Fox4now.com"},"author":"","title":"Florida students arrested for conspiracy to commit murder - Fox 4","description":"Florida students arrested for conspiracy to commit murder Fox 4 Two teen girls arrested for 'plotting nine murders' in Florida BBC News Florida middle school girls arrested after teacher discovered their plans to kill nine people, police say Fox News 2 middle…","url":"https://www.fox4now.com/news/national/florida-middle-school-students-arrested-for-conspiracy-murder","urlToImage":"https://ewscripps.brightspotcdn.com/dims4/default/1999333/2147483647/strip/true/crop/1000x525+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fe8%2Fde%2F7c7b57be4a4b97b22c7e3f5cd8ef%2Favon-park.png","publishedAt":"2019-04-19T15:49:00Z","content":"AVON PARK, Florida Two 14-year-old Avon Park Middle School students are facing felony charges for conspiracy to commit murder and kidnapping after their arrests on Wednesday. \r\nAccording to arrest records, a teacher noticed the girls acting \"hysterical\" while… [+2592 chars]"},{"source":{"id":null,"name":"Abc15.com"},"author":null,"title":"Florida students arrested for conspiracy to commit murder - ABC15 Arizona","description":"Florida students arrested for conspiracy to commit murder ABC15 Arizona Florida middle school girls arrested after teacher discovered their plans to kill nine people, police say Fox News Deputies: Avon Park girls created hit list, planned to kill 9 students F…","url":"https://www.abc15.com/news/national/florida-middle-school-students-arrested-for-conspiracy-murder","urlToImage":null,"publishedAt":"2019-04-19T15:49:00Z","content":null},{"source":{"id":null,"name":"Richmond.com"},"author":"JOHN BOYER Richmond Times-Dispatch","title":"Severe storms on the way to the Richmond area this evening; tornado watch in effect until midnight - Richmond.com","description":"Severe storms on the way to the Richmond area this evening; tornado watch in effect until midnight Richmond.com LIVE: At least five fatalities confirmed as severe outbreak brings tornadoes, flooding from Florida to Virginia AccuWeather.com The Latest: Mississ…","url":"https://www.richmond.com/weather/storms-will-bring-widespread-heavy-rain-isolated-tornadoes-to-central/article_8b880d5f-bb86-502f-a004-ed6532a9e04c.html","urlToImage":"https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/0/5e/05e74de6-608d-590a-977c-5bd61fd67476/5cba4d1a2bc22.image.png?resize=920%2C505","publishedAt":"2019-04-19T21:55:00Z","content":"Conditions are favorable for severe storms with damaging winds, brief tornadoes and flash flooding across Virginia this evening.\r\nReview your weather safety plan and be sure you can receive any warnings issued by the National Weather Service.\r\n6:45 p.m. updat… [+2397 chars]"},{"source":{"id":null,"name":"Wftv.com"},"author":"Irene Sans","title":"ORLANDO WEATHER: Hail, damaging winds, chance for tornadoes in Central Florida on Friday - WFTV Orlando","description":"ORLANDO WEATHER: Hail, damaging winds, chance for tornadoes in Central Florida on Friday WFTV Orlando LIVE: At least five fatalities confirmed as severe outbreak brings tornadoes, flooding from Florida to Virginia AccuWeather.com Weather NC: Severe storms exp…","url":"https://www.wftv.com/weather/oia-delays-cancellations-severe-threat-ends-for-central-florida-weekend-forecast/941592401","urlToImage":"https://mediaweb.wftv.com/photo/2019/04/19/radar_1555703142161_15064080_ver1.0_640_360.PNG","publishedAt":"2019-04-19T22:41:15Z","content":"ORLANDO, Fla. - After severe storms sweep over Central Florida, weather will continue to improve overnight. Jacket weather for the next few mornings, crisp and sunny afternoons. \r\nDownload our weather app: Receive watches and warning as soon as they are issue… [+6197 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Howard Cohen","title":"Storms are here, Florida drivers, and will be all day. Easter weekend will bring a change - Miami Herald","description":"Storms are here, Florida drivers, and will be all day. Easter weekend will bring a change Miami Herald LIVE: Tornado threat ramps up from Florida to Virginia after storms turn deadly in Deep South AccuWeather.com NC weather: Severe storms expected Friday, tor…","url":"https://www.miamiherald.com/news/local/article229454909.html","urlToImage":"https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557041001/a4876cf7-5e68-4a37-95ce-0319fafec598/ff933b0a-137b-4ae1-9f31-0e2e1c0b4c21/1280x720/match/image.jpg","publishedAt":"2019-04-19T12:06:00Z","content":"Storms are here, Florida drivers, and will be all day. Easter weekend will bring a change\r\n×\r\nEver heard of the term 'supercell' but didn't know what it was? Learn about these powerful storms responsible for most tornadoes in the United States and other thund… [+2607 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Deadly storms threatening several states - ABC News","description":"A strong storm system barreling through the South on Friday killed an 8-year-old girl in Florida and threatened to bring tornadoes to large parts of the Caro...","url":"https://www.youtube.com/watch?v=Q1MU4uIzHtY","urlToImage":"https://i.ytimg.com/vi/Q1MU4uIzHtY/maxresdefault.jpg","publishedAt":"2019-04-19T23:32:16Z","content":"A strong storm system barreling through the South on Friday killed an 8-year-old girl in Florida and threatened to bring tornadoes to large parts of the Carolinas and Virginia.\r\nWATCH THE FULL EPISODE OF 'WORLD NEWS TONIGHT':https://bit.ly/2KZJAsq\r\nWATCH OTHE… [+108 chars]"},{"source":{"id":null,"name":"Miamiherald.com"},"author":"Charles Rabin","title":"Video: Broward deputies body slam, pepper spray teens - Miami Herald","description":"Video: Broward deputies body slam, pepper spray teens Miami Herald A video shows Broward County, Florida, deputies body slamming and pepper spraying students outside a McDonalds near JP Taravella High School.","url":"https://www.miamiherald.com/news/local/community/broward/article229460669.html","urlToImage":"https://cf-images.us-east-1.prod.boltdns.net/v1/static/5618154292001/a4a2e8eb-c6d5-4054-8f29-5e9733e6c288/96e6988f-d9e7-4590-93b7-abc9d3eac159/1280x720/match/image.jpg","publishedAt":"2019-04-19T16:46:00Z","content":"Video shows BSO deputies body slamming, pepper spraying a student\r\n×\r\nVideo posted on social media shows Broward sheriff's deputies pepper-spraying and punching a teen during a confrontation near J.P. Taravella High. \r\nBy \r\nThe mayor of Broward County on Frid… [+2810 chars]"},{"source":{"id":null,"name":"Clickorlando.com"},"author":"Daniel Dahm, Troy Bridges","title":"LIVE RADAR: Strong storms could bring severe weather to Orlando area - WKMG News 6 & ClickOrlando","description":"LIVE RADAR: Strong storms could bring severe weather to Orlando area WKMG News 6 & ClickOrlando Fast-moving storms will rip through Central Florida, bringing the chance of severe weather. View full coverage on Google News","url":"https://www.clickorlando.com/weather/severe-weather-possible-today-in-orlando-area","urlToImage":"https://media.clickorlando.com/photo/2019/04/19/radarnow_1555684194904_21744689_ver1.0_1280_720.JPG","publishedAt":"2019-04-19T10:11:16Z","content":"ORLANDO, Fla. - There is a risk of severe weather Friday in Central Florida.\r\n\"There will be a few pop-up showers and thunderstorms ahead of the actual front that moves through later in the afternoon,\" News 6 meteorologist Troy Bridges said. \"The main threat … [+1583 chars]"},{"source":{"id":"fox-news","name":"Fox News"},"author":"Associated Press","title":"The Latest: Storm topples tree, kills girl in Florida - Fox News","description":"The Latest: Storm topples tree, kills girl in Florida Fox News The Latest on severe weather in the South (all times local): 9:40 a.m.. View full coverage on Google News","url":"https://www.foxnews.com/us/the-latest-storm-topples-tree-kills-girl-in-florida","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-715214aa0f614406ae9be93479029bdb.png","publishedAt":"2019-04-19T13:57:39Z","content":"ATLANTA The Latest on severe weather in the South (all times local):\r\n1:40 p.m.\r\nA storm system moving through the South is being blamed for the death of an 8-year-old girl in Florida.\r\nThe Leon County Sheriff's Office says a tree fell Friday into a house in … [+3995 chars]"},{"source":{"id":null,"name":"Nbc12.com"},"author":"Tamia Mallory","title":"News to know for April 19: Severe storms with damaging winds; School closings and delays; Mail carrier killed - WWBT NBC12 News","description":"News to know for April 19: Severe storms with damaging winds; School closings and delays; Mail carrier killed WWBT NBC12 News LIVE: Rampage of deadly storms continues across Alabama, Florida, Georgia into Friday AccuWeather.com Severe storms expected across N…","url":"http://www.nbc12.com/2019/04/19/news-know-april-severe-storms-with-damaging-winds-school-closings-delays-mail-carrier-killed-crash/","urlToImage":"http://www.nbc12.com/resizer/87YAyNCJ6t6XgjHPSlG9k_-nfMM=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/GQVQO5HETZBSVAOUPZ4FXYQ7N4.JPG","publishedAt":"2019-04-19T10:37:00Z","content":"RICHMOND, VA (WWBT) - Friday is here, and the risk for severe weather in Central Virginia has increased.\r\nPortions of Central Virginia are now in a moderate risk of severe weather.\r\nFriday Forecast: Severe weather threat climbs for the afternoon and evening\r\n… [+1774 chars]"},{"source":{"id":null,"name":"Accuweather.com"},"author":null,"title":"LIVE: Rampage of deadly storms continues across Alabama, Florida, Georgia - AccuWeather.com","description":"LIVE: Rampage of deadly storms continues across Alabama, Florida, Georgia AccuWeather.com UPDATES: Tornado warning for Fulton County, Gwinnett County and southern Forsyth County 11Alive Tornado threat increasing as severe storms move into Upstate WYFF4 Greenv…","url":"https://www.accuweather.com/en/weather-news/live-rampage-of-deadly-storms-continues-across-alabama-florida-georgia/70008025","urlToImage":null,"publishedAt":"2019-04-19T12:01:00Z","content":null},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"CNN reporter 'attacked' by lizard on air - CNN","description":"CNN reporter 'attacked' by lizard on air CNN CNN reporter stomps 'nightmare' lizard during live report | TheHill The Hill CNN correspondent battles ‘giant lizard’ on live TV New York Daily News CNN reporter accosted by lizard live on air during broadcast from…","url":"https://www.youtube.com/watch?v=W8PBRBlW50I","urlToImage":null,"publishedAt":"2019-04-19T20:06:14Z","content":null}]}